{
  "processing-time-total" : 2002,
  "clusters" : [ {
    "id" : 0,
    "size" : 6,
    "score" : 60.32122424751308,
    "phrases" : [ "Police" ],
    "documents" : [ 3, 31, 32, 33, 39, 49 ],
    "attributes" : {
      "score" : 60.32122424751308
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 102.5661598078849,
    "phrases" : [ "Private Property" ],
    "documents" : [ 6, 9, 18, 29, 31, 39 ],
    "attributes" : {
      "score" : 102.5661598078849
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 39.211663242126114,
    "phrases" : [ "Having it Enforced" ],
    "documents" : [ 5, 9, 27, 32, 39 ],
    "attributes" : {
      "score" : 39.211663242126114
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 51.28945909610407,
    "phrases" : [ "Natural Rights" ],
    "documents" : [ 16, 22, 23, 39, 48 ],
    "attributes" : {
      "score" : 51.28945909610407
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 70.06283767972107,
    "phrases" : [ "Small State" ],
    "documents" : [ 8, 10, 25, 29, 39 ],
    "attributes" : {
      "score" : 70.06283767972107
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 33.91671679020342,
    "phrases" : [ "Duty" ],
    "documents" : [ 32, 36, 37, 40 ],
    "attributes" : {
      "score" : 33.91671679020342
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 78.44446969631612,
    "phrases" : [ "Technology can make what was once Moral" ],
    "documents" : [ 7, 10, 29, 39 ],
    "attributes" : {
      "score" : 78.44446969631612
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 71.50814826826613,
    "phrases" : [ "Immigrants" ],
    "documents" : [ 39, 44, 46 ],
    "attributes" : {
      "score" : 71.50814826826613
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 47.80605184382156,
    "phrases" : [ "Practical Implications" ],
    "documents" : [ 19, 27, 39 ],
    "attributes" : {
      "score" : 47.80605184382156
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 50.85856081564032,
    "phrases" : [ "Product of my Labor" ],
    "documents" : [ 27, 39, 48 ],
    "attributes" : {
      "score" : 50.85856081564032
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 55.32179272768347,
    "phrases" : [ "Speech" ],
    "documents" : [ 38, 39, 42 ],
    "attributes" : {
      "score" : 55.32179272768347
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 49.16274836452193,
    "phrases" : [ "Tell me what this Video" ],
    "documents" : [ 19, 35, 39 ],
    "attributes" : {
      "score" : 49.16274836452193
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 45.510523576099516,
    "phrases" : [ "Eat" ],
    "documents" : [ 4, 39 ],
    "attributes" : {
      "score" : 45.510523576099516
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 63.34423127057668,
    "phrases" : [ "Form of Insurance" ],
    "documents" : [ 27, 39 ],
    "attributes" : {
      "score" : 63.34423127057668
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 84.2236636296522,
    "phrases" : [ "Game I am Playing at the Moment" ],
    "documents" : [ 36, 39 ],
    "attributes" : {
      "score" : 84.2236636296522
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 68.42488450088348,
    "phrases" : [ "Internet Security" ],
    "documents" : [ 12, 39 ],
    "attributes" : {
      "score" : 68.42488450088348
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 73.52176660571313,
    "phrases" : [ "Lysander Spooner" ],
    "documents" : [ 39, 41 ],
    "attributes" : {
      "score" : 73.52176660571313
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 72.74561775816461,
    "phrases" : [ "Mises and other Libertarian" ],
    "documents" : [ 10, 19 ],
    "attributes" : {
      "score" : 72.74561775816461
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 32.646426383283895,
    "phrases" : [ "Sales" ],
    "documents" : [ 5, 21 ],
    "attributes" : {
      "score" : 32.646426383283895
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 49.54166045251856,
    "phrases" : [ "Supreme Court" ],
    "documents" : [ 20, 32 ],
    "attributes" : {
      "score" : 49.54166045251856
    }
  }, {
    "id" : 20,
    "size" : 16,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 1, 2, 11, 13, 14, 15, 17, 24, 26, 28, 30, 34, 43, 45, 47 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1914,
  "documents" : [ {
    "id" : 0,
    "title" : "Run Your Family Like a Business",
    "snippet" : "  \"Billy, for the third quarter in a row, your numbers have dropped. I'm afraid we're going to have to let you go...  Fido, good news! I'm promoting you to Billy.\" \"Billy, for the third quarter in a row, your numbers have dropped. I'm afraid we're going to have to let you go...  Fido, good news! I'm promoting you to Billy.\"  \"One of the children has Asperger syndrome, another ADHD...\"\n\nYou're not a complete white middle class family these days until you have one of each... \"One of the children has Asperger syndrome, another ADHD...\"\n\nYou're not a complete white middle class family these days until you have one of each...   ",
    "url" : "http://online.wsj.com/article/SB10001424127887323452204578288192043905634.html"
  }, {
    "id" : 1,
    "title" : "Sheldon Richman - Speaking On Liberty interview.",
    "url" : "http://www.youtube.com/watch?v=MZVPVCrY_Po"
  }, {
    "id" : 2,
    "title" : "Observation: How Charity leads to Capitalism",
    "snippet" : "Just an observation.  Over the past several years, my wife just simply liked giving things to charity.  She would often buy from thrift stores to patronize their causes, and often give them stuff to sell as well.  Over time, many of the thrift store owners noticed this, and naturally became friends with her, and so over time many started to give her steep discounts on things that she would buy because of that.  So because of the low prices, she was able to buy even more from the thrift stores, and then things get cluttered as home, and so she would give even more to the thrift stores as well to unload old stuff as she got new stuff that she wanted.  But there are some thrift stores who specialize in different things like kids cloths, and others in things like utensils, and so a lot of time she would buy things the stores didn't need to much, and would give things that they do.  This eventually led to informal deals where they give her one set of things they didn't need so much, and she gives back another that they do, and she keeps the things she wants that pass by her in this process.  In this process the thrift stores win because they stuff that they can better use and sell, and she wins because she gets access to free stuff.   And so now, all these people are trading back and forth, and everybody is better off because of it, and what started out as simply giving and charity has turned into something that actually makes a small profit in the form of goods while making the charities even more charitable\n\nAnyhow, I knew that she liked to shop at thrift stores, and to give them things, but I had no clue that any of this was going on till she told me.   I thought it was interesting, because statists often like to proclaim how Capitalism is purely selfish and greed driven, but my observation is just the opposite.  It is driven by pure charity, love of the poor, socializing, friendship, and mutual respect. \n  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18dqgj/observation_how_charity_leads_to_capitalism/"
  }, {
    "id" : 3,
    "title" : "Question Regarding Car Insurance",
    "snippet" : "Not attacking AnCaps here - I'm one of you guys. But as I was driving into work this morning and someone nearly slammed into the back of my vehicle, I realized I'd never once stopped to think about car insurance in a voluntaryist society.\n\nHow would that work? Right now, it is, arguably, easy. My car slid downhill in the rain last year. I bumped into a lady's car. It wasn't bad, but it was a rear end on my part, so we quickly swapped insurance info, filled out a quick police report (they happened to stop by), and then we were on our way. Insurance took care of the rest, it wasn't expensive for either of us, and our rates didn't even go up. Very quick, very easy.\n\nMore than that, we both had insurance.\n\nIn an voluntary society, do you think most people would opt for insurance if they weren't \"forced\" to pay for it? (I don't think that's a justification for the use of force - I'm just curious about the question.)\n\nIs there a better way than insurance?\n\nWhat happens if someone runs into another person, but doesn't have insurance? Or what if they refuse to pony up, accusing the other person?\n\nI think our legal system is terrible at handling these things right now, but it's what we've got, and we're used to it. I can think in terms of our current constructs.\n\nI'm having difficulty envisioning how all of this works in a voluntary society.\n\nIdeas?  Medical care is far more expensive than it should be, and cars are quite an antiquated way of getting around. I imagine an ancap area to be more dense (like Hong Kong and Singapore) simply because the cost of accessing/maintaining suburban infrastructure is extremely high.\n\nThe problem with Government intervention in a marketplace (such as requiring insurance) is that it makes costly things cheap, and thus encourages use of said costly venture. Same as Federally Funded Flood Insurance which gave rise to more people living in coastal regions, instead of less. Then, Hurricane Sandy happens, and billions are spent where people shouldn't even be living.\n\nBut let's say people still drove cars in an ancap world:\n\n* It's a risk. If you want to drive without insurance, you open yourself up to lawsuits or crippling medical bills. People would be able to either justify this risk, or figure out how to get somewhere without so much risk (walking, bicycles, self driven Google Cars, bus rapid transit (BRT), trains or airplanes).\n\n* If they drove a car, they'd likely be smart to have camera systems, like those in Russia, to record accidents.\n\n* You're insurance would be priced to account for the fact that other people don't have it. This is why insurance companies lobbied state Governments to ensure that everyone purchased insurance, so that the insurance companies would get more ~~customers~~ money. Does it really make the roads any safer? After all, insurance doesn't matter if you're dead.\n\n* Private roads would likely require insurance protection. Private roads may also require breathalyzers in the car, and may not allow you to drive if you have more than 1 infraction/accident. Private roads would likely have much more safety cameras, more traffic police, etc. They're in the business of keeping people safe, and thus have an incentive to provide a safe experience. Thank you for the thorough reply. This helped a lot. I hadn't considered that most people may not even drive cars.\n\nIt's a strange thought. I live near a big city, but not in it, because the city is freakishly expensive to live in. It's the outlying area that is considerably cheaper. But you're suggesting that in an AnCap society, this would be flipped? I might be able to see that... Interesting...\n\nI hadn't considered points 2-3, either. Thanks for that.\n\nI still have some difficulty with point 4, though. I suppose if fewer people are driving cars, then it doesn't matter so much. Imagining it the way things are now (especially in America), this just seems like it would cause an enormous mess. I can't imagine having to show documentation every single time I drive from one privately owned road to another... it seems cumbersome.\n\nBut, of course, if we had privately owned roads, I guess somebody would innovate an easy and quick way to handle all that. Their roads would certainly be traversed more for the convenience factor, I imagine... so maybe that makes sense...\n\nAnyway, thanks. This was exactly the answer I was looking for. :-)  I'd buy car insurance without government. Would you? Of course. I don't buy car insurance now because the government requires it. I do so, because I want to be insured - both for myself and others.\n\nBut I have learned that I oftentimes have different views than most other people... The mere fact that I'm an AnCap probably proves that. :-) In my experience, if most people can get away without doing something, they will. Even if it's to their (or especially someone else's) detriment...  there's no mandatory car insurance law in New Hampshire. look at how things are being done there. no need for theory. That's intriguing. Know of any good articles about it?     If an accident occurs, and there is no insurance, then the road owner could very easily be held liable for the damages, as he was letting people drive on his road without insurance. So there would probably be a lot of private requirements for insurance in order to be allowed to drive on roads.\n\nEven beyond that, life is dangerous. I know at least ten people who were the victims of hit and run accidents over the past year alone. Even with the government, there is still a high chance that you are not going to get your money's worth from an accident. &gt; So there would probably be a lot of private requirements for insurance in order to be allowed to drive on roads.\n\nThis seems messy and complicated... I can't imagine that being the case. Every time you go from one road to another owned by somebody else, you have to show all your documentation? I'm all for private roads, but... that just sounds horrible.\n\n&gt; Even with the government, there is still a high chance that you are not going to get your money's worth from an accident.\n\nThat's a very good point, though. Current private road companies provide [transponders](https://en.wikipedia.org/wiki/Transponder#Road) to their customers so they don't have to stop to pay tolls. Presumably in an anarcho-capitalist future, cars would feature a universal transponder that could be provided by your insurance company to show road owners that you are insured without having to stop and show your insurance information on every new road.    ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ds6r/question_regarding_car_insurance/"
  }, {
    "id" : 4,
    "title" : "Aaron Swartz and the Soul Eating Machinery of \"Justice\"",
    "snippet" : "  ",
    "url" : "http://www.youtube.com/watch?v=15ZgVk0paK4"
  }, {
    "id" : 5,
    "title" : "Is all scarcity the same?",
    "snippet" : "I.e. should the scarcity of food, shelter, and clean water be treated the same as the scarcity of gold-plated Yachts?  Some scarcity is purely synthetic, for instance, concert tickets or music downloads.\n\nSome scarcity is geophysical: only so much oil exists in one place at one time in the universe.\n\nSome scarcity is perceptual: we only know of so much oil existing. &gt; Some scarcity is purely synthetic, for instance, concert tickets or music downloads.\n\nHow are music downloads even \"synthetically\" scarce? Copyright. But you don't \"have\" to abide by it. You do if you're going to be really public about it.\n\n'Course, this is why its *artificial* scarcity. &gt; You do if you're going to be really public about it.\n\nThen why are there fake Apple stores in China?   Because China doesn't enforce or at the very least isn't nearly as aggressive in its enforcement of copyright. Or in other words, China isn't working to make it artificially scarce. The nature of the good has not changed, just the circumstances surrounding it. Exactly. Naturally, the good doesn't need to be scarce, but with government intervention it might be made artificially scarce.  Because all of those are scarce and require scarce goods to produce, we should treat them the same by economizing their use. The best way I know how to do this is the price system in an unhampered market economy. Even if it results in millions of people starving while the people who caused their distress use the profits to buy gold-plated yachts? Even if it results in millions of people starving while the people who caused their distress use the profits to buy gold-plated yachts?  It's a [troll](http://www.reddit.com/r/Anarchism/comments/17yb7r/cmon_evry_body_lets_abuse_the_propertarians/), drop him.  The market \"treats\" these different scarce items differently, it's called supply and demand. What if the 'demand' of food and water is made ineffective because of poverty, even though farms and grocers destroy food rather than let them have it for free (because that would set a bad precedent)?  If there is plenty of food and housing (i.e. they are not actually scarce) and yet there are people who are starving and homeless because stocks are destroyed (or kept off the market) rather than given away, just to prop up prices, doesn't that imply that the system does not serve human needs? &gt;even though farms and grocers destroy food rather than let them have it for free (because that would set a bad precedent)\n\nThis is absurd, grocers and farmers aren't going to destroy their food, they would sell it at whatever the market deems it's price is.  You can't just ignore supply and demand unless you are talking about a totalitarian state-run economy.  If my cost to bring an apple to market is $1.00 and I bring 10,000 apples to market, my cost is $10,000.  Now, let's say the percentage of poor people is 40% of my sales.  does it make sense for me to destroy $4,000 worth of product in order to \"not set a precedent\" or does it make more sense to adjust my prices at a level that the poor are willing to pay, let's say 50 cents, in order to sell off my product and come out only $2,000 behind instead of $4,000?  Obviously the latter puts more money (or, in this case, less debt) in my pocket, and guess what, the poor who previously couldn't afford my product now can.  Everyone is happy.\n\n&gt; If there is plenty of food and housing (i.e. they are not actually scarce) and yet there are people who are starving and homeless because stocks are destroyed (or kept off the market) rather than given away, just to prop up prices, doesn't that imply that the system does not serve human needs?\n\nI guess I don't think of capitalism as a \"System designed to meet human needs\" so much as I see it as \"the sum of multiple parties voluntarily exchanging goods and services.\"  Are there people who are starving and homeless?  Absolutely, but those exist in every large-scale group that live under a single economic philosophy.  The power shift is different when it comes to capitalism because it is at the level of the consumer and producer, where the voluntary actions take place.  After all, no big business started out big, it had to grow to that size, and it did so by selling it's goods and services at a price it's consumers were willing to pay, it didn't burn goods to set an example. &gt;adjust my prices at a level that the poor are willing to pay, let's say 50 cents\n\nSuppose they have zero money.  The price they are able to pay is zero.  Are you going to sell at that price? What if the 'demand' of food and water is made ineffective because of poverty, even though farms and grocers destroy food rather than let them have it for free (because that would set a bad precedent)?  If there is plenty of food and housing (i.e. they are not actually scarce) and yet there are people who are starving and homeless because stocks are destroyed (or kept off the market) rather than given away, just to prop up prices, doesn't that imply that the system does not serve human needs?   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ev1u/is_all_scarcity_the_same/"
  }, {
    "id" : 6,
    "title" : "How is one geographic area \"governed\" or \"secured\" by more than one liberty/security-ensuring org in practice?",
    "snippet" : "Excuse me if I have not done enough prerequisite reading but I had these few thoughts after lurking for a some time and while beginning Snow Crash by Neil Stephenson. \n\nToday, I live in a neighborhood \"governed\" by an HOA, imo similar to those FOQNEs (they even rent out cops to patrol at night, sans a private court system). Am I to assume that the common, AnCap approach to my property's security would be that if I live in an area that does not respect my \"legitimate\" property rights (as I see them, say if someone is squatting and I want them gone), is my only solution to act on my freedom to move to another area governed by another FOQNE that agrees with my view? \n\nIf so, how is this much different than the situation I am in now, where almost every HOA in my area governs according to the same, common ideology (no front-yard gardens, have to ask for permission to build anything higher than the 6-foot fence, etc)? What would prevent other HOAs/FOQNEs from adopting negligibly different governing ideologies, effectively limiting my choices? \n\nI guess I'm just failing to see how an AnCap free market can solve this problem (assuming of course that this is a problem that can be solved by a truly free market).   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18eqod/how_is_one_geographic_area_governed_or_secured_by/"
  }, {
    "id" : 7,
    "title" : "Intellectual vs moral approach to the future?",
    "snippet" : "MY case is moral.\n\nThe abolitionist, and other major irreversible struggles, did not need a intellectual method of why the master would be better of if he quit his business. And most laws and intellect is just a reflection of the morals, not vise-versa.    It's nice to have beliefs, but you also need a plan.  Morality changes as we change. Technology can make what was once moral or amoral into something immoral. Once we can convert energy directly into food, will the mass slaughter of animals become immoral? &gt; Technology can make what was once moral or amoral into something immoral. \n\nCare to show an example.\n\nI only see morality changing technology, not backwards. Eg thinktanks and study groups have females/kids/coloured/lgbt to do research and tests on improvements. \n\nOr In slavery, the telegraph for 100K rich aristocrats was not worth the technology.  Child labour. It doesn't happen once society reaches a certain level of industrialization. You mean there would not be lemonade stands, neighbourhood chores ect even without licences?  Don't act like a fool. If you aren't acting, my sincerest apologies. Don't pretend that all forms of child labour are unwanted. \n\nAnd don't get mad when I cant understand your vague paintbrush just to make stuff up.  I'm not mad, i just thought you were being intentionally obtuse.  I could say the same about you, thinking that public schools are not a 9-5 version of child labour. Would you say public schools are worse than traditional forms of child labour?  Just ignore this guy, people. He's been trollin up other threads.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ekgn/intellectual_vs_moral_approach_to_the_future/"
  }, {
    "id" : 8,
    "title" : "Please help me explore the relationship between Buddhism (correct the lable if necessary) and Anarchism.",
    "snippet" : "Alan Watts, the man who brought much eastern philosophy to the west, connected with my own mind and clarified things in a way I had never had clarified before and I then went on to find voluntarism.  I wonder if any of you have noticed a similar connection and if you can help me explain or explore this connection.\n\n*Doaism is the label I was looking for.  Are you sure it was Buddhism and not Daoism?\n\nThere are some very similar thematic elements with Daoism and anarchism: organic order, 无为 \"inaction\" (not the best translation, but it's the most common), power is corrupting, etc. Generally speaking though Daoism seems to accord more with anarcho-primitivism. Although, at the time that most of the Daoist canonical works were written, \"primitive\" probably wasn't too far removed from \"civilized\".\n\nNot all Daoists are the same though--keep in mind that at the time Laozi and Zhuangzi wrote, the concept of a formal Daoist school of thought didn't exist--and Zhuangzi seems more political than Laozi does. Over the years Daoism has cross-bred with Chinese folk religion, so if you go looking beyond the most basic texts you will probably be disappointed. Alan Watts is fun, but he's not so much a rigorous philosopher as a wonderful translator and communicator of foreign ideas. \n\nHere is Alan Watts talking about these topics: http://www.youtube.com/watch?feature=player_detailpage&amp;v=UbpSyxYLsT4#t=655s\n\nhttp://en.wikipedia.org/wiki/Zhuangzi#Anarchism\n\nhttp://mises.org/daily/1967\n\nhttp://www.amazon.com/Daoism-Anarchism-Critiques-Contemporary-Anarchist/dp/1441132236 Yes I think doaism(Taoism?) is the label, and thank you so much for these links, I am still interested in further exploration of these connections.  I have heard it said once before that the first recorded libertarian was one of the eastern philosophers.  Yeah, Rothbard says the early Daoists were the first \"libertarians\". Which is I think accurate to a loose degree. Are you sure it was Buddhism and not Daoism?\n\nThere are some very similar thematic elements with Daoism and anarchism: organic order, 无为 \"inaction\" (not the best translation, but it's the most common), power is corrupting, etc. Generally speaking though Daoism seems to accord more with anarcho-primitivism. Although, at the time that most of the Daoist canonical works were written, \"primitive\" probably wasn't too far removed from \"civilized\".\n\nNot all Daoists are the same though--keep in mind that at the time Laozi and Zhuangzi wrote, the concept of a formal Daoist school of thought didn't exist--and Zhuangzi seems more political than Laozi does. Over the years Daoism has cross-bred with Chinese folk religion, so if you go looking beyond the most basic texts you will probably be disappointed. Alan Watts is fun, but he's not so much a rigorous philosopher as a wonderful translator and communicator of foreign ideas. \n\nHere is Alan Watts talking about these topics: http://www.youtube.com/watch?feature=player_detailpage&amp;v=UbpSyxYLsT4#t=655s\n\nhttp://en.wikipedia.org/wiki/Zhuangzi#Anarchism\n\nhttp://mises.org/daily/1967\n\nhttp://www.amazon.com/Daoism-Anarchism-Critiques-Contemporary-Anarchist/dp/1441132236 I'd disagree that Taoism leans Primitivist. While some of the teachings are Primitivist in their results, they are not Primitivist in their purpose. Taoist philosophers did not, for instance, advocate living a sort of hermit lifestyle because it was in and of itself desirable, but because they viewed it as the only means of escaping State control, rightly believing that most if no all attempts to move to a higher level of wealth accumulation would involve the State taking an \"interest\" in one.\n\nBack in the days these teachings were formulated, States were relatively ineffectual, particularly with regards to their ability to control large swaths of rugged or mostly uninhabited terrain. The wealth simply wasn't there for them to leech a sufficient amount to do so. Therfore, by moving to a mostly uninhabited region, and forgoing enough wealth accumulation to spark a State's interest, you could actually be fairly certain of being left to your own devices. Well that's why Daoism is a problematic term: which Daoists are you talking about? Not only that but \"Laozi\" (or the texts from various people attributed to this figure) in particular contradicts himself a number of times in the DDJ, so trying to suss out an explicit political ideology is difficult.\n\nI also respectfully disagree with this:\n\n&gt;**Taoist philosophers did not, for instance, advocate living a sort of hermit lifestyle because it was in and of itself desirable**, but because they viewed it as the only means of escaping State control, rightly believing that most if no all attempts to move to a higher level of wealth accumulation would involve the State taking an \"interest\" in one.\n\n...at least if you are considering the basic, foundational texts, like the Dao De Jing or the Zhuangzi. Keep in mind that when these philosophies were written 'China' was in the middle of massive political chaos and conflict called the Warring States period. As a result, many of these wise men or hermits of the mountains that we might consider \"Daoist\" retreated from the State because the rulers were not \"righteous\" or \"just\", not necessarily because rulers existed--in fact many rulers at the time tried to employ or attract these hermits to their courts because it granted \"legitimacy\" to their reign. That's part of what's confusing about the DDJ, it at once provide principles by which rulers are suggested to rule by AND it suggests leaving society altogether. This is perhaps intentional on Laozi's part, as he likes to employ contradictions and paradoxes throughout the text.\n\nLike in Verse 57:\n\n&gt;Use fairness in governing the state.\n&gt;Use surprise tactics in war.\n&gt;Be unconcerned and you will have the world.\n&gt;How do I know it is like this?\n&gt;Because:\n&gt;The more regulations there are,\n&gt;The poorer people become.\n&gt;The more people own lethal weapons,\n&gt;The more darkened are the country and clans.\n&gt;The more clever the people are,\n&gt;The more extraordinary actions they take.\n&gt;The more picky the laws are,\n&gt;The more thieves and gangsters there are.\n&gt; \n&gt;Therefore the sages say:\n&gt;I do not force my way and the people transform themselves.\n&gt;\n&gt;I enjoy my serenity and the people correct themselves.\n&gt;\n&gt;I do not interfere and the people enrich themselves.\n&gt;\n&gt;I have no desires\n&gt;\n&gt;And the people find their original mind.\n\nHell, Verse 61 is basically saying small states should submit to larger ones if the ruler is \"righteous\":\n\n&gt;The great state should be like a river basin.\n&gt;The mixing place of the world,\n&gt;The feminine of the world.\n&gt;The feminine always overcomes the masculine by softness\n&gt;Because softness is lesser.\n&gt;Therefore if a large state serves a small state\n&gt;It will gain the small state.\n&gt;If a small state serves a large state\n&gt;It will gain the large state.\n&gt; \n&gt;Therefore some serve in order to gain\n&gt;And some gain despite their servitude.\n&gt; \n&gt;The large state wants nothing more\n&gt;Than to unite and feed its people.\n&gt;The small state wants nothing more\n&gt;Than to enter into the service of the right person.\n&gt;Thus both get what they want.\n&gt; \n&gt;Greatness lies in placing oneself below.\n\nI don't think the division between results and purpose is so explicit. Primitivism was not an incidental by-product of the Daoist's avoidance of the state. I'm not arguing of course that early Daoists were only primitivist, there are clearly individualist and syncretic (with Confucian or folk religion) elements as well. But the DDJ definitely contains passages which *advocate* a sort of peasant utopia for reasons other than \"avoiding State influence\". They weren't saying \"Oh we must avoid the State and silly Confucian rituals and the best way to do that is to live in remote locations, which incidentally means we have to live a primitivist lifestyle\". I think it is clear that at least portions of the foundational texts advocated primitivism for its own sake.\n\nConsider these few verses:\n\n&gt;Verse 3\n&gt;If you do not adulate the worthy, you will make others non-contentious.\n&gt;If you do not value rare treasures, you will stop others from stealing.\n&gt;If people do not see desirables, they will not be agitated.\n&gt; \n&gt;Therefore, when the sage governs,\n&gt;He clears peoples minds,\n&gt;Fills their bellies,\n&gt;Weakens their ambition and\n&gt;Strengthens their bones.\n&gt; \n&gt;**If the people are kept without cleverness and desire**\n&gt;It will make the intellectuals not dare to meddle.\n&gt; \n&gt;Acting without contrivance, there is no lack of manageability.\n\n-----------------\n&gt;Verse 12\n&gt;The five colors blind our eyes.\n&gt;The five tones deafen our ears.\n&gt;The five flavors confuse our taste.\n&gt;Racing and hunting madden our minds.\n&gt;Possessing rare treasures brings about harmful behavior.\n&gt;Therefore the sage regards his center, and not his eyes.\n&gt; \n&gt;He lets go of that and chooses this.\n\n-----------------\n&gt;Verse 19\n&gt;Get rid of “holiness”and abandon “wisdom”and the people will benefit a hundredfold.\n&gt; \n&gt;Get rid of “humaneness”and abandon “rightness”and the people will return to filial piety and compassion.\n&gt; \n&gt;Get rid of cleverness and abandon profit, and thieves and gangsters will not exist.\n&gt; \n&gt;Since the above three are merely words, they are not sufficient.\n&gt;Therefore there must be something to include them all.\n&gt; \n&gt;See the origin and keep the non-differentiated state.\n&gt;Lessen selfishness and decrease desire.\n\n-------------------\n&gt;Verse 81\n&gt;True words are not fancy.\n&gt;Fancy words are not true.\n&gt;The good do not debate.\n&gt;Debaters are not good.\n&gt;The one who really knows is not broadly learned,\n&gt;The extensively learned do not really know.\n&gt;The sage does not hoard,\n&gt;She gives people her surplus.\n&gt;Giving her surplus to others she is enriched.\n&gt; \n&gt;The way of Heaven is to help and not harm.\n&gt;The way of the Sage is to act without wrangling.\n\nThough even with all those, this verse I think is the most obviously, explicitly primitivist:\n\n&gt;**Let there be a small country with few people,\nWho, even having much machinery, don't use it.\nWho take death seriously and don't wander far away.\nEven though they have boats and carriages, they never ride in them.\nHaving armor and weapons, they never go to war.\nLet them return to measurement by tying knots in rope.\nSweeten their food, give them nice clothes, a peaceful abode and a relaxed life.\nEven though the next country can be seen and its doges and chickens can be heard,\nThe people will grow old and die without visiting each others land.**\n\n\nIn all of these, Laozi is denouncing culture, technology, knowledge, and even regional travel. My only doubt about this being primitivist is that it was intended to maintain an ignorant populace. Surely there were rulers who took it that way and employed it that way. But you are right in pointing out that Daoism is incredibly nuanced and to say it leans one way or another is perhaps inaccurate. Perhaps it is best described of as having themes from which different coherent \"versions\" are formalized or substantiated.   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ekgm/please_help_me_explore_the_relationship_between/"
  }, {
    "id" : 9,
    "title" : "City Outlaws. . .Roommates. ",
    "snippet" : "  This is an example of offensive war.  Neighbors don't want it because they suspect it will be louder and more disruptive around  them.  What should be 'illegal' is 'disruptive and loud behavior' and many private buildings have rules in place for this.  Obviously, private property owners of buildings that lease out rooms should be able to set the limit on # of people living in a room because it's their property - not the city's.  But this is an example of a city creating offensive laws rather than just enforcing defensive ones such as intervening when their is loud or disruptive behavior. An offensive war... an *aggressive* war... \n\nNew York, Chicago... Seems to be happening up north...\n\nWhat would we call a war of aggression that starts in the north and works its way down south? This is an example of offensive war.  Neighbors don't want it because they suspect it will be louder and more disruptive around  them.  What should be 'illegal' is 'disruptive and loud behavior' and many private buildings have rules in place for this.  Obviously, private property owners of buildings that lease out rooms should be able to set the limit on # of people living in a room because it's their property - not the city's.  But this is an example of a city creating offensive laws rather than just enforcing defensive ones such as intervening when their is loud or disruptive behavior.      Well, Watertown is about to become \"Ghosttown\". Well, Watertown is about to become \"Ghosttown\".   I read the law as having some racial undertones. White people seldom live in such conditions.  This would even outlaw living with a non-married partner (regardless of gender), which lots of white people do. Very true. \n\nA lot of critical race theory examines how laws are actually enforced. For example, marijuana and drug laws are disproportionately enforced against blacks. There might, however, be another proxy; for example, violent criminals found with drugs.    Is it just me or do the quotes they took almost sound like they are doing the opposite.  I found this confusing.  This is a pretty simple solution; nobody will live there.  Anybody live near there? It would be great to get these bureaucrats to discuss their thought process on camera. ",
    "url" : "http://reason.com/blog/2013/02/11/city-outlaws-roommates"
  }, {
    "id" : 10,
    "title" : "Is morality to Anarcho-capitalism like laws are to a state?",
    "snippet" : "Let's get philosophical.    I have *always* felt anarcho-capitalism is a political philosophy, not ethical. Meaning laws and social structure are what matters, not morality and personal values.  I have *always* felt anarcho-capitalism is a political philosophy, not ethical. Meaning laws and social structure are what matters, not morality and personal values.  I have *always* felt anarcho-capitalism is a political philosophy, not ethical. Meaning laws and social structure are what matters, not morality and personal values.  &gt; not morality and personal values.\n\n\nYou must be a blast to hang around with. /s I believe he was speaking in the context of how anarcho-capitalism is defined, not how he lives his personal life. So giving a \"theory\" that he does not follow? I can't speak for him, but I think he believes that anarcho-capitalism is a philosophy focused on laws and the way that society is structured, with little to no focus on morality. That doesn't mean he chooses to live his personal life with no morals.  Not for us nihilists and moral relativists!\n\n I'm curious.  Are you a libertarian strictly for consequentialist reasons, or do you subscribe to something like Kinsella's dialogical estoppel? I'm curious.  Are you a libertarian strictly for consequentialist reasons, or do you subscribe to something like Kinsella's dialogical estoppel?  That's conflating law and morality, which is common within the statist camp. It does not follow from the idea that one set of morals is \"better\" than another, to the notion that you can impose that morality onto others.              Yep, as Doug Casey and other successful Austrians say:\n\n*We are not fighting an intellectual battle, but rather a moral one.*\n\n\nFor the past 30 years Mises, and all the intellectuals were used and the movement has not even grown.\n\n\nWith the morality principal, nap, some sort of upb and others, it is catching on as wildfire.\n\n\nThe \"echo-nomists\" will be pissed that they are obsolete, and mob attack the moral ones.\n\n\n*  **Moderator requests:\nModerator message: Don't down-vote posts you disagree with.** &gt;Yep, as Doug Casey and other successful Austrians say: We are not fighting an intellectual battle, but rather a moral one.\n\nCasey isn't speaking from a position solely informed by Austrian economics when handling morality, for Austrian economics is a science of human action and science has *never* been prescriptive.\n\n&gt;For the past 30 years Mises, and all the intellectuals were used and the movement has not even grown.\n\nlolwut, Rothbard is as big of a deontological ancap as it gets and even he understood the critical importance of Mises's work.\n\n&gt;With the morality principal, nap, some sort of upb and others, it is catching on as wildfire.\n\nActually, it is the deontological ancaps (and especially those programmed by people like Molyneux) who are most vulnerable to faltering in some way and changing their beliefs or in making conclusions that do not follow.\n\n&gt;Moderator requests: Moderator message: Don't down-vote posts you disagree with.\n\nI think you're getting downvoted because you're saying things that are merely factually inaccurate. &gt; Casey isn't speaking from a position solely informed by Austrian economics when handling morality,\n\n\nBecause being Austrian is a very small part of the movement. TP.\n\n\n&gt; or Austrian economics is a science of human action and science has never been prescriptive.\n\n\nWhat is the market price for an Austrian economist in the private sector, and what is the \"supply\"? \n\n\n&gt; Rothbard is as big of a deontological ancap as it gets and even he understood the critical importance of Mises's work.\n\nBig fan of the Libertarian party, it shrunk. I personally enjoy reading some of his stuff.\n\n\n&gt; Actually, it is the deontological ancaps (and especially those programmed by people like Molyneux) who are most vulnerable to faltering in some way and changing their beliefs or in making conclusions that do not follow.\n\n\nSo in 5 years, a lot more has been done than in 30. And there is evidence that more people are playing by nap. \n\n\n&gt; I think you're getting downvoted because you're saying things that are merely factually inaccurate.\n\n\nWe all know why. Keeping up their pseudo intellectuality credentials is worth more than any change in their own worlds.  &gt;Because being Austrian is a very small part of the movement. TP.\n\nSez you.\n\n&gt;What is the market price for an Austrian economist in the private sector, and what is the \"supply\"?\n\nEconomists have a very small niche demand, definitely, but how is this relevant?  It's like the faulty supposition that black market actors must consciously affirm Agorism before they may behave consistent with the ideology.\n\n&gt;Big fan of the Libertarian party, it shrunk.\n\nNever have been, myself, but where are you going with this; why aren't you addressing my points against your argument?\n\n&gt;So in 5 years, a lot more has been done than in 30.\n\nHas almost everything to do with just the internet itself, but this technology is just a means of disseminating a lot of information quickly; there still needed to be quality, hallmark literature and clear thinking to thread these decentralized people's beliefs together into something.\n\nI know nothing more about Anarcho-Capitalism and Austrian economics than what Roger Garrison knows.  The former engineer [found Rothbard's circle](http://www.auburn.edu/~garriro/e6rothbard.htm) and Mises's work directly.  The content of his education is no different from mine.  I just happened to be able to find it easier and earlier in my life than him.  But, that seed had to be there; we needed men who sat down and clearly reasoned these things out.\n\n&gt;Keeping up their pseudo intellectuality credentials\n\nThis is Reddit; I don't think any of the regulars here see themselves or this environment as rigorously academic. &gt; Sez you.\n\n\nIt was not because of intellect that people spent millions of hours on libertarian political campaigns, but rather hunger and uncertainty.\n\n\n&gt; Economists have a very small niche demand, definitely, but how is this relevant?\n\nThat most of the ancap echo-nomists in here rather support their job of the horse cart in the ferrari age of cars.\n\n\n&gt;  It's like the faulty supposition that black market actors must consciously affirm Agorism before they may behave consistent with the ideology.\n\nThat is a bit steep and useless. \n\n\n&gt; Never have been, myself, but where are you going with this; why aren't you addressing my points against your argument?\n\nI was addressing Rothbard, not you. \n\n\n&gt; there still needed to be quality, hallmark literature and clear thinking to thread these decentralized people's beliefs together into something.\n\n\nSo you want to write a health book, but donk care if you yourself take your own advice. Nice.\n\n\n&gt; The content of his education is no different from mine. I just happened to be able to find it easier and earlier in my life than him. But, that seed had to be there; we needed men who sat down and clearly reasoned these things out.\n\n\nAnd do what with it? What is so good about talking, but not acting?\n\n\n&gt; This is Reddit\n\nJust individuals acting as copy paste.\n\n\n&gt;  I don't think any of the regulars here see themselves or this environment as rigorously academic.\n\n\nToo many hypocrites. \n\n &gt;It was not because of intellect that people spent millions of hours on libertarian political campaigns, but rather hunger and uncertainty.\n\nPolitical campaigns are largely meaningless.\n\n&gt;echo-nomists in here rather support their job of the horse cart in the ferrari age of cars\n\nWhat?\n\n&gt;So you want to write a health book, but donk care if you yourself take your own advice. Nice.\n\nI'm not sure there's ever been a post of mine you've actually understood.  Kind of a waste of my time, really.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18d80m/is_morality_to_anarchocapitalism_like_laws_are_to/"
  }, {
    "id" : 11,
    "title" : "\"This is the sense in which we are all anarchists...\"",
    "snippet" : "  ",
    "url" : "http://www.everything-voluntary.com/2013/02/natural-law-and-authority.html"
  }, {
    "id" : 12,
    "title" : "The Four Signs of a Collapsing State- Jeffrey Tucker",
    "snippet" : "    looks like all they have left is security. after all we have 1 2 and 3 beat with the internet (internet education, internet communication, internet money) Can we do internet security somehow? How about online DROs in combination with vigilante quadrocopters? Or should we reintroduce bounties?\n\nEdit: Forgot for a moment that prevention &gt; cure and hence protection &gt; retribution. Ideas for preventing violence over the internet still welcome. Can we do internet security somehow? How about online DROs in combination with vigilante quadrocopters? Or should we reintroduce bounties?\n\nEdit: Forgot for a moment that prevention &gt; cure and hence protection &gt; retribution. Ideas for preventing violence over the internet still welcome.  [Why not socialism?](http://cdn.memegenerator.net/instances/400x/25376444.jpg) [Why not socialism?](http://cdn.memegenerator.net/instances/400x/25376444.jpg) With socialism we could all live like Zoidberg! [Why not socialism?](http://cdn.memegenerator.net/instances/400x/25376444.jpg)",
    "url" : "http://lfb.org/today/the-four-signs-of-a-collapsing-state/"
  }, {
    "id" : 13,
    "title" : "The Real History of the Fed: Why It Didn't Need a Miracle (Or a Conspiracy!) to Succeed: \"The problem with the Fed is not that it was the product of a conspiracy but that it was the product of politics.\"",
    "snippet" : "  ",
    "url" : "http://blog.skepticallibertarian.com/2013/02/11/the-fed-not-a-conspiracy-just-par-for-the-progressive-era-course/#respond"
  }, {
    "id" : 14,
    "title" : "Chris Dorner vs. The LAPD vs. Little Old Ladies",
    "url" : "http://www.youtube.com/watch?v=_Wh_gM7tgpg"
  }, {
    "id" : 15,
    "title" : "Murray Rothbard - Involuntary Commitment - [4:35]",
    "url" : "http://youtu.be/EOeRSL0crcg"
  }, {
    "id" : 16,
    "title" : "it must take something other than faith...",
    "snippet" : "it takes faith to believe that the word of God becomes reality\n\nit takes something else entirely to believe that the word of a man can do the same \n\n(like reducing gun ownership or drug usage by banning them)\n\njust random thoughts by myself  &gt;Shall mortal man be more just than God? Shall a man be more pure than his maker?\n\nJob 4:17  Fuck this shit.\n\nedit: To be clear, fuck the idea that any human is inferior to the imaginary friend of some other backwards-thinking human. This is how religion destroys minds. Let us assume for a moment that God exists, that He's good, perfect, omnipotent, omnipresent, omniscient, etc. All of these things are claimed by the Bible and 99% of Christianity. \nNow let us suppose that God gave people commandments, laws, rules, guidelines, etc. It would not be unreasonable, given our current assumptions about God, to say that these rules are \"perfect\", the ideal rules for humanity to operate under. This is also claimed by the Bible and by most Christians if you asked them directly.\n\nUnder this set of assumptions, what worth does a man-made law have? If *the perfect set of rules* for society to function under have already been made known, and humans lack God's supernatural power to make things happen just by speaking them, then man-made laws are worthless at best, and at worst vain attempts on the lawmaker's part to become godlike.\n\nTo have faith in the Bible/God and yet not view man-made (non-Natural) law this way \n&gt;takes something else entirely\n\nThat was my whole point in posting that verse; apologies if the necessary context only existed in my head. I might as well preface any discussion here with \"let us assume that the state has legitimate authority over us\". The first clause of your comment is nonsense, so I don't see why the rest of it merits any discussion whatsoever. When you assume nonsense, you can create any arbitrary nonsense you like. This isn't a remotely reliable means of reasoning. Whether or not the first clause is nonsense doesn't change the fact that there are people who believe it. All I was saying is that even for those people it is *still* ridiculous to believe that arbitrary government edicts have the magical powers or virtue that statists seem to think they have. \n\nWe (ancaps) know that the State doesn't have the supernatural powers many seem to think it does. But even Christians, who believe that there exists a God who does have those powers, still have no excuse for having faith in government because the Bible tells them repeatedly that man's law is always inferior to God's. &gt;the Bible tells them repeatedly that man's law is always inferior to God's.\n\nIf christians believe this on the bible's or a priest's presumed authority, then there's really no (logically consistent) reason for them to disbelieve when a state agent says that his holy texts (laws) say that citizens owe some allegiance to the (imaginary) entity of the \"state\".\n\nIn both cases, the person is outsourcing their mental autonomy to some external \"other\"; in one case it's a religious text or priest, in the other it's some law or some politician. There's zero psychological difference. In both cases I'm speaking to a mental dependent. &gt;Shall mortal man be more just than God? Shall a man be more pure than his maker?\n\nJob 4:17  more just than the abrahamic god? Definitely. You're right. If He was truely just (giving everyone what they deserve), none of a would be here.\n\nNot to start an religious debate or anything, just saying...   I would submit that it also takes faith to believe in a natural rights justification for anarcho-capitalism, but I suspect many people here will disagree with that. I don't think that's faith as much as it is a misidentification of personal preferences as objective facts. But then again maybe that's what faith is in general: translating what one wants to be true into what one believes is true.  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18d566/it_must_take_something_other_than_faith/"
  }, {
    "id" : 17,
    "title" : "What is everyone's take on mental institutions?",
    "snippet" : "I'm not so convinced with Rothbard's opinion on them, so if anyone could share alternative ideas, that would be great!  I think Rothbard has the right idea. When it comes to mental institutions, the agents of the state definitely belong in them.   \"Objective\" reality is the consensus of the majority. Those deemed \"insane\" are those who reject the consensus of the majority.  The cognitive deficient are similar to children, their respective guardian has a responsibility to care for them and sometimes confinement is necessary for their own good. Of course, like anything else it's horrid when controlled by the government.  The cognitive deficient are similar to children, their respective guardian has a responsibility to care for them and sometimes confinement is necessary for their own good. Of course, like anything else it's horrid when controlled by the government.  The cognitive deficient are similar to children, their respective guardian has a responsibility to care for them and sometimes confinement is necessary for their own good. Of course, like anything else it's horrid when controlled by the government.   I've been in a couple for severe depression and attempted suicide. One was private and the other state run.  In the state run one, I would see a doctor for maybe 5 minutes a day so he could fill out paperwork, and the food was shit and the living conditions were terrible.  In the private one, we had a set schedule and doctors and therapists would meet with us throughout the day.  I spent hours a day talking to somebody there and even during downtime there was somebody I could talk to who wasn't just a government employee.  The food was way better too.\n\nI know this isn't a surprise to anybody here but the private ran institutions were by far better than any public institution.  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18coyi/what_is_everyones_take_on_mental_institutions/"
  }, {
    "id" : 18,
    "title" : "Free Market Monopoly?",
    "snippet" : "My friends and I enjoy playing Monopoly, but I dislike the central government control that it requires. Is there some set of rules that can transform regular Monopoly into something more free market without have to buy anything?  http://www.reddit.com/r/Anarcho_Capitalism/comments/ub339/free_market_monopoly_board_game/ holy shit. Ima play that.  Try Settlers of Catan Interesting how gameplay can change based on the ideology of the players.   I know Monopoly was originally made by a Georgist to advance the single-tax/land-tax agenda, but wasn't it criticizing central banks as well? I know Monopoly was originally made by a Georgist to advance the single-tax/land-tax agenda, but wasn't it criticizing central banks as well?  Instead of \"Go to Jail!\" It could be \"Go to Privatized Jail!\"\n\nFree parking? Now it's just parking (remember to feed the meter!).\n\n Dude, imagine a world where everything were free and, uh, we were all happy and stuff.  And fuck capitalism.   what's the central government? the fact that the prices are set in advance? I dont get it There are two matters of central government in Monopoly. The first is the existence of the bank - the bank is not allowed to go bankrupt and continues to flood the market with paper notes as players pass go. The second piece is the requirement for the participants to engage in business when they land on another players property or are assessed a penalty through a chance card or the community chest.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18bwr3/free_market_monopoly/"
  }, {
    "id" : 19,
    "title" : "How many of you have heard Mises' actual voice? He's actually speaking in this video on wage earners and employers.",
    "snippet" : "  Yeah, he 'sounds like Hitler' to most American listeners who don't have much experience with many Austrian speakers. Yeah, he 'sounds like Hitler' to most American listeners who don't have much experience with many Austrian speakers.   Using the Mises and other libertarian info has not produced anything more than 1% of the votes in the last 30 years.\n\n\nI understand that there are a lot of \"economists\" who want to hold their positions, but most of them are just obsoletes, who only find jobs because of the state.  &gt; Using the Mises and other libertarian info has not produced anything more than 1% of the votes in the last 30 years.\n\nYou can't measure the progress of ideology based on how many votes the Libertarian Party has received over the years. People like Milton Friedman were heavily inspired by a lot of the works now archived by the Mises Institute, and he's considered one of the biggest contemporary figures in economics.\n\n&gt; I understand that there are a lot of \"economists\" who want to hold their positions, but most of them are just obsoletes, who only find jobs because of the state.\n\nNot sure what point you're making here. Keynesian economics is the prevailing economic theory, because it is taught as canon in undergraduate and graduate education pretty much everywhere - sans George Mason and a few others (Chicago school, etc.). The state just puts these \"experts\" in power. Welcome to the technocracy!\n\n &gt; You can't measure the progress of ideology based on how many votes the Libertarian Party has received over the years.\n\n\nOf course I can. Anyway, a lot of current Austrian thinkers know that we are not fighting an intellectual fight, but a moral one, eg Doug Casey. That is why Mises and other libertarians have not and will not succeed to promote any form of anarchy. \nIt is more of theory, \"this is how its done\", rather than any of them living and making changes in their own life's towards anarchy, excluding Jeff Tucker.\n\n\n&gt; Not sure what point you're making here.\n\nMost of the Austrian \"economists\" in here are just using this sub to get a job anywhere, they do not promote anything ancap, other than themselves.   &gt; a lot of current Austrian thinkers know that we are not fighting an intellectual fight, but a moral one, eg Doug Casey. That is why Mises and other libertarians have not and will not succeed to promote any form of anarchy.\n\nAre you sure you don't want to rephrase that? Because what you seem to be implying is that basically any argument that **isn't**  ethical or moral one hasn't/isn't/won't work, or isn't significant based on your own feelings in respect to how efficacious moral arguments would be in their stead. \n\n\n&gt;Using the Mises and other libertarian info has not produced anything more than 1% of the votes in the last 30 years.\n&gt;&gt;You can't measure the progress of ideology based on how many votes the Libertarian Party has received over the years.\n&gt;&gt;&gt;Of course I can\n\n\n\nOh really? How have you determined that this is solely a \"moral fight\"? Simply by saying libertarians only got 1% of the vote? You have absolutely no way of knowing how many of these people were convinced by economic or moral arguments or otherwise.\n\nYou admonish the Mises people for just talking \"theory\" yet convincing someone initially of the NAP is also just \"theory\".\n\nFor the person who is new to Libertarianism/ancap/voluntaryism etc. and is only introduced to the moral aspect of these philosophies, will just disregard it if at the end of the day the NAP results in societal suicide and doesn't answer who will build the roads or take care of the poor or provide infrastructure, etc.\n\nUtilitarian, consequentialist, historical **and** arguments appealing to some Austrian Economics are **invaluable**  in convincing people and to lay the foundation so they can feel more confident in consistently applying the NAP, yes in their personal lives it is important, but if it isn't accepted to apply on a macro level I suspect you won't seem as convincing as you think you are, or be as efficacious in actually producing a free society.   &gt;  Because what you seem to be implying is that basically any argument that isn't ethical or moral one hasn't/isn't/won't work, or isn't significant based on your own feelings in respect to how efficacious moral arguments would be in their stead.\n\n\nIt has not worked, and it will not work. \n\n\n&gt; Oh really? How have you determined that this is solely a \"moral fight\"? Simply by saying libertarians only got 1% of the vote? You have absolutely no way of knowing how many of these people were convinced by economic or moral arguments or otherwise.\n\n\nSimple, just compare the freedom of today, and compare it to when Mises uni started. And see how many aspects of the nap Mises uni and all its followers have broken.\n\nSo they are hypocrites who tell us how its done, but they do the same things as statists.\n\n\n\n\n&gt; You admonish the Mises people for just talking \"theory\" yet convincing someone initially of the NAP is also just \"theory\".\n\n\nThere are plenty of leftists that practice nap  with more rigour than most people at Mises.\n\n\n&gt; For the person who is new to Libertarianism/ancap/voluntaryism etc. and is only introduced to the moral aspect of these philosophies, will just disregard it if at the end of the day the NAP results in societal suicide and doesn't answer who will build the roads or take care of the poor or provide infrastructure, etc.\n\n\nSure it is good to have a bit of economy and free markets, but that is a tiny percentage of what anarchy is.\n\n\n\n&gt; yes in their personal lives it is important, \n\n\nThat is what nearly everybody lacks at Mises and other libertarian places, that is why they will never achieve anything, on the contrary even the libertarian numbers are shrinking.  \n\n\n\n&gt; but if it isn't accepted to apply on a macro level I suspect you won't seem as convincing as you think you are, or be as efficacious in actually producing a free society.\n\n\nPeople who break the nap, but preach the nap will not be looked at with any integrity.\n\n\nAfter all, thats all the majority of the Mises, 300kg man preaching about body-building diets, just sad. &gt;Simple, just compare the freedom of today, and compare it to when Mises uni started. And see how many aspects of the nap Mises uni and all its followers have broken.\n\nActually no it is not at all simple and you didn't address what I said, also holy non sequitur batman. In an immensely complicated society, with media, culture and philosophy ramming together from all sides you've isolated 2 variables, asserted that there's some connection without proof or logic and think you've sorted the issue? You might want to leave FDR.com for a while and let your brain flush out some of Stef's shittier talking points. \n\nAgain, the percentage of people who voted Libertarian doesn't mean ANYTHING in regards to determining the best way to propagate libertarian ideas if you have NO WAY OF KNOWING how many of the people that did vote were convinced of Libertarianism on moral, economic or utilitarian grounds, in what combination and in what proportion. \n\n&gt;There are plenty of leftists that practice nap with more rigour than most people at Mises.\n\nAnd yet they support the current political super structure that breaks the NAP frequently and with abandon, and will likely raise children that support it too, *and you are praising them*, and contrasting them with the people at Mises.org who you claim \"break the nap\", ***do you not see how ridiculously retarded that is?*** \n\n&gt;but that is a tiny percentage of what anarchy is.\n\nYou missed the point, the only people who you will convince of \"anarchy\" based solely on the NAP (if any) will be people who simply follow their emotions, \"oh X is bad? ok I'll believe Y\" \n\nIf they aren't at all curious /don't care about the practical implications of the NAP i.e. all that \"free market economy stuff\", they'll simply be persuaded by the next moral snake oil salesmen that comes along who actually does care to support his moral sophistry with practical benefits. \n\n &gt; In an immensely complicated society, with media, culture and philosophy ramming together from all sides you've isolated 2 variables, asserted that there's some connection without proof or logic and think you've sorted the issue? \n\n\nYou got something against Doug Casey and others and his knowledge on the matter?\n\n\n&gt; You might want to leave FDR.com for a while and let your brain flush out some of Stef's shittier talking points.\n\nOh it is about this?\n\n\n&gt; Again, the percentage of people who voted Libertarian doesn't mean ANYTHING in regards to determining the best way to propagate libertarian ideas if you have NO WAY OF KNOWING how many of the people that did vote were convinced of Libertarianism on moral, economic or utilitarian grounds, in what combination and in what proportion.\n\n\nYet Mises and all its echo-nomists promoted it and still promote it. Do you see how retarded that looks?\n\n\n&gt; And yet they support the current political super structure that breaks the NAP frequently and with abandon, \n\n\nYep lets put the marxists paint on, on people who communicate and work in the private sector peacefully. \n\n\n&gt; and will likely raise children that support it too,\n\n\nNot if you treated them with love and nap, and there are a few that do.\n\n\n&gt; and you are praising them\n\nYes, for doing something anarcho that uni professors preach but cant do. \n\n\n&gt; and contrasting them with the people at Mises.org who you claim \"break the nap\", do you not see how ridiculously retarded that is?\n\n\nThe only contradiction is that you are comparing \"scholars\" to \"people\". \n\n\n&gt; the only people who you will convince of \"anarchy\" based solely on the NAP (if any) will be people who simply follow their emotions,\n\n\nYes, as I said, it is a moral fight, and its flames are growing quicker than any \"intellectual\" libertarian literature. \n\n\n&gt; be persuaded by the next moral snake oil salesmen that comes along who actually does care to support his moral sophistry with practical benefits.\n\n\nYour opinion is from the 20's. Each and all of us have access to the net to verify our own findings.\n\nAlong with the founders of Mises trying to get the UN to do their dirty work, as their decades of establishment couldn't even learn about the nap that they preached. &gt;You got something against Doug Casey and others and his knowledge on the matter?\n\nNo and irrelevant / appeal to authority, regardless as far as I know he doesn't go around baselessly disparaging the Mises Institute saying it's completely ineffectual partly because they also break the NAP. \n\n&gt;Oh it is about this?\n\nAbout what? A weak argument that Stef makes that you are actually bastardizing, twisting and making even weaker to suit your own bitter feelings? Yes I suppose that's what this is now about. \n\n&gt;Each and all of us have access to the net to verify our own findings.\n \nHmm and I wonder where they'll go? \n\n&gt;Along with the founders of Mises trying to get the UN to do their dirty work, as their decades of establishment couldn't even learn about the nap that they preached.\n\nWhat the actual fuck? \n\nWell I'm out, I don't know if it's your English comprehension or your intellectual faculties that are the problem but neither are facilitating a productive conversation here, at least not with me, maybe someone else will take your bait. \n\n\n\n &gt; You can't measure the progress of ideology based on how many votes the Libertarian Party has received over the years.\n\n\nOf course I can. Anyway, a lot of current Austrian thinkers know that we are not fighting an intellectual fight, but a moral one, eg Doug Casey. That is why Mises and other libertarians have not and will not succeed to promote any form of anarchy. \nIt is more of theory, \"this is how its done\", rather than any of them living and making changes in their own life's towards anarchy, excluding Jeff Tucker.\n\n\n&gt; Not sure what point you're making here.\n\nMost of the Austrian \"economists\" in here are just using this sub to get a job anywhere, they do not promote anything ancap, other than themselves.   Just wondering, how many determenists downvoted? Is English not your native language?\n\nI upvoted you for honestly challenging these guys, even though I think some of your criticisms rely on faulty premises (political and social activism supposedly being the *only* reason to adopt ancap views).\n\n",
    "url" : "http://www.youtube.com/watch?v=VjTCS1-Ykvw"
  }, {
    "id" : 20,
    "title" : "Canadian Government to end warrantless wiretapping (Supreme Court ruling) ",
    "url" : "http://www.vancouversun.com/news/national/Government+warrantless+wiretapping+wake+Supreme+Court/7948768/story.html"
  }, {
    "id" : 21,
    "title" : "Country’s Largest Raw Milk Supplier Sues FDA for Ban on Interstate Sales",
    "snippet" : " ",
    "url" : "http://foodriotradio.com/2013/02/countrys-largest-raw-milk-supplier-sues-fda-for-ban-on-interstate-shipment/"
  }, {
    "id" : 22,
    "title" : "Constitutional rights vs natural rights. You are a free sovereign individual, not because of any document but because you are a human being.",
    "url" : "https://www.youtube.com/watch?v=U_rsIbws-vE&amp;feature=youtube_gdata_player"
  }, {
    "id" : 23,
    "title" : "Why I Don't Argue and Neither Should You (Depending on Your Goals) | by LifeIsHowItIs",
    "snippet" : "  I like arguing. It's entertaining. Also, having other people criticize my ideas allows me to gain access to other perspectives. Some of the information they posses may overlap but some of it may not. That new information can give me insight into my own reasoning that I would not have otherwise.  The solution is not to turn honest debate into discrete manipulation. This way overexaggerates peoples inability to understand things objectively, at least by the standards of common argumentation here. \n\nAsk yourself, would you rather two people honestly discuss they way they feel, or have a two way manipulation game.\n\nIt's better to teach people how to dissect information objectively apart from their emotions, rather than employ these tactics to other people, it's dehumanizing and partly dishonest. I can speak only for what I mean in the video, and there is much more emphasis on communication than persuasion. I do not mean to employ tricks; I have near zero interest in convincing people of other ideologies to my cause. What I'm saying is that your option is to treat people one way, or to treat people another in order to feel a certain way. I see no reason for believing that creating an atmosphere for calm discussion is that same thing as manipulation; calming the emotions so that you can get to the rational part is in the summation of the video.  &gt;calming the emotions so that you can get to the rational part is in the summation of the video.\n\nI can agree with that, but I think the title should be \"why I don't engage in heated arguments\", because to me arguing just means advocating/defending a position with someone else doing the same. It doesn't have to be emotional, though it often can be. Arguing in the sense of just yelling past each other is of course unproductive. I think arguing implies a heated nature. I think things get a bit tricky when we get into implied meaning and semantics in general, so I can understand why the idea wouldn't make sense if it means a different thing to me than it does to you. Well it is the [actual definition](http://imgur.com/fCFC55N) of the word. The way a dictionary defines thing and the way that things are colloquially used often have a big gap in between them. If you say \"I had an argument with my boyfriend last night\" then you do not mean \"I had a calm and rational discussion about a topic on which we disagreed.\" \n\nAs much as life would be easier if it was the case that words had objective meaning and that people did not stick their own implications on it, I do not think this pans out in real life. Take even the words \"anarchism\" or \"capitalism.\" While the way ancaps use it actually stick to the dictionary, arguments trying to convince a traditional anarchist that we are using them properly will be fruitless because they attach a historical-social meaning to them.\n\nSo, while I appreciate the resource, I do not think it addresses that we have a gap between how words are defined, and how words are used.    I understand that, but that's why I'm trying to point out you are using the word in a way that can be misleading to people here. In everyday life people may use argue as a synonym for fight, but people here and myself usually take the word to mean debate/discussion. So when you say don't argue with people it can come off as, don't try to talk to other people about your ideas when they are defending or advocating their own. I know that is not what you are saying but it can be misleading, I think don't get in fights with people is more appropriate for this audience.  The solution is not to turn honest debate into discrete manipulation. This way overexaggerates peoples inability to understand things objectively, at least by the standards of common argumentation here. \n\nAsk yourself, would you rather two people honestly discuss they way they feel, or have a two way manipulation game.\n\nIt's better to teach people how to dissect information objectively apart from their emotions, rather than employ these tactics to other people, it's dehumanizing and partly dishonest.  For anyone interested in this subject, she's basically outlining the book [The Righteous Mind](http://righteousmind.com/) by Haidt For anyone interested in this subject, she's basically outlining the book [The Righteous Mind](http://righteousmind.com/) by Haidt Listening to a few talks from this man and, I have to say, his historical analysis is afflicted with great statist programming.\n\nUpdate: shit, I spoke to soon; there's more than enough redeeming, quality analysis later. she (unless you're refering to Haidt)  This motivated me to start working on an article I've been procrastinating.\n\nhttp://jamescarlin.wikidot.com/arguing-is-worthless\n\nOne piece this appears to be missing or not clearly explained is that the overlap between \"concept analysis\" and \"argumentation\" is primarily **semantic**, and that the underlying behaviors and goals are quite distinct.\n\n\n\n\n\n Hook me up with an RSS feed. I want to read, but RSS is the only way I can make sure I don't miss anything. http://jamescarlin.wikidot.com/feed/site-changes.xml\n\nI did a little bit of searching, and this link above works.... but shows every time I make even minor changes to pages.  I suppose ideally, I should have a seperate \"blog\" but I'll let you know if/when I do that.   Right now I'm working on some code, but I'll leave this comment open to remind me to look into it.  What are your thoughts on \"non-violent communication\" as espoused by Marshall Rosenberg? The mindset described in this video is more important than the language of NVC. Or is at least presupposed.  Is the goal to get the other person to admit that they were wrong and for them to feel bad about being wrong? (Dominating the other person through shame.) Or is the goal to have empathy towards both sides of the conflict. (Seeking Mutual benefit) The language of needs used in NVC can be used for both, which is one of NVC's flaws in my opinion. \n\n**EDIT:** The flaw of NVC is not the language itself, but that a lot of the heavy focus is on language.   And often times even those who espouse NVC have skipped right over the message presented in the video above.  Which I think needs to be the mindset that come first. I seem to remember Rosenberg making clear that it doesn't work to try to manipulate someone into agreeing with you, this video and what you are saying sound just like something he would say.  So the point is that we shouldn't argue because others can't take it emotionally?\n\nThat's very disrespectful to others, in my opinion.\n\nI'm going to continue to treat people like adults and have arguments with them.  so she's arguing that one should not argue...  I can't see the video just yet. But let me extend the idea and suggest that you shouldn't have to defend your ideology to anyone. Just like how it would be pretty douchebaggy if some Christian started arguing to a non-Christian that their religion makes no sense and for them to explain it to them like that was their responsibility, so would it be for a statist to demand you answer them \"what about the roads\". No, they can go and do some reading if they so choose.\n\nBy all means, answer stupid questions if you so choose that people have about anarchism, but don't feel obliged or defensive. This is also somewhat of a black mark against evangelism in religion and in political ideology; we do not need to answer questions or argue in an attempt to turn people around (by all means argue if you so want). People who are truly disillusioned with their current faiths will arrive at the logical conclusion on their own.    ",
    "url" : "http://www.youtube.com/watch?v=qVRhwwsKPog"
  }, {
    "id" : 24,
    "title" : "Control is War",
    "snippet" : "  War starts in the home, no need to go to other continents for it.  Good read.  &gt; War begins...when you attempt to forcibly control someone else without their permission.\n\nIt seems believable, but could you possibly expand on how you got to this conclusion?  Thanks! It seems obvious to me, but I suppose that's not satisfactory...\n\nA 2-person fight is, in principle, war. It's not war to to the degree that a 2-nation fight is, but it's still war because their is some sort of disagreement that has led to violence or the threat of violence (cold war). Why is their a disagreement? It's probably always over a piece of property (object, land, body/person), a dispute of ownership. One party is claiming ownership, ie. the right to control in some way, and the other is opposing that claim (therefore making their own claim to ownership or partial ownership). Parties can be single individuals, or groups of individuals, but the claim, I think, is always over ownership, and thus control.\n\nDoes that help? Thanks for the reply!  See, this is kind of what I thought when I read it too.  What's crazy is - is that I could see an anarchist saying the exact same thing, only they'd go one step further and claim that property itself = war.  Great article, by the way.",
    "url" : "http://www.everything-voluntary.com/2013/02/control-is-war.html"
  }, {
    "id" : 25,
    "title" : "How will a voluntarist society be achieved?",
    "snippet" : "Will it be through an election? Mutual agreement? Will the state slowly cease to exist? Will it be through a violent revolution? A peaceful revolution?\n\nI realize that there will be disagreements but what are your individual views?  Treat your kids, family, friends, colleges with the out most love and nap.\n\n\nOstracise all other parasites as much as possible who use force coersion and intimidation on the weaker people. You only live once for around 1000 months, dont spend it on wankers, criminals, statists, abusers ect.  _Spaaaaaaace_.\n\nSeriously though, I think statism is too ingrained in our history for us to ever just totally get rid of it. I think when people finally get to new land that's actually ungoverned (eg, Moon/Mars colonies or something), we'll be able to take a fresh look at the state and voluntarism may have a shot.\n\n\\- My largely uninformed opinion.  When it's cheaper to break a law than follow it, people break the law. Copyright has been prosecuted to the fullest extent allowed by human resources for over a decade--the entertainment industry has taken a loss on the venture, file sharing is easier than it's ever been, and for non-commercial use copyright is essentially a dead letter.\n\nIt will take generations for the state to update its policies accordingly, but the damage has already been done in the here and now. As voluntary association gets cheaper and safer, more and more people will choose it. That's why it's called voluntarism.       Peacefully and gradually.\n\nOne thing I love about being a capitalist is that the world I want exists in small pieces already, and the spread is inevitable. The state will never keep pace with the advancements of free humanity.\n\nBringing these ideals into reality doesn't require hordes of foaming-at-the-mouth revolutionaries who are just going to kill each other once they get power. (looking at you /r/anarchism)  I'm not a voluntarist, but from my understanding they tend to favor agorism and general raised awareness. \n\nI personally think our best option for *anarcho-capitalism* (which isn't synonymous with voluntarism) is through the political system. We must have a lawful transition, and the prohibition of further rights violations with a greater decentralization should get us there. Our odds aren't looking great, as secession and libertarianism in general are mostly rejected, but I never claimed to be an optimist.  &gt; anarcho-capitalism (which isn't synonymous with anarcho-capitalism)\n\nCome again? They have similarities, and some can identify as both, but they are not the same thing. Voluntarist can be very anti-capitalist, and an ancap can favor acts of violence voluntarists generally reject (like execution and other forms of punishments).  You said that anarcho-capitalism isn't synonymous with anarcho-capitalism.  That's the same word.  \n\nI think you meant to say that voluntaryism isn't synonymous with anarcho-capitalism. I'm not a voluntarist, but from my understanding they tend to favor agorism and general raised awareness. \n\nI personally think our best option for *anarcho-capitalism* (which isn't synonymous with voluntarism) is through the political system. We must have a lawful transition, and the prohibition of further rights violations with a greater decentralization should get us there. Our odds aren't looking great, as secession and libertarianism in general are mostly rejected, but I never claimed to be an optimist.           ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18b7du/how_will_a_voluntarist_society_be_achieved/"
  }, {
    "id" : 26,
    "title" : "Drug cartels invent their own phone network to communicate news and plans.",
    "snippet" : "  That is so cool.\n\nY'know, I'd totally be 100% behind these cartels and their flourishing practice of agorism if they'd just stop cutting peoples' heads off.\n\nCan I get some love for the NAP, jefe? That is so cool.\n\nY'know, I'd totally be 100% behind these cartels and their flourishing practice of agorism if they'd just stop cutting peoples' heads off.\n\nCan I get some love for the NAP, jefe? That is so cool.\n\nY'know, I'd totally be 100% behind these cartels and their flourishing practice of agorism if they'd just stop cutting peoples' heads off.\n\nCan I get some love for the NAP, jefe? That is so cool.\n\nY'know, I'd totally be 100% behind these cartels and their flourishing practice of agorism if they'd just stop cutting peoples' heads off.\n\nCan I get some love for the NAP, jefe?    What did the US government think would happen. Everyone knows they monitor all major forms of public communications. Of cource organized crime groups that become large enough would create their own unmonitored lines.   ",
    "url" : "http://www.npr.org/2011/12/09/143442365/mexico-busts-drug-cartels-private-phone-networks"
  }, {
    "id" : 27,
    "title" : "\"Contingent Property\" - An exploration of how property is not automatically granted.",
    "snippet" : "  I suggest Friedman's [A Positive Account of Property Rights](http://daviddfriedman.com/Academic/Property/Property.html), it's a personal fav on the topic.   I suggest Friedman's [A Positive Account of Property Rights](http://daviddfriedman.com/Academic/Property/Property.html), it's a personal fav on the topic.    I think you've got the form of property backwards. Rather than property being a mutually beneficial truce between parties to a property conflict, I think property is a means of resolving a conflict in the eyes of onlookers. It only becomes mutually beneficial for both parties to the conflict *because of* the social consequences imposed by those onlookers. Actually, that's not necessarily true. If there is reasonable expectation of future conflict, it is worth finding a low cost-per-conflict resolution system. Property rights are a system designed to allow parties to objectively determine the rightful owner in advance of conflict. Two parties may agree on property rights absent any social implication, simply because of the reduced costs for both parties in future conflicts over scarce resources. I may not have picked the coconuts today, but I might pick them tomorrow.\n\nThis is not a guarantee - if one party is easily able to dominate the other, where the cost of using force is outweighed by the gains, then property norms break down without external social costs.  Downvotes and no responses?  I'm interested in hearing any responses you may have even if you disagree.  I can't imagine living in a world where I had to make truces with every person I ever met. Most people would want return to the \"automatic\" property system because of how cumbersome truce theory is. \"Truce theory\" is merely a framework for analyzing and understanding human interactions and ethical proposals.  You already do \"truce theory\" here all the time on /r/AnCap, by discussing the \"AnCap Truce\" (even if you don't call it that).  Not only do you discuss what that truce 'should' be, but also how to properly treat those who violate that truce.  And no, I don't see any reason why it is necessary to generate new truces with every individual, any more than one does already today.\n\nEdit:  The self defense clause &amp; non-aggression principle are two perfect examples.  Basically it's saying *\"I respect your person and property UNLESS/UNTIL you don't respect my person/property\"*  When AnCaps propose property, they're not respecting property ownership of thieves so they're already doing what the article talks about. What is practiced by AnCaps isn't a truce at all...it doesn't require other people to agree with it. If someone doesn't agree to the \"AnCAp truce\" - their lack of agreement with the truce doesn't exempt them from the consequences. \"Truce theory\" is merely a framework for analyzing and understanding human interactions and ethical proposals.  You already do \"truce theory\" here all the time on /r/AnCap, by discussing the \"AnCap Truce\" (even if you don't call it that).  Not only do you discuss what that truce 'should' be, but also how to properly treat those who violate that truce.  And no, I don't see any reason why it is necessary to generate new truces with every individual, any more than one does already today.\n\nEdit:  The self defense clause &amp; non-aggression principle are two perfect examples.  Basically it's saying *\"I respect your person and property UNLESS/UNTIL you don't respect my person/property\"*  When AnCaps propose property, they're not respecting property ownership of thieves so they're already doing what the article talks about. Fair enough, but I wonder: How exactly is contingent property just? It seems like contingency property is a \"I'm holding my power to harm your property over your head\" thing for \"defending my property\" purposes. It doesn't jive well with capitalism to have people threatening property all the time.\n\nEDIT: One too many is's in my post. &gt; *\"How exactly is contingent property is just? \"*\n\nHow is any property just? Contingent property *(which isn't a type of property, it's just a concept)* does not propose that it is just, but instead recognizes that most property proposals ARE continent.\n\nThe advantage or reason for recognizing \"property is contingent\" is to recognize and avoid a certain \"Trick.\"  The trick is illustrated in the article, where one person proposes an arbitrary and agreeable property (like iphones) and then somehow exempts other kinds of property (like capital).\n\nIf one rejects the ownership of capital, then the presumption that an AnCap agrees to their IPhone ownership disappears.  From there, they have to \"prove\" their iphone ownership, and not merely rely on the fact that AnCaps like property. I get what you're saying, but it seems like the idea of contingent property is \"offensive\", as in you have to be able to threaten other people's property to lay claim to your own.\n\n\"Ancap property\" (because I lack a good descriptor for the methodology I think ancaps use for property) is \"defensive\", where the only threatening you have to do is to other people if they so choose to threaten your own property first. \"Truce theory\" is merely a framework for analyzing and understanding human interactions and ethical proposals.  You already do \"truce theory\" here all the time on /r/AnCap, by discussing the \"AnCap Truce\" (even if you don't call it that).  Not only do you discuss what that truce 'should' be, but also how to properly treat those who violate that truce.  And no, I don't see any reason why it is necessary to generate new truces with every individual, any more than one does already today.\n\nEdit:  The self defense clause &amp; non-aggression principle are two perfect examples.  Basically it's saying *\"I respect your person and property UNLESS/UNTIL you don't respect my person/property\"*  When AnCaps propose property, they're not respecting property ownership of thieves so they're already doing what the article talks about. Since you put this in after my first post:\n\n&gt; Edit: The self defense clause &amp; non-aggression principle are two perfect examples. Basically it's saying \"I respect your person and property UNLESS/UNTIL you don't respect my person/property\" When AnCaps propose property, they're not respecting property ownership of thieves so they're already doing what the article talks about.\n\nThere is a huge disconnect in that last sentence there. I can't think of any ancap who says it's okay to steal from thieves, unless it's to get your own goods back. The thieves didn't ever own the stolen goods in the first place. What's wrong with taking from thieves? Let's take a preference view of things. What if, hypothetically, you were labelled a thief by a group of people? Would it be okay for them to steal things you legitimately bought or claimed legitimately?\n\nI did not say it was not okay to take back stolen property. I said that JamesCarlin made a huge error by saying anarcho-capitalists do not respect property rights of thieves, which they do. They only disrespect the false and illegitimate claim to the stolen property the thieves have.\n\nEDIT: Anarcho-capitalism is not a person, no matter how much I want it to be. &gt;Let's take a preference view of things. What if, hypothetically, you were labelled a thief by a group of people? Would it be okay for them to steal things you legitimately bought or claimed legitimately?\n\nIt wouldn't be okay for me, obviously. Just as a thief would think it not okay for anyone to take property from him, stolen or otherwise. But that's not what it's about. It's about personal justification of behavior, not whether the property holder cares or not. This is why preference-ists / deontologists like me argue that the market would necessarily create an arbitration system to handle all of those potential issues. People don't like being raided, but they do like formal conflict resolution so that they can trust each other between conflicts. Ostracism and raiding are necessarily last resorts because they cause huge trust issues no matter if you're in the moral right or not. &gt;This is why preference-ists / deontologists like me argue that the market would necessarily create an arbitration system to handle all of those potential issues.\n\nAs would I.\n\n&gt;Ostracism and raiding are necessarily last resorts because they cause huge trust issues no matter if you're in the moral right or not.\n\nWhy is ostracism a last resort? &gt; Why is ostracism a last resort?\n\nNot only can it be a huge hurdle to stop buying or spending time around a person or business (\"I'd have to find a new X to get my Y from\" sort of thing), defending your ostracism in the public eye can be difficult and may backfire. Imagine if Wal-Mart barred entry to the store to anyone wearing what might be considered gang related clothing. No matter how justified that might be based on the level of gang violence in the area, there would likely be calls of racism and reverse ostracism. Wal-Mart might rather just hire more security. Let's take a preference view of things. What if, hypothetically, you were labelled a thief by a group of people? Would it be okay for them to steal things you legitimately bought or claimed legitimately?\n\nI did not say it was not okay to take back stolen property. I said that JamesCarlin made a huge error by saying anarcho-capitalists do not respect property rights of thieves, which they do. They only disrespect the false and illegitimate claim to the stolen property the thieves have.\n\nEDIT: Anarcho-capitalism is not a person, no matter how much I want it to be. &gt; *\" I said that JamesCarlin made a huge error by saying anarcho-capitalists do not respect property rights of thieves, which they do.\"*\n\nIt's not a error, just simply a lack of detail.\n\nAnCap restitution is proportional; meaning that a person may only respond to breaches *(of the truce, NAP, property, etc)* in proportion to the violation.  This helps maintain the truce, and the desired goals/pursuits of the truce.\n\nIf someone respects ZERO property, the proportion of restitution might be large enough it's as if the \"thief\" has no property. &gt; If someone respects ZERO property, the proportion of restitution might be large enough it's as if the \"thief\" has no property.\n\nIf the person truly respected zero property, he would not respect his own, and thus you couldn't steal or take anything from him. You can't repay out of nothing, only your own property. He might have things on his person, but other people own them and they are property of other people or those who make claims to it.\n\nAs such, even thieves respect property, if only theirs. Since you put this in after my first post:\n\n&gt; Edit: The self defense clause &amp; non-aggression principle are two perfect examples. Basically it's saying \"I respect your person and property UNLESS/UNTIL you don't respect my person/property\" When AnCaps propose property, they're not respecting property ownership of thieves so they're already doing what the article talks about.\n\nThere is a huge disconnect in that last sentence there. I can't think of any ancap who says it's okay to steal from thieves, unless it's to get your own goods back. The thieves didn't ever own the stolen goods in the first place. I can't imagine living in a world where I had to make truces with every person I ever met. Most people would want return to the \"automatic\" property system because of how cumbersome truce theory is. I've been thinking....\n\nI think your disagreement / confusion comes from thinking \"Truces\" and \"contingent property\" are types of property.  They're not.  \"Contingent\" is an adjective - describing property proposals which are contingent upon the entire proposal.\n\nTo use an example, one may offer a contract with certain terms which they are willing to sign.  If another were to mark off half the terms of that contract, the first person may no longer find that contract to be desirable. So, my property is contingent on other people? Do I have to seek permission from everyone in the neighborhood before I can say I own the house I inhabit?  I don't see how this might be a useful framework of thought. In my framework of thought reciprocity is the entire formula of justice. If somebody takes your labor product, then you are justified to take it back, if somebody uses violence against you, then you may do the same. This is a far simpler approach.\n\nThe only apparent advantages yours might have is with regards to rationalizing intellectual monopoly enforcement against people who don't recognize it as valid. Beyond that, it seems unnecessarily complicated, and occam's razor suggests the simpler model. If the product of my labor is a house that I build, then I move to a new house and rent out the old house (product of may labor) to a tenant, and the tenant quit paying rent, would it be just to evict the tenant and take back the product of my labor? It depends. The tenant may have contributed their labor product to the house as well in the course of living in it, and would thus have some stake in it. If this was the case, either one of you forcibly excluding the other would be unjust. You would have the overwhelming claim to the house though, and as long as any stake of ownership in the house that they might also have, if they do, is repaid, then yes, it is just.  I thought you were an advocate of possession as just ownership.  Wouldn't the the user/occupant have a stronger claim than an absentee landlord? No, I'm an advocate of property, I just make an effort to explain the ideas of other people as accurately as I can. I do think that advocates of possession are generally onto an idea that their propertarian opponents generally miss, though.\n\nIn my view, they would both have claims to the house, and the longer the tenant stays in the house, the greater their stake of ownership in the house. Perhaps after some number of years the claim of the tenant would exceed that of the original owner, but both claims can exist simultaneously. Wouldn't it be trivial to include a clause in the rental contract stating that the tenant's interest in the house is handed over to the owner (primary interest holder?) if X (for example, non-payment of rent after Y period of time)? Theoretically yes, but a free market would sustain that type of thing only at significantly lower rent that the owner could probably never pay it off out of the rent they make from it (at market interest rates). After all, why would I as a tenant pay to let you live off of my income and pay off your house for you if I'm not getting something out of the deal in the long run? If I'm going to pay off a house, I want to pay off my own house.\n\nWhat we have now is most certainly not a free market, of course. Ok, but presumably part of the rental contract would be that the owner would be responsible for maintenance costs and so on. There would almost certainly have to be some kind of service over and above simply 'here is the house' for it to be viable. Given that, assuming the owner was keeping up with their side of the agreement I don't see why they would be willing to bear the risk of the tenant just deciding to stop paying rent and claiming partial ownership of the house.    \nIt seems like this approach would incentivise renters to only rent out property on relatively short term leases to mitigate the potential risk of competing claims to the property.    \nI agree that in a free market it would be unlikely for a situation in which someone rents out a house, does nothing at all and just collects rent forever to arise. &gt; Ok, but presumably part of the rental contract would be that the owner would be responsible for maintenance costs and so on. There would almost certainly have to be some kind of service over and above simply 'here is the house' for it to be viable.\n\nEven a rental contract in which the owner is responsible has the same attribute that the costs of maintenance are coming out of the rent charged to the tenant. If that were the case, why not simply get some kind of insurance for something like that (my landlord has appliance insurance, they pay a flat rate to get all their appliances fixed)? The landlord or capitalist wears many hats, they are the owner, often insurer, the manager, the investor. Their income can be divided among the hats they wear. Getting a service on the market would generally deprive the landlord or capitalist of that fraction of their income. If I am paying for the appliances to get fixed anyway, why not pay for that service on the market rather than from my landlord? If I am paying for their house insurance, why not get that myself on the market? And so forth. After all of these roles are pushed into the market where it can be done with more realistic pricing, the landlord's income is negligible if it's even there. There's a possibility they'd actually be losing money just to have someone rent to place because if they didn't they'd be losing money faster. Not all landlords at once would be in that condition but enough would that landlording wouldn't be a business people try to get into, and one that they avoid at all costs. Why can't we do this? Well, the landlord (or their bank) says we can't.\n\nLandlords, in their role as landlords being everything other than what can be done for cheaper on the market, don't provide anything. They are basically toll booth workers. Most landlords wouldn't do it without the promise of unearned income.\n\n&gt; I don't see why they would be willing to bear the risk of the tenant just deciding to stop paying rent and claiming partial ownership of the house.\n\nNo, this isn't a right they just up and claim one day. It's gradually earned over time. After the first month's rent they might own 1/360th stake in the house. After a year, 1/30th. After five years, 1/6th. And so forth. Of course, that would also mean they're paying 1/6th of the insurance, for example. If I'm paying your mortgage I want the benefits of paying a mortgage, otherwise I'll go get my own mortgage. Evicting a tenant would mean buying them out of their share of the house.\n\n&gt; It seems like this approach would incentivise renters to only rent out property on relatively short term leases to mitigate the potential risk of competing claims to the property.\n\nIf you rent it, they have claim.\n\n&gt; I agree that in a free market it would be unlikely for a situation in which someone rents out a house, does nothing at all and just collects rent forever to arise.\n\nIt's likely, they just won't be able to make money off of it. The same applies to capital. I don't see how this might be a useful framework of thought. In my framework of thought reciprocity is the entire formula of justice. If somebody takes your labor product, then you are justified to take it back, if somebody uses violence against you, then you may do the same. This is a far simpler approach.\n\nThe only apparent advantages yours might have is with regards to rationalizing intellectual monopoly enforcement against people who don't recognize it as valid. Beyond that, it seems unnecessarily complicated, and occam's razor suggests the simpler model. &gt; *\"In my framework of thought* **reciprocity** *is the entire formula of justice.\"*\n\nI've been thinking about creating a \"2.0\" version of this article, especially since several people seemed to misunderstand it.  Truces are of course about reciprocity, however perhaps focusing on that might help clarify the concept, so thank you for the suggestion.\n\n----\n\n&gt; *\"The only apparent advantages yours might have is with regards to rationalizing intellectual monopoly enforcement against people who don't recognize it as valid. Beyond that, it seems unnecessarily complicated, and occam's razor suggests the simpler model.\"*\n\nThe concept I'm attempting to express in the article might perhaps be better illustrated by the following analogy:\n\n*  If person-A were to offer a contract with 10 terms, that they agree to sign, and Person-B were to mark off 5 of those terms of the contract - Person-A may no longer be interested/willing to sign the contract with only those 5 terms.\n\nI don't think the concept is complex, though perhaps I'm not explaining it very well. Implicit truces add complexity. Reciprocity of behavior is sufficient, reciprocity through truces seems needlessly indirect. I do recognize the reciprocity underlying them, but I'm unsure why that particular form of reciprocity is given so much importance.\n\nHopefully a new version would be more clear. I might need to make a wiki like this for myself. &gt; *\"Implicit truces add complexity.\"*\n\nPerhaps, but **implicit** reciprocity is perhaps a normal part of a significant portion of human interaction.  Much of it is implicit, because explicitly listing it would be far too complex, time-consuming, and **inefficient**.  If one purchases a candy bar at a store, it seems illogical to write out an entire purchase agreement with all contingencies.\n\n&gt; *\" I might need to make a wiki like this for myself.\"*\n\nAwesome!  The wikidot.com website was ridiculously easy for me to setup; I have other wikis/blogs there I use for other purposes as well.",
    "url" : "http://jamescarlin.wikidot.com/contingent-property"
  }, {
    "id" : 28,
    "title" : "Taking preventive measures in LA: \"Don't shoot!\"",
    "snippet" : "  ",
    "url" : "https://www.facebook.com/photo.php?fbid=555067034511110"
  }, {
    "id" : 29,
    "title" : "Question regarding coordination problems with a large population",
    "snippet" : "Let me preface this by saying that I'm definitely an anarcho-capitalist, though for moral/ethical reasons rather than practical ones, so I'm not trying to troll you guys.  My question is basically this: in general, how can coordination problems (e.g. public good provision) be solved for large populations without resorting to some kind of coercion?  \n\nI specify large populations because it is in large populations that the reputation mechanism seems to fade in importance and behavior takes on a much more impersonal aspect (think of the stereotype that people are ruder in cities).  Also, there are already plenty of examples of small populations working in a more-or-less anarcho-capitalist way, but no examples with a million people or more.  The only solution I can really think of is one where the entire city is effectively governed along the lines of a \"gated community\" where real estate carries with it certain conditions by virtue of contract.  I'd be really interested to hear what others have to say though, since this is one of the more difficult things I've come across.  Here's an essay that I like: [Funding Public Goods by Roderick Long](http://www.freenation.org/a/f21l4.html)\n\nThere's probably loads of other stuff too. Thanks - this is the sort of thing I was looking for.     &gt; public good provision\n\n\nThat is a statist problem, there is no such thing as \"public good\" in a private world. \n\n\nMost holiday resorts in the world have been working as walled cities and have had a great success. Many of them uniting, or going independent will be the future for sure.  I meant it in terms of the the economist's definition of a public good - something that is non-excludable (so you can't prevent people from using it) and non-rivalrous (so that one person's use does not reduce the availability to others), not something that is paid for out of \"public\" funds.  The classic example would be a lighthouse.   &gt;The classic example would be a lighthouse.\n\nLighthouses could be financed by the docks. The docks may take fees from their visitors. A lighthouse makes economic sense as it makes it safer for ships to arrive at the harbor and this leads to more customers. This is how lighthouses have been financed historically as well.\n\nIf there is a market for something, it will likely be provided if the current technology allows it. I meant it in terms of the the economist's definition of a public good - something that is non-excludable (so you can't prevent people from using it) and non-rivalrous (so that one person's use does not reduce the availability to others), not something that is paid for out of \"public\" funds.  The classic example would be a lighthouse.   &gt; I meant it in terms of the the economist's definition of a public good\n\nYou have been reading marxist economists, as there is not \"public\" in a private world. \n\n&gt; The classic example would be a lighthouse.\n\nThat too would be private.\n There are still public goods. Clean air, for example. We cannot stop our pollution from drifting from our property, so the atmosphere is a public good.  \n  \nOther examples include a dam that prevents flooding to all properties on the bank of a river. The dam builder can't exclude land owners that didn't help fund the dam from benefiting from its existence.  \n &gt; I meant it in terms of the the economist's definition of a public good\n\nYou have been reading marxist economists, as there is not \"public\" in a private world. \n\n&gt; The classic example would be a lighthouse.\n\nThat too would be private.\n \"Public goods\" is a pretty widely used phrase in all of economics.  Here's [Tyler Cowen](http://www.econlib.org/library/Enc/PublicGoods.html) giving an explanation.  He's not an anarcho-capitalist, but he's definitely not a Marxist. &gt; He's not an anarcho-capitalist, but he's definitely not a Marxist.\n\n\nAnything non ancap is bound to lean towards marxism. \n\n I really didn't come here to quibble over established terminology.  Public goods are called public goods because access is by definition public, not because they are common or state property.  I really don't see any Marxism at work there.   &gt; Public goods are called public goods because access is by definition public,\n\nUpdate your marxist dictionary than. \n\n\n&gt; Public goods are called public goods because access is by definition public.\n\n\nSaid Stalin, Marx, Lenin, Pot, Moa, Castro ect. Please stop. Please go kill yourself.  What goods are you specifically referring to? \n\nThe only public good I see of any importance, and the only one where any public good problem seems to exist, is national defense, and there's a solution to that. I believe the courts should only come to the aid of those who have contributed to national defense in some manner, whether that means paying a defense agency, stockpiling armaments, contributing to intelligence operations, or reserve training. You don't have a right to any service, so it's simply an expression of free association to label you an outlaw.  The public good that sprang into my mind in particular was lack of noise on a city corner in a residential neighborhood or something like that.  I was more interested in hearing people's thoughts on the coordination problem underlying any sort of public good provision or resolution of externalities.  I've seen a lot of people in this subreddit talk about how you can basically use threats to reputation instead of coercion when trying to sanction behavior - for example, if a firm is cheats its customers, spreading information about this cheating will convince people not to do business with them.  When so many people are involved in a system that they become effectively anonymous, however, what replaces the reputation mechanism?  What gets people to continue to commit to the agreements they've made?",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18b9b5/question_regarding_coordination_problems_with_a/"
  }, {
    "id" : 30,
    "title" : "Marc Stevens: There are no citizens. There is no state.",
    "snippet" : "  Is this the same Marc Stevens? He looks so much different than he did in his [2009 talk](http://www.youtube.com/watch?v=7qsdXlXUocc&amp;feature=player_detailpage#t=663s).  Excellent musical choice; thusly, everything that follows must be logically valid. ",
    "url" : "http://www.youtube.com/watch?v=hJ8Ygbx_cXs"
  }, {
    "id" : 31,
    "title" : "Reminder that you are living in a police state",
    "snippet" : "* [Man arrested in La Guardia airport and spends 24 hours in prison for jar of peanut butter](http://rt.com/usa/news/tsa-peanut-butter-jar-783/)\n\n\n* [Massachusetts Governor signs executive order calling for as much as one year of jail time and a $500 fine for “non-essential” blizzard driving](http://redalertpolitics.com/2013/02/08/mass-gov-threatens-snowstorm-drivers-with-year-in-jail/)\n\n\n* [“LAPD Had 'No Idea' Who They Were Shooting At In Dorner Pursuit, Says Victims' Attorney”](http://reason.com/reasontv/2013/02/08/lapd-had-no-idea-who-they-were-shooting)\n\n\n* [LAPD ram and shoot at a second vehicle in search for Dorner, no charges to be filed](http://www.dailynews.com/ci_22548130)\n\n\n* [Electronic devices of roughly 2/3 of Americans can be seized without reason or warrant](http://www.wired.com/threatlevel/2013/02/electronics-border-seizures/)\n\n\n* [Obama quietly signs law which “…extends powers of the National Security Agency to conduct surveillance of Americans’ international emails and phone calls without obtaining a court order for each intercept.”](https://www.commondreams.org/headline/2012/12/31-1)\n\n\n* [The Cyber Intelligence Sharing and Protection act (CISPA) to be reintroduced before the US House next week ](http://rt.com/usa/news/cispa-congress-reintroduce-act-825/)\n\n\n* [White House to launch campaign against online activity associated with domestic terrorists and “violent sovereign citizens”](http://www.whitehouse.gov/blog/2013/02/05/working-counter-online-radicalization-violence-united-states)\n\n  /r/DescentIntoTyranny  This subreddit, which I have already been amalgamating for myself in a different form, will ensure I am never happy.\n\nThank you for destroying any chance of bliss I had left. Just think of them as little bitty steps toward the public recognizing the state's illegitimacy. :) Just think of them as little bitty steps toward the public recognizing the state's illegitimacy. :) But who will protect us if not the state?  We better inflate the state so it can control itself, it works 100% of the time 0% of the time.  I am currently in Mexico but it's probably not much better here. If you want to/are able to leave, I would suggest soveriegnman.com. There are others as well but can't think of them atm. He (Simon Black) is a big fan of Chile, in fact most of Latin America, and also Southeast Asia especially Laos, Vietnam, Cambodia, Malaysia and others. I would say now is a pretty good time to leave before they make it more difficult and the situation further deteriorates. For people who cannot leave it might also be worthwhile to look into a second passport. Edit: good source for some second passport information http://tdvpassports.com &gt;There are others as well but can't think of them atm\n\nThe three that I know of:\n\nhttp://www.sovereignman.com/\n\nhttp://www.internationalman.com/\n\nhttp://dollarvigilante.com/ &gt;There are others as well but can't think of them atm\n\nThe three that I know of:\n\nhttp://www.sovereignman.com/\n\nhttp://www.internationalman.com/\n\nhttp://dollarvigilante.com/ I am currently in Mexico but it's probably not much better here. If you want to/are able to leave, I would suggest soveriegnman.com. There are others as well but can't think of them atm. He (Simon Black) is a big fan of Chile, in fact most of Latin America, and also Southeast Asia especially Laos, Vietnam, Cambodia, Malaysia and others. I would say now is a pretty good time to leave before they make it more difficult and the situation further deteriorates. For people who cannot leave it might also be worthwhile to look into a second passport. Edit: good source for some second passport information http://tdvpassports.com What's your opinion on Latin America vs SE Asia? Here is what I've gathered:\n\n**Latin America:**\n\n* Wide open spaces (low population density)\n\n* Social freedoms (gun ownership, smoke pot without much hassle, speed in your car without as much hassle)\n\n* Society that is prepared for economic depression due to high farmer:population ratio, many people work outside of banking systems. The downside being that things are not technologically as advanced as SE Asia\n\n**SE Asia:**\n\n* High population density\n\n* More difficult for a westerner to assimilate\n\n* Language is more difficult for a westerner to learn\n\n* More jobs than Latin America, especially in technical fields, finance, and manufacturing.\n\n* World's most secure banking\n\n* Little in the way of Intellectual Property law, unlike Latin America\n\n* High technology\n\n* Treats gold as money I am currently in Mexico but it's probably not much better here. If you want to/are able to leave, I would suggest soveriegnman.com. There are others as well but can't think of them atm. He (Simon Black) is a big fan of Chile, in fact most of Latin America, and also Southeast Asia especially Laos, Vietnam, Cambodia, Malaysia and others. I would say now is a pretty good time to leave before they make it more difficult and the situation further deteriorates. For people who cannot leave it might also be worthwhile to look into a second passport. Edit: good source for some second passport information http://tdvpassports.com I seriously considered moving, but I decided against it for a couple of key reasons. \n\n1. Yes, the US will collapse, but the people here mostly share a few things I enjoy. A lot of people (not all) view limited government as normal, even if they continuously vote otherwise. In these other countries, the government is expected to do everything and they've just been too poor to achieve that goal up until now. The peoples thoughts and expectations are more socialist. Americans aren't really different, but at least they lie to themselves that they wish limited government. with the right leader, I think a lot more people would subscribe to anarchy here than anywhere else.\n2. These are very poor countries, which is the reason their governments haven't developed as far as the US. If you move to one of these countries, you're going to be poor as well. Maybe you'll have a good life, but your children won't have the same opportunities as they would in the US. It's basically a one way ticket, because you won't be able to afford to return in 10-15 years. I'm too engrained in the consumerist lifestyle to give this all up before the end of the party. Maybe thats why Lot's wife looked back at everything she was missing.  Sometimes I just want to give up \"Battle not with monsters, lest ye become a monster, and if you gaze into the abyss, the abyss gazes also into you.\" - Nietzsche\n\n\nDon't laugh but Buddhism, yoga, and zen meditation creates a bank vault for your psyche in the middle of life's hurricane. Sometimes I just want to give up  We have crossed the line.  There is little to stop it.  Just watch it happen and be pissed.\n\nBut don't deny it.  We have crossed that line into empire run by kings.\n\nAnd nobody has asked this yet, but why aren't they investigating the LAPD?    Honestly, the road thing doesn't sound too bad. I'm sure a private highway would close it down just the same (maybe without the jail threat though). That's a huge difference though. The owner of a road cutting off access to it is nowhere close to threatening to throw people in a cage for a year. Effectively, it's the same thing.\n\nPrivate road owner -&gt; \"Road Closed, no trespassing\" -&gt; people trespass on road -&gt; ??? Private Security -&gt; Fine/Court/Jail/Whatever? Effectively, it's the same thing.\n\nPrivate road owner -&gt; \"Road Closed, no trespassing\" -&gt; people trespass on road -&gt; ??? Private Security -&gt; Fine/Court/Jail/Whatever? But the roads were built with public money. They aren't the government's to close.   Your daily reminder that issues with how completely different parts of disparate government agencies on several different levels of governance handle completely different and complex situations does not a police state make.\n\nPeople who live in police states seldom are able to openly say so in a public forum, BTW. Your daily reminder that issues with how completely different parts of disparate government agencies on several different levels of governance handle completely different and complex situations does not a police state make.\n\nPeople who live in police states seldom are able to openly say so in a public forum, BTW. Your daily reminder that issues with how completely different parts of disparate government agencies on several different levels of governance handle completely different and complex situations does not a police state make.\n\nPeople who live in police states seldom are able to openly say so in a public forum, BTW.  People are idiots and don't stay off the roads during a sever snow storm. If people are on the roads how are they supposed to be cleared? I don't agree with the fine at all. But people are idiots, especially around here.\n\n Downvoted for general comment of \"people are idiots\" and accepting the use of force as legitimate without any real argument as to why. They are idiots because they are attempting to use impassable roads. They do not listen to a blizzard warning. Who makes the warning? why is it credible? Why should i not use a car during any weather condition, what would you do to stop me if i did? http://imgur.com/zFFO2tc\n\nThis is why. And at this point it stops being about \"you\" as the cost of your mistake has been externalized to others. Not at all, tell me how anyone of those people caught in the blizzard affects you? Those people took the risk and they face the consequences.\n Before you say x government agency must now use your taxes to fix the problem you must realise the very existence of those agencies is what i also argue against. [deleted] A risk you took when you chose to put yourself in a situation where such an event would cost you financially, as opposed to being coerced into paying for the increased maintenence Fair enough. That doesn't exactly counter why you shouldn't drive during those conditions though. It's a great counter to why you shouldn't be able to but that wasn't the question you asked. You shouldn't because its a poor decision and it increases costs for someone else whether they accepted that risk or not. If you meant to ask why you shouldn't be able to then we're in agreement Who makes the warning? why is it credible? Why should i not use a car during any weather condition, what would you do to stop me if i did? Shut the fuck up. This is childish rebelliousness. Even in a free society you would have similar situations. If the roads were private would you still bitch like a child? It's a matter of safety an efficiency. No. What is childish is your willingness to hand over all your personal responsibility to the state. The fact of the matter is you personally wouldnt do a god damn thing to stop me from driving my car in bad weather but you would happily have people in blue costumes do it for you, that is childish and cowardly. The reality of your position is that of an unthinking slave, i would rather be a truly free person able to make my own descisions and face the rewards or consequences of those. \n\nIts also quite remarkable that you would even use the line \"shut the fuck up\" in reddit of all places where debate is an intrinsic part of the website, why post at all if you are not open to responses?\n\n This isn't oppressive. It's people working together to keep the infrastructure functional. If the road were privately owned would you bitch and moan that the owner decides to close it for safety and ease of cleaning? It's a blizzard. Not a couple inches of snow. Telephone pole are down, people are without power, roads are reduced to single lanes because there is no place to put the snow. Why are you turning this into an oppressive thing? Shut the fuck up. This is childish rebelliousness. Even in a free society you would have similar situations. If the roads were private would you still bitch like a child? It's a matter of safety an efficiency. You completely ignored his question. The crux of the matter is simple; what are you going to do to him if he drives his car in a blizzard? In reality, warn him. It isn't safe and it hinders clean up. \"Warn him\" of what? Read the second sentence. Were you affected by the storm? It was a blizzard. Look at what happened in New York because people wouldn't stay off the roads. Someone posted a pic in /r/Wtf. Not only is there two feet of snow on the road, but cars trapped. The same thing happened in 1978 in MA and RI. It was a preemptive measure. I agree that the punishment would be disproportionate, but a deterrent nonetheless. Read the second sentence. Were you affected by the storm? It was a blizzard. Look at what happened in New York because people wouldn't stay off the roads. Someone posted a pic in /r/Wtf. Not only is there two feet of snow on the road, but cars trapped. The same thing happened in 1978 in MA and RI. It was a preemptive measure. I agree that the punishment would be disproportionate, but a deterrent nonetheless.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/189dal/reminder_that_you_are_living_in_a_police_state/"
  }, {
    "id" : 32,
    "title" : "this guy argues within the constitution, but he does such a good job regardless so i won't spoil it",
    "snippet" : "  I feel the most pertinent part of this interview from an ancap perspective is at [8:52](https://www.youtube.com/watch?v=lbZgmTWmzh4#t=8m52s).  I'm not sure \"projection\" is the right term though.  I thought projection would be that the host *would* harm someone if he had access to those weapons but is in denial about this and then *projects* that on to others.  I could be wrong, and I like the gist of the argument. \n\nIt's an argument that would have to be altered based on one's interlocutor.  Certain intellectual opponents would say: \"Yes, I am better than them.\"  I don't believe this is the majority of anti-gun individuals out there though.  At least they won't overtly admit it.  It could be used to put one's interlocutor on the defensive.\n i found the part where he reminds us that law enforcement doesn't even have a legal duty to protect anyone very enlightening\n\nand now that i think about, they are called law enforcement, not public guards Does anyone know what he is referring to with regards to the supreme court? [Wikipedia](http://en.wikipedia.org/wiki/Castle_Rock_v._Gonzales)\n\n[Justices Rule Police Do Not Have a Constitutional Duty to Protect Someone ](http://www.nytimes.com/2005/06/28/politics/28scotus.html?_r=0) - NYTimes\n\n[Castle Rock v. Gonzales](http://caselaw.lp.findlaw.com/scripts/getcase.pl?court=US&amp;vol=000&amp;invol=04-278&amp;friend=nytimes) Oh wow it was worse than I expected. So they take your money by force and you aren't even guaranteed protection in return. Even the Mafia offers better service.    ",
    "url" : "https://www.youtube.com/watch?v=fQYCXhIeajI&amp;feature=youtu.be"
  }, {
    "id" : 33,
    "title" : "Police Find Super-Sharp Buck Knife",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=KQni3Sjb2QU"
  }, {
    "id" : 34,
    "title" : "Socially ostracizing criminals (x-post /r/libertarian)",
    "snippet" : "Voluntarists often mention social ostracism as a way to handle criminals. You don't have to execute or imprison them, you can just refuse to sell them food. What if we could start doing this, right now, for a certain class of criminals?\n\nThe criminals I have in mind are a type that isn't handled by state \"justice.\" They are either not charged, or let off with a slap on the wrist. They are a protected class, and when they commit crimes, they don't suffer any punishment. Let's call them *protected criminals*.\n\nThis leaves resentment in the victims, and those who can relate to them. Those who believe in revolution feel roused to violence when they hear about protected criminals getting off free. What if there was a peaceful solution that doesn't even require the abolition of the state monopoly on justice?\n\n**Supplementary Justice**\n\nI'm talking about invoking your right to free association and refusing to do business with protected criminals. For some people, that's crooked cops. For others, that's all agents of the state. It's your right to free association, so you choose just how broad you want to be.\n\nThe gist of what I'm suggesting is that when protected criminals commit a crime, they don't get their day in court, and that's not right. So rather than depending on the state to administer retributive violence, why not show them how cold peace can be?\n\nA prisoner has the luxury of meals, clothes, and shelter -- all things that free people can only get through market cooperation. What happens when a protected criminals finds that nobody is willing to cooperate? How long until they notice that they're getting the run-around at service locations? What will it be like when they have to look for *crook-friendly* shops to do their grocery shopping?\n\nThis is the ultimate punishment. This is when salaries, pensions, and benefits become meaningless, because money is worthless without a seller. This is the social solution to anti-social individuals.\n\n**Questions**\n\nAre there business owners in this subreddit who can offer some perspective on this?\n\n* Has anyone tried this, and what were the results?\n\n* How much income would one stand to lose doing this?\n\n* Are there additional considerations, like the cost of screening customers, and training costs for employees?  Start with ostracizing the worst statist that hang around you today. \n\n\nYou cant change others, only yourself.  &gt;You can't *guarantee* a change in others, only yourself.\n\nFTFY   I would love to see some kind of wiki database of state-sanctioned criminals. For example, a cop may have a biographical page including links to youtube videos and local news reports describing his abuses of power while arresting people for non-violent crimes. Personal information about residence and most frequented businesses too, so anyone who wants to contact businesses directly about ostracizing that person will know where to start.\n\nI'm not sure how legal it would be to dox people like this, but perhaps it wouldn't matter if the information were available as a decentralized consensus, a la bitcoin or TPB's magnet links. I don't know enough about network tech, so I may just be talking out of my ass.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ac9f/socially_ostracizing_criminals_xpost_rlibertarian/"
  }, {
    "id" : 35,
    "title" : "Without the government regulating drugs, we could start turning into monsters! (Seriously. Couldn't make this drek up.) -_-",
    "snippet" : "  Played this with headphones in the middle of the night lying in bed...I got scared shitless those first few seconds. Can someone tell me what this video is about so I don't have to worry about scares? Played this with headphones in the middle of the night lying in bed...I got scared shitless those first few seconds. Can someone tell me what this video is about so I don't have to worry about scares?   The top comment on the video is someone saying they'll never use unregulated drugs again. Do people really form their opinions on fictional stories?  ",
    "url" : "http://vimeo.com/32844733"
  }, {
    "id" : 36,
    "title" : "Letting Off Steam: Games We Play (Copied from /r/ancapgaming)",
    "snippet" : "I figure many of us here are gamers, and /r/ancapgaming doesn't get a lot of traffic, so I'd might as well throw the idea here.  \n\n/r/MyLittlePony had the [idea](http://www.reddit.com/r/mylittlepony/comments/1898bf/games_bronies_play_steam_thread/) of getting together and sharing each other's multiplayer gaming interests for the purposes of general friend-making and stuff. I know a LOT less anarchists than fans of silly pony cartoons and, well, I'd like to change that.  So, I figured I'd grab their idea and throw it to a slightly less connected crowd ie us.  \n\nTo start:\n\nSteam Name: The Dave\n\nMultiplayer Games I Play Often: Killing Floor\n\nMultiplayer Games I Own and Could Play More Often: Team Fortress 2, Portal 2, Saints Row the 3rd, Dungeon Defenders, Left 4 Dead (2), Orcs Must Die! 2, Trine (2).\n\nSingle Player Games I Enjoy: Fallout: New Vegas, Fallout 3, Super Meat Boy, Psychonauts, Final Fantasy, Crash Bandicoot, Kirby, Street Fighter 4, Prince of Persia: The Sands of Time, God of War.\n\nI hope this helps.    If anyone is a Starcraft:Broodwar player, I'm always looking for more people to play with. Do you not play SC2? I don't play bad games. I'm sorry if I want more than 12 units in my control group. Also it is a great game.  I don't play bad games. lol ohh SC2 is a bad game now? Sounds like butt hurt to me. so typing \"lol\" means you're butt hurt now? lol ohh SC2 is a bad game now? If anyone is a Starcraft:Broodwar player, I'm always looking for more people to play with. Oh shit, I love Brood War (but i suck ass, D- on ICCUP!), haven't played in a while though, what's your name?   Steam: Wesker1982\n\nThe only game I am playing at the moment is Battlefield 3 PC. Link to my battlelog if anyone wants to friend me there: http://battlelog.battlefield.com/bf3/soldier/Wesker1982/stats/169509683/ Is it ironic that AnCaps play games like Battlefield 3, with its pure and unadulterated worship for state-sanctioned violence?\n\nNo, no it's not.  Sent you a friend request! &gt;Is it ironic that AnCaps play games like Battlefield 3, with its pure and unadulterated worship for state-sanctioned violence?\n\nLOL, yeah, I used to play America's Army (1.2 through 2.8) which is as bad as it gets. It was a game put out by the actual U.S. Army as a recruiting tool.\n\nFriend request accepted. Do you play on east or west coast servers?  &gt;Do you play on east or west coast servers?\n\nNo preference, the lag isn't noticeable in either direction.\n\nFor the others: [My BF3 profile](http://battlelog.battlefield.com/bf3/soldier/Aidiekins/stats/247993745/) and my [Steam profile](http://steamcommunity.com/id/Aidiekins/).  Origin ID is the same as my username here.  Is it ironic that AnCaps play games like Battlefield 3, with its pure and unadulterated worship for state-sanctioned violence?\n\nNo, no it's not.  Sent you a friend request! Steam: Wesker1982\n\nThe only game I am playing at the moment is Battlefield 3 PC. Link to my battlelog if anyone wants to friend me there: http://battlelog.battlefield.com/bf3/soldier/Wesker1982/stats/169509683/ Steam: Wesker1982\n\nThe only game I am playing at the moment is Battlefield 3 PC. Link to my battlelog if anyone wants to friend me there: http://battlelog.battlefield.com/bf3/soldier/Wesker1982/stats/169509683/  Steam name: Senator Satan\n\nMultiplayer games I play: TF2, Minecraft, Planetside 2, Counter Strike GO, Gmod, Killing Floor, Far Cry 3, Shogun 2\n\nSingle player games I like: Far Cry 3, Just Cause 2, Shogun 2, The Walking Dead You should join our Planetside 2 outfit on the waterson server. We play NC, add LysanderSpooner. LysanderSpooner is your steam name I'm assuming?  What's the outfit name?  This reminds me, we (the Anarcho Capitalist Steam Group) need to host another event soon. I'll set one up in the coming days. Looks like we'd have a great showing with TF2...               So far, nobody has mention dota 2?  \n\n  Steam Name: Steenalized\n\nMultiplayer games: uhhhh.... I have Counter Strike but haven't played in years, and there's TF2. I play Minecraft too, been meaning to look into CivCraft. \n\nSingle player games (currently): Football Manager 2013, Crusader Kings II, Civ 5, and then a lot of sports game on the 360. \n     I was wondering if I was the only Anarchist Brony   \nI made new account just for this thread. Was an active poster some while ago before giving up on online discussions. My nick was either wulf0r or derwulf. \n\nAn AnCap myself I'd love to game with you guys.\n\nMy steam account name is sgt_wulf ( yeah I know *rollseye*). On steam I got Dota2 (and a bunch of invites if anyone wants one), L4D 1 and 2. Portal 2. CounterStrike:Source ( I guess, I could CS:GO if it's F2P)\n\nUsually I play HoN (Heroes of Newerth a dota-like) (nick wulf0r). Would be willing to play with anyone (even people new to the game) as long as they are nice and polite. Would also be willing to play DoTA2 instead if people prefer that. \n\nI'm in Europe so Europe or US East would be fine.\n\nI have and used to play BF3: http://battlelog.battlefield.com/bf3/soldier/wulf0r/stats/353085974/\n\nI'm not particularly good at games, I have to admit, but I always try to win (vs padding my stats) and I'm nice to everyone unless they aren't :)\n   I joined the Steam group.\n\nMultiplayer Games I Play Often: EVE Online\n\nMultiplayer Games I Own and Could Play More Often: Battlefield: Bad Company 2, Call of Duty: Modern Warfare 2, Civilization IV, Civilization V, Company of Heroes, Guild Wars 2, Killing Floor, Minecraft, SimCity 4, Team Fortress 2, Terraria\n\nSingle Player Games I Enjoy: Angband, Dwarf Fortress, Jagged Alliance 2, The Settlers 2 I've been thinking about re-subscribing to EVE. probably not now, maybe in a month or two. PM me and maybe I'll send you a PM back when/if I do? I mostly trade and I've spent about 11 billion ISK on a certain item that used to be lucrative, but has seen a very sharp decline in the last couple of months due to CCP tweaking the game mechanics. Fucking government, man! Maybe I could gift you a months' subscription if I manage to move some of that inventory, if money is a problem.\n\nWhat kind of game play are you interested in?      ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/189ipi/letting_off_steam_games_we_play_copied_from/"
  }, {
    "id" : 37,
    "title" : "\"Authorities\" post $1 million reward for ex-Los Angeles policeman",
    "snippet" : "  Despite the fact that a lot of people don't agree with his actions, and the fact that I rarely bring up anything \"politics\" or \"news\" - I've heard many locals who are sympathetic to him, even if they disagree with some of his actions.  They need a bribe this big because, right now it is not popular enough to turn him in.  The compensation means nothing when it cost somebody's life. Life is life, nothing is more valuable than life itself. \n\nAlso, using our tax payers money to find ex-cop who shot another cop, meanwhile the duties who shot citizens are still in work and has no bounty upon the shooters head. What a backwards world we live in.  He didn't just shot another cop. He shot the daughter and fiancee of a cop as well.  *Allegedly.*\n\nIt will all come out in the laundry. He pretty openly wrote about his plans in his manifesto. ",
    "url" : "http://www.reuters.com/article/2013/02/10/us-usa-california-cop-idUSBRE9160SM20130210"
  }, {
    "id" : 38,
    "title" : "Not exactly anarchistic, but this film was my first real taste of government corruption as a kid. Great speech. (Spoilers)",
    "snippet" : "   I used to tear up whenever I watched this. It doesn't effect me anymore. Yet another movie ruined since becoming an Ancap. I guess that's the cross we bear for favoring human liberation. ",
    "url" : "http://www.youtube.com/watch?v=s6UbYHCkoZs"
  }, {
    "id" : 39,
    "title" : "Socialist here. My comrades are being dicks. Can I come hang out with you guys instead?",
    "snippet" : "On a related note, TIL you're not a \"real\" socialist unless you're a feminist.\n\nHonestly though, I'm disgusted by the amount of authoritarianism present in the socialist community. It seems like half the people on /r/socialism these days are Stalin apologists or something similar. Just because I came to the conclusion that government is a necessary evil doesn't mean I stopped being pro free speech and civil liberties. Of course, you guys will probably tell me authoritarianism and left wing economics go hand in hand. Ironically, they'd probably agree with you.\n\nAnyway, I'm currently annoyed with the whole socialist movement, so hit me with your best shot.\n\n[](/brdannoyed)  I have no problem with socialism, or communism; I just see property rights as legitimate, and violence as not. So as far as I'm concerned, if people want to get together and start a commune... great! Just make sure everybody consents. This is more or less what I used to believe, back when I was an anarcho-syndicalist. I've gotten more cynical as I've gotten older, though. I now believe that a central authority is essentially inevitable, so the best thing to do is try and make it as benign as possible. Trying to fight it will just ensure that you end up with something worse. That sounds a lot like minarchism, or am I missing something? Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. &gt; I also put things like universal health care and education under the definition of \"benign.\"\n\nSo government comes to me with a gun and says ' Buy health insurance or else'. In what way is this coercion 'benign'?\n\n&gt;I do think that the government should stay right out of your personal life, though.\n\nHow do you reconcile this with government running your doctors office? Medical decisions are some of the most personal intimate things there are. Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. Government controlled education is far from benign, it brainwashes the population from childhood to whatever agenda they see fit. Let different school models compete in the market and avoid a central regulation so we can educate freely. Right now, even \"bastions\" of socialist progress i.e. Sweden, will take away **your** child if you refuse to let the State indoctrinate him in their schools.\n\nEdit: typo Government controlled education is far from benign, it brainwashes the population from childhood to whatever agenda they see fit. Let different school models compete in the market and avoid a central regulation so we can educate freely. Right now, even \"bastions\" of socialist progress i.e. Sweden, will take away **your** child if you refuse to let the State indoctrinate him in their schools.\n\nEdit: typo &gt;Government controlled education is far from benign, it brainwashes the population from childhood to whatever agenda they see fit.\n\nBecause corporations wouldn't also do that? I mean the government is basically run by corporations anyway so they basically **are** doing that. &gt;Government controlled education is far from benign, it brainwashes the population from childhood to whatever agenda they see fit.\n\nBecause corporations wouldn't also do that? I mean the government is basically run by corporations anyway so they basically **are** doing that. If you take a short look into the history of government mandated compulsory education, it's a lot sicker and more twisted than that.  Lot's of Xenophobia and Social Engineering experiments.  Were talking things on the order of Eugenics programs and Brainwashing.  Read about John Dewey, the revered Progressive, he thought we could achieve the perfect society via psychological conditioning. Government controlled education is far from benign, it brainwashes the population from childhood to whatever agenda they see fit. Let different school models compete in the market and avoid a central regulation so we can educate freely. Right now, even \"bastions\" of socialist progress i.e. Sweden, will take away **your** child if you refuse to let the State indoctrinate him in their schools.\n\nEdit: typo &gt;Let different school models compete in the market and avoid a central regulation so we can educate freely.\n\nAnd what about \"schools\" which teach that the Earth was created in seven days 6000 years ago, and gays are the devil's minions? I can see that sort of school being extremely competitive. That's why school is one of the few things I refuse to consider privatizing to some degree. Do you know why the winners write history? It's because they control the schools. They teach the next generation that they're heroes and that their political opponents are terrorists, or whatever nasty label is in vogue.\n\nIf you can't let other people be free, you can't be free. They will want to \"nationalize\" things you want to be private as retribution. You take away their ability to indoctrinate their kids in a religion of their choice, and they'll nationalize women's uteri and make abortion illegal. **This is the battle between \"left\" and \"right\" that has been driving everyone towards authoritarianism.** Not to be cliche, but what about the children? I wouldn't call being indoctrinated at a young age freedom. Are children born to fundamentalist parents just shit out of luck? And that goes for poor parents, too, who can't afford a good education for their children. Luckily, basic education would be relatively cheap. Only highly advanced educations would cost more than the average person could afford.\n\nIn regards to Creationist indoctrination, while it would be sad if someone choose to \"educate\" their child on that manner, we have to expect individuals to see through the mess themselves. I know a number of people raised as Creationists who have educated themselves in the sciences and see it as false. Many are still Christian, but except certain realities. What we have to remember us that if we really are correct in our assertion, then we have to expect that our ideas will naturally win the day. \n\nEdit: typo typo. &gt;Let different school models compete in the market and avoid a central regulation so we can educate freely.\n\nAnd what about \"schools\" which teach that the Earth was created in seven days 6000 years ago, and gays are the devil's minions? I can see that sort of school being extremely competitive. That's why school is one of the few things I refuse to consider privatizing to some degree. Unlike you, I see **no** problem with those schools. \n\n*Who am I to tell you what to believe?* \n\nThe arrogance Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. &gt; you should have to work for a company to own stock in it.\n\nDo you understand what the 'owner of a capital good' is supplying to the company? It sounds to me that you don't understand what a capitalist supplies to a production process, and you think the part of \"ownership of capital goods\" its just a ridiculous conspiracy by capital goods owners.\n\nNo, capitalists supply capital goods to the production process, that capital good would not have existed if he had not created them in the first place through his savings.\n\nYou saying that the ownership of means of production must be in the hands of people who work there, sounds like you think ownership of capital goods is like a lottery, and you are deciding which arbitrary group of people must have their name on the lot, and if you could just move them around, and impose arbitrary rules there wouldn't be any consequences.\n\nAnother way to put it, your statement \"you should have to work for a company to own stock in it\" is like saying \"you should be a student in the school if you wanna work there as a teacher\". The statement you made is completely useless. So you're saying OP is ignorant of the fact that capital represents actual goods that require saving to be built. You can't just make a factory from nothing, and then give it to a bunch of workers. Someone has to invest in the first place. If a bunch of workers want to save their money and own their own company, they can do that. In fact it's easy to buy shares of stock. Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. I think it's inevitable that once you socialize the costs of healthcare, people are going to want to control other's behavior to make sure their health care costs don't go up. I.e regulating what people can eat/smoke and things like that. Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. Is there anything more personal than a doctor-patient relationship? How would you be able to keep the government out of your personal life within a government run and administrated health care system? Yeah. I'm still a socialist, so I still think the workers should own the means of production. Specifically, you should have to work for a company to own stock in it. I also put things like universal health care and education under the definition of \"benign.\" I do think that the government should stay right out of your personal life, though. You sound more like a mutualist. That sounds a lot like minarchism, or am I missing something? This is more or less what I used to believe, back when I was an anarcho-syndicalist. I've gotten more cynical as I've gotten older, though. I now believe that a central authority is essentially inevitable, so the best thing to do is try and make it as benign as possible. Trying to fight it will just ensure that you end up with something worse. This is more or less what I used to believe, back when I was an anarcho-syndicalist. I've gotten more cynical as I've gotten older, though. I now believe that a central authority is essentially inevitable, so the best thing to do is try and make it as benign as possible. Trying to fight it will just ensure that you end up with something worse. you started believing in the religion again, magic scrolls (magic papers, constitution) and some people being complete angels (because you are ok to give one group of people (minority) guns and let the majority (workers) to vote who should be killed etc..  That's a delusion and you regressed to it. You haven't learned your lesson, sir. &gt;because you are ok to give one group of people (minority) guns\n\nThere will always be a minority with guns. Better if they see themselves as protectors, rather than having personal material gain as their only goal. &gt;because you are ok to give one group of people (minority) guns\n\nThere will always be a minority with guns. Better if they see themselves as protectors, rather than having personal material gain as their only goal. no, it is always better do not give anyone guns and authority to use it on you \"legally\". That's a solution. What you are proposing is madness. This is more or less what I used to believe, back when I was an anarcho-syndicalist. I've gotten more cynical as I've gotten older, though. I now believe that a central authority is essentially inevitable, so the best thing to do is try and make it as benign as possible. Trying to fight it will just ensure that you end up with something worse. &gt; I now believe that a central authority is essentially inevitable, so the best thing to do is try and make it as benign as possible.\n\nYeah, this is something that left anarchists never seem to get. In most cities there are a few gangsterish families with large houses that everyone is scared of. If you mostly mix with students - and left anarchists tend to be young and college educated - you're not aware of this. \n\nStill it seems very naive to think if the state disappeared the college anarchists would end up running things. More likely the criminals who are much better at violence would do so. \n\nAnd a quick read of /r/metanarchism shows you that a society run by studenty anarchist types would not exactly be a paradise.\n\nSo it seems the society to aim for is one where the state can collect taxes, enforce the law and so on but does not aim at redistribution.\n\nOr if you want redistribution and benefits, the state needs to guard against illegal immigrants too. &gt;Still it seems very naive to think if the state disappeared the college anarchists would end up running things. More likely the criminals who are much better at violence would do so. \n\nThis is exactly what I think would happen in all types of anarchism, including anarcho-capitalism. After all, what we call crime is just another business model.\n\n&gt;And a quick read of [1] /r/metanarchism shows you that a society run by studenty anarchist types would not exactly be a paradise.\n\nGod, tell me about it. I've found that the last people you want leading a revolution are the ones who have spent years agitating for one.\n\n&gt;Or if you want redistribution and benefits, the state needs to guard against illegal immigrants too.\n\nIt does, which is unfortunate, but you have to take the world as it is, not as you'd like it to be. I probably wouldn't restrict people from entering my theoretical socialist nation, but I would restrict them from accessing benefits if they weren't citizens. I'd also allow as many legal immigrants as was economically feasible. This is more or less what I used to believe, back when I was an anarcho-syndicalist. I've gotten more cynical as I've gotten older, though. I now believe that a central authority is essentially inevitable, so the best thing to do is try and make it as benign as possible. Trying to fight it will just ensure that you end up with something worse. This is more or less what I used to believe, back when I was an anarcho-syndicalist. I've gotten more cynical as I've gotten older, though. I now believe that a central authority is essentially inevitable, so the best thing to do is try and make it as benign as possible. Trying to fight it will just ensure that you end up with something worse. I have the same point of view as Oxstev3 while coming to the conclusion that the inevitable 'authorities' needn't be violent or coercive. A HOA agreement or a union membership can both act under a non-violent voluntary  manner. So can other forms of government. \n\nThe problem I see, is giving a central authority the power to dictate legality will always lead to more power being centralized.  &gt;The problem I see, is giving a central authority the power to dictate legality will always lead to more power being centralized. \n\nYou're right, and I think the solution is to tie their hands as much as possible. The government's primary role should be to carry out the laws which already exist, not to create more. I have no problem with socialism, or communism; I just see property rights as legitimate, and violence as not. So as far as I'm concerned, if people want to get together and start a commune... great! Just make sure everybody consents. &gt; if people want to get together and start a commune... great! Just make sure everybody consents.\n\nYou make it sound like the consent of the people in the commune is the issue...  whereas you ought to know that the issue is whether the people who want to form a commune can obtain the consent of the rest of society, to allow them to have the resources they need. Everyone has the same rules for claiming unowned resources, no permission is needed since they are unowned.\n\nIf you are talking about the commune wanting to use resources that are owned by someone outside the commune isn't that the same issue as wether the owner of those resources consents to become a member of the commune or not? What I'm saying is that obviously a group of people who want to form a commune will not be able to obtain the consent of the owners of the world to form their commune.  Therefore, presenting the possibility as if it exists is dishonest.\n\nIn the real world, the people who want to form a commune have to first overturn the system of private property ownership. I have no problem with socialism, or communism; I just see property rights as legitimate, and violence as not. So as far as I'm concerned, if people want to get together and start a commune... great! Just make sure everybody consents. &gt; I have no problem with socialism, or communism; I just see property rights as legitimate\n\nThere's the contradiction. Socialists do not see property rights as legitimate (at least ownership of land). Yeah, I'm not too sure how that works. They still take up space, so if they choose to form a group and take over land I don't see how that's different to a single person doing it. Well, I think the whole point is that the entire society should own the land (or, fairly equivalently, no one should own the land) rather than a single person. That actually is a huge difference. I have no problem with socialism, or communism; I just see property rights as legitimate, and violence as not. So as far as I'm concerned, if people want to get together and start a commune... great! Just make sure everybody consents.  I don't have much to say, but I'd just like to give you a warm welcome to /r/Anarcho_Capitalism. I've been around for a while, actually, and I've found this subreddit to be considerably more welcoming than a lot of the subreddits that I supposedly agree with. Kind of embarrassing, really. Thank you, though. You're welcome. Shhh, now you're being *too* nice and it looks like we're just trying to show up the other subs with our hospitality.  We didn't even tell him about the free coke and blowjobs yet! Don't forget the sweet Koch brothers checks he'll start receiving soon Ahh, the life of a shill is the life for me. Shhh, now you're being *too* nice and it looks like we're just trying to show up the other subs with our hospitality.  We didn't even tell him about the free coke and blowjobs yet! Free? What are you, a socialist?  You know what man, I think most people here will share your distaste for the norm and authoritative, counter intuitive behavior.\n\nSometimes you just have to stick it to em' and make yourself the best you can be!  And that's regardless of some over-reaching ideology or philosophy!  I dare say, you're a creature of earth and have some level of control over your persons.  Tell em' to kick rocks!  Just advocate by example and make a change in your life!  \n\nBut sometimes you just gotta let it go.  Go out and smell some of those Alabama pines or gaze up at the smoke rising off the mountain tops in Tennessee!  Well, or the equivalent to your location...sometimes it just better to say \"go fish for a dish, and fry it up in a pan when you can\" You know what man, I think most people here will share your distaste for the norm and authoritative, counter intuitive behavior.\n\nSometimes you just have to stick it to em' and make yourself the best you can be!  And that's regardless of some over-reaching ideology or philosophy!  I dare say, you're a creature of earth and have some level of control over your persons.  Tell em' to kick rocks!  Just advocate by example and make a change in your life!  \n\nBut sometimes you just gotta let it go.  Go out and smell some of those Alabama pines or gaze up at the smoke rising off the mountain tops in Tennessee!  Well, or the equivalent to your location...sometimes it just better to say \"go fish for a dish, and fry it up in a pan when you can\" That's pretty deep, man. Thanks for the advice. If I had any ganja, I'd take a hit in your honor. You know what man, I think most people here will share your distaste for the norm and authoritative, counter intuitive behavior.\n\nSometimes you just have to stick it to em' and make yourself the best you can be!  And that's regardless of some over-reaching ideology or philosophy!  I dare say, you're a creature of earth and have some level of control over your persons.  Tell em' to kick rocks!  Just advocate by example and make a change in your life!  \n\nBut sometimes you just gotta let it go.  Go out and smell some of those Alabama pines or gaze up at the smoke rising off the mountain tops in Tennessee!  Well, or the equivalent to your location...sometimes it just better to say \"go fish for a dish, and fry it up in a pan when you can\" You know what man, I think most people here will share your distaste for the norm and authoritative, counter intuitive behavior.\n\nSometimes you just have to stick it to em' and make yourself the best you can be!  And that's regardless of some over-reaching ideology or philosophy!  I dare say, you're a creature of earth and have some level of control over your persons.  Tell em' to kick rocks!  Just advocate by example and make a change in your life!  \n\nBut sometimes you just gotta let it go.  Go out and smell some of those Alabama pines or gaze up at the smoke rising off the mountain tops in Tennessee!  Well, or the equivalent to your location...sometimes it just better to say \"go fish for a dish, and fry it up in a pan when you can\"  You might also wish to check out /r/MarketAnarchism; it is subreddit specifically founded to be a friendly and diverse subreddit which is less interested in \"-isms\" and more in communication and cross-pollination of thought.\n\n&gt; *\"TIL you're not a \"real\" socialist unless you're a feminist.\"*\n\n**Packaged-Deals.**  This is something I criticize nearly every 'political' community, including *(you guessed it)* /r/AnCap.  IMO, it's far better to be a free thinking individual who makes up his own damn mind, rather than a person with \"positions\" and \"beliefs\" that can be easily labeled.\n\nIf one looks back at someone like Lysander Spooner, who identified as a *\"socialist,\"* one might recognize that socialism hasn't always meant what it does today.\n\n&gt; *\" authoritarianism present in the socialist community\"*\n\nSome *\"propertarian\"* anarchists will note that a lack of clear boundaries, or worse \"community property,\" tends to enable and promote the existence of political busy-bodies who are involved in everyone's business.\n\n&gt; *\"Anyway, I'm currently annoyed with the whole socialist movement, so hit me with your best shot.\"*\n\nIMO, anyone who does accept the package deal of any movement is little more than a mindless robot. I say this about both things I like and dislike.\n\n  In socialism, only one view can be the norm, put into law. If you are going to be socialist with different views, you gotta split the movement and create your own party, and attempt to crush the other ones, as only one can prevail in the end. This was the case many times. Well, you could also resolve them democratically, although something tells me the Stalinists won't be up for that. Isn't that true of every system, though? Your system demands the existence of private property and the legitimacy of absentee ownership, for example. Socialism cannot really accept democracy, because what if voters choose to get rid of socialism? That's a risk which socialism, as an ideology, cannot allow itself to take. That's why the historical behaviour of socialist parties has been either the one described by /u/rafaelschp or compromising the ideology, which creates \"social-democracy\".\n\nAnd I don't see that as being true of our system, because it doesn't need (it might be argued that it can't) be applied uniformly across a whole state/country/society/world. Our system requires that if people, *using their own private property*, decide to share it as a commune, they be respected by others. Hell, if someone signs to the idea that *their* property is forfeited if they become \"absentee\", I say let that be enforced!\n\nSocialism, even \"anarcho\"-socialism, implies a single, uniform, forcible legal system. Anarcho-capitalism is based on the idea of a polycentric legal system, which implies diversity and coexistence.\n\nThat being said, I think \"communes\" and other arrangements which forbade \"absentee ownership\" would quickly collapse because they're based on an unsustainable and naïve view of economics, but that's very different from coercively preventing such experiments. In fact, I would *like* if they existed under a free market, if only to test my assumption they don't work! &gt;Socialism cannot really accept democracy, because what if voters choose to get rid of socialism? That's a risk which socialism, as an ideology, cannot allow itself to take. That's why the historical behaviour of socialist parties has been either the one described by [1] /u/rafaelschp or compromising the ideology, which creates \"social-democracy\".\n\nThat's true. My view on democracy is pretty much summed up by the Churchill quote, \"Democracy is the worst form of government ever conceived of, except for all the others that have been tried.\" For example, it's perfectly possible in a democracy for a white majority to vote slavery as legal. In my opinion, democracy should be secondary to a constitution that guarantees rights for everyone, both positive and negative. Democracy serves better as another check on government power.\n\n&gt;And I don't see that as being true of our system, because it doesn't need (it might be argued that it can't) be applied uniformly across a whole state/country/society/world. Our system requires that if people, using their own private property, decide to share it as a commune, they be respected by others. Hell, if someone signs to the idea that their property is forfeited if they become \"absentee\", I say let that be enforced!\n\nBut if that person doesn't give their consent, taking their property if they aren't using it is prohibited. That rules out a number of systems right there, for better or worse. It's fine if you think your system is best, but don't pretend to be all inclusive.\n\n&gt;Socialism, even \"anarcho\"-socialism, implies a single, uniform, forcible legal system. Anarcho-capitalism is based on the idea of a polycentric legal system, which implies diversity and coexistence.\n\nKeep in mind, the opposite of enforceable is unenforceable. If a group became powerful enough that antagonizing it was too risky to be profitable, how would your private courts enforce rulings on it?\n\n&gt;That being said, I think \"communes\" and other arrangements which forbade \"absentee ownership\" would quickly collapse because they're based on an unsustainable and naïve view of economics, but that's very different from coercively preventing such experiments. In fact, I would like if they existed under a free market, if only to test my assumption they don't work!\n\nThey exist already. I do nearly all of my shopping at a pair of regional worker owned supermarkets. &gt;For example, it's perfectly possible in a democracy for a white majority to vote slavery as legal. In my opinion, democracy should be secondary to a constitution that guarantees rights for everyone, both positive and negative.\n\nI, and I think most other here, have a different view of what rights are than you.\n\nYou said a constitution \"guarantees\" rights. To us, it doesn't. Rights exist, whether other people - that is, the government - thinks it has the right to violate them or not.\n\nThat is a matter of principle. But it also has practical implications. It is simply *inevitable*, for the government to \"grant\" what has become known as \"positive rights\" (I prefer to call these what they are: entitlements), that it violates citizens' \"negative\" rights (which are the true rights) - namely, their right to property, through taxation. So, yes, I prefer people aren't robbed by their own government than there exists any kind of entitlement you can think of. No, I don't think this would lead to some kind of \"breakdown of social order\" or anything like that - just compare the living standards of the poor in places where there is something vaguely resembling a free market today, the developed countries, with the way poor people lived 300 years ago or the way the poor in poor countries live, and you'll see even such distorted market generates immense wealth for them. That is not because of government-enforced inefficiencies, but in spite of them.\n\n&gt;But if that person doesn't give their consent, taking their property if they aren't using it is prohibited. That rules out a number of systems right there, for better or worse.\n\nYes, it's called the non-aggression principle. It protects everyone, including those who would like to steal others' property, as long as they don't. It is still more inclusive than any other system. Plus, as I have said, there's room for *consenting* people to experiment with whatever they want.\n\n&gt;Keep in mind, the opposite of enforceable is unenforceable. If a group became powerful enough that antagonizing it was too risky to be profitable, how would your private courts enforce rulings on it?\n\nI don't think ancap law would be unenforceable. If anything, it would be more enforceable because people consent to its enforcement.\n\nAnd how exactly would any group gather such large power, absent a state? Firepower costs money; money cannot be had except through the provision of goods and services relevant to the market, in an environment of fierce competition. Also, everyone in the society understands the basis for its functioning is the non-aggression principle and have an interest in having it enforced. Furthermore, defence is incredibly cheaper than offence. With all these factors together, you simply wouldn't have someone gathering the necessary amount of wealth to finance the firepower needed to initiate an attack against everyone else. The only way such an entity can possibly arise is if people agree it can fund itself regardless of the will of the people funding it and regardless of the quality of the service they provide - in other words, the state.\n\n&gt;They exist already. I do nearly all of my shopping at a pair of regional worker owned supermarkets.\n\nI'm not saying they don't exist right now. I'm saying I'm not sure how long they would last under a free market. &gt;You said a constitution \"guarantees\" rights. To us, it doesn't. Rights exist, whether other people - that is, the government - thinks it has the right to violate them or not.\n\nI take issue with this. Where did these rights come from? Are they god-given? If so, which god? Are they a fundamental constant of the universe, like gravity or the speed of light? If so, can you perform an experiment to verify that? Nature doesn't give two shits whether we live or die. That's what natural selection is based on. The only reason we say not being murdered is a right is because we ourselves would rather not be murdered. And as long as we're using rights to make our lives better, why not make a few more?\n\n&gt;That is a matter of principle. But it also has practical implications. It is simply inevitable, for the government to \"grant\" what has become known as \"positive rights\" (I prefer to call these what they are: entitlements), that it violates citizens' \"negative\" rights (which are the true rights) - namely, their right to property, through taxation.\n\nYou misunderstand what I mean by positive and negative rights. Negative rights are freedom *from*, i.e. the freedom from being murdered. Positive rights are freedom *to*, i.e. the freedom to put what I want into my own body. \n\n&gt;And how exactly would any group gather such large power, absent a state? Firepower costs money; money cannot be had except through the provision of goods and services relevant to the market, in an environment of fierce competition. Also, everyone in the society understands the basis for its functioning is the non-aggression principle and have an interest in having it enforced. Furthermore, defence is incredibly cheaper than offence. With all these factors together, you simply wouldn't have someone gathering the necessary amount of wealth to finance the firepower needed to initiate an attack against everyone else. The only way such an entity can possibly arise is if people agree it can fund itself regardless of the will of the people funding it and regardless of the quality of the service they provide - in other words, the state.\n\nFirst, a person accumulates money by whatever means they like. I assume we agree that this is possible, since one of the major features of capitalism is that it rewards those who are productive. Then, the person forms a pair of \"private security contractors,\" one openly, and the other clandestinely. The latter shakes down any citizen without some form of protection. Then the former comes in and offers said protection.\n\nHonestly, I can think of a dozen schemes like that that could be profitable under an anarchist system, not only in the short term, but in the long term. Eventually, it would lead to society devolving into a series of armed camps, and guess what happens when you've got an enclave of people living together under a single group that has all the guns?\n\n&gt;I'm not saying they don't exist right now. I'm saying I'm not sure how long they would last under a free market.\n\nHey, I don't shop there just because it agrees with my ideology. Their prices are lower and their quality is higher than at competing corporate chains. As far as I can tell, the big corporate chains only survive because they blow more money on advertising. Another problem with capitalism, incidentally. &gt;I take issue with this. Where did these rights come from?\n\nTo be honest, others here might provide more detailed explanations about that. To me, the explanation that I own my own body and that which I use my labour to make useful to myself or others is good enough.\n\n&gt;The only reason we say not being murdered is a right is because we ourselves would rather not be murdered. And as long as we're using rights to make our lives better, why not make a few more?\n\nWe don't \"make\" rights; we *recognise* those rights in others which we see we ourselves simply cannot exist without. Besides, it is a *non-sequitur* fallacy to assert this recognition has to be enforced by an entity with the monopoly on the use of force; history simply shows otherwise (with the Xeer system of traditional law of the Somali people, for example).\n\n&gt;You misunderstand what I mean by positive and negative rights. Negative rights are freedom from, i.e. the freedom from being murdered. Positive rights are freedom to, i.e. the freedom to put what I want into my own body.\n\nOK, I do. I thought that, by \"positive rights\", you meant stuff like state-sponsored pensions, healthcare and the like.\n\nAgain, history shows it is not governments which \"grant\" positive rights in that sense; just think of Prohibition. Governments *abridge* rights, that's what they do. The most a constitution can do is try (ineffectively) to limit what abridgements are allowed.\n\n&gt;one of the major features of capitalism is that it rewards those who are productive.\n\nI don't mean this as an argument, just as a provocation: are you sure you're a socialist? :)\n\n&gt;The latter shakes down any citizen without some form of protection. Then the former comes in and offers said protection.\nHonestly, I can think of a dozen schemes like that that could be profitable under an anarchist system, not only in the short term, but in the long term.\n\nGreat. So can we. So can mostly anyone. That is why we see one of the markets which presently barely exists and which would be much more fully developed under anarchy is that of private protection. This could take the form of insurance, for instance: I will set up a given level of protection for my property, according to what I can, and for further protection I would buy insurance. I mean, everyone would. Think of how police works nowadays, and add a market competition dimension to it. This \"private police\" (some of us here like to use the term DRO, for dispute resolution organisation) would lose my business if it failed to protect me, unlike the statist police. Besides, competition would ensure the price would be lower than what we currently pay via taxes. And these are contracts which are enforceable by means of private courts of law (arbitration, which is already very common, even under the state). So, because they are enforceable, people who currently have little or no police protection (say, in the inner area of North American cities) would have adequate protection, even if it would initially be expensive (the price would drop with time, though).\n\n&gt;Eventually, it would lead to society devolving into a series of armed camps\n\nNo it wouldn't, that is another *non-sequitur*.\n\n&gt;Hey, I don't shop there just because it agrees with my ideology. Their prices are lower and their quality is higher than at competing corporate chains.\n\nReally? Well, then they're missing out on the opportunity to take market share from their competitors - unless those competitors are being *propped up by the state*. Like, say, Walmart is all the time. But would you still buy there if they became too big??\n\n&gt;As far as I can tell, the big corporate chains only survive because they blow more money on advertising. Another problem with capitalism, incidentally.\n\nOn the one hand, the former socialist in me agrees advertising is annoying (I can't live without AdBlock). On the other, you simply cannot have a proper market if people don't know what products are on offer and what their price is. I guess in a free market you'd have even more of what today already exists: a segmentation where those who don't mind being flooded with ads do, and those who mind pay a premium to avoid it and get their market information in a way that suits their tastes. Here, like everywhere else, the solution is a free market, not government intervention.\n\nThis reminds me: \"oh, what about misleading ads?\" Well, because voluntary transactions are the way property changes hands, the non-aggression principle includes a provision against fraud. For a transaction to be legitimate, both parties must know exactly what they're giving and what they're getting; failure to disclose that amounts to theft, which violates the NAP. So I think one could still sue an advertiser if their ad was so misleading it could be considered fraudulent. &gt;I take issue with this. Where did these rights come from?\n\nTo be honest, others here might provide more detailed explanations about that. To me, the explanation that I own my own body and that which I use my labour to make useful to myself or others is good enough.\n\n&gt;The only reason we say not being murdered is a right is because we ourselves would rather not be murdered. And as long as we're using rights to make our lives better, why not make a few more?\n\nWe don't \"make\" rights; we *recognise* those rights in others which we see we ourselves simply cannot exist without. Besides, it is a *non-sequitur* fallacy to assert this recognition has to be enforced by an entity with the monopoly on the use of force; history simply shows otherwise (with the Xeer system of traditional law of the Somali people, for example).\n\n&gt;You misunderstand what I mean by positive and negative rights. Negative rights are freedom from, i.e. the freedom from being murdered. Positive rights are freedom to, i.e. the freedom to put what I want into my own body.\n\nOK, I do. I thought that, by \"positive rights\", you meant stuff like state-sponsored pensions, healthcare and the like.\n\nAgain, history shows it is not governments which \"grant\" positive rights in that sense; just think of Prohibition. Governments *abridge* rights, that's what they do. The most a constitution can do is try (ineffectively) to limit what abridgements are allowed.\n\n&gt;one of the major features of capitalism is that it rewards those who are productive.\n\nI don't mean this as an argument, just as a provocation: are you sure you're a socialist? :)\n\n&gt;The latter shakes down any citizen without some form of protection. Then the former comes in and offers said protection.\nHonestly, I can think of a dozen schemes like that that could be profitable under an anarchist system, not only in the short term, but in the long term.\n\nGreat. So can we. So can mostly anyone. That is why we see one of the markets which presently barely exists and which would be much more fully developed under anarchy is that of private protection. This could take the form of insurance, for instance: I will set up a given level of protection for my property, according to what I can, and for further protection I would buy insurance. I mean, everyone would. Think of how police works nowadays, and add a market competition dimension to it. This \"private police\" (some of us here like to use the term DRO, for dispute resolution organisation) would lose my business if it failed to protect me, unlike the statist police. Besides, competition would ensure the price would be lower than what we currently pay via taxes. And these are contracts which are enforceable by means of private courts of law (arbitration, which is already very common, even under the state). So, because they are enforceable, people who currently have little or no police protection (say, in the inner area of North American cities) would have adequate protection, even if it would initially be expensive (the price would drop with time, though).\n\n&gt;Eventually, it would lead to society devolving into a series of armed camps\n\nNo it wouldn't, that is another *non-sequitur*.\n\n&gt;Hey, I don't shop there just because it agrees with my ideology. Their prices are lower and their quality is higher than at competing corporate chains.\n\nReally? Well, then they're missing out on the opportunity to take market share from their competitors - unless those competitors are being *propped up by the state*. Like, say, Walmart is all the time. But would you still buy there if they became too big??\n\n&gt;As far as I can tell, the big corporate chains only survive because they blow more money on advertising. Another problem with capitalism, incidentally.\n\nOn the one hand, the former socialist in me agrees advertising is annoying (I can't live without AdBlock). On the other, you simply cannot have a proper market if people don't know what products are on offer and what their price is. I guess in a free market you'd have even more of what today already exists: a segmentation where those who don't mind being flooded with ads do, and those who mind pay a premium to avoid it and get their market information in a way that suits their tastes. Here, like everywhere else, the solution is a free market, not government intervention.\n\nThis reminds me: \"oh, what about misleading ads?\" Well, because voluntary transactions are the way property changes hands, the non-aggression principle includes a provision against fraud. For a transaction to be legitimate, both parties must know exactly what they're giving and what they're getting; failure to disclose that amounts to theft, which violates the NAP. So I think one could still sue an advertiser if their ad was so misleading it could be considered fraudulent. &gt;We don't \"make\" rights; we recognise those rights in others which we see we ourselves simply cannot exist without. Besides, it is a non-sequitur fallacy to assert this recognition has to be enforced by an entity with the monopoly on the use of force; history simply shows otherwise (with the Xeer system of traditional law of the Somali people, for example).\n\nI don't claim rights have to be enforced. That's not my argument for government. My argument for government is that some group is always going to end up with the guns, and if don't do your best to ensure the group that does is benign and has your interests at heart, then it won't.\n\n&gt;Again, history shows it is not governments which \"grant\" positive rights in that sense; just think of Prohibition. Governments abridge rights, that's what they do. The most a constitution can do is try (ineffectively) to limit what abridgements are allowed.\n\nBut some governments do so more than others. Therefore, improvement is possible, and if you believe as I do that government is inevitable, then improvement is something we should strive for.\n\n&gt;I don't mean this as an argument, just as a provocation: are you sure you're a socialist? :)\n\nProbably should have said, one of the *supposed* features of capitalism ;)\n\n&gt;Great. So can we. So can mostly anyone. That is why we see one of the markets which presently barely exists and which would be much more fully developed under anarchy is that of private protection. This could take the form of insurance, for instance: I will set up a given level of protection for my property, according to what I can, and for further protection I would buy insurance. I mean, everyone would. Think of how police works nowadays, and add a market competition dimension to it. This \"private police\" (some of us here like to use the term DRO, for dispute resolution organisation) would lose my business if it failed to protect me, unlike the statist police. Besides, competition would ensure the price would be lower than what we currently pay via taxes. And these are contracts which are enforceable by means of private courts of law (arbitration, which is already very common, even under the state). So, because they are enforceable, people who currently have little or no police protection (say, in the inner area of North American cities) would have adequate protection, even if it would initially be expensive (the price would drop with time, though).\n\nI'm familiar with the idea of insurance as security, but it doesn't solve the root of the problem. Say my insurance company fails to protect me, but they don't pay up. So then, I take them to court, and I win. Now what? Who's going to get that insurance company to pay up? They've already got a bunch of guns for the purpose of protecting their customers. Maybe you say that if they don't pay up, all their customers will leave them. Well, what if the insurance company then says, \"We won't let you leave. You have to keep paying us\"? Again, they've already got a bunch of guns. There's no profit for another security company in coming in and trying to destroy this rogue insurance company. Eventually, you'd end up with something that looks suspiciously like a state, and not the warm, fuzzy, democratic kind. That, I would say, is the heart of the reason why I'm not an anarchist.\n\n&gt;On the one hand, the former socialist in me agrees advertising is annoying (I can't live without AdBlock). On the other, you simply cannot have a proper market if people don't know what products are on offer and what their price is. I guess in a free market you'd have even more of what today already exists: a segmentation where those who don't mind being flooded with ads do, and those who mind pay a premium to avoid it and get their market information in a way that suits their tastes. Here, like everywhere else, the solution is a free market, not government intervention.\n\nI don't really see a reason why you'd have to pay to get your information without ads. That sort of information can easily be distributed over the internet, assuming the internet is freely available (Why hello there, government).\n\nOn a side note, I once read an interesting article about how advertising represents a fundamental breakdown of self interest, similar to the tragedy of the commons. If you have two companies who advertise little, one can greatly increase its market share by spending more on advertising. This forces the other to match its spending, and eventually you end up in the same situation you were in before, except now both companies are spending large amounts on advertising. &gt;But some governments do so more than others. Therefore, improvement is possible, and if you believe as I do that government is inevitable, then improvement is something we should strive for.\n\nI agree some governments suck less than others. I would much rather live in America than China. But that doesn't make government legitimate. And as for its inevitability, which you also brought up in your first paragraph, this touches heavily on the argument below, concerning private security.\n\n&gt;I'm familiar with the idea of insurance as security, but it doesn't solve the root of the problem. Say my insurance company fails to protect me, but they don't pay up. So then, I take them to court, and I win. Now what? Who's going to get that insurance company to pay up? They've already got a bunch of guns for the purpose of protecting their customers. Maybe you say that if they don't pay up, all their customers will leave them. Well, what if the insurance company then says, \"We won't let you leave. You have to keep paying us\"? Again, they've already got a bunch of guns. There's no profit for another security company in coming in and trying to destroy this rogue insurance company. Eventually, you'd end up with something that looks suspiciously like a state, and not the warm, fuzzy, democratic kind. That, I would say, is the heart of the reason why I'm not an anarchist.\n\nSo, basically, you think private protection contracts would in practice be unenforceable. I couldn't agree less: yes, I say any company, in any industry, which flat-out refuses to provide the service for which they have been contracted will soon be driven out of business, and even if we're talking about a company which is in the possession of guns - a minute proportion of the total number of guns in society, by the way - it doesn't change that fact.\n\nI honestly think the situation wouldn't even come anywhere this, but if it did, I would simply team up with everyone else who has been defrauded by this rogue protection agency, hire their competitors and have them beat the shit out of the rogues. This is why I think this wouldn't happen - each of the many protection agencies knows this backlash is not only possible but inevitable. And notice it is only possible because it is voluntarily funded by those seeking restitution from their initial contractors; the agencies simply wouldn't be able to do this out of their own will, against their customers, because there wouldn't be funds for this, so these agencies wouldn't become a state.\n\nAnd you might ask if paying other security agencies to kick the rogue agency's ass isn't a violation of the non-aggression principle. I might retort that, if a company hasn't violated my rights (which justifies retribution), it by definition hasn't gone rogue. And even if I don't think this breech of contract justifies this violence, I can still call for ostracism of the offending company. I'd publicise as widely as I can the fact that this company has wrongfully terminated our contract and that it has lost in court and refused to abide by the verdict. I would expect a significant number of people, possibly everyone, to simply cease doing business with this company. Its owners and employees wouldn't be allowed on anyone else's property; its suppliers - of water, toner for their office printers, and *ammunition* - would stop supplying them; how can anyone continue to commit such an egregious breech of contract in such a situation?\n\n&gt;assuming the internet is freely available (Why hello there, government).\n\nYou're not implying governments are responsible for the provision of Internet services, when they are in fact the only ones who *restrict* people's access to information online (think Big Firewall of China), are you?\n\n&gt;I don't really see a reason why you'd have to pay to get your information without ads. That sort of information can easily be distributed over the internet\n\nI don't claim I can predict exactly how a free market would behave, there is always a cost for information to be transmitted. In our unfree market, ads are a significant way this cost is borne.\n\n&gt;I once read an interesting article about how advertising represents a fundamental breakdown of self interest, similar to the tragedy of the commons\n\nThe dynamics you described look quite different from the tragedy of the commons to me, but yeah, it seems reasonable anyway. I know one thing: where I live (Brazil), the government is one of the country's biggest advertisers - some media are basically funded by ads describing how this or that government programme is essential to people's lives or this or that state-owned enterprise is all warm and fuzzy. So, for one, eliminating government would make advertising cheaper for everyone else (with the added benefit that it is promoting products people actually have a choice whether or not to buy).\n\nAlso, maybe the abolishing of state coercion in the domain of intellectual \"property\" (which really isn't property), specifically in the area of trade marks, could alleviate the inefficiency you described. (It would still be fraud to sell a product as if it came from a given producer when it didn't, but you don't need a government to prosecute fraud.) &gt;I take issue with this. Where did these rights come from?\n\nTo be honest, others here might provide more detailed explanations about that. To me, the explanation that I own my own body and that which I use my labour to make useful to myself or others is good enough.\n\n&gt;The only reason we say not being murdered is a right is because we ourselves would rather not be murdered. And as long as we're using rights to make our lives better, why not make a few more?\n\nWe don't \"make\" rights; we *recognise* those rights in others which we see we ourselves simply cannot exist without. Besides, it is a *non-sequitur* fallacy to assert this recognition has to be enforced by an entity with the monopoly on the use of force; history simply shows otherwise (with the Xeer system of traditional law of the Somali people, for example).\n\n&gt;You misunderstand what I mean by positive and negative rights. Negative rights are freedom from, i.e. the freedom from being murdered. Positive rights are freedom to, i.e. the freedom to put what I want into my own body.\n\nOK, I do. I thought that, by \"positive rights\", you meant stuff like state-sponsored pensions, healthcare and the like.\n\nAgain, history shows it is not governments which \"grant\" positive rights in that sense; just think of Prohibition. Governments *abridge* rights, that's what they do. The most a constitution can do is try (ineffectively) to limit what abridgements are allowed.\n\n&gt;one of the major features of capitalism is that it rewards those who are productive.\n\nI don't mean this as an argument, just as a provocation: are you sure you're a socialist? :)\n\n&gt;The latter shakes down any citizen without some form of protection. Then the former comes in and offers said protection.\nHonestly, I can think of a dozen schemes like that that could be profitable under an anarchist system, not only in the short term, but in the long term.\n\nGreat. So can we. So can mostly anyone. That is why we see one of the markets which presently barely exists and which would be much more fully developed under anarchy is that of private protection. This could take the form of insurance, for instance: I will set up a given level of protection for my property, according to what I can, and for further protection I would buy insurance. I mean, everyone would. Think of how police works nowadays, and add a market competition dimension to it. This \"private police\" (some of us here like to use the term DRO, for dispute resolution organisation) would lose my business if it failed to protect me, unlike the statist police. Besides, competition would ensure the price would be lower than what we currently pay via taxes. And these are contracts which are enforceable by means of private courts of law (arbitration, which is already very common, even under the state). So, because they are enforceable, people who currently have little or no police protection (say, in the inner area of North American cities) would have adequate protection, even if it would initially be expensive (the price would drop with time, though).\n\n&gt;Eventually, it would lead to society devolving into a series of armed camps\n\nNo it wouldn't, that is another *non-sequitur*.\n\n&gt;Hey, I don't shop there just because it agrees with my ideology. Their prices are lower and their quality is higher than at competing corporate chains.\n\nReally? Well, then they're missing out on the opportunity to take market share from their competitors - unless those competitors are being *propped up by the state*. Like, say, Walmart is all the time. But would you still buy there if they became too big??\n\n&gt;As far as I can tell, the big corporate chains only survive because they blow more money on advertising. Another problem with capitalism, incidentally.\n\nOn the one hand, the former socialist in me agrees advertising is annoying (I can't live without AdBlock). On the other, you simply cannot have a proper market if people don't know what products are on offer and what their price is. I guess in a free market you'd have even more of what today already exists: a segmentation where those who don't mind being flooded with ads do, and those who mind pay a premium to avoid it and get their market information in a way that suits their tastes. Here, like everywhere else, the solution is a free market, not government intervention.\n\nThis reminds me: \"oh, what about misleading ads?\" Well, because voluntary transactions are the way property changes hands, the non-aggression principle includes a provision against fraud. For a transaction to be legitimate, both parties must know exactly what they're giving and what they're getting; failure to disclose that amounts to theft, which violates the NAP. So I think one could still sue an advertiser if their ad was so misleading it could be considered fraudulent. &gt;You said a constitution \"guarantees\" rights. To us, it doesn't. Rights exist, whether other people - that is, the government - thinks it has the right to violate them or not.\n\nI take issue with this. Where did these rights come from? Are they god-given? If so, which god? Are they a fundamental constant of the universe, like gravity or the speed of light? If so, can you perform an experiment to verify that? Nature doesn't give two shits whether we live or die. That's what natural selection is based on. The only reason we say not being murdered is a right is because we ourselves would rather not be murdered. And as long as we're using rights to make our lives better, why not make a few more?\n\n&gt;That is a matter of principle. But it also has practical implications. It is simply inevitable, for the government to \"grant\" what has become known as \"positive rights\" (I prefer to call these what they are: entitlements), that it violates citizens' \"negative\" rights (which are the true rights) - namely, their right to property, through taxation.\n\nYou misunderstand what I mean by positive and negative rights. Negative rights are freedom *from*, i.e. the freedom from being murdered. Positive rights are freedom *to*, i.e. the freedom to put what I want into my own body. \n\n&gt;And how exactly would any group gather such large power, absent a state? Firepower costs money; money cannot be had except through the provision of goods and services relevant to the market, in an environment of fierce competition. Also, everyone in the society understands the basis for its functioning is the non-aggression principle and have an interest in having it enforced. Furthermore, defence is incredibly cheaper than offence. With all these factors together, you simply wouldn't have someone gathering the necessary amount of wealth to finance the firepower needed to initiate an attack against everyone else. The only way such an entity can possibly arise is if people agree it can fund itself regardless of the will of the people funding it and regardless of the quality of the service they provide - in other words, the state.\n\nFirst, a person accumulates money by whatever means they like. I assume we agree that this is possible, since one of the major features of capitalism is that it rewards those who are productive. Then, the person forms a pair of \"private security contractors,\" one openly, and the other clandestinely. The latter shakes down any citizen without some form of protection. Then the former comes in and offers said protection.\n\nHonestly, I can think of a dozen schemes like that that could be profitable under an anarchist system, not only in the short term, but in the long term. Eventually, it would lead to society devolving into a series of armed camps, and guess what happens when you've got an enclave of people living together under a single group that has all the guns?\n\n&gt;I'm not saying they don't exist right now. I'm saying I'm not sure how long they would last under a free market.\n\nHey, I don't shop there just because it agrees with my ideology. Their prices are lower and their quality is higher than at competing corporate chains. As far as I can tell, the big corporate chains only survive because they blow more money on advertising. Another problem with capitalism, incidentally. &gt;You said a constitution \"guarantees\" rights. To us, it doesn't. Rights exist, whether other people - that is, the government - thinks it has the right to violate them or not.\n\nI take issue with this. Where did these rights come from? Are they god-given? If so, which god? Are they a fundamental constant of the universe, like gravity or the speed of light? If so, can you perform an experiment to verify that? Nature doesn't give two shits whether we live or die. That's what natural selection is based on. The only reason we say not being murdered is a right is because we ourselves would rather not be murdered. And as long as we're using rights to make our lives better, why not make a few more?\n\n&gt;That is a matter of principle. But it also has practical implications. It is simply inevitable, for the government to \"grant\" what has become known as \"positive rights\" (I prefer to call these what they are: entitlements), that it violates citizens' \"negative\" rights (which are the true rights) - namely, their right to property, through taxation.\n\nYou misunderstand what I mean by positive and negative rights. Negative rights are freedom *from*, i.e. the freedom from being murdered. Positive rights are freedom *to*, i.e. the freedom to put what I want into my own body. \n\n&gt;And how exactly would any group gather such large power, absent a state? Firepower costs money; money cannot be had except through the provision of goods and services relevant to the market, in an environment of fierce competition. Also, everyone in the society understands the basis for its functioning is the non-aggression principle and have an interest in having it enforced. Furthermore, defence is incredibly cheaper than offence. With all these factors together, you simply wouldn't have someone gathering the necessary amount of wealth to finance the firepower needed to initiate an attack against everyone else. The only way such an entity can possibly arise is if people agree it can fund itself regardless of the will of the people funding it and regardless of the quality of the service they provide - in other words, the state.\n\nFirst, a person accumulates money by whatever means they like. I assume we agree that this is possible, since one of the major features of capitalism is that it rewards those who are productive. Then, the person forms a pair of \"private security contractors,\" one openly, and the other clandestinely. The latter shakes down any citizen without some form of protection. Then the former comes in and offers said protection.\n\nHonestly, I can think of a dozen schemes like that that could be profitable under an anarchist system, not only in the short term, but in the long term. Eventually, it would lead to society devolving into a series of armed camps, and guess what happens when you've got an enclave of people living together under a single group that has all the guns?\n\n&gt;I'm not saying they don't exist right now. I'm saying I'm not sure how long they would last under a free market.\n\nHey, I don't shop there just because it agrees with my ideology. Their prices are lower and their quality is higher than at competing corporate chains. As far as I can tell, the big corporate chains only survive because they blow more money on advertising. Another problem with capitalism, incidentally. &gt;You said a constitution \"guarantees\" rights. To us, it doesn't. Rights exist, whether other people - that is, the government - thinks it has the right to violate them or not.\n\nI take issue with this. Where did these rights come from? Are they god-given? If so, which god? Are they a fundamental constant of the universe, like gravity or the speed of light? If so, can you perform an experiment to verify that? Nature doesn't give two shits whether we live or die. That's what natural selection is based on. The only reason we say not being murdered is a right is because we ourselves would rather not be murdered. And as long as we're using rights to make our lives better, why not make a few more?\n\n&gt;That is a matter of principle. But it also has practical implications. It is simply inevitable, for the government to \"grant\" what has become known as \"positive rights\" (I prefer to call these what they are: entitlements), that it violates citizens' \"negative\" rights (which are the true rights) - namely, their right to property, through taxation.\n\nYou misunderstand what I mean by positive and negative rights. Negative rights are freedom *from*, i.e. the freedom from being murdered. Positive rights are freedom *to*, i.e. the freedom to put what I want into my own body. \n\n&gt;And how exactly would any group gather such large power, absent a state? Firepower costs money; money cannot be had except through the provision of goods and services relevant to the market, in an environment of fierce competition. Also, everyone in the society understands the basis for its functioning is the non-aggression principle and have an interest in having it enforced. Furthermore, defence is incredibly cheaper than offence. With all these factors together, you simply wouldn't have someone gathering the necessary amount of wealth to finance the firepower needed to initiate an attack against everyone else. The only way such an entity can possibly arise is if people agree it can fund itself regardless of the will of the people funding it and regardless of the quality of the service they provide - in other words, the state.\n\nFirst, a person accumulates money by whatever means they like. I assume we agree that this is possible, since one of the major features of capitalism is that it rewards those who are productive. Then, the person forms a pair of \"private security contractors,\" one openly, and the other clandestinely. The latter shakes down any citizen without some form of protection. Then the former comes in and offers said protection.\n\nHonestly, I can think of a dozen schemes like that that could be profitable under an anarchist system, not only in the short term, but in the long term. Eventually, it would lead to society devolving into a series of armed camps, and guess what happens when you've got an enclave of people living together under a single group that has all the guns?\n\n&gt;I'm not saying they don't exist right now. I'm saying I'm not sure how long they would last under a free market.\n\nHey, I don't shop there just because it agrees with my ideology. Their prices are lower and their quality is higher than at competing corporate chains. As far as I can tell, the big corporate chains only survive because they blow more money on advertising. Another problem with capitalism, incidentally. &gt;Socialism cannot really accept democracy, because what if voters choose to get rid of socialism? That's a risk which socialism, as an ideology, cannot allow itself to take. That's why the historical behaviour of socialist parties has been either the one described by [1] /u/rafaelschp or compromising the ideology, which creates \"social-democracy\".\n\nThat's true. My view on democracy is pretty much summed up by the Churchill quote, \"Democracy is the worst form of government ever conceived of, except for all the others that have been tried.\" For example, it's perfectly possible in a democracy for a white majority to vote slavery as legal. In my opinion, democracy should be secondary to a constitution that guarantees rights for everyone, both positive and negative. Democracy serves better as another check on government power.\n\n&gt;And I don't see that as being true of our system, because it doesn't need (it might be argued that it can't) be applied uniformly across a whole state/country/society/world. Our system requires that if people, using their own private property, decide to share it as a commune, they be respected by others. Hell, if someone signs to the idea that their property is forfeited if they become \"absentee\", I say let that be enforced!\n\nBut if that person doesn't give their consent, taking their property if they aren't using it is prohibited. That rules out a number of systems right there, for better or worse. It's fine if you think your system is best, but don't pretend to be all inclusive.\n\n&gt;Socialism, even \"anarcho\"-socialism, implies a single, uniform, forcible legal system. Anarcho-capitalism is based on the idea of a polycentric legal system, which implies diversity and coexistence.\n\nKeep in mind, the opposite of enforceable is unenforceable. If a group became powerful enough that antagonizing it was too risky to be profitable, how would your private courts enforce rulings on it?\n\n&gt;That being said, I think \"communes\" and other arrangements which forbade \"absentee ownership\" would quickly collapse because they're based on an unsustainable and naïve view of economics, but that's very different from coercively preventing such experiments. In fact, I would like if they existed under a free market, if only to test my assumption they don't work!\n\nThey exist already. I do nearly all of my shopping at a pair of regional worker owned supermarkets. &gt; If a group became powerful enough that antagonizing it was too risky to be profitable, how would your private courts enforce rulings on it?  \n\nIf an organization was hurting people and ignoring the rulings of private courts, then that organization would be acting like a state.  In which case, we'd be back where we started.  You're making the argument that we shouldn't resist the gang because without it, there'd be gangs.   &gt;If an organization was hurting people and ignoring the rulings of private courts, then that organization would be acting like a state.\n\nYes, exactly. I assume you at least acknowledge that some states are worse than others. Therefore, if states are inevitable, we should make the one we end up with is as good as possible. Socialism cannot really accept democracy, because what if voters choose to get rid of socialism? That's a risk which socialism, as an ideology, cannot allow itself to take. That's why the historical behaviour of socialist parties has been either the one described by /u/rafaelschp or compromising the ideology, which creates \"social-democracy\".\n\nAnd I don't see that as being true of our system, because it doesn't need (it might be argued that it can't) be applied uniformly across a whole state/country/society/world. Our system requires that if people, *using their own private property*, decide to share it as a commune, they be respected by others. Hell, if someone signs to the idea that *their* property is forfeited if they become \"absentee\", I say let that be enforced!\n\nSocialism, even \"anarcho\"-socialism, implies a single, uniform, forcible legal system. Anarcho-capitalism is based on the idea of a polycentric legal system, which implies diversity and coexistence.\n\nThat being said, I think \"communes\" and other arrangements which forbade \"absentee ownership\" would quickly collapse because they're based on an unsustainable and naïve view of economics, but that's very different from coercively preventing such experiments. In fact, I would *like* if they existed under a free market, if only to test my assumption they don't work! Socialism cannot really accept democracy, because what if voters choose to get rid of socialism? That's a risk which socialism, as an ideology, cannot allow itself to take. That's why the historical behaviour of socialist parties has been either the one described by /u/rafaelschp or compromising the ideology, which creates \"social-democracy\".\n\nAnd I don't see that as being true of our system, because it doesn't need (it might be argued that it can't) be applied uniformly across a whole state/country/society/world. Our system requires that if people, *using their own private property*, decide to share it as a commune, they be respected by others. Hell, if someone signs to the idea that *their* property is forfeited if they become \"absentee\", I say let that be enforced!\n\nSocialism, even \"anarcho\"-socialism, implies a single, uniform, forcible legal system. Anarcho-capitalism is based on the idea of a polycentric legal system, which implies diversity and coexistence.\n\nThat being said, I think \"communes\" and other arrangements which forbade \"absentee ownership\" would quickly collapse because they're based on an unsustainable and naïve view of economics, but that's very different from coercively preventing such experiments. In fact, I would *like* if they existed under a free market, if only to test my assumption they don't work! Well, you could also resolve them democratically, although something tells me the Stalinists won't be up for that. Isn't that true of every system, though? Your system demands the existence of private property and the legitimacy of absentee ownership, for example. I think it's a mistake to view capitalism and private property as a designed \"system\". I see many people on the left talking about their preferred system in those terms. Propertarianism or libertarianism or what you want to call it is the absence of a designed social system. There is no \"common goal\", or centrally mandated \"roles\" people should fulfill. There's just law and order. Which is informed by an ethical theory, as to how to resolve conflicts. Capitalism is then just the byproduct of libertarian ethics. What makes you think socialism isn't the byproduct of a different set of ethics? To be specific, we define freedom differently. You define freedom as the absence of compulsion. I define freedom as the ability to do the things you want to do. If you follow my definition to its conclusion, you'll probably arrive at something fairly similar to my system, just as I would arrive at your system if I followed your definition. What makes you think socialism isn't the byproduct of a different set of ethics? To be specific, we define freedom differently. You define freedom as the absence of compulsion. I define freedom as the ability to do the things you want to do. If you follow my definition to its conclusion, you'll probably arrive at something fairly similar to my system, just as I would arrive at your system if I followed your definition. &gt;I define freedom as the ability to do the things you want to do.\n\nWhat if you want to do absolutely nothing? Like I want to smoke weed and masturbate while other people feed, house, transport and provide medical services for me. &gt;What if you want to do absolutely nothing? Like I want to smoke weed and masturbate while other people feed, house, transport and provide medical services for me.\n\nThat would interfere with the freedom of those you expect to provide to you. But if you're willing to put in a minimum amount of effort into the maintenance of society, you're free to spend the rest of your time smoking weed and masturbating to your heart's content. Just as providing someone with the 'freedom' of 'free' healthcare interferes with the freedom of those providing for you! &gt;What if you want to do absolutely nothing? Like I want to smoke weed and masturbate while other people feed, house, transport and provide medical services for me.\n\nThat would interfere with the freedom of those you expect to provide to you. But if you're willing to put in a minimum amount of effort into the maintenance of society, you're free to spend the rest of your time smoking weed and masturbating to your heart's content. Well, you could also resolve them democratically, although something tells me the Stalinists won't be up for that. Isn't that true of every system, though? Your system demands the existence of private property and the legitimacy of absentee ownership, for example. Our system of competing courts (where individuals buy memberships for) allows for some of those courts not to recognize private property and absentee ownership. Competing courts will negotiate compromises for when their respective members have a dispute. If a court's views are too radical (e.g. \"murder is OK, it's just natural\") than that court will be ostracized by other courts, meaning they won't cover their members liability in trading with you so people will likely treat you as an outlaw.\n\nThe nice thing in this system is that to change the world you no longer need to win a war or a rigged election, you simply need to start your own court system and convince customers.\n\nAlso, because violence and destruction is very expensive and this cost has to be paid by customers rather than \"the taxpayer\", peaceful solutions can be expected for issues that now dominate politics. Israelis and palestines, or to be more precise their different competing courts, will arbitrate and settle on a solution.\n\nLast but not least, please note: Anarcho-capitalism can have socialist communes, while a socialist state can only have it their way. (In fact there is no \"one way\" in anarcho-capitalism by definition as it is all about competition.) &gt;Our system of competing courts (where individuals buy memberships for) allows for some of those courts not to recognize private property and absentee ownership. Competing courts will negotiate compromises for when their respective members have a dispute. If a court's views are too radical (e.g. \"murder is OK, it's just natural\") than that court will be ostracized by other courts, meaning they won't cover their members liability in trading with you so people will likely treat you as an outlaw.\n\nI didn't quite follow that. Sorry.\n\n&gt;Also, because violence and destruction is very expensive and this cost has to be paid by customers rather than \"the taxpayer\", peaceful solutions can be expected for issues that now dominate politics. Israelis and palestines, or to be more precise their different competing courts, will arbitrate and settle on a solution.\n\nViolence is only expensive when the target can defend itself. Violence against unprotected citizens is actually rather profitable.\n\nI would like to say that since I've started learning more about anarcho-capitalism, I've become in favor of private arbitrators in addition to state courts. If people can handle their problems themselves before it reaches the government, everyone wins. Well, you could also resolve them democratically, although something tells me the Stalinists won't be up for that. Isn't that true of every system, though? Your system demands the existence of private property and the legitimacy of absentee ownership, for example. I've never understood why the socialists think anarcho-capitalism *demands* absentee ownership.  Just because it is the norm now doesn't mean it always will be or *has* to be.  I would imagine a society with different regional interpretations of private property.  Some might value absentee ownership some might not.\n\nI personally and many here probably *prefer* absentee ownership simply for the benefits it has for capital accumulation and resulting investment but this doesn't mean we can't be convinced otherwise.\n\nI think something the socialists/communists have a hard time understanding is that we ancaps are only absolute in that private property *exists*, but not absolute in the *interpretation* of private property. What if the workers of a factory decide that they don't believe in absentee ownership, and take ownership for themselves? The former owner probably won't think much of that. He can hire a court that supports absentee ownership, but the workers can hire one that doesn't. Who's view will be supported? Ultimately, it will come down to who has the most guns. Well, you could also resolve them democratically, although something tells me the Stalinists won't be up for that. Isn't that true of every system, though? Your system demands the existence of private property and the legitimacy of absentee ownership, for example. Democracy only work the amount it works because people still control some of the 'means of procuction'. If someparty get hold of the aparatus, and one of them has to take control - to make the economic decisions - how do you decide how much resources have to be given to the oposition? In the market, resources go to the ideas people consider important. Even if you had many parties under socialism, they would receive at most resources to be insignificant, or less. I meant more a single party with policies that are a compromise between a number of ideologies. How much resources should be put to witch ideologies? I'm not really in favor of witches, but I guess we can give them a supply of broomsticks. Well, you could also resolve them democratically, although something tells me the Stalinists won't be up for that. Isn't that true of every system, though? Your system demands the existence of private property and the legitimacy of absentee ownership, for example. Well, you could also resolve them democratically, although something tells me the Stalinists won't be up for that. Isn't that true of every system, though? Your system demands the existence of private property and the legitimacy of absentee ownership, for example. But it is all an abstraction. Can non-propertarian or non propertarian society exist without thi initiation of force?\n\nWithout answering it such that there be one answer we impose on all the people that disagree with us, how would we best test this hypothesis such that those on each side of the issue can live in the society they think is least aggressive, and be free to change their mind? One everyone agrees there will simply be nobody left in the other group; no bloody revolution nevessary.\n\nI think it is possible for people to respect other people's views. non-propertarian societies can have systems such that their collective can trade with propertarians, and visa versa. There would be individual titles and collective titles. The porpertarian societes would be more dependent upon the title system, where non propertarians would have their own system under the umbrella of one big title.\n\nTo note, I do not believe in absentee ownership, but I think we may have different feelings / understandings of what that means. For example, I do not think \"rent\" is unearned or exploited income, and think of it more as a division of labor where one person is responsible for the maintainence of the capital, and another person invests in the rewards of the capital. The balance of savings and capital is determined through a system of price signals and time preferences.\n\nWhat are your thoughts on that line of thinking? &gt;One everyone agrees there will simply be nobody left in the other group; no bloody revolution nevessary.\n\nI think this is the ideal solution, although it's difficult to implement. Inevitably, whichever system was more successful would become dominant. \n\nGee, that sounds kind of like competition, doesn't it?\n\n  You can hang out with me for 5$.  Is that uh English usage or something with the sign after the amount? In Canada that's indeed the official way of displaying a dollar sign in French. Is that uh English usage or something with the sign after the amount?  Hello!\n\n&gt;The defining feature of capitalism is actually that the means of production are goods to be bought and sold (capital goods, to be specific). It's fully possible to be pro markets, but anti capitalist.\n\nWhy do you oppose the private ownership of (and trade in) the means of production? Because it leads to exploitation at several levels. Here's a little analogy I like. Imagine a hundred people on an island. One of these people owns the entire island, as well as all the means on or off the island. In return for food, he demands that the other 99 people labor for 12 hours a day, every day. You could call this situation a voluntary, mutually beneficial exchange (it's better than starving, right?), but at the same time, it's more or less indistinguishable from a gulag. This is what socialists refer to as wage slavery. [This](http://www.marxists.org/archive/lafargue/1903/xx/truths.htm) brief article illustrates it more elegantly than I can.\n\nIn addition to that, when the people who own a company aren't the people who run the company, it opens the door for corruption. A CEO can run his company into the ground for a short term boost in profit, use that as a justification for a massive personal bonus, and then leave before it comes crashing down. Look at what happened recently with Hostess. This is ultimately what caused the 2008 financial crisis. Traders were passing back loans they knew were ultimately worthless, and taking huge bonuses for themselves, which had the effect of sucking all the money out of their companies. The companies collapsed, but the people who actually made the decisions are doing just dandy.\n\nThose are the two major reasons, although there are a number of smaller ones, as well. &gt;Because it leads to exploitation at several levels.\n\nIt's clear that you believe exploitation is something negative. Can you define exploitation?\n\n&gt;Imagine a hundred people on an island. One of these people owns the entire island, as well as all the means on or off the island.\n\nWhy/how did the others get there?\n\n&gt; In addition to that, when the people who own a company aren't the people who run the company, it opens the door for corruption. A CEO can run his company into the ground for a short term boost in profit, use that as a justification for a massive personal bonus, and then leave before it comes crashing down.\n\nThis is something I don't know much about so excuse my ignorance. Why would shareholders allow this to happen? &gt;It's clear that you believe exploitation is something negative. Can you define exploitation?\n\nExploitation occurs when there is an imbalance of power between two parties making an exchange, and the party with the advantage uses that to force a deal that the second party wouldn't agree to if the power was balanced. By power, I mean that the second party needs the first more than the first needs the second. It's impossible to eliminate entirely, of course, but the world isn't perfect.\n\n&gt;Why/how did the others get there?\n\nMaybe they were born there. Maybe there was a shipwreck. There are ways people can come into a situation they would not have chosen without force being used against them, as you would define it.\n\n&gt;This is something I don't know much about so excuse my ignorance. Why would shareholders allow this to happen?\n\nThey don't know. It's common for people who own stocks to own them through a mutual fund or something similar. For those who do notice, they usually don't have enough stocks to actually do anything. This is the problem with separating ownership from management. Ignoring the questions about how to define exploitation for the moment, lets say we agree that X is exploiting Y by employing Y in a sweatshop.\n\nLet's also assume (for simplicity) that X has not stolen any land, or received any special favours from Y's government.\n\nWe can fairly assume that X, by accepting the offer of employment in the sweatshop, judges this employment to be the best of the realistic alternatives available to him. ie. Y's offer has improved X's conditions by some amount (at least according to X's judgement).\n\nSo Y, in helping himself, has also helped X by some amount. If we complain about Y's 'exploitation' of X, then it sounds like our real complaint is that Y hasn't helped X *enough*. If this is the case though, Y shouldn't be targetted for criticism *until all those who didn't exploit X have been criticised*, since they helped X even less than Y did.\n\nI don't see those who complain about exploitation doing this. I'm not sure if this is relevant but I want to ask. Is employment never exploitation, and especially in an anarchist society? The ones who are unable to get good jobs, or the ones who for some reason or another cannot get anything more than very low pay jobs (lack of education, lack of resources to move, for example), do they deserve any sort of life they get, no matter how bad it is, because it is all voluntary? Can employers do whatever they want at all times, since it is all voluntary, in theory? I'm not sure if this is relevant but I want to ask. Is employment never exploitation, and especially in an anarchist society? The ones who are unable to get good jobs, or the ones who for some reason or another cannot get anything more than very low pay jobs (lack of education, lack of resources to move, for example), do they deserve any sort of life they get, no matter how bad it is, because it is all voluntary? Can employers do whatever they want at all times, since it is all voluntary, in theory? I'm not sure if this is relevant but I want to ask. Is employment never exploitation, and especially in an anarchist society? The ones who are unable to get good jobs, or the ones who for some reason or another cannot get anything more than very low pay jobs (lack of education, lack of resources to move, for example), do they deserve any sort of life they get, no matter how bad it is, because it is all voluntary? Can employers do whatever they want at all times, since it is all voluntary, in theory? Ignoring the questions about how to define exploitation for the moment, lets say we agree that X is exploiting Y by employing Y in a sweatshop.\n\nLet's also assume (for simplicity) that X has not stolen any land, or received any special favours from Y's government.\n\nWe can fairly assume that X, by accepting the offer of employment in the sweatshop, judges this employment to be the best of the realistic alternatives available to him. ie. Y's offer has improved X's conditions by some amount (at least according to X's judgement).\n\nSo Y, in helping himself, has also helped X by some amount. If we complain about Y's 'exploitation' of X, then it sounds like our real complaint is that Y hasn't helped X *enough*. If this is the case though, Y shouldn't be targetted for criticism *until all those who didn't exploit X have been criticised*, since they helped X even less than Y did.\n\nI don't see those who complain about exploitation doing this. How did X get into a position to exploit Y, though? Obviously, Y owns no machines or resources, and X does. Why is this the case? Now, it's possible that X and Y started from the same point, and X was successful where Y was not. In this case, Y doesn't have anyone but himself to blame for his situation, and I have no complaint. But it's much more likely that X was born into a situation that gave him some advantage, and Y was born into a situation that gave him some disadvantage. If you trace it back far enough, X probably benefited from someone claiming ownership over some resource, whereas Y didn't.\n\nSomething to note is that you are, in a sense, correct. X can be said to be improving Y's situation in a certain sense. Thus, it's not X who should be criticized, but rather the system itself, which is the ultimate cause of the situation X and Y find themselves in. &gt;It's clear that you believe exploitation is something negative. Can you define exploitation?\n\nExploitation occurs when there is an imbalance of power between two parties making an exchange, and the party with the advantage uses that to force a deal that the second party wouldn't agree to if the power was balanced. By power, I mean that the second party needs the first more than the first needs the second. It's impossible to eliminate entirely, of course, but the world isn't perfect.\n\n&gt;Why/how did the others get there?\n\nMaybe they were born there. Maybe there was a shipwreck. There are ways people can come into a situation they would not have chosen without force being used against them, as you would define it.\n\n&gt;This is something I don't know much about so excuse my ignorance. Why would shareholders allow this to happen?\n\nThey don't know. It's common for people who own stocks to own them through a mutual fund or something similar. For those who do notice, they usually don't have enough stocks to actually do anything. This is the problem with separating ownership from management. Thanks for the answers.\n\n&gt; By power, I mean that the second party needs the first more than the first needs the second.\n\nIt's not clear to me exactly what you mean by 'need' here, and how could you test/determine that this is the case in a given situation? Economics isn't a hard science, no matter how much economists would like to pretend that it is. For example, though, if a worker will be kicked out of his apartment if he can't find a job, then his employer has an obvious advantage. If an employer will go out of business unless they can find another worker, than the employee has an obvious advantage. Unfortunately, the former situation is much more common than the latter. &gt;It's clear that you believe exploitation is something negative. Can you define exploitation?\n\nExploitation occurs when there is an imbalance of power between two parties making an exchange, and the party with the advantage uses that to force a deal that the second party wouldn't agree to if the power was balanced. By power, I mean that the second party needs the first more than the first needs the second. It's impossible to eliminate entirely, of course, but the world isn't perfect.\n\n&gt;Why/how did the others get there?\n\nMaybe they were born there. Maybe there was a shipwreck. There are ways people can come into a situation they would not have chosen without force being used against them, as you would define it.\n\n&gt;This is something I don't know much about so excuse my ignorance. Why would shareholders allow this to happen?\n\nThey don't know. It's common for people who own stocks to own them through a mutual fund or something similar. For those who do notice, they usually don't have enough stocks to actually do anything. This is the problem with separating ownership from management. Because it leads to exploitation at several levels. Here's a little analogy I like. Imagine a hundred people on an island. One of these people owns the entire island, as well as all the means on or off the island. In return for food, he demands that the other 99 people labor for 12 hours a day, every day. You could call this situation a voluntary, mutually beneficial exchange (it's better than starving, right?), but at the same time, it's more or less indistinguishable from a gulag. This is what socialists refer to as wage slavery. [This](http://www.marxists.org/archive/lafargue/1903/xx/truths.htm) brief article illustrates it more elegantly than I can.\n\nIn addition to that, when the people who own a company aren't the people who run the company, it opens the door for corruption. A CEO can run his company into the ground for a short term boost in profit, use that as a justification for a massive personal bonus, and then leave before it comes crashing down. Look at what happened recently with Hostess. This is ultimately what caused the 2008 financial crisis. Traders were passing back loans they knew were ultimately worthless, and taking huge bonuses for themselves, which had the effect of sucking all the money out of their companies. The companies collapsed, but the people who actually made the decisions are doing just dandy.\n\nThose are the two major reasons, although there are a number of smaller ones, as well. Because it leads to exploitation at several levels. Here's a little analogy I like. Imagine a hundred people on an island. One of these people owns the entire island, as well as all the means on or off the island. In return for food, he demands that the other 99 people labor for 12 hours a day, every day. You could call this situation a voluntary, mutually beneficial exchange (it's better than starving, right?), but at the same time, it's more or less indistinguishable from a gulag. This is what socialists refer to as wage slavery. [This](http://www.marxists.org/archive/lafargue/1903/xx/truths.htm) brief article illustrates it more elegantly than I can.\n\nIn addition to that, when the people who own a company aren't the people who run the company, it opens the door for corruption. A CEO can run his company into the ground for a short term boost in profit, use that as a justification for a massive personal bonus, and then leave before it comes crashing down. Look at what happened recently with Hostess. This is ultimately what caused the 2008 financial crisis. Traders were passing back loans they knew were ultimately worthless, and taking huge bonuses for themselves, which had the effect of sucking all the money out of their companies. The companies collapsed, but the people who actually made the decisions are doing just dandy.\n\nThose are the two major reasons, although there are a number of smaller ones, as well. Because it leads to exploitation at several levels. Here's a little analogy I like. Imagine a hundred people on an island. One of these people owns the entire island, as well as all the means on or off the island. In return for food, he demands that the other 99 people labor for 12 hours a day, every day. You could call this situation a voluntary, mutually beneficial exchange (it's better than starving, right?), but at the same time, it's more or less indistinguishable from a gulag. This is what socialists refer to as wage slavery. [This](http://www.marxists.org/archive/lafargue/1903/xx/truths.htm) brief article illustrates it more elegantly than I can.\n\nIn addition to that, when the people who own a company aren't the people who run the company, it opens the door for corruption. A CEO can run his company into the ground for a short term boost in profit, use that as a justification for a massive personal bonus, and then leave before it comes crashing down. Look at what happened recently with Hostess. This is ultimately what caused the 2008 financial crisis. Traders were passing back loans they knew were ultimately worthless, and taking huge bonuses for themselves, which had the effect of sucking all the money out of their companies. The companies collapsed, but the people who actually made the decisions are doing just dandy.\n\nThose are the two major reasons, although there are a number of smaller ones, as well. all the analogies about exploitation assume a single capitalist or a group of them have a complete monopoly on resources and that charity does not exist\n\nprivate charity does exist so i think that counter example takes care of that\n\nand practically speaking its near impossible for a single group to gain such a monopoly by voluntary means, the only organization to pull it off by some means oddly enough, is the state, and it then dictates to us that we must do some certain things or else  Freedom and liberty have always been the most compelling cause for me.   I feel your pain. It seems to me half the people in r/anarcho_capitalism these days are socialists.  [deleted]  The reason I do not *believe* in any government system is because government is based on the religion of justice. Justice is a moral and a religion. Even some atheists believe in it. It means whatever the people believe at the current time is allowed, anything outside of this isn't allowed. It means people will seek death penalties or lifetime prison sentences based on their emotions instead of trying to find ways to treat all things from a scientific standpoint. This is reason enough to discount the government, but I'll continue to elaborate.\n\nThe time for religious worldviews is over. We now live in a time with figures like Carl Sagan and processes like science that can establish the truth about the cosmos for the first time in history. So I don't \"believe,\" instead I *understand.*\n\nI understand that there is no actual thing as justice. Instead, I understand voluntarism/consent. I understand that if consent is not used as the primary tool for interaction with other life forms then retaliation will not be far behind it either from the victims of the oppressed or by other forces present in the universe. Voluntarism is just another example of science making sense out of life and turning it simple and predictable so we can understand it.\n\nOnly *the law* and *religion* **still debate** whether or not it *should* be ok to allow people who have consented to doing something together as the only participants involved and still consider it a sin and a crime to be punished. As in, these two organizations *do not move forward* -  only science does - law and religion are piggy back riding on the power of science. Government and religion are the largest to blame for genocide.\n\nScience and liberty. This is a fascinating argument because I've had the most success in converting people by talking about libertarian law and justice. Chaos Theory, a libertarian justice treatise, is what converted me personally. I can't comment because what idea of justice and law you have was not shared.\n\nYes, the universe appears chaotic and unpredictable, but ultimately science has been slowly chipping away at it for thousands of years for example when Thales of Miletus (582 BC) first predicted a solar eclipse and proved that the universe does have predictable properties.\n\nIn the case of my first post, I was speaking about the predictability of coercion and consent. Chaos Theory presents a preferential justice system, where people must agree on arbitrators and to bind themselves in contract to the opinion of the arbitrator. People may break these contracted opinion methods of restitution, but at the expense of being outcasted from society for not being trustworthy, both for having to have been taken to arbitration, and also for not wanting to repay damages he / she agreed to pay prior. The reason I do not *believe* in any government system is because government is based on the religion of justice. Justice is a moral and a religion. Even some atheists believe in it. It means whatever the people believe at the current time is allowed, anything outside of this isn't allowed. It means people will seek death penalties or lifetime prison sentences based on their emotions instead of trying to find ways to treat all things from a scientific standpoint. This is reason enough to discount the government, but I'll continue to elaborate.\n\nThe time for religious worldviews is over. We now live in a time with figures like Carl Sagan and processes like science that can establish the truth about the cosmos for the first time in history. So I don't \"believe,\" instead I *understand.*\n\nI understand that there is no actual thing as justice. Instead, I understand voluntarism/consent. I understand that if consent is not used as the primary tool for interaction with other life forms then retaliation will not be far behind it either from the victims of the oppressed or by other forces present in the universe. Voluntarism is just another example of science making sense out of life and turning it simple and predictable so we can understand it.\n\nOnly *the law* and *religion* **still debate** whether or not it *should* be ok to allow people who have consented to doing something together as the only participants involved and still consider it a sin and a crime to be punished. As in, these two organizations *do not move forward* -  only science does - law and religion are piggy back riding on the power of science. Government and religion are the largest to blame for genocide.\n\nScience and liberty. On the contrary. I believe that since as far as we can tell, this is the only life we get, we should live it to the fullest. That means spending it doing the things we want to do, which leads to a natural definition of freedom: The ability to do the things you want to do. Therefore, it's to the advantage of everyone to create a system that maximizes freedom. If you kill me, you've taken away all of my freedom, so this is defined as bad. Thus, law. If you take away my only TV, you've taken away my ability to watch TV or play video games, so this is also defined as bad. But if I have a hundred TV's, and you take one, my ability to watch TV and play video games is not impacted at all, and if you had no TV before, you gain the ability to watch TV and play video games. Therefore, this is defined as good. Thus, taxation. In this system, everyone is able to get what they want, with the only limit being the point at which they would deny someone else what they want by consuming too many resources. Well, with a post like this, all I can say is that I can see you haven't been here for very long.\n\n&gt; \"with the only limit being the point at which they would deny someone else what they want by consuming too many resources.\"\n\n[In a free market, how would businesses be regulated without government to enforce regulations? And doesn't a free market tend towards monopolies?](http://voluntarismfaq.wikispaces.com/Voluntarism) From the the Voluntary FAQ.\n\n&gt; with the only limit being\n\nThe only problem is that I may not want to live under your coerced system. If you can't see how simple consent is without complicating it with force, then we will never agree. I don't think I did a very good job of explaining my position. In my defense, it was right before I went to bed. I believe that our economic and political system should try to maximize everyone's freedom, by which I mean facilitate people to do the things they want to do the best of our ability. But that's not always possible. For instance, I'd like to go to Mars, but the amount of resources that would take would result in a reduction of freedom for other people. Therefore, I don't get to do that. As our technology increases, so does our freedom. That's what I mean by limits.\n\n&gt;[1] In a free market, how would businesses be regulated without government to enforce regulations? And doesn't a free market tend towards monopolies? From the the Voluntary FAQ.\n\nI see this argument a lot, and there's a problem with it, which is basically that you're assuming corporations will play nice and abide by the NAP. For instance, let's say some corporation gets a monopoly on food. Not a very likely scenario, but stay with me. Now that they have a monopoly, they raise their prices. Some entrepreneur sees this and decides to start his own competing business. So the big company hires some goons and burns down his competing business. Now what? The entrepreneur doesn't have the resources to challenge a massive corporation, and even if he did, the risk of taking on a powerful entity like that is way too high for any security company to take it. They can't be brought down by a boycott either, because they're already a monopoly. In the absence of a state, there's no one who can challenge them.\n\n&gt;The only problem is that I may not want to live under your coerced system. If you can't see how simple consent is without complicating it with force, then we will never agree.\n\nWhat I've come to believe is that you're *always* going to be living under a \"coerced\" system. Central authority is inevitable, and getting rid of it just guarantees that what replaces it will be worse. Instead, we should try to make it as benign as possible. &gt; you're assuming corporations will play nice and abide by the NAP.\n\nAncaps do not claim the world will be a utopia. Ancap is about *understanding* the world and attempting to influence it cooperatively. Not about controlling and bullying it. Only government systems create religious/ritualistic ideas like that. i.e. Flags, celebrations, national holidays, war propaganda, speeches, claims that the world will be a better place. Government is a *belief* system.\n\nThe fact is, that any company that tries to take over in a free market, and burn someone's house down/homocide who simply attempted to compete in the market, will lose the acceptance of all other people and they will stop buying from them. Why? Because that's what happens when a company becomes detrimental and a danger to other people. It simply will be taken care of by people's predictable nature to coercion.\n\nI certainly have not heard a scientist use justice as a basis for law. That's because science cannot be used to prove ethics are right or wrong.\n\nScience can only be used to prove something is beneficial or detrimental to a species' health - a form of raw data. It also happens to be able to explain why voluntarism is beneficial, meaning consent is not only a moral but backed by scientific proof.\n\n&gt; They can't be brought down by a boycott either, because they're already a monopoly.\n\nThen you don't understand that the monopoly would be broken down by decentralized forms of consentual contracts, fines, and self-regulation.\n\n&gt; always going to be living under a \"coerced\" system. Central authority is inevitable, and getting rid of it just guarantees that what replaces it will be worse.\n\nThis is just factually false already. Many things currently already exist outside of central authority unaffected by coercion. Stating that they are automatically worse is subjective and unconvincing. Would you want to be the one to tell the Native Americans that? On the contrary. I believe that since as far as we can tell, this is the only life we get, we should live it to the fullest. That means spending it doing the things we want to do, which leads to a natural definition of freedom: The ability to do the things you want to do. Therefore, it's to the advantage of everyone to create a system that maximizes freedom. If you kill me, you've taken away all of my freedom, so this is defined as bad. Thus, law. If you take away my only TV, you've taken away my ability to watch TV or play video games, so this is also defined as bad. But if I have a hundred TV's, and you take one, my ability to watch TV and play video games is not impacted at all, and if you had no TV before, you gain the ability to watch TV and play video games. Therefore, this is defined as good. Thus, taxation. In this system, everyone is able to get what they want, with the only limit being the point at which they would deny someone else what they want by consuming too many resources. The reason I do not *believe* in any government system is because government is based on the religion of justice. Justice is a moral and a religion. Even some atheists believe in it. It means whatever the people believe at the current time is allowed, anything outside of this isn't allowed. It means people will seek death penalties or lifetime prison sentences based on their emotions instead of trying to find ways to treat all things from a scientific standpoint. This is reason enough to discount the government, but I'll continue to elaborate.\n\nThe time for religious worldviews is over. We now live in a time with figures like Carl Sagan and processes like science that can establish the truth about the cosmos for the first time in history. So I don't \"believe,\" instead I *understand.*\n\nI understand that there is no actual thing as justice. Instead, I understand voluntarism/consent. I understand that if consent is not used as the primary tool for interaction with other life forms then retaliation will not be far behind it either from the victims of the oppressed or by other forces present in the universe. Voluntarism is just another example of science making sense out of life and turning it simple and predictable so we can understand it.\n\nOnly *the law* and *religion* **still debate** whether or not it *should* be ok to allow people who have consented to doing something together as the only participants involved and still consider it a sin and a crime to be punished. As in, these two organizations *do not move forward* -  only science does - law and religion are piggy back riding on the power of science. Government and religion are the largest to blame for genocide.\n\nScience and liberty. Have you read The Law my Frederic Bastiat?\n\nhttp://bastiat.org/en/the_law.html\n\nI agree with most of your points but:\n\n-scientific understanding and the scientific method are constantly improving, but the modern blanket of 'science' is rather dogmatic\n- justice is the abscence of injustice\n- there is a different between law and legislation, one is moral and true, the other is determined by ignorant rulers.  I'm an anarcho-socialist that unsubbed from /r/socialism because of the arrival of the statist-communists and social democrats. I hate government more than I hate capitalism (by capitalism I mean usury, and not free trade). I like anarcho-capitalism because of the embrace of the NAP, and because I know socialist cooperatives can't work on a massive scale. I prefer small, worker owned cooperatives competing against each other in a \"capitalist\" system (free of wall street vultures).   Fuck it, I'm coming with you. Hello my AnCap ~~comrades~~ buddies!  If they had more activity, you would probably like it more at /r/mutualism and /r/marketanarchism. They are mostly populated by non-authoritarian socialists. Unfortunately, there seems to be little to no activity there these days. I think it is great if more people with different points of view come to this subreddit. Just beware that while this subreddit is generally quite welcoming, there are still, just like in all other subreddits, people who prefer downvoting to actually making an argument. Don't let those people scare you away.  No country has had ideal versions of capitalism or socialism. However some countries have certainly been more socialist/capitalist then others. Do you really believe the socialist countries have been better places to live on average? \n\nIf not then doesn't suggest socialism is a bad idea? I mean if a political system only works in ideal cases then it is not something I would advocate. \n\nI mean I hate the USA's government. But certainly the USA's model has worked much better then most (most countries are more socialist) places.  By this, I assume you're referring to the Soviet Union and similar countries. My position is that these countries weren't just not ideally socialist, they weren't socialist at all. Socialism is not synonymous with central planning. Socialism means worker ownership of the means of production. In the Soviet Union, the means of production were owned by the Party, and they weren't big on sharing power. \n\nOf course, the Stalinists aren't real impressed when I say that, which is one of the reasons I'm over here now.  Read Caplan on why Left Anarchism is flawed.\n\nhttp://econfaculty.gmu.edu/bcaplan/spain.htm  My suggestion is to try either Anarcho communism or mutualism as\n\nthe next best alternatives for former socialists.   in a voluntaryist or ancap society people could form groups with whatever structure desired, including socialism, as long as people were free to leave. Hell, it might even end up that the strongest groups are smallish socialist collectives, not mega corps like we have now.\n\nwe want you to live how you want to live, to be free with us, as long as you don't force any of it on us. :) Which would be great, if I thought that such a society could be stable. The reason I'm no longer an anarchist is because I've come to the belief that central authority is inevitable. Therefore, we should work to make it as benign as possible. Trying to eliminate it just guarantees that you'll get something worse.  If you feel government is a necessary evil perhaps you are more of a libertarian than a socialist, as a socialist tends to see it more necessary good. The idea of someone who isn't a feminist not being able to be a socialist is moronic though, we tend to be much more inclusive and open for discussion here even if we disagree. When your ideology relies the NAP (or not infringing on others) you tend to become more tolerant in general My ideology doesn't rely on the NAP, which is why I'm a socialist rather than a libertarian. It has to do with how I define freedom. Libertarians tend to define freedom as the absence of coercion, which is what gives rise to the NAP. I define freedom as the ability to do the things I want to do. This leads to several differences from the NAP. First, under the NAP, absolute freedom is possible in the total absence of coercion, whereas under my definition, there's only more or less freedom. Second, if taking something from someone doesn't actually impact their ability to do what they want to do, then under my definition, you haven't decreased their freedom, and therefore you haven't done anything wrong. This is why taxation is acceptable. Third, by providing things to people, you can actually increase their freedom, which is why government programs are acceptable. I find my definition of freedom to be much more useful, because it's possible under your definition to be completely free but still have an absolutely horrid quality of life. My ideology doesn't rely on the NAP, which is why I'm a socialist rather than a libertarian. It has to do with how I define freedom. Libertarians tend to define freedom as the absence of coercion, which is what gives rise to the NAP. I define freedom as the ability to do the things I want to do. This leads to several differences from the NAP. First, under the NAP, absolute freedom is possible in the total absence of coercion, whereas under my definition, there's only more or less freedom. Second, if taking something from someone doesn't actually impact their ability to do what they want to do, then under my definition, you haven't decreased their freedom, and therefore you haven't done anything wrong. This is why taxation is acceptable. Third, by providing things to people, you can actually increase their freedom, which is why government programs are acceptable. I find my definition of freedom to be much more useful, because it's possible under your definition to be completely free but still have an absolutely horrid quality of life.   Well, we're happy to have you! Enjoy your stay.\n\n[](/rdlean \"I just wanted to post one of these\")    The question I'd like to ask you is: How closely have you examined your premises for the \"necessary evil\" of government? Its inevitability does not make it a requirement for peaceful cooperation.  &gt;Its inevitability does not make it a requirement for peaceful cooperation. \n\nI would say that it does. 99 percent of the time, you're right, and people are perfectly capable of handling their own business without interference from the government. But occasionally you'll get that one asshole who is incapable of respecting other people's rights. Even in this case, I think your system is probably capable of handling routine criminals. The problem comes when a psychopath manages to accumulate power for himself (and studies have shown that psychopaths are often very successful in business). When this happens, he becomes more or less immune to retribution under your system, and there's nothing to stop him from accumulating more and more power (except, of course, another psychopath in a position of power).\n\nYou'll probably counter that if there's a state, all an aspiring psychopath has to do is take control of it and he'll be set, but it's not quite that simple. Remember, people are only powerful because other people believe they're powerful, and are willing to do what they say. In a strictly capitalist society, where everything is ultimately driven by the profit motive, that's not hard to do. But if the army is loyal to society as a whole, rather than to one individual person or position, then they'll refuse any order that would harm it. If that monopoly on force didn't already exist, someone else would be free to fill the void.    COMRADE! http://www.youtube.com/watch?v=IH42Gme4oIg  I have an honest question raised by some of your comments. I'm not trying to be snarky.\n\nCan you outline your understanding of what money is?\n\n  &gt;you guys will probably tell me authoritarianism and left wing economics go hand in hand\n\nI'd say left-wing economics are a subset of authoritarianism, specifically.  But, not all ancaps look at anarcho-capitalism as being authority-free, either; we just regard the authority that does exist in that system to be much more agreeable with our preferences.\n\nIf you find much of their cultural marxism annoying, you may end up like many among our ranks who began as socialists / libertarian socialists, but arrived at anarcho-capitalism after studying economics more and finding a way to be fine with property in some form. I've actually already studied economics quite a bit, both at university and on my own, and I'm already fine with property rights in some form. If there's a magic bullet that will make me see the error of my socialist ways, that's not it.  [deleted] ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/188pbb/socialist_here_my_comrades_are_being_dicks_can_i/"
  }, {
    "id" : 40,
    "title" : "I Have Been Summoned (Poll on Jury Nullification!)",
    "snippet" : "     Only time I was ordered to go to jury duty I wasn't even picked.   By the way, I want you to consider [jury nullification in rape trials](http://www.avoiceformen.com/feminism/government-tyranny/on-jury-nullification-and-rape/) as well.\n\nThanks!  ",
    "url" : "http://notesonliberty.com/2013/02/10/i-have-been-summoned-poll/"
  }, {
    "id" : 41,
    "title" : "Lysander Spooner Excerpt w/Parking Enforcement Illustration",
    "url" : "http://www.youtube.com/watch?v=0Ayz1aIcKmc"
  }, {
    "id" : 42,
    "title" : "Obama Reacts to Dr. Benjamin Carson's Damning Speech",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=nNGy2SONDQA"
  }, {
    "id" : 43,
    "title" : "The Best Video Summary Of The Case For Anarchy?",
    "snippet" : " ",
    "url" : "http://youtu.be/goYBtHdEIjs"
  }, {
    "id" : 44,
    "title" : "Immigration policy is just statist logic",
    "snippet" : "  ",
    "url" : "https://www.youtube.com/watch?v=ofp1WKM7dQI&amp;feature=youtube_gdata_player"
  }, {
    "id" : 45,
    "title" : "Add another tick to the government program tally - time for the US government to start cracking down on the internet",
    "snippet" : "  ",
    "url" : "http://www.whitehouse.gov/blog/2013/02/05/working-counter-online-radicalization-violence-united-states"
  }, {
    "id" : 46,
    "title" : "Judge Napolitano nails it on immigration",
    "url" : "http://www.youtube.com/watch?v=zbHvP9CTjvA"
  }, {
    "id" : 47,
    "title" : "How Raytheon software tracks you online",
    "snippet" : "  The best time to rob Nick's house without much resistance appears to be at ~6am.  It's actually some interesting software. None of this information is private - it's all public. It just goes to show how careful we need to be if we want to keep our privacy intact in the information age. encryption for the average joe can't come soon enough. It's out there. The problem is that nobody gives a fuck.  https://www.eff.org/https-everywhere",
    "url" : "http://www.guardian.co.uk/world/video/2013/feb/10/raytheon-software-tracks-online-video"
  }, {
    "id" : 48,
    "title" : "Adam runs into an educated and well read but fairly confused former libertarian",
    "snippet" : "  I love it when people describe one of the \"flaws\" of capitalism is it being hyper-productive. Its like \"no, it's too awesome. We're not worthy.\" Nothing makes me shake my head and give up like the \"too much production!\" argument does.\n\nProduction = using labor and capital to shape the arrangement of matter in the world into a form more desirable to humans.\n\nThere are people out there who believe that we do too much of this.  I get that there are negative externalities in some forms of production.  I get that the proceeds of production are not egalitarianly distributed... but how the hell can somebody be \"anti-production\".  In spite of this, it comes up quite often. I love it when people describe one of the \"flaws\" of capitalism is it being hyper-productive. Its like \"no, it's too awesome. We're not worthy.\" I think they believe it leads to too much labor and too little free time, hence too much focus on productivity.\n\nCapitalism provides part-time jobs for those people. That's just silly. The goal of all production is consumption. If you want better free time, that is if you want to consume more, having a more productive society is perfect for that.\n\nNo, I think the problem they are trying to claim is that its *so* efficient that its taking their jobs or something and everything becomes automated, leaving you with a lot of stuff an no one to buy it or something, which is an idea proven to be blatantly false with a proper understanding of Say's Law. Producing things people want creates demand for everything else. A general glut is impossible. It's the standard Keynesian argument of not enough demand. I love it when people describe one of the \"flaws\" of capitalism is it being hyper-productive. Its like \"no, it's too awesome. We're not worthy.\" Oh come on, you're being completely unfair. Did you listen to what he said 3 seconds later? He said that is \"glorious\" in some ways, because the standard of living increases dramatically, but that it also causes the boom-bust cycle. Obviously, feel free to argue that he's wrong about the source of the business cycle, but don't act like he's just rattling off nonsense. I love it when people describe one of the \"flaws\" of capitalism is it being hyper-productive. Its like \"no, it's too awesome. We're not worthy.\" The hyper-productivity does create a problem for many people though, it offloads the workforce that supports that industry prior to its productivity shift into hyper mode. \n\n\nThat represents a lot of pain for people who can't or won't change their skill-set. That's their choice not to continue to change their skillset yes, but it can be very painful to have a cycle of non-employment (as we are in now). \n\n\nI think if we wanted to seriously lower the likelihood of the bust cycle causing pain, we would work to make worker education happen in a much more efficient way.  Bust cycles aren't caused by hyper-production or technology making certain jobs obsolete, they're caused by inflation producing artificially low interest rates that keep people from saving and have people invest in the wrong things. That can also cause them but is not the exclusive cause. Although lately an exception to the rule would be hard to find.  Only other obvious economic downturns I think I can point to would be war and environmental disasters, which are, as I said, obvious.  To his credit he's the most reasonable marxist I've ever seen. To his credit he's the most reasonable marxist I've ever seen.  Feel free to use this guy as an example of how not to live your life.  The supply of information exceeds his ability to process the information.  All he can do is parrot what other people have said about certain conditions instead of processing the information and facing life with an educated perspective.  He is the poster child for factory schooling.  I bet you he can tell you the year the Spanish-American war started.  I bet you he can tell you the capital of Chile...but ask him to think and you'll be left with a man scratching his head while muttering to himself \"what did Jung say about that\"?\n  as he gestures with his grande caramel frappaccino.     Perhaps it's just because I'm more familiar with Adam's talking points than the other guy's talking points, but I felt like Adam completely lost that debate. Everything Adam said was just another boring libertarian talking point that, quite frankly, I am sick of hearing, even if I do still agree the gist of Adam's arguments. I am specifically tired of the \"Socratic method\" that starts with \"Do you own yourself?\" (I'm not a natural rights kind of guy) and I was glad to see the other guy dismiss that as a loaded question. It wasn't a debate. Adam simply asked him questions. And if you're not a \"natural rights\" kind of guy, then I'm curious to know what your ideas on the rights of people are. Are you aware that there is a significant group of anarcho-capitalists who do not subscribe to natural rights theory? One of the most prominent books espousing this viewpoint would be The Machinery of Freedom by David Friedman. No, I was not aware. Please inform me in your ideas and logic as I asked before because I truly am curious. Opinions vary. Some people take the approach of direct utilitarianism (libertarianism will maximize human happiness), some approach from economics (libertarianism will make everyone wealthier), etc. In Part IV of The Machinery of Freedom, Friedman writes a good summary of the different approaches to libertarianism (and some of the problems of each), including the natural rights approach. It's a short and easy read, and I highly recommend it: http://daviddfriedman.com/The_Machinery_of_Freedom_.pdf. Perhaps it's just because I'm more familiar with Adam's talking points than the other guy's talking points, but I felt like Adam completely lost that debate. Everything Adam said was just another boring libertarian talking point that, quite frankly, I am sick of hearing, even if I do still agree the gist of Adam's arguments. I am specifically tired of the \"Socratic method\" that starts with \"Do you own yourself?\" (I'm not a natural rights kind of guy) and I was glad to see the other guy dismiss that as a loaded question. I don't feel like he lost the debate, he won when he said I own myself and you don't. He shut the other guy down and that's why he flipped out so much in that moment, because Adam won.  I realy don't want to listen to a marxist or someone who can't accept that he owns himself.  If you don't own yourself, do you also not own your actions?... How can I own my actions? If a person cannot own his actions, he can not hold any responsibility for doing anything. I have talked to people that believe this. \n\nFor example, if a person committed murder, this mentality blames society, government, or a collective, instead of the individual. To lock up said individual is against society, so instead society should be punished as a whole.  I should be held responsible for my actions and I should have exclusive use of a certain object. You are mixing two different concepts. How can I own my actions? By doing them Ownership requires action, action does not require ownership. What if I limited your actions to absolutely nothing through slavery? Who would have ownership then? You are begging the question. The concept of ownership cannot exist without humans, however you seem to think that humans cannot exist without the concept of ownership. Sure ownership could occur without humans. It could belong to whatever species that's at the top of the food chain to claim it. Many people  are enslaved today all across the world. Does somebody not own them when that enslaved person cannot make any decisions for their own? Just because I am not owned by a slave master it does not follow that I own myself, only that I am not owned.  Pythagorams theorem is a^2 + b^2 = c^2  I think maybe he was referring to the [3,4,5 triangle](https://www.google.com/search?q=345+triangle&amp;hl=en&amp;safe=off&amp;tbo=u&amp;tbm=isch&amp;source=univ&amp;sa=X&amp;ei=Yn0YUfrSAYmQ0QGV_YC4DQ&amp;ved=0CFAQsAQ&amp;biw=1241&amp;bih=844)? I.e. a complicated thing is made simple, but only given a particular, specific set of circumstances (the heavens align). He was referring to Law of Cosines:\n\nc^2 = a^2 + b^2 - 2\\*a\\*b*cos C\n\nwhich reduces to Pythagorean Theorem when C is a right angle (pi/2). Pythagorams theorem is a^2 + b^2 = c^2   ",
    "url" : "http://www.youtube.com/watch?v=kAFFgmTzcHs"
  }, {
    "id" : 49,
    "title" : "ITT Redditors finally learn that police have a ganglike mentality",
    "snippet" : "   I have to run in a few minutes so I don't have time to find it and link, but there's a great interview with Tupac on Youtube somewhere where he makes a ton of connections between gangs and government, and specifically talked about the NATO bombings of Bosnia. [Found it.](http://www.youtube.com/watch?v=qm9dduejCmI)",
    "url" : "http://www.reddit.com/r/videos/comments/1879mm/good_cop_gets_fired_for_stopping_another_cop_who/"
  } ],
  "processing-time-source" : 88,
  "processing-result.title" : "anarcho_capitalism6_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/anarcho_capitalism6_reddit.xml"
  }
}