{
  "processing-time-total" : 2480,
  "clusters" : [ {
    "id" : 0,
    "size" : 10,
    "score" : 95.83819484700639,
    "phrases" : [ "Pay Taxes" ],
    "documents" : [ 0, 9, 14, 16, 17, 20, 21, 24, 28, 38 ],
    "attributes" : {
      "score" : 95.83819484700639
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 39.20828034322199,
    "phrases" : [ "Article" ],
    "documents" : [ 0, 5, 15, 20, 37, 43, 49 ],
    "attributes" : {
      "score" : 39.20828034322199
    }
  }, {
    "id" : 2,
    "size" : 7,
    "score" : 36.023521962387136,
    "phrases" : [ "Spend" ],
    "documents" : [ 9, 28, 37, 39, 42, 43, 45 ],
    "attributes" : {
      "score" : 36.023521962387136
    }
  }, {
    "id" : 3,
    "size" : 6,
    "score" : 42.81718365083296,
    "phrases" : [ "Capitalist" ],
    "documents" : [ 2, 13, 14, 16, 18, 48 ],
    "attributes" : {
      "score" : 42.81718365083296
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 60.19569500689345,
    "phrases" : [ "Libertarian Party" ],
    "documents" : [ 0, 16, 31, 33, 40 ],
    "attributes" : {
      "score" : 60.19569500689345
    }
  }, {
    "id" : 5,
    "size" : 5,
    "score" : 88.42646525610152,
    "phrases" : [ "School System" ],
    "documents" : [ 9, 16, 37, 42, 44 ],
    "attributes" : {
      "score" : 88.42646525610152
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 23.057048254889224,
    "phrases" : [ "Union" ],
    "documents" : [ 9, 16, 18, 37, 41 ],
    "attributes" : {
      "score" : 23.057048254889224
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 91.55181924408127,
    "phrases" : [ "Like Bitcoin" ],
    "documents" : [ 24, 28, 42, 47 ],
    "attributes" : {
      "score" : 91.55181924408127
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 24.01451860475108,
    "phrases" : [ "Meet" ],
    "documents" : [ 10, 26, 43, 49 ],
    "attributes" : {
      "score" : 24.01451860475108
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 51.89152121966496,
    "phrases" : [ "Austrian Economists" ],
    "documents" : [ 2, 12, 37 ],
    "attributes" : {
      "score" : 51.89152121966496
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 39.41760460345112,
    "phrases" : [ "Fallacy" ],
    "documents" : [ 30, 39, 40 ],
    "attributes" : {
      "score" : 39.41760460345112
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 80.28802076236981,
    "phrases" : [ "Minimum Wage" ],
    "documents" : [ 11, 29, 37 ],
    "attributes" : {
      "score" : 80.28802076236981
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 46.24277068975371,
    "phrases" : [ "Piece of Land" ],
    "documents" : [ 0, 7, 20 ],
    "attributes" : {
      "score" : 46.24277068975371
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 56.229492622382686,
    "phrases" : [ "Small Community" ],
    "documents" : [ 0, 28, 46 ],
    "attributes" : {
      "score" : 56.229492622382686
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 70.58273826073145,
    "phrases" : [ "Voluntarist" ],
    "documents" : [ 28, 36, 44 ],
    "attributes" : {
      "score" : 70.58273826073145
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 61.54345465119933,
    "phrases" : [ "Argument made for the Minimum Wage" ],
    "documents" : [ 11, 37 ],
    "attributes" : {
      "score" : 61.54345465119933
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 80.89070239383506,
    "phrases" : [ "Cause Inflation" ],
    "documents" : [ 26, 37 ],
    "attributes" : {
      "score" : 80.89070239383506
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 73.77668579169172,
    "phrases" : [ "Copying is Theft" ],
    "documents" : [ 0, 7 ],
    "attributes" : {
      "score" : 73.77668579169172
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 111.57157069028295,
    "phrases" : [ "Jury Duty" ],
    "documents" : [ 3, 19 ],
    "attributes" : {
      "score" : 111.57157069028295
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 34.083868918101864,
    "phrases" : [ "Milton Friedman" ],
    "documents" : [ 2, 35 ],
    "attributes" : {
      "score" : 34.083868918101864
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 60.85029073362443,
    "phrases" : [ "Music for the Show" ],
    "documents" : [ 4, 7 ],
    "attributes" : {
      "score" : 60.85029073362443
    }
  }, {
    "id" : 21,
    "size" : 9,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 1, 6, 8, 22, 23, 25, 27, 32, 34 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 2406,
  "documents" : [ {
    "id" : 0,
    "title" : "I thought this was a universally accepted truth within the AnCap community that copying is not theft.",
    "snippet" : "   A better question to ask is whether copying can ever constitute aggression Can it? To answer that question, you and whoever decides to have that conversation should first define aggression.  aggression includes infringing on my monopoly\n\ntherefore copying is aggression!!!! /s You laugh, but that's exactly what every discussion about \"aggression\" distills to. You can easily have a left-libertarian and an anarcho-capitalist argue whether trespassing is aggression, because they disagree on whether private property rights are valid. Can it? In my opinion, yes. The easy case is when you promise not to copy a thing and then you copy it anyway. \n\nThe harder case comes from what model of property you choose to adhere to: under some models, copying is aggression even without such promises. In my opinion, property is the result of a purposeful act of creation. If so, then my ideas are property. Furthermore they are *my* property. Since they are my property, it is aggression to use them in ways that are contrary to my wishes.\n\nThis doesn't mean it's aggression to come up with an identical idea on your own. Nor does it mean its fine to stick a gun in someone's face if they copy your intellectual output. It just means that you should respect the wishes of a creator with respect to his creations whether those creations are of a physical or intellectual nature &gt; The easy case is when you promise not to copy a thing and then you copy it anyway.\n\nWhy? Does breaking all promises constitute aggression? &gt; The easy case is when you promise not to copy a thing and then you copy it anyway.\n\nWhy? Does breaking all promises constitute aggression? its not that\n\nsigned and explicit agreements should have compensation clauses\n\nif you and I sign a contract that says you wont do X then there should be a clause that states that if you do X then I am awarded $100 to be paid by you. without this clause the contract is all but useless\n\nso if we sign this and you do X I will expect my $100. if you dont give I will take. if you stop me it is aggression because you are denying me my property  Why should pieces of paper with marks on them be the basis for whether something is aggression? That seems very arbitrary. we have agreed that if X happens then that $100 is my property. therefore i may use force in acquiring it if necessary.  What if the contract was for, say, sex? Would rape then be justified?  i'm not sure if i know of any ancaps who are 100% on board with IP laws, but keep in mind that not everyone here is an ancap so you will here some pro IP voices on occasion in this subreddit like jamescarlin-somethinglikethat \n\ni was talking about Intellectual Monopoly with him about a week ago and he quit after my 3rd or so reply :(  jamescarlin doesn't like debating. He actually *dislikes* it. You should be happy he gave you a few responses. &gt; *\"He actually dislikes it.\"*\n\nIt's true.\n\n&gt; *\"You should be happy he gave you a few responses.\"*\n\nI actually consider it irresponsible on my part if I engage in long unproductive internet debates with strangers.  Victory over some random internet stranger on a debate is not worth the price I pay daily for rent, food, etc.\n\n\n\n**Quick story:**  When growing up, my dad LOVES debating.  He'll never just \"make a point\" - he'll make that point from \"1000\" different angles, and when you thought he was about done, he'd come back with \"1000\" more.  Occasionally I would decide to debate/argue with him on a subject, and sometimes actually \"win.\"  However, 5 minutes later, he'd act like nothing happened and start back on his list of reasons he's right.  If I wished, I \"win\" again, but to what purpose? He'd never give up, I have much better things to do, and that \"victory\" wouldn't do much for me. &gt; *\"He actually dislikes it.\"*\n\nIt's true.\n\n&gt; *\"You should be happy he gave you a few responses.\"*\n\nI actually consider it irresponsible on my part if I engage in long unproductive internet debates with strangers.  Victory over some random internet stranger on a debate is not worth the price I pay daily for rent, food, etc.\n\n\n\n**Quick story:**  When growing up, my dad LOVES debating.  He'll never just \"make a point\" - he'll make that point from \"1000\" different angles, and when you thought he was about done, he'd come back with \"1000\" more.  Occasionally I would decide to debate/argue with him on a subject, and sometimes actually \"win.\"  However, 5 minutes later, he'd act like nothing happened and start back on his list of reasons he's right.  If I wished, I \"win\" again, but to what purpose? He'd never give up, I have much better things to do, and that \"victory\" wouldn't do much for me. well i can see why you wouldn't want to debate, but how do you plan on convincing anyone save for making claims and then not backing them up? &gt; *\" how do you plan on convincing anyone \"*\n\nsee: [\"The Enchiridion\" by Epictetus](http://classics.mit.edu/Epictetus/epicench.html)\n\n&gt; *\"Some things are in our control and others not. Things in our control are opinion, pursuit, desire, aversion, and, in a word, whatever are our own actions. Things not in our control are body, property, reputation, command, and, in one word, whatever are not our own actions. \"*\n\n^  It's a good read.\n\n&gt; *\"and then not backing them up?\"*\n\nSo you assert.  I explain concepts when I have the time/motivation.  For example:\n\n*[Piracy vs Theft](http://jamescarlin.wikidot.com/intellectual-property:piracy-vs-theft)* property rights are violated when someone causes the value of something you own to change in an undesirable way, that's a good one lol\n\nwhy do you restrict this concept of violation of property rights to ideas and not to the farmer in your example? you say the important part is that he has lost trading value in his tomato, but what if a competitor enters the tomato market and causes the value of his tomatoes to fall? this is just as \"bad\" then as his tomato being stolen right? &gt; *\"property rights are violated when someone causes the value of something you own to change in an undesirable way, that's a good one lol\"*\n\nhuh?\n\n&gt; *\"why do you restrict this concept of violation of property rights to ideas and not to the farmer in your example? \"*\n\nI don't understand?\n\nThere's some disconnect here, and I can't tell if you're misrepresenting what I wrote, or simply didn't understand it.\n\n \"If a thief steals this tomato, while -yes- the farmer has lost possession of a physical object, more important is the loss of tradable -value. The thief takes value for himself at the expense of the farmer\"\n\n\"If a pirate pirates this artwork, while -yes- the artist has lost no physical object, more important is the loss of tradable -value. The pirate takes value for himself at the expense of the artist.\"\n\n\"X taking value at the expense of Y\" by itself can be a violation of property rights? which i think that's what you believe is the case of \"the pirate and the artist\" example since the only bad thing that happened was that the value of the artist's art was \"taken\" by the pirate because he did something (in the pirate's case copying) that reduced the trade-able value of the artists artwork, but affected the the artists rights in no other way\n\nso what i'm saying is \"someone causes the value of something you own to change in an undesirable way\" = \"a pirate pirates this artwork... more important is the loss of tradable -value. The pirate takes value for himself at the expense of the artist\"\n\nbut what i said was generalized for multiple scenarios, and i plan on testing that \"[whats] more important is the loss of tradable -value. The pirate takes value for himself at the expense of the artist\" is in fact a violation of property rights \n\nso lets take the farmer from your example again, except instead of having his tomato stolen, a competitor enters the market selling some substitute good (it doesn't even have to be tomatoes). and just like the artist in your example the farmer still has full use of his tomatoes, BUT WAIT, while -yes- the ~~artist~~ farmer has lost no physical object, more important is the loss of tradable -value. The ~~pirate~~ competitor takes value for himself at the expense of the farmer since the competitor made a profit and caused the farmer's profits to decrease!\n\nso by your argument for Intellectual Monopoly, you can also argue to ban competition, since competition reduces the monopolists profits just like piracy reduces profits of the artist, what a coincidence! &gt; *\"someone causes the value of something you own to change in an undesirable way\"*\n\nThat may be what you're saying, but that's not what I said.  This is what I said about the example:\n\n* *\"Often, when one refers to piracy as theft, they are equating the underlying ethical, practical, or economic implications of piracy.\"*\n\nand\n\n* *\"One should be able to recognize the reasonable comparison between the farmer/thief and artist/pirate scenarios, even if one disagrees on the implications of the nuanced differences.\"*\n\n i'm not sure if i know of any ancaps who are 100% on board with IP laws, but keep in mind that not everyone here is an ancap so you will here some pro IP voices on occasion in this subreddit like jamescarlin-somethinglikethat \n\ni was talking about Intellectual Monopoly with him about a week ago and he quit after my 3rd or so reply :(  I support IP rights. I don't agree with any involuntary state issued laws, but I see nothing wrong with voluntarily agreed upon IP laws. \n\nIP rights are really no different in my mind than any other property rights. We (or at least my) aim is to respect the labor of others. If you labor over something, it gives you rights over that creation. \n\nI think the key to understanding property (physical or intellectual) rights is to separate the enforcement part from the ownership part. It doesn't matter how property rights are enforced, we can still recognize that someone that has invested labor into something has a claim of ownership. It's arbitrary to suggest that some things can be property and other things can't be. \n\nI mean who decides what this list is? Things that are red are property and things that are blue are not property! Thats arbitrary. [Our measure of property should be based solely on labor.](http://en.wikipedia.org/wiki/Labor_theory_of_property) You can't separate enforcement from ownership, how can you have one without the other? \n\nwho will enforce this monopoly right? and what happens if someone, as often happens, comes up with the same idea at roughly the same time independently? should the wheel family have IP rights to the wheel? would the guy who made a path have the monopoly rights to paths even when the guy who made the roads came a long?\n\nwhat about the paths? lol\n\nactually I am stealing stuff i heard from stefan kinsella on the decline to state podcast\n\nhttp://declinefm.com/archives/Decline%20to%20State%20show%200039%20January%2023%202013.mp3/view\n\nHe mentions the Labor theory of property and I believe it was menger who came up with scarce goods and property?? &gt; You can't separate enforcement from ownership\n\nSo what you're arguing is that we can't have roads without government? You're saying that the only way you can envision roads is to have them created through government easement and taxation? \n\nThere is nothing wrong with an author laying claim to a story he wrote. He did after all labor many hours to create the ideas that go into that story, so who are you to state that he didn't labor? \n\nWhat you don't like is how the author goes about enforcing his claim of ownership. I get that and I agree that any enforcement of ownership should be voluntary. \n\nSo let me ask this, lets assume that in the future that an method to enforce protections over a digital story. Is that moral or immoral for the author to implement? &gt;So what you're arguing is that we can't have roads without government?\n\nNo, I am saying once you have defined what constitutes property, enforcing those rights comes with it. I am against IP law so I am saying you can't enforce the idea of road building.\n\n&gt;So let me ask this, lets assume that in the future that an method to enforce protections over a digital story. Is that moral or immoral for the author to implement?\n\nIf someone comes up with an idea that makes the book scarce i.e. some form of encrypted key with the book that means it can not be copied that is a valid way to protect your book. If the book can just be digitally copied it is immoral to claim any rights to the copy.\n\n &gt;  some form of encrypted key with the book that means it can not be copied that is a valid way to protect **your book.**\n\nYou said **your book**. What if you write a story, but I am somehow able to apply an encrypted key to the story before you do, does that make the story mine then? I think it's important to separate enforcement from property for this reason.\n\nJust so we don't have a double standard, are you suggesting that if someone can't protect their physical property, then they don't own it? Why should the ability to protect property be a requirement for IP, yet not physical? I am saying ideas are not property. I can't use your computer while you are using it, but we can both share an idea.\n\nIf I put my ideas down in a book, the book is the property and ideas within the book just can't be property in any shape or form.\n\nI'm not sure I'm doing a very good job here. I would recommend the podcast I mentioned earlier! You can't separate enforcement from ownership, how can you have one without the other? \n\nwho will enforce this monopoly right? and what happens if someone, as often happens, comes up with the same idea at roughly the same time independently? should the wheel family have IP rights to the wheel? would the guy who made a path have the monopoly rights to paths even when the guy who made the roads came a long?\n\nwhat about the paths? lol\n\nactually I am stealing stuff i heard from stefan kinsella on the decline to state podcast\n\nhttp://declinefm.com/archives/Decline%20to%20State%20show%200039%20January%2023%202013.mp3/view\n\nHe mentions the Labor theory of property and I believe it was menger who came up with scarce goods and property?? &gt; *\"You can't separate enforcement from ownership, how can you have one without the other? \"*\n\nSure you can.  The #1 means of maintaining a property norms is not violence or force, but rather **respect for ownership.** Respect for ownership is a byproduct of the willingness of an owner to defend their property. Some people respect it for reasons of \"violence aversion.\"  Others for reasons of ethics / morality.  Others for cooperative and mutual benefit reasons.  Others still have other reasons, or several reasons for respecting property.\n\nYes, enforcement is ONE reason (of several) but it is not the only reason. I support IP rights. I don't agree with any involuntary state issued laws, but I see nothing wrong with voluntarily agreed upon IP laws. \n\nIP rights are really no different in my mind than any other property rights. We (or at least my) aim is to respect the labor of others. If you labor over something, it gives you rights over that creation. \n\nI think the key to understanding property (physical or intellectual) rights is to separate the enforcement part from the ownership part. It doesn't matter how property rights are enforced, we can still recognize that someone that has invested labor into something has a claim of ownership. It's arbitrary to suggest that some things can be property and other things can't be. \n\nI mean who decides what this list is? Things that are red are property and things that are blue are not property! Thats arbitrary. [Our measure of property should be based solely on labor.](http://en.wikipedia.org/wiki/Labor_theory_of_property) Do you accept Rothbard's premise that an item, in order to be property, must be a scarce good? &gt; *\" Rothbard's premise\"*\n\nSource?\n\n*edit:  I have yet to see an article where Rothbard asserted that.* &gt; *\" Rothbard's premise\"*\n\nSource?\n\n*edit:  I have yet to see an article where Rothbard asserted that.* [We already had this dialogue.](http://www.reddit.com/r/Anarcho_Capitalism/comments/17avtl/in_opposition_to_the_natural_rights_arguments/c84e0vu) Rothbard's argument for property rights in things outside one's body relies on an implied premise of scarcity. His argument simply doesn't work without it.\n\nAnd it looks like wshanahan found another one where he expressly states it. Right.  I found the connection too weak. [We already had this dialogue.](http://www.reddit.com/r/Anarcho_Capitalism/comments/17avtl/in_opposition_to_the_natural_rights_arguments/c84e0vu) Rothbard's argument for property rights in things outside one's body relies on an implied premise of scarcity. His argument simply doesn't work without it.\n\nAnd it looks like wshanahan found another one where he expressly states it. Do you accept Rothbard's premise that an item, in order to be property, must be a scarce good? I don't. What is scare is really a matter of opinion. For example, I don't consider land a scare resource, since there is plenty for all of us. By this reasoning, land could never be property.\n\nI subscribe to the principle of homesteading. Labor creates property. It doesn't matter if I create one such thing (i.e. scarce) or a million such things (i.e. plentiful) they all belong to me. Ugh. You need to stop talking about economics that you know nothing about. You're not using the economic definition of scarcity and it hurts me to read it.\n\nYou've been around here long enough to learn how to properly communicate ideas. Cmon, step it up. I don't. What is scare is really a matter of opinion. For example, I don't consider land a scare resource, since there is plenty for all of us. By this reasoning, land could never be property.\n\nI subscribe to the principle of homesteading. Labor creates property. It doesn't matter if I create one such thing (i.e. scarce) or a million such things (i.e. plentiful) they all belong to me. &gt;  What is scare is really a matter of opinion.\n\nYou are conflating definitions in a invalid manner.  Different words mean different things. Also the same words mean different things based on context.\n\nIn this context 'scarcity' is used as a defining characteristic of a item. Which is to say that there is not infinite amounts of it. \n\nThere is not a infinite amount of land on earth. Thus the land is described to be 'scarce'.  This is NOT a opinion. You can not make a infinite amount of land by simply deciding that it is infinite. \n\nLand is also contentious. (ie: liable to cause conflict) That is to say you cannot use the same land at the same time. That is to say you and I cannot occupy the same exact place on this earth... It's physically impossible. \n\nAgain, this is not subject to opinion. It's what is called a 'fact'. You cannot cause two individuals to co-mingle their atoms in order to occupy the same place at the same time because you choose to believe that it is not a big deal. \n\n Thats all well and good, but it doesn't solve a dispute I'm having with my neighbor. If my neighbor and I are fighting over a piece of land, it provides nothing to the argument that I say \"it's a scare resource, therefore it's mine!'. Property is defined by labor, not scarcity. therefore when I argue with my neighbor, I explain that I labored over this piece of land, therefore it belongs to me rather than him.\n\nNow what I believe you're doing is trying **to limit** what is property and what is not. Hopefully you agree that labor is what bestows ownership of property. you just want to establish some ground rules. For example, there can be infinite numbers of opinions, ideas, movies, stories, majestic views, company names or reputations, therefore nobody can \"own\" these infinitely available things. Do I have that correct?\n\nThe problem I have with this is that it still doesn't help us in a society. Sure both of us can use the name natermer, because there can be an infinite number of iterations of that name, but it can lead to difficulties in society. If someone charges that natermer has committed a crime, I could be damaged as a result of what you did (assuming we share the same name). So while you're right that we all have the right to use the same name, there are implications beyond that one point alone. You wish to lay an ownership claim against that name, because it has direct impact on how you relate to society. what is the limit on things you can apply labor to make something yours? i would hope that it does not include other people's property I would say that yes it does include other peoples property. It's for this reason that if you write a song and I copy it, I am now the owner of that song. This doesn't negate the fact that you created it originally, the act of copying has instilled a minor degree of labor into it, thus making it your labor mixed with my labor. Assuming that you don't challenge my ownership claim, I have more labor in that copy than my neighbor. if you, me and my neighbor are in an ownership dispute, the you have first claim, I have second claim and my neighbor (with no labor invested) has last claim. This might sound odd, but a theft that steals something does have a greater right to what he steals than a theft that never stole it.\n\nHow would that apply to something physical? Lets say you make a wooden chair and I smash it apart to make toothpicks. Your labor is mixed with mine in the toothpicks. However you have the superior position of ownership, because you have more labor and/or have the initial labor position. For it to have been legitimate I should have first bought your labor out of the wooden chair. what if i merely inherited a slab of marble, and you come along and make it into a statue, do you then get to claim the statue is yours because you put more labor into it than i did and you get to take it now? I don't. What is scare is really a matter of opinion. For example, I don't consider land a scare resource, since there is plenty for all of us. By this reasoning, land could never be property.\n\nI subscribe to the principle of homesteading. Labor creates property. It doesn't matter if I create one such thing (i.e. scarce) or a million such things (i.e. plentiful) they all belong to me. A scarce item is something that can't be used by everyone at the same time.  So for example, land isn't uniform and as such, different land counts as different goods.  The land that you've homesteaded is scarce because it can only be used in a certain number of ways for a certain number of people.  As such, property rights are necessary in order to decide how that land will be used.  An idea isn't scarce and as such, property rights aren't needed to choose who is the sole owner of that idea.  Labor isn't sufficient to warrant property.  The principle of homesteading dictates that it's labor mixed with *land* that creates property. &gt;A scarce item is something that can't be used by everyone at the same time.  \n\nSuch things are rivalrous, not scarce.  They are rivalrous *because* they are scarce. If you don't believe me, try giving me an example of a good that is non-scarce but also rivalrous.  So you could have an infinite supply, just as long as each unit can only be used by one person at a time. that doesn't sound scare to me. \n\n&gt; If you don't believe me, try giving me an example of a good that is non-scarce but also rivalrous. \n\nSpace. You and I can't occupy the same space at the same time, yet space is infinite. Physical standing space is scarce. Space as in outer space is not a good.  They are rivalrous *because* they are scarce. If you don't believe me, try giving me an example of a good that is non-scarce but also rivalrous.  Water is, in general, rivalrous but not scarce.  It is not even an economic good insofar as no allocation is necessary for it's future use by the actor or anyone else. As soon as someone values it as an actual good, like drinking water, then it *is* scarce. \n\nThe water I assume you are talking about that is \"non-scarce\" is the water nobody values as an economic good. The water that is valued as a good, is scarce.\n\n&gt; If the means are in *unlimited abundance*, then they need not serve as the object of at­tention of any human action. For example, air in most situations is in unlimited abundance. It is therefore not a means and is not employed as a means to the fulfillment of ends. It need not be al­located, as time is, to the satisfaction of the more important ends, since it is sufficiently abundant for all human requirements. Air, then, though indispensable, is not a means, but a general condi­tion of human action and human welfare. - [MES](http://mises.org/rothbard/mes/chap1a.asp#1._The_Concept_of_Action_)\n\nWater does not fall into the category of unlimited abundance. Drinking water, shower water, toilet water, etc. are all scarce goods that must be allocated (i.e. economized).  A scarce item is something that can't be used by everyone at the same time.  So for example, land isn't uniform and as such, different land counts as different goods.  The land that you've homesteaded is scarce because it can only be used in a certain number of ways for a certain number of people.  As such, property rights are necessary in order to decide how that land will be used.  An idea isn't scarce and as such, property rights aren't needed to choose who is the sole owner of that idea.  Labor isn't sufficient to warrant property.  The principle of homesteading dictates that it's labor mixed with *land* that creates property. &gt; As such, property rights are necessary in order to decide how that land will be used. \n\nAuthorship of a story has just as much random variation as land does. there is just as much chance as two people writing the exact same story as there is of finding two pieces of land that have the same contour and climate. \n\nSo by your logic here, since the same story can't possible have two separate, yet equal authors (i.e. one is plagiarizing the other), we must apply the same idea of property rights. \n\n&gt; The principle of homesteading dictates that it's labor mixed with land that creates property.\n\nWhy must there be \"land\"? What if I have a piece of metal and I shape it into a ring, are you redefining \"land\" to include metal or don't I actually own that ring? I think what you mean to say is that only material things can be owned. \n\nBe careful what you wish for though, because if nothing immaterial can be exclusive to any singlre person, then names and reputation (both immaterial) can be freely interchanged with others. Today I think I'll be wshanahan, since you have no right to exclusive use of that name. You're straw manning me pretty hard here. I'm not talking about the creation of ideas, only the \"ownership.\" When you buy and read a book you now \"own\" the information in that book, as does everyone who's read the book. Even if you sign a contract when you purchase the book (which I never have) that stipulates you won't share these ideas no other third party has.  All it takes is one violator of the contract for everyone in the world to have access to those ideas.   In terms of the ring, that's the result of land and labor.  All resources and goods are the result of land and labor.  The ring came from land. It came from the minerals of the earth.  So that's a nonsensical argument.  I don't own my name. There's dozens of Will Shanahans out there.  But there is only one of me.  I'm a scarce resource. So you can use my name and my ideas that I've put out there but you can't claim to be me (my person) because I'm a scarce good and your damaging my reputation (also scarce as I only have one).  Just because ideas aren't property doesn't mean fraud doesn't exist.  I don't see how one could arrive at that conclusion.   &gt; All it takes is one violator of the contract for everyone in the world to have access to those ideas.\n\nI don't dispute this. All that proves is that contracts are not a good way to enforce IP rights. \n\n&gt; Just because ideas aren't property doesn't mean fraud doesn't exist\n\nOK, so you agree that by selling a story or a book you stole from someone else would be fraud? After all, if you wrongly aquired a piece of property, you have no right to sell or even give away that property do you?\n\njust to clarify. If I steal your car, can I sell it to someone else legitimately? As far as the buyer is concerned, he's assuming that I am the legitimate owner and have a right to sell the car. If I never truly had that right, isn't this fraud? \n\nNow lets say that I tell the buyer that the car is stolen. He 100% knows that there was not a legitimate chain of ownership from you to him. Can he then legitimately give it as a gift to some else for free? Hasn't fraud been occurring all along the chain of ownership and you still maintain the sole right to own that car? A car is property. A car is property. I support IP rights. I don't agree with any involuntary state issued laws, but I see nothing wrong with voluntarily agreed upon IP laws. \n\nIP rights are really no different in my mind than any other property rights. We (or at least my) aim is to respect the labor of others. If you labor over something, it gives you rights over that creation. \n\nI think the key to understanding property (physical or intellectual) rights is to separate the enforcement part from the ownership part. It doesn't matter how property rights are enforced, we can still recognize that someone that has invested labor into something has a claim of ownership. It's arbitrary to suggest that some things can be property and other things can't be. \n\nI mean who decides what this list is? Things that are red are property and things that are blue are not property! Thats arbitrary. [Our measure of property should be based solely on labor.](http://en.wikipedia.org/wiki/Labor_theory_of_property) to me property rights is a system we use to answer the question \"who gets to use what rivalrous resources\" rivalrous meaning that using it denies some1 else being able to use it at the same time, ideas do not fit this category so i see no reason for there to be Intellectual Monopoly laws other than the reasons for their conception a few hundred years ago, to stifle competition ~~from~~edit:of the big publishing companies IIRC I support IP rights. I don't agree with any involuntary state issued laws, but I see nothing wrong with voluntarily agreed upon IP laws. \n\nIP rights are really no different in my mind than any other property rights. We (or at least my) aim is to respect the labor of others. If you labor over something, it gives you rights over that creation. \n\nI think the key to understanding property (physical or intellectual) rights is to separate the enforcement part from the ownership part. It doesn't matter how property rights are enforced, we can still recognize that someone that has invested labor into something has a claim of ownership. It's arbitrary to suggest that some things can be property and other things can't be. \n\nI mean who decides what this list is? Things that are red are property and things that are blue are not property! Thats arbitrary. [Our measure of property should be based solely on labor.](http://en.wikipedia.org/wiki/Labor_theory_of_property) to put it bluntly, labor by itself is not sufficient to justify ownership in something What else is required to be input for an ownership claim? Lets say that I craft something, what must I input other than my labor to ensure something is recognized as belonging to me and nobody else? labor cannot transfer ownership from one party to another, if i rightfully own a slab of marble, and you come along and make that into a statue without my permission, the statue does not become yours because you put labor into it\n\ni suppose you might mean that you use labor for anything currently unclaimed &gt; the statue does not become yours because you put labor into it\n\nI agree, we each have a component of labor in that material. We'll have to look to other principles to determine who best deserves exclusive control within our community of the resulting object. For example, since you weren't guarding the slab of marble, I would argue you abandoned your portion of labor and therefore any claim of ownership. now your being ridiculous, if i steal something, you must not have been guarding it well enough so you forfeit your claim is what i'm hearing\n\nthat is absurd If the owner isn't responsible for guarding his property, then who is? the owner is responsible for guarding his property and/or hiring some1 to, however that does not mean that if a thief manages to steal something that it rightfully becomes the thief's because the owner obviously didn't guard well enough I support IP rights. I don't agree with any involuntary state issued laws, but I see nothing wrong with voluntarily agreed upon IP laws. \n\nIP rights are really no different in my mind than any other property rights. We (or at least my) aim is to respect the labor of others. If you labor over something, it gives you rights over that creation. \n\nI think the key to understanding property (physical or intellectual) rights is to separate the enforcement part from the ownership part. It doesn't matter how property rights are enforced, we can still recognize that someone that has invested labor into something has a claim of ownership. It's arbitrary to suggest that some things can be property and other things can't be. \n\nI mean who decides what this list is? Things that are red are property and things that are blue are not property! Thats arbitrary. [Our measure of property should be based solely on labor.](http://en.wikipedia.org/wiki/Labor_theory_of_property) &gt;but I see nothing wrong with voluntarily agreed upon IP laws.\n\nI don't think anyone here would.\n\n&gt;If you labor over something, it gives you rights over that creation.\n\nonly if unanimously voluntarily agreed to unanimously* &gt; I don't think anyone here would.\n\nyet someone downvoted you (not me obviously). I would say therefore at least one person disagrees with you.\n\n&gt; only if unanimously voluntarily agreed to unanimously*\n\nnot sure what you mean exactly. If you mean that the rest of the community must recognize your right to own, then I can see your point. However along with ownership is responsibility. It's the owners responsibility to defnd what he owns and if he doesn't, then it's abandoned.\n\n &gt;I would say therefore at least one person disagrees with you.\n\nI pick up people who go to my user page and downvote all my comments from time to time. I wouldn't read too much into it; I doubt there would be many people in here who would disagree with voluntarily agreed upon laws for intellectual property.\n\n&gt;not sure what you mean exactly.\n\nThe \"voluntary\" laws must be unamimously agreed to. Anyone who doesn't agrees wouldn't be subject to the IP laws.  Copying being theft strikes me as a not overly constructive semantic argument.  While I don't believe copying is theft, it seems like the line of argument deals with language, interpretation, and definitions.  I can't think of any \"universally accepted truth\" that comes into play when it comes to those.  See this piece from Less wrong: [Disputing Definitions](http://lesswrong.com/lw/np/disputing_definitions/) - Eliezer_Yudkowsky\n\nIf you want to get into \"widely\" accepted definitions and understandings concerning anarcho-capitalism I believe it really isn't a question of if copying is theft. The more important question would be whether or not copying constitutes aggression.   &gt; *\"Copying being theft strikes me as a not overly constructive semantic argument. \"*\n\nStrongly agreed.  Here's a highly relevant article I wrote on the subject:\n\n*[\"Intellectual Property: Piracy vs Theft\" - JamesCarlin](http://jamescarlin.wikidot.com/intellectual-property:piracy-vs-theft)*\n\nI'll add that less-wrong article you linked to the bottom as a \"related article\" What do you think will be the result of this pro-IP vs. anti-IP argument? I really don't feel like arguing against intellectual property, but in a free society, if the argument is not resolved, how do you think this will play out? &gt; *\"What do you think will be the result of this pro-IP vs. anti-IP argument? \"*\n\nThe debate does nothing.\n\nWhat do people do?  Today, the debate encourages several AnCaps engaging in piracy and/or activtely working to undermine copy-protections of intangible owners, believing they're engaging in some form of activism.\n\nBeyond that, long term, the debate itself is huge distraction, and a massive waste of time and resources. I mean in the context of litigation in a free society. The debate itself is really unimportant at the moment, we've got a whole lot of time to figure it out before we get a free society, and we've got more important things to worry about, but do you think that this will create a sort of minor societal divide, where two societies emerge, one that ostracizes pirates, and one that doesn't? Lets say there are 4 panarchist societies:\n\n1.  IP is enforced and protected significantly \"stronger\" and \"broader\" than today, to a dogmatic level.\n2.  Intangible property is recognized, and persons have the option to enforce it through tort, blacklisting, and in the worst cases (i.e. a large piracy website) direct force.\n3.  Intangilble property is recognized,  and piracy is considered \"unethical\" - though enforcement is weak.\n4.  Intangible property of all types receives no recognition at all, to a dogmatic level.\n\n#1 and #4 will \"fail\" due to being far less wealthy and far more problematic..  #2 Will thrive, though much of 'enforcement' IP will rely on a \"good lock\" (i.e. DRM) and convincing persons to voluntarily not pirate.  #3 will \"survive\" but have far more difficulty encouraging trade, investment, and production of intangibles wealth.\n\n^ My predictions anyway.\n\n---\n\nThough I suspect that won't be very interesting or relevant 100 years from now, as property concept evolve and adapt to various advancements in technology and the 'human' *(intelligent actors)* condition.  As an AnCap I still haven't made up my mind on IP laws or what they would look like in libertopia. My best guess is private agreements between individuals not to do *x* with a given piece of information.  \n\ne.g. I promise not to make copies of your software, or else I agree to pay you a fee for breaking this agreement.\n\nor\n\nI will not sell my used copy of this game, or else I agree you can lock down my PS8 Trademarks are also a form of IP and they work without enforcement by the government. For example, if I sell cows branded with my trademark, and someone else comes along and starts selling cows with the same trademark as me, I will let everyone know that there's an impostor selling cows with my trademark. It works because both me and my customers who buy from me have an incentive to have only one person using my trademark. You're right that both you and the customer value the trademark, but I don't see how that stops the imposter. If every time I go to buy your cows it's a 50-50 guessing game of whether I'm getting your quality cows or the imposter's diseased-ridden ones, I'm going to just stop trusting your trademark altogether. I'd rather go with the slightly-lesser quality cow-producer which has better managed to enforce its trademark.\n\nThe imposter is there to milk (cow joke, come on) your reputation for all it's worth until it is worthless. You'll never stop something like that completely, but to just stand by while it happens seems absurd. To me, it seems like an easy candidate for enforcement by DROs. Both the customer and the producer value the trademark, so it seems like they would both be willing to pay for trademark enforcement. You're right that both you and the customer value the trademark, but I don't see how that stops the imposter. If every time I go to buy your cows it's a 50-50 guessing game of whether I'm getting your quality cows or the imposter's diseased-ridden ones, I'm going to just stop trusting your trademark altogether. I'd rather go with the slightly-lesser quality cow-producer which has better managed to enforce its trademark.\n\nThe imposter is there to milk (cow joke, come on) your reputation for all it's worth until it is worthless. You'll never stop something like that completely, but to just stand by while it happens seems absurd. To me, it seems like an easy candidate for enforcement by DROs. Both the customer and the producer value the trademark, so it seems like they would both be willing to pay for trademark enforcement. My best guess is private agreements between individuals not to do *x* with a given piece of information.  \n\ne.g. I promise not to make copies of your software, or else I agree to pay you a fee for breaking this agreement.\n\nor\n\nI will not sell my used copy of this game, or else I agree you can lock down my PS8 A person that does not sign the agreement has no such obligation. So if I buy an iPhone Ancap Edition, I can't reverse engineer it, but if I leave it at my friend's semiconductor business, there's nothing stopping him from doing so.\n\nYou can limit what your customers can do with your product, but no one else, which makes this form of IP protection useless.\n\nI see people looking to limit duplication deliberately obfuscating their designs with mislabeled components or completely integrated designs and perhaps even cases which self-destruct (perhaps not explode) if they are opened. Exactly.  One can't make a contract binding to an unwilling 3rd party. Unless we're talking about your unilateral right to exclude unwilling third parties from the use of your property, right? How is that a contract? If its not a contract, then what is it? A contract is an agreement having a lawful object entered into voluntarily by two or more parties, each of whom intends to create one or more legal obligations between or among them. The elements of a contract are \"offer\" and \"acceptance\" by \"competent persons\" having legal capacity who exchange \"consideration\" to create \"mutuality of obligation.\" Okay but what gives rise to \"your unilateral right to exclude unwilling third parties from the use of your property,\" if not a contract? As an AnCap I still haven't made up my mind on IP laws or what they would look like in libertopia. In an anarcho-capitalist society, there could be laws enforcing IP. However, it would be under-enforced, as it is more costly to enforce IP than it is to ignore IP law. Thus, I could see small scale IP laws enforcing trade secrets, local trademarks, maybe even some published works in a relatively small community. However, any large scale attempt to enforce an \"across-the-board\" copyright or patent law would be extremely unstable, and probably would not exist for too long, if it existed at all. Even with things like Google &amp; Apple's app stores, it may be in their best interest to enforce some form of intangible property and take down infringing content.     Do you think more than 51% of people want courts that enforce some form of ip? does a majority percentage matter?  I thought we were against democracy as it is mob rule. Well thats how consumer demand works I don't make the rules. Are you going to pay for  a dro that will attempt to enforce your patents and copyrights?  Ip don't real. And any Dro that enforces patents are initiating aggression and violating the NAP. No shit, but you still aren't getting it. What if the number of dros that did enforce ip was greater than the number that didn't recognize it? The non recognizers would be considered the rogues. When all functions of  a taxless entity become decentralized, democracy(the tyranny of the 51%) rears its ugly head in the form of consumer demand. \n\n\nSo are there more people who don't like taxes but still want patents\n\nthan there are people who don't like taxes or patents? Just because the 51% demand it doesn't mean the other 49% demand disappears and there would be dros for both sides.  But it still doesn't change the fact that enforcing it is un libertarian.       ",
    "url" : "http://www.youtube.com/watch?v=IeTybKL1pM4"
  }, {
    "id" : 1,
    "title" : "Linking this only so we can all laugh at the chronic nekkidness of this man.",
    "snippet" : "   I mostly jest; &lt;3 whatever your real name is, bro.  Did you just get out of the shower? I mostly jest; &lt;3 whatever your real name is, bro.  Did you just get out of the shower? In one of his videos he said he doesn't really use reddit. He's been coming around here a bit recently, however. u/lengthyounarther One may not want to look through his comment history if one is at work... if that's not the truth. The man has two passions... Wow... Wow... One may not want to look through his comment history if one is at work... My lord, what the fuck. I'll never look at him the same. One may not want to look through his comment history if one is at work...",
    "url" : "http://www.youtube.com/watch?v=B5ddA2jW4K8"
  }, {
    "id" : 2,
    "title" : " I know Milton Friedman catches a lot of criticism here for his monetarist views but in this video he states that he's always been in favor abolishing the Federal Reserve.",
    "snippet" : "  Also worth pointing out that you don't have to be an austrian if you are an anarcho-capitalist. Case and point- Friedman's son, Friedman. And *his* son.  Case and point- Friedman's son, Friedman. In what way does David Friedman disagree with Austrian economics? I know he tends to identify more with the Chicago school, but his proposed anarcho-capitalist society (as in The Machinery of Freedom) seems to align pretty well with Austrian economics. ~~Economic schools do not refer to which policies you prefer, they refer to your economic philosophy. (How you think knowledge about economics is gained.)~~\n\nHere's super brief and highly inadequate summary:\n\n- Mainstream economists believe in using the scientific method to understand economic activity. These economists observe economic activity and then use those observations to build mathematical models of economic events. Once models can be used to describe historical phenomena, economists then use them to try and extend current trends into the future. When models don't work, economists must revisit their assumptions and revise their work.\n\n- Austrian economists essentially think that economic events are irreversibly complex (*this may be a misrepresentation, those who know about Austrian economics should feel free to correct me*), and they don't believe that mathematical models will ever be able to capture the nature of economic activity. The Austrian alternative to a scientific economic approach is to examine humans on an individual basis and try to logically deduce how economic patters aggregate up from this individual level to macroeconomic trends.\n\nSo at the end of the day, you can (*theoretically*) have a mainstream economist and an Austrian economist who believe the exact same things about government; the difference is how they think we should develop our knowledge about economics. But monetarism is, by definition, also a policy advocation. The same goes for some of the fundamental parts of Keynesianism. Some aspects of economic theory are independent from policy advocation, but not all.  In what way does David Friedman disagree with Austrian economics? I know he tends to identify more with the Chicago school, but his proposed anarcho-capitalist society (as in The Machinery of Freedom) seems to align pretty well with Austrian economics. He's a monetarist. The policies might be the same but he doesn't adhere to the axiomatic fundamentals of the Austrian school. I guess I don't quite understand what it means to be a monetarist when his most well-known works are proposing a stateless society with polycentric law. You can't really be a monetarist without also advocating for the existence of governments, right?  Friedman is nearly the most influential economist of the 20th century *and* a rabid capitalist. If this subreddit can't count him as a friend then you guys just don't want to get anywhere.  That's some collectivist language you've got going on there.\n\nJust because I criticize  a person's view on certain subjects doesn't mean I don't view them as an ally or a friend.  I agree with both of you here. It is very much okay to criticize some of someone's beliefs, but I agree with him as well. There are many people here that only see things in black and white and if they disagree with one thing that means that the person in question is labelled an enemy of Ancaps  What do you mean by many? I'd like to see \"many\" examples of people being labeled and enemy of ancaps because of disagreement on one issue. The closest example that I can think of was the [spanking spat](http://www.reddit.com/r/Anarcho_Capitalism/comments/unppb/why_not_get_rid_of_the_downvote_button/c4x1rbz) about eight months ago that resulted in the creation of /r/AgainstAllArchons. It doesn't seem like there's that \"many\" people still segregating themselves over there. \n\nThere are individuals that I think are way too liberal labeling people \"troll\", but I have never seen it over one issue.  Friedman is nearly the most influential economist of the 20th century *and* a rabid capitalist. If this subreddit can't count him as a friend then you guys just don't want to get anywhere.   Friedman turned me from a conservative to a libertarian and Hayek from a libertarian to an anarchist.  I pay tribute to those who taught me, even if I think I pushed the rock a little further than them ideologically.\n\nFriedman [wasn't actually as opposed to anarcho-capitalism as people might believe](https://www.youtube.com/watch?v=S4CcannofnY&amp;t=2m47s).  He doubted it, but was not categorically-opposed to it, a quite different objection from the one Rand took.  If Milton found himself in such an order, he wouldn't be advocating for minarchy.  Abolition of Fed alone is not that interesting just like fall of government by itself is not interesting. More important question is what was he planning to replace it with.",
    "url" : "http://youtu.be/UlNxIc9gUMc?t=4m33s"
  }, {
    "id" : 3,
    "title" : "Stand Up comedian: How and why to be take in jury duty.",
    "snippet" : "  Doug Stanhope [Deadbeat Hero](https://www.youtube.com/watch?v=iBXL36TOTYo)  I have jury duty in March, needless to say that I can't wait to see the faces of the other jurors when I say 'innocent'.  Is there a way to increase your chances of jury duty? Is there a way to increase your chances of jury duty? Register to vote. Depends on the state. Texas uses different rules \"Each county receives a list of potential jurors from the Secretary of State that consists of those individuals in the county that are registered to vote, hold a Texas driver’s license, or hold a Texas identification card. Citizens on the list are randomly selected and mailed a summons to report for jury service.\"\n\nhttp://www.courts.state.tx.us/tjc/juryinfo/summons.asp Is there a way to increase your chances of jury duty? I think you can go up and volunteer for it, but it might depend on which state you are in.  doesn't a hung jury usually result in a retrial? ",
    "url" : "http://www.youtube.com/watch?v=1k4fYIUuAP8&amp;t=1m20s"
  }, {
    "id" : 4,
    "title" : "Hey Ancaps, Decline to State is looking for some new music for the show. Any suggestions?",
    "snippet" : "By popular demand, we're looking at changing up the music for the show. Lets see what y'all got.  Madeon - Finale Madeon - Finale Madeon - Finale   [Taxman in the Style of \"The Beatles\"](http://www.youtube.com/watch?v=MvtPf_YfOUM)\n\nIt's funny because copyright.  I can write s few things for you for free if you want. You looking for intro/outro stuff? Let me know if you are ever interested. Just need to know what you are going for. If you don't use the stuff i write, i'll use it for something else. It's not like it can't be infinitely reproduced\n ;) That's very generous. Yes, we're looking for intro/outro stuff.\n\nI don't have anything in particular in mind. What do you usually write?  Woohoo!  Does it have to be something properly licensed for public use?   Why did you choose the original music, was there something particularly ancapy about it?  Just wondering if that was something you were particularly concerned with.  Is it better for it to have lyrics/ no lyrics?  Something in the same general sort of genre?  Another electric donkey shock song? Woohoo!  Does it have to be something properly licensed for public use?   Why did you choose the original music, was there something particularly ancapy about it?  Just wondering if that was something you were particularly concerned with.  Is it better for it to have lyrics/ no lyrics?  Something in the same general sort of genre?  Another electric donkey shock song? Donkey, ha - As we were discussing, Porter Robinson is the creator of The State, as a teenager using Rothbard quotes from the mises website. We wanted to pay homage to that fact, using an uptempo tune. For the record, I fucking love the Porter Robinson song you currently use. I had never heard it before, took me a while to figure out what is was, downloaded it and listened to it on repeat for hours that first night.  For the record, I fucking love the Porter Robinson song you currently use. I had never heard it before, took me a while to figure out what is was, downloaded it and listened to it on repeat for hours that first night.  We are gonna try a new intro, however, I just negociated keeping it as the outro but fading before the second built up :-)  When is decline to state going to update the archives?   [Severed Head of State - No Love Lost](http://youtu.be/gIOC3uUxXCs)  I like what it is now. Please don't screw it up with worse electronic music I like what it is now. Please don't screw it up with worse electronic music  https://www.youtube.com/watch?v=38K9X5PMLRU",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18oe78/hey_ancaps_decline_to_state_is_looking_for_some/"
  }, {
    "id" : 5,
    "title" : "Material on the rollback of the New Deal and WWII rationing policies?",
    "snippet" : "Does anyone know some books and articles to read from an Austrian perspective about the rollback of the New Deal and the demilitarization of the US following the end of WWII? I'd like more detailed material to use to refute the notion that WWII ended the Great Depression.  Robert Higgs is the man on this one. If you cannot get your hands on his [*Depression, War, and Cold War: Studies in Political Economy*](http://www.amazon.com/gp/aw/d/0195182928/ref=redir_mdp_mobile/181-0628126-8896707) (or even if you do), definitely read [\"Regime Uncertainty: Why the Great Depression Lasted So Long and Why Prosperity Resumed after the War\"](http://www.independent.org/publications/tir/article.asp?a=430) and  [\"Wartime Prosperity? A Reassessment of the U.S. Economy in the 1940s\"](http://www.independent.org/newsroom/article.asp?id=138). Thank you!",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ol4h/material_on_the_rollback_of_the_new_deal_and_wwii/"
  }, {
    "id" : 6,
    "title" : "Cool view of the bitcoin economy in real time, I found it rather inspiring (found on r/bitcoin)",
    "snippet" : "  nothing? nothing?",
    "url" : "http://blockchain.info/unconfirmed-transaction"
  }, {
    "id" : 7,
    "title" : "Bill Burr on politics and voting. Damn funny",
    "snippet" : "  The end isn't funny. You didn't like the straight forward truth? Isn't it interesting that he can be so right on something and yet you'll turn on him the next moment. Perhaps, just perhaps, he's right and you haven't realized it yet? Perhaps I was referring to the mocking of my name? damn, sorry! I didn't catch the reference. :) You didn't like the straight forward truth? Isn't it interesting that he can be so right on something and yet you'll turn on him the next moment. Perhaps, just perhaps, he's right and you haven't realized it yet? Well, he's not right though. Stealing requires the property, IP in this case, to out of the original property holders possession. Which it isn't. \n\nRegardless of how you think of it being right or wrong it's not stealing, it's copying.  Sure it's copying, but it is directly depriving of him any of the rewards of his labor. Without his labor, you would have nothing to copy. By this logic, it's also wrong to borrow books or comics, videos, video games, use the library's services, listen to the radio or your friend's iPod, etc. Borrowing books doesn't create new copies though. One person has it and the other doesn't. You might as well be saying that loaning out a wrench, screwdriver or other tools has the same effect as well.\n\nThe point is that we respect the labor of others. It's one thing to write a story that is similar to another, maybe just changing the names. It's plagiarism if you directly copy every last word.\n\n Let's take your example of a wrench.  Say we get to the point where 3-d printing is super advanced and super cheap - would it be stealing someone's labor to scan a screwdriver and print an exact copy of it? Let's take your example of a wrench.  Say we get to the point where 3-d printing is super advanced and super cheap - would it be stealing someone's labor to scan a screwdriver and print an exact copy of it? Interesting example. I would say no it's not a crime to copy the wrench. The reason being is that the person selling the wrench has no expectation of this. \n\nStill you have a point, if we have no society and we're all individuals without connection to one another, then there is no expectation of anything. I can drive on the left side of the road and if we get into an accident, any arbitrator would have no basis to declare which one of us is at fault. He can't look at the general expectation of how society functions, because our premise is that there is no society.\n\nIf we have no society and an arbitrator has no basis with which to decide if copying a writers work is acceptable, then you're right, there can not be any theft. \n\nThis same dilemma though applies to just about everything though. If you leave your car unattended on someone elses property (or unowned wilderness), then you can't complain that someone else took it from you, you've basically abandoned it. there is no societal norm that unoccupied vehicles are presumed to be owned. Same goes for houses, leave your house to goto the store, then how is everyone supposed to know that you didn't simply die and never returned? \n\nMy point is that we have a society that has generally understood behavior. We presume an unowned car in front of a store is owned by someone in that store. An unoccupied house is assumed owned, unless the neighbors agree they haven't seen you in a reasonable amount of time. In addition, we consider plagiarism wrong. Also, I'm sorry you're getting down voted for no obvious reason other than disagreeing. Borrowing books doesn't create new copies though. One person has it and the other doesn't. You might as well be saying that loaning out a wrench, screwdriver or other tools has the same effect as well.\n\nThe point is that we respect the labor of others. It's one thing to write a story that is similar to another, maybe just changing the names. It's plagiarism if you directly copy every last word.\n\n &gt;Borrowing books doesn't create new copies though.\n\nSo what? So your definition of theft is? Theft requires that you dispossess property from the owner. At least \"theft\" in the legal sense. Even if you grant that intellectual property is \"property,\" it still doesn't make it theft to copy it.\n\nIf you made a bunch of chairs and sold them as a business and I decided to make a generic chair (ignore any IP) and give them away for free, your chairs are now worthless. I am depriving you of your labor. Am I \"stealing\"?\n\n&gt;It's one thing to write a story that is similar to another, maybe just changing the names.\n\nIt's one thing to exclude the rightful owner from his possession of an item, it's another thing to make an exact copy of it. Right?\n\n&gt;The point is that we respect the labor of others.\n\nYou don't respect the labor of others when you borrow a tool instead of purchasing a new one from the creator of the tool.\n\n&gt;It's plagiarism if you directly copy every last word.\n\nNo it's not. You can copy every word verbatim and you have not committed \"plagiarism.\" The plagiarism is when you pretend you created those words. &gt; If you made a bunch of chairs and sold them as a business and I decided to make a generic chair (ignore any IP) and give them away for free, your chairs are now worthless. I am depriving you of your labor. Am I \"stealing\"?\n\nIt's hard to make analogies and I usually give the benefit of the doubt, but this one didn't work. Thats like saying that if I write a story to sell and you write a totally different story, then my story is worthless.\n\nHowever I believe your ultimate point is that writing and IP has no value to anyone, since it can be shared easily. I think this assumes that we are all smart enough to develop, share and express thoughts equally. Haven't you ever met a good story-teller? try to repeat the same story yourself and it doesn't quite come out the same. You might think that there is no difference in the labor that went into telling that story, but I would much prefer the good story-teller relaying the story than you (no offense).\n\n&gt; It's one thing to exclude the rightful owner from his possession of an item, it's another thing to make an exact copy of it. Right?\n\nI'm not sure what you're driving at. My argument here is focused upon the labor of people and how we should respect each others efforts. The \"rightful owner\" is the person that labors over something. Don't you agree? \n\n&gt; You don't respect the labor of others when you borrow a tool instead of purchasing a new one from the creator of the tool.\n\nHow so? The creator has no expectation of what you're suggesting.\n\n&gt; No it's not. You can copy every word verbatim and you have not committed \"plagiarism.\" The plagiarism is when you pretend you created those words.\n\nIf i borrow a wrench from you and then someone else asks to borrow the wrench from me, yet I don't tell the new requester that it's not mine to loan, have I done anything wrong?\n\nPeople that copy IP and then start to sell it are giving others the appearance that they created the material and are the rightful owner. &gt;Thats like saying that if I write a story to sell and you write a totally different story, then my story is worthless.\n\nSure, substitute goods can also render what you have worthless. That's the point of the analogy. It's a great analogy to communicate the idea that reducing the value of another's property or even rendering it worthless doesn't mean you are stealing or \"not respecting\" another's labor.\n\n&gt;However I believe your ultimate point is that writing and IP has no value to anyone\n\nNo, that wasn't my ultimate point at all. Some intellectual property is very valuable (sometimes *because* it can be shared), but that doesn't mean copying it is theft and it doesn't mean the reduction in value is \"stealing\" something.\n\n&gt;My argument here is focused upon the labor of people and how we should respect each others efforts.\n\nI understand your sentence, the point of my comment is to show how it's flawed. Your statement doesn't actually make an argument, it merely reasserts your conclusion. \n\nWe are not respecting the labor of someone when we do anything that reduces its value, but that doesn't mean we are doing anything wrong, bad, or aggressive.\n\n&gt;If i borrow a wrench from you and then someone else asks to borrow the wrench from me, yet I don't tell the new requester that it's not mine to loan, have I done anything wrong?\n\nI don't understand how this is relevant to the thread. My point is that you are reducing the value of the person who made the wrench by sharing it instead of forcing someone to buy a wrench if they need a wrench.\n\n&gt;People that copy IP and then start to sell it are giving others the appearance that they created the material and are the rightful owner.\n\nNo, they're not and I didn't write \"sell.\" You wrote, \"It's plagiarism if you directly copy every last word.\" which is simply wrong.\n\nThey're not implying or giving the appearance they created the material at all, they're merely copying it and distributing it. If this ever does happen, it's exceedingly rare. To make the assertion that someone sharing Ironman 2 on the pirate bay are giving others the appearance that they created it is completely nonsensical. People selling ripped dvd's on the street are not giving the appearance that they are the rightful owners of the goods. You have to add in some other act to make this a reasonable claim which is why my distinction is important.\n\nCopying is not plagiarism; they're not synonyms. Well, he's not right though. Stealing requires the property, IP in this case, to out of the original property holders possession. Which it isn't. \n\nRegardless of how you think of it being right or wrong it's not stealing, it's copying.  If you enjoyed it, and it cost him to make it, and he made it so it could be sold, and you didn't pay for it, you stole. you have disturbing definition of \"stealing\", sir. I know i'm in AC, but you guys are whack on your definitions.  I bet you think that people that write books don't deserve to get reimbursed for their time. No one deserves anything. I take 3 hours to produce a poop, do I deserved money for poop now? You try to appeal to emotion instead of using rational argument. No one deserves anything. I take 3 hours to produce a poop, do I deserved money for poop now? You try to appeal to emotion instead of using rational argument. Your poop didn't take years to perfect.  Anyone can poop.  You can't get on stage and be funny.  It takes years to craft.  That's not an emotional argument, that's a reality.  Your value is derived from your specialty.  \n\n\nPeople DO deserve things.  If you become a brain surgeon, does that person not deserve what the economy values them at?   &gt;Anyone can poop.\n\nNo one poops like him, bro; I seens it. Your poop didn't take years to perfect.  Anyone can poop.  You can't get on stage and be funny.  It takes years to craft.  That's not an emotional argument, that's a reality.  Your value is derived from your specialty.  \n\n\nPeople DO deserve things.  If you become a brain surgeon, does that person not deserve what the economy values them at?   I know i'm in AC, but you guys are whack on your definitions.  I bet you think that people that write books don't deserve to get reimbursed for their time. I know i'm in AC, but you guys are whack on your definitions.  I bet you think that people that write books don't deserve to get reimbursed for their time. If you made a bunch of chairs and sold them as a business and I decided to make a generic chair (ignore any IP) and give them away for free, your chairs are now worthless. I am depriving you of your labor. Am I \"stealing\"? So because it costs nothing to copy a standup video, you have rationalized that the comedian doesn't deserve payment?  \n\nBack to your scenario, competition is competition, and market bears the price people are willing to pay.  If you offer a comparable chair at a lower price the market will swing that way, but you aren't going to be able to continue offering free chairs in the long run, and you'll be out of business.  What's your point?  Are you stealing? No, but you sure aren't getting anywhere.  So in this scenario, your theory is if it can cost nothing it should, and it isn't stealing because the copy didn't cost anything.  How do you expect innovation if the originators can't collect anything? No, actually, that's not what I wrote at all.\n\n&gt;Are you stealing? No, but you sure aren't getting anywhere.\n\nThat's sort of the point. It's not stealing because nothing is dispossessed. The only thing \"taken\" is future profits, but we have just determined \"future profits\" are not guaranteed or deserved.\n\nI think it's competition.\n\n&gt;your theory is if it can cost nothing it should\n\nNo, that isn't my theory. I think as time goes to infinity, the price will go to marginal cost.\n\n&gt;How do you expect innovation if the originators can't collect anything?\n\nYou made quite a jump from me not thinking copying was stealing to me prohibiting originators from collecting anything. There are advantages to being the originator of something even if you don't claim a monopoly on it (for example first mover advantage). Why do people still buy name-brand pharmaceuticals? If you enjoyed it, and it cost him to make it, and he made it so it could be sold, and you didn't pay for it, you stole. So Bill Burr no longer owns a version of the work of art? Because typically when I steal something I possess it and the other person doesn't. It's not a work of art.  It's a product.  You viewed the product, you enjoyed it and you don't think he deserves reimbursement for his time? I'm not arguing whether or not one should pay for something that is easily duplicable. My point is that copying digital files is copying, not stealing. For theft to occur, one must lose something.  Would you agree that there is a dilution of profits when there is a copy made?  \n\nI'm just being philosophical here, I don't really care if you copy shit, I just like comedians. No, because businesses or individuals aren't entitled to profits. They must earn them by providing value to the customer. If the customer doesn't see the value in the product, the creator doesn't deserve their money. So Bill Burr no longer owns a version of the work of art? Because typically when I steal something I possess it and the other person doesn't. OK, so if you homestead a piece of land, but I remove anything that accumulates on that land (i.e. copyied leaves or dirt), then it's not stealing? Your claim is that you only own something at the moment of creation and none of the fruits of that property belong to you. I'm confused with your analogy. My claim is that if something is copied from you (as is the case in digital files or ideas) that I had nothing stolen from me. I still own my creation even if someone copied it.\n\nYou deserve the fruits of your work if the consumers see value in it enough to purchase it. But you are not entitled to sales. &gt; I still own my creation even if someone copied it.\n\nHeres my analogy. You walk out to a field, clear it of brush and declare that it's yours now. Hopefully you agree that this has been homesteaded. In the same way if someone makes a chair out of some wood or a writer creates a story, they have used their labor to bring something new into the world. We look at the work these people did to say \"wow, they put a lot of work into that and it turned out well\".\n\nNow what you're saying is that the only thing that these people have homesteaded is that object at that moment in time. If a tree grows on the cleared land, that tree is new and fresh, so it belongs to nobody. If the chair is broken apart to make a toy wooden train, thats new and fresh, so it's owned by the new creator. The story that is copied is owned by the copier, because he is the one that labored to create it. \n\nWhat you're disrespecting is that the people that came before expended their labor in creating something that we all agreed was good and new. If these previous peoples labor produces fruit, whether it's a new tree, a toy train or a copy of a book, it should be owned (at least in part) through the previous work. If it wasn't for the cleared land, the wooden chair or the original book, the later objects would never have existed. I am obviously not clear with my point. Let me break it down in a little more details.\n\n**Scenario 1**\n\nYou make a guitar. Someone breaks into your house and takes that guitar. You no longer have a guitar and someone else has it. **This is theft**.\n\n**Scenario 2**\n\nYou have a guitar and create a new song. You sit at a campfire and sing this new song to your friend. Your friend learns the new song and now sings it. Your friend has copied your song. You can still sing it and he can still sing it. **This is NOT theft, this is copying**.\n\nWhy is this concept so hard to grasp? If you enjoyed it, and it cost him to make it, and he made it so it could be sold, and you didn't pay for it, you stole. No... it's not... it's still copying... (assuming it's been file-shared or whatever) but it's not stealing because the original owner is still in possession of the property. Did you not read or understand my comment?  \n\nYou're speaking in terms of emotional value. Despite it being wrong that you received something without paying which was intended to provide revenue to the creator it's *not* theft.  Oh, so I suppose he gets magically reimbursed for his time and effort put into making his video. \n\n&gt;Anarcho-capitalists argue for a society based on the voluntary trade of private property and services (in sum, all relationships not caused by threats or violence, including exchanges of money, consumer goods, land, and capital goods) in order to minimize conflict while maximizing individual liberty and prosperity. \n\nHow would you like to study and create something for people to enjoy, and then they enjoy it without reimbursing you.  Explain to me your justification.  What if you spent 10 years making something and then someone 'copied' it and felt they didn't owe you anything.  How would you cope with that? \n\nWhere is the voluntary trade when you copy it?  Where is the prosperity enrichment that BB should receive?  You are unjustly enriched, and you argue that it's not stealing? puhleez\n\nI read your comment, it's copying AND it's stealing. If I had a product that could be copied infinitely for no cost, I'd figure out how to make a product that wasn't copyable. Like like shows, official merchandise, autographs, and the likes.\n\nI would also build a system that made it easy to get versions from me and cater to the emotional aspect of supporting the creator. But if they value it at $0, I can't force them to pay me. \n\nAssuming my works were so great that everyone copied it, I would imagine my limited time would be highly valuable.  So you are pro-drm?  He says it's worth $5.00.  If you don't pay him, you shouldn't watch it.  But you do.  Are you going to pay him?  Why?  He said it was $5.00.  If you didn't want to pay it why did you watch it?\n\nTBH, I think of stand-up videos like advertisements for the real standup.  I saw Louis CK this year, and the plus was I saw his new material before it was in a video.  I get it, I agree, at least with music for sure, the mp3 should be free and you should pay for live.\n I say talking with me on Reddit is worth $10 per post I make, are you going to pay it? Everything I create is copyrighted to me and you are reading it. Value isn't derived from the creator, it's derived from the consumer. \n\nI'm not arguing what prices should be, or the best strategy for making money off creations. My argument is that 1) copying is not theft and 2) value is determined by the purchaser not the creator.  If you enjoyed it, and it cost him to make it, and he made it so it could be sold, and you didn't pay for it, you stole. You didn't like the straight forward truth? Isn't it interesting that he can be so right on something and yet you'll turn on him the next moment. Perhaps, just perhaps, he's right and you haven't realized it yet?  *\"We're all gonna be replaced by robots.\"*\n\nSounds more like Marxism than Anarcho-capitalism.\n\n*\"Downloading music is theft.\"*\n\nYeah, no.\n\nOther than that, yeah, as per usual, Bill Burr is on point. I really recommend his podcast. I listen to it every Wednesday at work. He's great at analyzing things from a deep and impartial level. He tends to shy away from politics citing his ignorance and apathy, but when he does it's accurate and hilarious. He describes himself as pretty socially liberal and fiscally conservative. He's one of those types where I'm sure if he did his research he'd at least be a libertarian. Not even sure if he knows what that means right now though.  He's a funny-ass guy. That special he was plugging is on Netflix and has got to be one of the funniest I've seen in a LONG time. I'm bummed he went right into IP and saying that \"Lars was right\" right after that bit.. I guess you can't win them all! :-/ So are you a fan of Dennis Leary? I still remember when Greg Giraldo got him pretty good [here](http://www.youtube.com/watch?feature=player_detailpage&amp;v=ymltNm4p2VY#t=198s).\n\nRIP Greg Giraldo :( So are you a fan of Dennis Leary? Pretty much my only experience with Leary is Operation Dumbo Drop when I was a kid. I've never actually heard any of his standup before, is it any good? Well, he stole it all from Bill Hicks, just repackaged it. So that would be okay with you? Well, I do love Bill Hicks, so I can't tell if I'd enjoy it, in an homage sense, or hate it for the derivation it is. Pretty much my only experience with Leary is Operation Dumbo Drop when I was a kid. I've never actually heard any of his standup before, is it any good? He's a funny-ass guy. That special he was plugging is on Netflix and has got to be one of the funniest I've seen in a LONG time. I'm bummed he went right into IP and saying that \"Lars was right\" right after that bit.. I guess you can't win them all! :-/ I'm allowed to still love Lars's drumming, right? I'm allowed to still love Lars's drumming, right? Nah, shit's garbage. He doesn't alter dynamics much and he doesn't know how to execute high-tempo and/or sustained double bass to save his life. Even for thrash, I prefer a shit ton of drummers over him (Overkill, Megadeth, Slayer - hell, even the drummer for Confessor, and that's doom). The newer stuff is all completely lame, the same old 'bass and snare alternating on quarters' rock beat with the occasional fill or extra bass or snare thrown in.  Yeah, I don't know shit about it.  I don't even really listen to much metal; 95% of what I listen to is one subgenre or another of electronica. He's a funny-ass guy. That special he was plugging is on Netflix and has got to be one of the funniest I've seen in a LONG time. I'm bummed he went right into IP and saying that \"Lars was right\" right after that bit.. I guess you can't win them all! :-/     Not available in my country :-( Where you at? Australia",
    "url" : "http://www.youtube.com/watch?v=4eLaIBIjpYM#t=1m20s"
  }, {
    "id" : 8,
    "title" : "Dr David Friedman on Triple-V: Voluntary Fractional Reserve Banking, Anarchy, Fiat Currency, …",
    "snippet" : "  ",
    "url" : "http://voluntaryvirtues.com/2013/02/16/dr-david-friedman-on-triple-v-voluntary-fractional-reserve-banking-anarchy-fiat-currency/"
  }, {
    "id" : 9,
    "title" : "School choice, safety, and the documentary \"Bully\"",
    "snippet" : "Hi all,\n\nMy first text post to /ancap. Somewhat long post, so tl;dr: Do you think that the trend of school \"bullying\" and \"safety\" awareness is a strong potential argument for liberty-minded folks to demonstrate the dangers of statism, or to at least advocate for better (market) incentives in the school system? \n\nThat is, typically I think of liberty arguments for change in schools as relating to testing data, school crowding, etc, not the more emotional appeal of \"your kids aren't safe.\"\n\n----\n\nI was watching the documentary \"Bully\" yesterday. For those of you who aren't familiar, the documentary follows a few children who are victims of bullying. It also includes a couple families of children who killed themselves in response to constant bullying. (It was also parodied by SouthPark, who criticized it for not being released for free)\n\nThere are a few scenes where these families and/or their children are addressing school board members, principals, and the school bussing administrator (important because it's a source of constant bullying for the main subject of the documentary).\n\nIn one instance, a bullied kid and the vice principal are having a discussion; the bullied kid is reporting chronic harassment on the bus, especially by a bully named XXXX. The principal says \"If these kids have been bullying you for so long, why didn't you report it?\" The kid says \"I did report it. Last year. I told you that XXXX was forcing my head under the bus seat cushion and sitting on my head. You didn't do anything.\" The principal says \"We did do something. I talked to XXXX. I told him not to sit on your head any more. Did he continue to sit on your head after that?\"\n\nThe bullied kid's parents talk with the school bussing administrator, outraged that this bullying has not been stopped. The mom says \"back when I went to school, if there was any fighting, loudness, or kids out of their seat on the bus, the bus driver would stop and make them sit down before driving any further. Why don't you do this now?\" The administrator says \"I'm going to be honest with you, I can't guarantee that your child will be safe on our bus. I can transfer him to another bus if you like.\" The mom, \"But will that change anything?\" Administrator \"I don't know.\"\n\nAnother kid, who is a constant victim of bullying, is clearly upset with his bully. The same bus administrator pulls the two aside. She then forces the bullied kid to \"shake hands and make up\" with his bully and berates the bullied for being disinterested in making up, saying \"when you refuse to shake hands with him, you are the same as him. You are bullying him by not being willing to make up.\" The kid retorts \"he has been harassing me for two years now\" the administrator \"that doesn't matter, you should make up anyway. I think if you tried harder, you two could be good friends.\"\n\nFaced with continually frustrating interactions like those above, the parents of this movie keep saying things like \"How can we send our kids to school without expecting them to be safe?\" \"The parents of these bullies aren't involved and don't do anything to stop their children.\" \"I don't feel safe sending my kid to school on the bus.\"\n\nI couldn't help but think: these parents recognize that their children are forced to be in close proximity to dangerous and mean children from broken families. However, they continue to believe somehow that the people in charge of schools actually care, when all of the evidence (e.g. above) says otherwise. I continued to be incredulous that it never occurred to these people that the problem was with the initial fact that the state is coercing them to send their kids to state schools. One scene had an entire gymnasium full of bullied children and their concerned parents. I thought \"there are enough of you here to support a school specifically for your bullied children.\"\n\nHowever, to be slightly more nuanced, many of the families in this particular documentary were of low SES, so they didn't really have the means to access private schooling in its current form.  &gt; I continued to be incredulous that it never occurred to these people that the problem was with the initial fact that the state is coercing them to send their kids to state schools.\n\nThat's the problem with most statist institutions, rare person is gonna say that we should just abolish them, most would say, we just need better, more caring bureaucrats.  &gt; \"I'm going to be honest with you, I can't guarantee that your child will be safe on our bus. I can transfer him to another bus if you like.\"\n\nYup, no competition or fear of reprisal will lead to this.\n\n&gt; \"that doesn't matter, you should make up anyway. I think if you tried harder, you two could be good friends.\"\n\nThis sounds like someone that is either a politician, or someone that is very far removed from reality. Probably doesn't help that he/she has 100% job security, or realizing that from a kid's perspective, someone just got away with being a bully for two years with no punishment. \n\n&gt; However, to be slightly more nuanced, many of the families in this particular documentary were of low SES, so they didn't really have the means to access private schooling in its current form.\n\nI hope that unschooling and homeschooling becomes more prevalent, even though there are states with laws against it.\n\nThe bullying thing is a tough issue, especially with kids from low SES that don't get proper attention/affection at home, and have to release it somewhere. Most bully's do so because they're trying to impress their peers, and this is the only outlet for it. It's also a vicious cycle because lots of kids that were bullied become bullies themselves.\n\nOf course, it's a huge issue, because schools are funded through property taxes, and thus every family is in a race to live in the ~~best~~ highest-tax paying neighborhoods, which creates a 'keeping up with the joneses' type atmosphere in the suburbs. It's no wonder the size of American homes has doubled in the past 50 years.  I also think this issue seems more prevalent with mega-schools, as politicians/bureaucrats gain votes by saying they'll 'invest in education,' which usually just means spending on education infrastructure (and thus more money to construction unions), and not issues in the classroom.\n\nI think a return to unschooling, homeschooling, and most importantly one-room schools with age mixing is the best course of action. Get rid of the politicians, bureaucracy, unions, and administration, and have kids go to school within walking distance. Then, they can sit in class with kids from older grades, do work independently, and the teacher can be there to help them when they need it, while also giving out work to do and things like that.\n\n[Local Governments spend between $12,000 and $27,000](http://www.cato.org/publications/policy-analysis/they-spend-what-real-cost-public-schools) per student per year! That's outrageous! Give that to 1 teacher in a 1-room school with 20 kids, and that's a revenue of $240,000/year. If kids walk to school, bring their own lunch, and re-use textbooks, you could teach kids for a helluva lot less, and also buy each kid their own laptop or Kindle every few years. Hell, at that salary you could hire doctors or people with Ph.D.'s to teach your six year old. &gt; \"I'm going to be honest with you, I can't guarantee that your child will be safe on our bus. I can transfer him to another bus if you like.\"\n\nYup, no competition or fear of reprisal will lead to this.\n\n&gt; \"that doesn't matter, you should make up anyway. I think if you tried harder, you two could be good friends.\"\n\nThis sounds like someone that is either a politician, or someone that is very far removed from reality. Probably doesn't help that he/she has 100% job security, or realizing that from a kid's perspective, someone just got away with being a bully for two years with no punishment. \n\n&gt; However, to be slightly more nuanced, many of the families in this particular documentary were of low SES, so they didn't really have the means to access private schooling in its current form.\n\nI hope that unschooling and homeschooling becomes more prevalent, even though there are states with laws against it.\n\nThe bullying thing is a tough issue, especially with kids from low SES that don't get proper attention/affection at home, and have to release it somewhere. Most bully's do so because they're trying to impress their peers, and this is the only outlet for it. It's also a vicious cycle because lots of kids that were bullied become bullies themselves.\n\nOf course, it's a huge issue, because schools are funded through property taxes, and thus every family is in a race to live in the ~~best~~ highest-tax paying neighborhoods, which creates a 'keeping up with the joneses' type atmosphere in the suburbs. It's no wonder the size of American homes has doubled in the past 50 years.  I also think this issue seems more prevalent with mega-schools, as politicians/bureaucrats gain votes by saying they'll 'invest in education,' which usually just means spending on education infrastructure (and thus more money to construction unions), and not issues in the classroom.\n\nI think a return to unschooling, homeschooling, and most importantly one-room schools with age mixing is the best course of action. Get rid of the politicians, bureaucracy, unions, and administration, and have kids go to school within walking distance. Then, they can sit in class with kids from older grades, do work independently, and the teacher can be there to help them when they need it, while also giving out work to do and things like that.\n\n[Local Governments spend between $12,000 and $27,000](http://www.cato.org/publications/policy-analysis/they-spend-what-real-cost-public-schools) per student per year! That's outrageous! Give that to 1 teacher in a 1-room school with 20 kids, and that's a revenue of $240,000/year. If kids walk to school, bring their own lunch, and re-use textbooks, you could teach kids for a helluva lot less, and also buy each kid their own laptop or Kindle every few years. Hell, at that salary you could hire doctors or people with Ph.D.'s to teach your six year old. Those last points you made are something I talk about a lot. I really enjoy breaking down the actual expenditures of government like that for people.\n\nI know that here in /ancap and /lib we're fond of removing all government. However, I also like to create \"market government\" examples to help win over statists. And because, to be totally honest, I'm more OK with direct welfare than with state institutions, because at least you're empowering people with choice and creating incentives for better cost/quality than the starting point of government control. If people were given $12,000 per year to use toward their student's education, I'm sure it would be easy to buy a small business location with capacity for 30 kids, 30 computers, 30 desks, 180 sets of textbooks/workbooks/whatever, and 6 teachers. \n\n360,000 = 24000 (overhead--in most parts of the country, 2000/mo is a decent sized house with utilities, I'd imagine it also works for a business location) - 300,000 (salary/benefits) - 18000 (textbooks) - 3000 (desks) - 12000 (computers) - 3000 (online lectures or other expenses)\n\nAnd obviously the computers and desks and textbooks are capital costs that can be recouperated or decreased after the first year and reinvested in other capital/school field trips/experiences or used to increase salary/benefits. That's a profitable and sustainable business model from day 1, assuming you can get 30 students, which I wouldn't imagine being difficult.\n\nThere you have it, a school with a 5:1 faculty:student ratio (if you split the students/faculty evenly) or 30:1 (if by \"subject\" assuming rigid teacher specialties).   Lack of choice in schools and compulsory schooling make schools bully paradises. No matter what they do, all this anti-bully crap. bullys hate school.   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18n5cf/school_choice_safety_and_the_documentary_bully/"
  }, {
    "id" : 10,
    "title" : "We're holding a tabling event!!! Join and help the Young Americans for Liberty at the University of South Alabama as they seek to register and RSVP students for their February 27th meeting.",
    "snippet" : " ",
    "url" : "http://www.yaliberty.org/events/2013-01-24/tabling-event-1"
  }, {
    "id" : 11,
    "title" : "Obama's $9/Hour SOTU Minimum Wage | Robert P. Murphy",
    "snippet" : "  I posted a similar thought in another thread, but I wanted to share it here.\n\nWe all agree that instituting a minimum wage is a bad thing. However, I think there is a more specific and a more general point to be made here.\n\nIn a free market, the government should not intervene by instuting a minimum wage. The market will decide the value of people's time/labor.\n\nHowever, we don't exist in a free market. We exist in a corporatist government. The large employers have been insulated from competition by high costs of entry into the market (pricing out smaller competitors) and don't bear the risk of their actions (as best seen by LLC's). That is, it is entirely possible that if the minimum wage were removed without also removing other harmful regulations, employers could very well drop unskilled employee salaries by a significant amount, because there won't be smaller competitors who can bear the costs of entry into the market and who, therefore, can not give those big-corporation employees better options.\n\nMy point is that minimum wage is an issue that makes libertarians (I know we're in /ancap) look like poor person haters without addressing the real problem--government intervention. I posted a similar thought in another thread, but I wanted to share it here.\n\nWe all agree that instituting a minimum wage is a bad thing. However, I think there is a more specific and a more general point to be made here.\n\nIn a free market, the government should not intervene by instuting a minimum wage. The market will decide the value of people's time/labor.\n\nHowever, we don't exist in a free market. We exist in a corporatist government. The large employers have been insulated from competition by high costs of entry into the market (pricing out smaller competitors) and don't bear the risk of their actions (as best seen by LLC's). That is, it is entirely possible that if the minimum wage were removed without also removing other harmful regulations, employers could very well drop unskilled employee salaries by a significant amount, because there won't be smaller competitors who can bear the costs of entry into the market and who, therefore, can not give those big-corporation employees better options.\n\nMy point is that minimum wage is an issue that makes libertarians (I know we're in /ancap) look like poor person haters without addressing the real problem--government intervention. Can't you make an argument that minimum wage is another barrier to entry for the small business?    ",
    "url" : "http://youtu.be/bic4za5a1qo"
  }, {
    "id" : 12,
    "title" : "Economists in One Lesson",
    "snippet" : "  Keynes was definitely not a consistent man. That's for sure. But tell a bunch of power hungry people they need more power and of course you'll be lifted to the top. It's more important to recognize when you're wrong than to be consistent. If you follow consistent logic, you are less likely to be wrong. Frequently being wrong and recognizing it is not better than frequently being right because you are logically consistent. If you follow consistent logic, you are less likely to be wrong. Frequently being wrong and recognizing it is not better than frequently being right because you are logically consistent. Ideological rigidity isn't the same thing as being consistently logical. humans have a thing with consistency, which is too bad since it keeps them picking the wrong way or refusing to learn and adapt. Such broad-sweeping and baseless statements are a plague upon humanity. Only a sith deals in absolutes. Such broad-sweeping and baseless statements are a plague upon humanity. If you follow consistent logic, you are less likely to be wrong. Frequently being wrong and recognizing it is not better than frequently being right because you are logically consistent. The suggestion being that Keynes was frequently incorrect compared to his contemporaries... Keynes was definitely not a consistent man. That's for sure. But tell a bunch of power hungry people they need more power and of course you'll be lifted to the top. This is why (mainstream) economics is a pseudoscience. Before anything else, anything claiming to be a science must be internally consistent. In what ways are mainstream economists \"*internally inconsistent*\" that differ from natural scientists? Economics, not economists.  Though the root of this thread is about a specific economist, so I can see why your mind went there. Works for me, in what ways are mainstream economic models and their development functionally different than other scientific pursuits? I won't say much about internal consistency, but economic models clearly differ from hard science in that they are not developed from controlled experiments where each factor can be held in place or modified individually.  Others of the softer sciences can be characterized the same way, but I challenge anyone to find an economic premise that is as thoroughly demonstrated as, say, the Pauli exclusion principle, or for an easier one, the law of gravity. In what ways are mainstream economists \"*internally inconsistent*\" that differ from natural scientists? I take it you haven't been keeping up with Krugman? It's not entirely fair to judge all Keynesian economists by him, but given that he is a Nobel laureate and is put on a pedestal for it, he's my go-to guy for questions like this. Are you familiar with Krugman's academic work?\n\nUsually when people criticize \"Krugman's predictions\" they point out youtube videos that show decontextualized clips of him making statements about the housing bubble; or something to that effect. But they're wholly unfamiliar with the models Krugman supports or has worked on, and the predictive power of Krugman's published work.\n\nI mean, showing a video clip of Krugman saying something silly and taking that as an indictment of the field of economics is as bad as showing a video of Peter Schiff predicting hyperinflation over and over again and pretending that it represents a failure on behalf of all Austrian economists.\n\n&gt;This is why (mainstream) economics is a pseudoscience.\n\nI'm much more interested in why you think that the construction of mainstream economic models is akin to pseudoscience than what you think about Krugman's public talks. You raise very good points and, again, I profess ignorance on matters of economic theory. I haven't studied it, so I can't give an informed opinion on his work.\n\nHowever, I am aware of the implications of economic policies, and I don't believe it's a coincidence that a large majority of economists are in the payroll of the state. Given that mainstream economics doesn't address the conflict of interest inherent in economic research funded by the state, it is as much a pseudoscience as astronomy that is funded by Catholic church to prove the geocentric model of the solar system. Keynes was definitely not a consistent man. That's for sure. But tell a bunch of power hungry people they need more power and of course you'll be lifted to the top.  My favorite Keynes quotation, shortly before his death:\n\n&gt;[I find myself more and more relying for a solution of our problems on the invisible hand which I tried to eject from economic thinking twenty years ago.](http://en.wikipedia.org/wiki/John_Maynard_Keynes#Postwar)\n\n Taking the OP quotation into consideration, perhaps we must recognize that *not* being quickly found out when one is wrong CAN cause a great harm. That great harm being the 1960's onward. I truly respect Keynes. Keynesians, not so much.  No offense but one sentence quotes with no context are basically just propoganda. They can mke people appear to say basically any nonesense. I have seen figures I respect made to look like idiots and bigots. We really should not use them. No offense but half the people in this subreddit know more than one sentence of keynes theories and know full well the context.    I'd love to see a citation on the Keynes quote. It's the last one on the list [here](http://en.wikiquote.org/wiki/John_Maynard_Keynes#Attributed). ",
    "url" : "http://i.imgur.com/wjy2VV7.jpg"
  }, {
    "id" : 13,
    "title" : "\"Dorner is a wholesale product of a society gone mad on racism and war, of a state that aggressively punishes dissent, of an intellectual milieu where telling the truth has become a dangerous act.\"",
    "snippet" : "  \"During times of universal deceit, telling the truth becomes a revolutionary act.\" -- George Orwell  \"During times of universal deceit, telling the truth becomes a revolutionary act.\" -- George Orwell  George Orwell was a socialist brah. :V Does that mean his comments on totalitarianism are less worthwhile? Or his comments on the primacy of the individual?\n\n&gt;\"I worked out an anarchistic theory that all government is evil, that the punishment always does more harm than the crime and the people can be trusted to behave decently if you will only let them alone.\"\n\nBut he was a socialist and member of the ILP because he thought they would be against the war (world war 2).  He was then for the war and against those who were anti-war. He has always had quite a few good things to say about anarcho-syndicalism and anarchists (mostly collectivist anarchism as far as I can tell). Orwell always said, \"socialism first and foremost was about liberty and justice.\"\n\nHis writing and actions are very conflicted if you are trying to determine a consistent, easily labeled viewpoint. At times, he's a democratic socialist and he is pro-war, at other times he is anti-war and criticizes like an anarchist. If I had to come up with a label, it would be \"scathing critic.\" He criticized anarchism, but he never really put forward a better system. He was a libertarian socialist through and through. Whether that's democratic socialism or anarchism is simply a matter of debate. \n\nBut to use him to push a libertarian capitalist agenda is quite disingenuous. &gt;He was a libertarian socialist through and through.\n\nDid he reject private property? I don't think he did, but I may be wrong. He definitely wasn't an anarchist though, he could never completely let go of the state.\n\n&gt;But to use him to push a libertarian capitalist agenda is quite disingenuous.\n\nWhat about an anti-authoritarian agenda? &gt;Did he reject private property? I don't think he did, but I may be wrong.\n\nI do believe to an extent he did, or at least the use of property to impoverish, enslave, or coerce others.\n\n&gt;What about an anti-authoritarian agenda?\n\nThat's why he was a socialist. States are not the only institutions that act authoritarian. &gt;I do believe to an extent he did, or at least the use of property to impoverish, enslave, or coerce others.\n\nBased on what? Either you reject private property or you do not. I don't think he rejected private property, he just criticized the excesses of it.\n\n&gt;That's why he was a socialist.\n\nThat's fine, is it disingenuous to use him to push an anti-authoritarian agenda? &gt;That's fine, is it disingenuous to use him to push an anti-authoritarian agenda?\n\nIf you're a capitalist, yes. Seeing as he was very anti-capitalist (he fought against them for christsakes). So, you want to drop your assertion about Orwell's political beliefs?\n\n&gt;If you're a capitalist, yes. Seeing as he was very anti-capitalist (he fought against them for christsakes).\n\nI would fight against \"capitalism\" of his day too, and I'm not anti-capitalist. Could you support this statement too? ",
    "url" : "http://jacobinmag.com/2013/02/the-christopher-dorner-complex/"
  }, {
    "id" : 14,
    "title" : "Even though Facebook (FB) reported $1.1 billion in pre-tax profits from U.S. operations in 2012, it will probably pay zero federal and state taxes—and even receive a federal tax refund of about $429 million",
    "snippet" : "     A legal means of paying zero taxes.\n\nSign me up. PM me.  :-)\n\nDisclaimer:  I can only work with businesses grossing ~$1M or more.  You're on your own if you're a proletariat wage slave. &gt; You're on your own if you're a proletariat wage slave.\n\nDang.  Maybe in a few years. Sorry, dirty capitalists only. PM me.  :-)\n\nDisclaimer:  I can only work with businesses grossing ~$1M or more.  You're on your own if you're a proletariat wage slave.  &gt;Facebook’s first annual earnings report contains an accounting gem: a multibillion-dollar tax deduction for the cost of executive stock options and share awards.\n\nWell, yeah, wages paid are deductible, there's nothing special about that.\n\n&gt;Citizens for Tax Justice calls the tax footnotes in Facebook’s Jan. 30 financial statement “an amazing admission,” but there’s nothing illegal about the breaks the company is claiming. Companies like Facebook are allowed to treat the cost of non-cash compensation, such as stock options, as an expense that reduces profits, essentially the way they treat cash compensation such as salaries.\n\nSeeing as how individuals have to report non-cash payments as income, there's nothing mystifying about this.  &gt; individuals have to report non-cash payments as income\n\nSo this implies that the stock-holders themselves have already payed taxes on this income themselves, yes?    Except all shareholders will pay capital gains tax, all employees pay income taxes, everything they buy comes with sales taxes, buildings have property tax, and etc.\n\nAlso wtf does this mean:\n\n&gt; using further net operating loss carry-forwards that it has banked.",
    "url" : "http://www.businessweek.com/articles/2013-02-15/facebook-gets-a-multi-billion-dollar-tax-break"
  }, {
    "id" : 15,
    "title" : "Capitalism Promotes Peace: Medieval Mercenaries, Milan, and the Market.",
    "snippet" : "  Let me know what ya'll think about the website this links to, and/or anything you might interested in about this article.\n\nHope you enjoy the blog. Loved the article, don't like the color scheme or background. Black on white is a convention for text for good reason.  Thanks for the advice. I appreciate it, and glad you enjoyed the article. ",
    "url" : "http://thehumanecondition.com/2013/02/15/capitalism-promotes-peace-medieval-mercenaries-milan-and-the-market/"
  }, {
    "id" : 16,
    "title" : "Rant: Why I Don't Give a FUCK About Politicians",
    "snippet" : "  I think that's the difference between us and libertarians at /r/libertarian. We reject the cult of celebrity that is politics. It's a method of control, nothing more. This is why libertarians in [/r/Libertarian](http://www.reddit.com/r/Libertarian) aren't actually libertarian in the classical sense (i.e. classical liberalism). They *are* **L**ibertarian (meaning: of the US Libertarian party), but they aren't anti-authoritarian enough, not by a long shot. This is the problem with labels. They get bent to mean shit that they weren't traditionally meant to. \n\nClassic libertarian philosophy (little \"l\") is anarchistic, anti-authoritative. Libertarianism (big \"L\") is anti-authoritative, but much more of the minarchist bent, which we all know doesn't work.  This is why libertarians in [/r/Libertarian](http://www.reddit.com/r/Libertarian) aren't actually libertarian in the classical sense (i.e. classical liberalism). They *are* **L**ibertarian (meaning: of the US Libertarian party), but they aren't anti-authoritarian enough, not by a long shot. This is the problem with labels. They get bent to mean shit that they weren't traditionally meant to. \n\nClassic libertarian philosophy (little \"l\") is anarchistic, anti-authoritative. Libertarianism (big \"L\") is anti-authoritative, but much more of the minarchist bent, which we all know doesn't work.  Lets not get in to the whole \"real libertarian\" nonsense. If we're using historical standards, then ancaps are the ones who are insufficiently libertarian. It's not clear why anyone should care to be a \"real libertarian\" or whatever. It's nothing but conservatism of the worst kind to think something is better simply because its older. Being a \"real libertarian\" is not more extreme conservative. It has nothing to do with tradition. All I meant was, I don't see why people need to fight over who is a real libertarian in the \"classical\" sense. If you're wrong, it doesn't matter if you're part of a long tradition or if you represent some totally new school of thought. You're still wrong. Lets not get in to the whole \"real libertarian\" nonsense. If we're using historical standards, then ancaps are the ones who are insufficiently libertarian. This is why libertarians in [/r/Libertarian](http://www.reddit.com/r/Libertarian) aren't actually libertarian in the classical sense (i.e. classical liberalism). They *are* **L**ibertarian (meaning: of the US Libertarian party), but they aren't anti-authoritarian enough, not by a long shot. This is the problem with labels. They get bent to mean shit that they weren't traditionally meant to. \n\nClassic libertarian philosophy (little \"l\") is anarchistic, anti-authoritative. Libertarianism (big \"L\") is anti-authoritative, but much more of the minarchist bent, which we all know doesn't work.   &gt; Distributed democracies are setup in such a way that there's always many persons to blame, and no one to blame at the same time.\n\n1) Are there undistributed democracies?  \n\n2) Your rant is one facet of why I'm a MAJOR pessimist when it comes to the liberty movement.  I think a shitload of Evolutionary Psychology is pure speculation, but Anthropology is quite clear on two things- we have clear instinct built for a tribalistic culture and to survive in a Zero-Sum or Negative Sum \"economy.\"  But the slam dunk?  The gov actively controls, indoctrinates, and (purposefully?) encourages these weakness in youths over a period of goddamn YEARS. I like voucher programs, but a culture that worships the state will create private schools that instill this 'value' too.  Its really rather depressing.\n\n3) Side note, I'm rather a poor writer.  However, as a measure of constructive criticism given with goodwill, I feel this particular piece could use a touch more clarity and style.\n\nI think its the lack of active language?\n\nNot Active: The flower was being painted red by Joe.\n\nActive: Joe was painting the flower red.\n\n&gt;Distributed democracies are setup in such a way that there's always many persons to blame, and no one to blame at the same time\n\n* More active:  *The setup of distributed democracies means there are always many persons to blame, and no one to blame at the same time.* \n\n* or my take: *The structure of distributed democracies distribute blame over too many people, as to make accountability impossible.*\n\nAnother:\n\n&gt;Who do I blame for half my paycheck being stolen?\n\n* Who do I blame for the stolen half of my paycheck?\n* Who do I blame for stealing half my paycheck?\n* Half my paycheck is stolen, who do I blame?\n\nActive language sounds better, and at least for me, an active language style mysteriously encourages better word usage.\n\nSecondly pronouns.  Loose pronouns are no capital crime, but tighter is generally better:\n\n&gt;The president who did or didn't veto it?\n\nIn this sentence the \"it\" seems to apply to what the politicians wrote about being able to tax.  If that's not what you meant, its unclear.  If it is, \"The president who didn't veto it\" makes a lot more sense because 'it' is something you don't like.\n\nAlso last paragraph-\n \n&gt;and I'm not having any part of it.\n\nReally, how?  I'm confused... are you not paying taxes, or do you just mean you're no longer supporting politics?  Like you mean \"I'm not buying into it\" or \"I no longer believe it.\"\n\nSo yeah, I like your passion, but more active language is always better.  And careful with unclear pronouns- you might have idiots like me reading it!     &gt;But the slam dunk? The gov actively controls, indoctrinates, and (purposefully?) encourages these weakness in youths over a period of goddamn YEARS. I like voucher programs, but a culture that worships the state will create private schools that instill this 'value' too. Its really rather depressing.\n\nMeh. The Soviet Union indoctrinated their population for decades and it was forgotten within a generation. Same goes for Nazi Germany. And for the greatest chunk of history there weren't even public school around to \"indoctrinate\" people. Indoctrination is highly overvalued. I hate to break it to you, but there are still millions of Russians that are still sympathetic to communism and paranoid of anything that is seen as \"pro western.\" Look at the meteor that injured 100's, they are already trying to blame it on foreigners while others demand political action to protect them from future strikes. Nazi Germany indoctrination took a WWII to bring it to an end. As for your point about public schools, are you forgetting churches? Even ancient Greeks and Romas were indoctrinated by their leaders and there are religous cults that revolve around the leader of North Korea for **** sake. Look at the worship of Hugo Chavez and even Putin. A generation today is close to 25 years for most developed nations and that is plenty of time to do a lot of damage. Indoctrination is over rated? What a ridiculous claim.  I wasn't trying to say that some sort of \"indoctrination\" wouldn't work I just think it's way less effective than you'd think. While millions of Russians are still sympathetic to communism, the majority is not and nobody (the most) in Russia wouldn't want to have communism back. You'd think that if indoctrination was such a great tool to manipulate people the Nazis wouldn't haven't vanished within years after the fell of the old regime. Look at Eastern Europe. It transformed from Communism to free market capitalism within a two decades. \nAnd we are talking here about authoritarian systems. The western school system is despite everything relatively free. My art teacher was a communist and my economics teacher a die hard capitalist. Most people I know went through the public school system and they came out with completely different political believes ranging from AnCap to full blown communism.   What a useless little diatribe. You rage against everyone and no one while making no substantive, much less convincing, criticisms against anything.\n i think that's why he warned us it was a rant, but he does have substantive stuff in other posts ^ this.\n\nIt's good to have some fun / humor every once in a while.  I have a lot of respect for people like Matt &amp; Trey (Southpark), Penn &amp; Teller, George Carlin, and Larken Rose.... whose presentation style isn't about making meticulous arguments, but rather pointing out the absurdity of the things people take for granted.\n\nedit:  If anything is in surplus on /r/AnCap, it would be meticulous and boring *\"argumentation.\"*  Then persons wonder why /r/AnCap is mostly a bunch of male nerds in their 20s. Give me a break. Matt and Trey are masters of satire; that you would compare yourself to them even in the slightest is laughable. Rants don't have to be juvenile and pointless, but yours is both. Give me a break. Matt and Trey are masters of satire; that you would compare yourself to them even in the slightest is laughable. Rants don't have to be juvenile and pointless, but yours is both. Hmm, either you're trolling or you have a vendetta.  Hmm, either you're trolling or you have a vendetta.  I love you, James.",
    "url" : "http://jamescarlin.wikidot.com/why-i-don-t-give-a-fuck-about-politicans"
  }, {
    "id" : 17,
    "title" : "My favorite Gandhi quote that I put on an an-cap background.",
    "snippet" : "  If anyone in todays society lead their lives after this quote they are either incarcerated or buried. It's really sad how much power we have relinquished to the state apparatus. Fully in agreement on the sad and overbearing power of the state. But you can find yourself alive and not incarcerated leading your life by this quote- provided you don't do anything irrationally extreme.\n\nWhittle away at state power by spreading ideas and persuading others, as long as *that* freedom still lasts (for the most part). Above all, refuse to accept the state as justified in its oppressive action. If you'd choose to eliminate government as soon as that option becomes available, you're virtuously disobedient. If anyone in todays society lead their lives after this quote they are either incarcerated or buried. It's really sad how much power we have relinquished to the state apparatus.   Not sure, but I think it was relevant back in the *go fight today, so we can be free tomorrow*, when it was guns vs guns and maybe some tanks, but not insane like today with nukes and other mayhem. \n\n\nLive and associate free, thats all we can do for now. Nukes are not effective against individuals among friendlies.\n\nDrones, now those are a problem to deal with. Assuming that drone strikes are surgical in the least bit\n\nAlso assuming the state is afraid to kill it's own It's more than happy to send them off to die in droves in made up conflicts.   I guess there are two ways you can look at this quote, as to what the *point* is. Either the point is that you never gave in, never gave your obedience, or that you're dead. I suppose if you don't believe in an after-life, then nothing matters if you're dead, least of all your pride. And if you do believe in the afterlife, you wouldn't care either. Either way its standing up for your beliefs, and for what is right.      Too bad Gandhi was a NAZI supporter  So you don't pay taxes, you resist police officers, and you disregard all laws on a daily basis? The immense majority of people here prefer life to death and non-incarceration to prison, and they pursue their ends with means rational enough to rule out a declaration of futile war against the state.\n\nBut that's not the sort of obedience being implied here. This sub is classified by people who refuse to recognize government figures as *justified* in stealing property and tormenting innocent people, just because they have badges and uniforms and declare themselves supreme. Ancaps work in ways they can to erode state power, rather than support it or even just accept it, and that is a noble disobedience. Who are you to determine someone else's radicalism?  The immense majority of people here prefer life to death and non-incarceration to prison, and they pursue their ends with means rational enough to rule out a declaration of futile war against the state.\n\nBut that's not the sort of obedience being implied here. This sub is classified by people who refuse to recognize government figures as *justified* in stealing property and tormenting innocent people, just because they have badges and uniforms and declare themselves supreme. Ancaps work in ways they can to erode state power, rather than support it or even just accept it, and that is a noble disobedience. My point is that we are all obedient to the State. This quote isn't an accurate depiction of ~99% of the people on this sub, and I'm going out on a limb by asserting the same of the OP too. \n\nSo forgive me if you, the OP or most people here are actively resisting the State. I don't even evade taxes, and I'm going to be paying fines to a local court for a speeding ticket soon, so I guess I'm just not as strongly willed against the State as you are.\n\nBut I sure do love being downvoted and critiqued out of difference of opinion and revelation of truths. Shows just how willing to see things objectively (or complete lack thereof) people are here.\n\n You made an assumption about the author's intent regarding the quote posted, despite it being obvious that this is not how AnCaps lead their lives. You're not down voted for a difference of opinion, but for trolling. Funny, usually trolls know when they're trolling. But I find myself oblivious to it for every post I make on this sub. I wonder what this means.\n\nI found a quote being used to represent an ideology, and I concluded after reading it that the quote doesn't represent this ideology (not even my own), so I confronted the OP with it. And then a bunch of people didn't like that I did this, so they tried to censor me via downvoting. It's simple. I gave you upvotes because I think downvoting is unbefitting of this sub (incidentally, what is the rationale for not removing the feature altogether?), but I do not think it necessarily follows that I give my obedience to the State merely because I also will act out of self-preservation. Or let me put it this way, they have my compliance because I do not want to be murdered, but I will never give them my consent. So you don't pay taxes, you resist police officers, and you disregard all laws on a daily basis? Why is it all or nothing? A man may pay taxes and yet smoke pot, speed, sow discontent among the slaves, make light of politicians, protest wars and reappropriate government assets when the opportunities present themselves. Well, are you not obedient if you do one of those things? If I have a steak, bacon, hotdogs and a carrot for dinner, am I a vegetarian?",
    "url" : "http://i.imgur.com/fQJFXLg.jpg?1"
  }, {
    "id" : 18,
    "title" : "Organized Labor in an AN-CAP society",
    "snippet" : "What would be the legality or opportunity of organized labor in an AN-CAP society?   Free to do as it pleases. As is the employer. \n\nIf the employer feels \"organized labor\" is demanding too much and he has people that agree to his current terms of employment, he has the right to say \"Fuck off organized labor. I'm hiring people that are okay with what I provide, unless you become more reasonable\".\n\nAn AnCap society allows people to group together however the fuck they want. They do not, however, get to force their will onto people, or their employer, as \"organized labor\" gets to currently.  This.  On the flip side, it means if you want to have a union only shop (no non-union employees) that this is totally acceptable also.  Also, since certifications are market driven, unions could offer meaningful certifications to employers (sort of like a guild) making their members more valuable employees in the labor market. This is a perfect example of how the free market can regulate itself. \n\nMakes sure capitalists are doing what they should be through \"certification\" *and* makes sure people are paid what they deserve. \n\nAnd look!!! **No government required** Problem with certification is there is always bureaucratic loopholes. Say a company is certified to give a designated amount of profit share or wield to its employees, but its designated within one aspect of the company before it expands. Now you have this company with a (essentially) fair trade brand that the public trusts. The reality is Labor has to renegotiate for its stake in the company. \n\nNot to shake things up too much here, but as sneaky as government is, i think private corporations are ten times more willing to screw over a constituency that doesnt rely on any oversight but their own. And besides, who does the certification?   This.  On the flip side, it means if you want to have a union only shop (no non-union employees) that this is totally acceptable also.  Also, since certifications are market driven, unions could offer meaningful certifications to employers (sort of like a guild) making their members more valuable employees in the labor market. You're actually describing how unions were originally intended to function. Free to do as it pleases. As is the employer. \n\nIf the employer feels \"organized labor\" is demanding too much and he has people that agree to his current terms of employment, he has the right to say \"Fuck off organized labor. I'm hiring people that are okay with what I provide, unless you become more reasonable\".\n\nAn AnCap society allows people to group together however the fuck they want. They do not, however, get to force their will onto people, or their employer, as \"organized labor\" gets to currently.  thanks, yesterday I got hammered on by several pro-union people incessantly saying how under an AN-CAP society we would only have Homestead times 1000, with no mediator between business and labor i.e. the government, so I just wanted to confirm my own ideas with the community before representing the AN-CAP community.  I have a perfect little anecdote for those pro-union \"kids\". \n\nMy mom is a CNA at a public hospital in the Twin Cities. She has no choice, simply by working at this particular hospital, to join a union **and pay it money**. All under the guise of making sure \"she gets what she deserves\". \n\nAbout two weeks ago a misunderstanding between her and another CNA lead to some issues. It was handled by HR and both her and this other CNA had to give \"statements\" as to what happened. The union rep was required to be there when statements were given. But, wouldn't you know it, the rep was unavailable for two weeks. By the time my mom gave her statement, her boss had heard the testimony from the other CNA (2 weeks prior i.e. just after it happened) and had already decided to give her the option (prior to mother even giving her statement, mind you): \"Quit or get fired\". \n\nWhat did the rep say; You ask? Well: \"You either quit, or you get fired\". That's it. \n\nSo, tell me why should anyone pay the union if it doesn't do shit for its \"people\"? thanks, yesterday I got hammered on by several pro-union people incessantly saying how under an AN-CAP society we would only have Homestead times 1000, with no mediator between business and labor i.e. the government, so I just wanted to confirm my own ideas with the community before representing the AN-CAP community.       ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ma7g/organized_labor_in_an_ancap_society/"
  }, {
    "id" : 19,
    "title" : "My girlfriend's adventure in jury duty. (Getting dismissed from jury duty...)",
    "snippet" : "So, my girlfriend's not very political nor very philosophical... But she's very sympathetic to liberty and freedom and she did read up a bit on jury nullification when I told her about it.  She got called into jury duty yesterday where they told her a bit about a case and today she went in for the interview process.  I just wanted to share her story with you guys as I'm incredibly proud of her and I thought you guys might appreciate it.\n\n\"After they checked that everyone was there, they picked 18 jurors from the list at random.  I was called as potential juror #4. After they called those 18 names, we were asked to answer 7 questions that were posted on the wall.  The first questions were along the lines of “What is your name?”, “What is your occupation?” etc… but the last question was, “Do you think you can be fair to both parties of this case?”  I answered that I could be fair but I also added that I know my power as a juror to be able to nullify any law I though was wrong and I disagreed with.\nI don’t think the Judge liked what I said.\nI don’t remember his exact words, but he told me he would be giving me a few instructions and that I’d have to follow those instructions and make my decision leaving behind any bias.  He said when making my decision, I would have to keep the law in mind by following the letter of the law. He asked if I was going to be able to do this and I said no. I said that if I considered the law immoral and I disagreed with it, I’d make my own decision based on what I thought was fair. He then said something along the lines of “Then why would there be legislators?”  Like, if I am not going to follow the law, why are they made up?  He and the courtroom then let out a light laugh. He said that he was not saying this to laugh at me or mock my beliefs just as he finished chuckling.  I just labeled everyone who chuckled as ‘ignorant’ because they made me believe they were.\n\nAfter they talked to the other potential jurors and everyone answered the questions, the Judge asked the Attorneys to approach the bench.  They talked for like two minutes or less and all I could hear was the people murmuring (I was wondering if it was about me, lol).  Then the Attorneys returned to their seats and as they were walking the Judge asked if they wanted to ask questions or if he would just make a ruling.  They said to just let us step out (or something like that).  I was the second juror to be excused.\n\"\n\n  why would she show her hand like that ? I felt the same way. If I were in the position, I would do everything to get on a jury... Maybe help a fellow man. why would she show her hand like that ? She says the main reason she let them know she knew about jury nullification was that she did not want the stress involved with being in this particular trial and she knew she would be dismissed from some of the stories she had read.\n\nShe knew she wanted out, but did not want to lie and jury nullification is something she has come to believe in. That's important. We have to be completely open and honest if we expect any sort of integral revolution. The State lies. We don't. It's completely honest to answer 'Yes' to the question of \"Can you be completely fair to both parties in this case?\" It's just that my definition of \"fair\" includes ignoring the opinion of legislators. It's the judge's fault for not communicating clearly. :) It's completely honest to answer 'Yes' to the question of \"Can you be completely fair to both parties in this case?\" It's just that my definition of \"fair\" includes ignoring the opinion of legislators. It's the judge's fault for not communicating clearly. :) I agree with you to some extent, but a little more with KeatingOrRoark. If we play language games, then we're not different than the people we seek to replace. For example, they call a bill to strip freedom the Patriot Act through a twist of language. We shouldn't be playing those kind of games.\n\nOn the other hand, I agree with you, because the purpose of jury nullification is to rescue others that are being attacked. We have a greater moral obligation to help others than to worry about if we're harming their attackers with our lies. I agree with you to some extent, but a little more with KeatingOrRoark. If we play language games, then we're not different than the people we seek to replace. For example, they call a bill to strip freedom the Patriot Act through a twist of language. We shouldn't be playing those kind of games.\n\nOn the other hand, I agree with you, because the purpose of jury nullification is to rescue others that are being attacked. We have a greater moral obligation to help others than to worry about if we're harming their attackers with our lies. Yes, actually, we need to. If it's not harming anyone, then we're dumb as shit if we leave that option on the table. I agree with you to some extent, but a little more with KeatingOrRoark. If we play language games, then we're not different than the people we seek to replace. For example, they call a bill to strip freedom the Patriot Act through a twist of language. We shouldn't be playing those kind of games.\n\nOn the other hand, I agree with you, because the purpose of jury nullification is to rescue others that are being attacked. We have a greater moral obligation to help others than to worry about if we're harming their attackers with our lies. why would she show her hand like that ? [deleted] Have people gone to jail for jury nullification ?  \"You have to go by the letter of the law... because it's the law!\"\n\nAnother brain addled by the ravages of statism, bless his heart. \"You have to go by the letter of the law... because it's the law!\"\n\nAnother brain addled by the ravages of statism, bless his heart.   I've never been to jury duty, so forgive my secondhand perspective, but I have heard that you are to never mention you know what nullification is, and after the case is over then you may say \"I cannot in good conscience let this person be punished\" and nothing more.\n\nI do however fully support what she did and hopefully some witnesses of the proceedings took her honesty to heart. Just some tips for anyone who might end up in a similar experience. I have heard of people being arrested and charged with jury tampering for informing juries of jury nullification.  I have never heard of the charge sticking, as you're not telling a jury which way to vote, just telling them to use their conscience.  That being said, I never encouraged her to publicly announce it, but boy am I proud she did.\n\nSo, yes... anyone on a jury or called in for jury duty.. be very careful with this. I have heard of people being arrested and charged with jury tampering for informing juries of jury nullification.  I have never heard of the charge sticking, as you're not telling a jury which way to vote, just telling them to use their conscience.  That being said, I never encouraged her to publicly announce it, but boy am I proud she did.\n\nSo, yes... anyone on a jury or called in for jury duty.. be very careful with this. To be clear, when you talk about being charged with jury tampering, are you talking about a jury member informing other jury members about jury nullification, or a non-jury member doing so? To be clear, when you talk about being charged with jury tampering, are you talking about a jury member informing other jury members about jury nullification, or a non-jury member doing so?  Recently got a jury duty notice and am planning on keeping this under my hat.  \n\nPart of me really wants to fuck with the legal system as much as it fucks with non-violent, victimless \"criminals\" Recently got a jury duty notice and am planning on keeping this under my hat.  \n\nPart of me really wants to fuck with the legal system as much as it fucks with non-violent, victimless \"criminals\"  I was excused from being a juror on a sexual abuse case. It was going to be ugly as there was nil for evidence, only testimony. When I was asked if I would rank Law Enforcement testimony as \"more valid\" than anyone else's testimony, I said no. I was excused the next time they let potential jurors go...    I am not a lawyer but, I think you can be charged with jury tampering by informing jurors about nullification, unless you are one of the jurors and the jury is in deliberation. So be careful. It's sad that educating jurors is considered tampering. What a sad state of affairs. It's sad that educating jurors is considered tampering. What a sad state of affairs.  Please forgive the throw-away account.  I promised my girlfriend I would submit anonymously in case there were any legal ramifications. (Even though there shouldn't be, as I'm not discussing any part of the case - But a promise is a promise.) What a waste of a throwaway account! That name is gold. Please forgive the throw-away account.  I promised my girlfriend I would submit anonymously in case there were any legal ramifications. (Even though there shouldn't be, as I'm not discussing any part of the case - But a promise is a promise.)   &gt;Like, if I am not going to follow the law, why are they made up?\n\nIf immoral or senseless laws are made, I hope the good people on the jury have the wisdom to ignore them.  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ligx/my_girlfriends_adventure_in_jury_duty_getting/"
  }, {
    "id" : 20,
    "title" : "What do you think of hong kong?",
    "snippet" : "   [Hong Kong and Singapore face happiness deficit](http://www.scmp.com/news/hong-kong/article/1131222/singapore-hong-kong-face-happiness-deficit)\n\n[Hedley environmental index on Hong Kong's pollution](http://hedleyindex.sph.hku.hk/home.php)\n\n[pollution threatens Hong Kong's competitiveness](http://www.bbc.co.uk/news/business-21038495)\n\n[pollution clouds Hong Kong's future](http://www.bbc.co.uk/news/business-14042293)\n\n[Hong Kong - Cage Dwellers](http://www.youtube.com/watch?v=HU4jjdRzy3w)\n [Hong Kong and Singapore face happiness deficit](http://www.scmp.com/news/hong-kong/article/1131222/singapore-hong-kong-face-happiness-deficit)\n\n[Hedley environmental index on Hong Kong's pollution](http://hedleyindex.sph.hku.hk/home.php)\n\n[pollution threatens Hong Kong's competitiveness](http://www.bbc.co.uk/news/business-21038495)\n\n[pollution clouds Hong Kong's future](http://www.bbc.co.uk/news/business-14042293)\n\n[Hong Kong - Cage Dwellers](http://www.youtube.com/watch?v=HU4jjdRzy3w)\n I'm wondering what the cause of the cage dwellers thing is in hong kong, naturally I'd assume property is expensive because land is scarce there, but how heavily does the state regulate construction and are there restrictions on renting property?  Well, first you will notice that while HK is one of the most free places in the world, one of the few things that the gov controls is the real estate market, and that happens to be the one area that HK is the most fucked up.   Second, people in HK are doing what is impossible in NY, or LA, or Chicago.   Getting a place to live in the key job districts, with close access to every possible amenity, for less than $140 per month.  Unlike the homeless shelter mobs in the US, the poor over there can live in relative dignity. How does the government control the real estate market in hongkong? I'm wondering what the cause of the cage dwellers thing is in hong kong, naturally I'd assume property is expensive because land is scarce there, but how heavily does the state regulate construction and are there restrictions on renting property?  Land in Hong Kong is leased from the government. There is very little if any private ownership of land. \n\n&gt;When a real estate developer “buys” a piece of land from the government, it does not really “buy” the land. It only leases the land from the government for a given period of time. And if the developer builds 100 flats on that site and sells to 100 buyers, each buyer will be entitled to have one-hundredth of the right to use the land for given period of time. Let’s face it, most lands in Hong Kong are leasehold, not freehold. The only freehold land in Hong Kong is in where the St. John’s Cathedral is located.\n\nhttp://www.alsosprachanalyst.com/real-estate/hong-kong-property-actually-its-more-expensive-now-than-1997.html Not trying to nitpick, but in the US (and maybe everywhere else?) land is held under the feudal arrangement, fee simple. You must pay your lord, the county government, to maintain possession of your fief. I don't know if any freehold land exists in the US. But that isn't necessarily what freehold land means in the context of that article. Paying taxes, following zoning laws and buying the proper permits does not constitute a lease of the land. And according to that article, the leases have limits which means they expire. I guess you could say my lease ends when I fail to pay my taxes. I understand what you are saying, we could get into that debate and would probably agree with you on principle. I was specifically addressing his comments on why property prices are so high. Do you know of any cities where all the land is owned by the government and must be leased directly from the government?      The problem with \"pro-business\" havens like Hong Kong, Singapore, Chile, and the UAE is that the people in these places are (or were at some time) coerced into certain economic freedom. They may also have a powerful central government that enforces others laws strictly. &gt; coerced into certain economic freedom\n\nthink about what you just said there. If you made the Uk (where I live) completely economically free, tomorrow there would be marches in the streets and lots of angry people. It's not coercion, but I think sour was pointing out that the economic system in hong kong isn't a product of what the people living there want. There are lots of people who want the state to pay for housing because property is expensive in hong kong.  If you made the Uk (where I live) completely economically free, tomorrow there would be marches in the streets and lots of angry people. It's not coercion, but I think sour was pointing out that the economic system in hong kong isn't a product of what the people living there want. There are lots of people who want the state to pay for housing because property is expensive in hong kong.  &gt;there would be marches in the streets and lots of angry people\n\nSo what? Aren't there police and army to deal with them?\n\nMaggie Thatcher had angry coalminers in the streets.   If you made the Uk (where I live) completely economically free, tomorrow there would be marches in the streets and lots of angry people. It's not coercion, but I think sour was pointing out that the economic system in hong kong isn't a product of what the people living there want. There are lots of people who want the state to pay for housing because property is expensive in hong kong.  &gt; coerced into certain economic freedom\n\nthink about what you just said there. I did. its the same paradox that drove me to anarchism from classical liberalism. anarchism would allow for voluntary communal societies that regulate economic activity and redistribute wealth. A dictator, like chile's pinochet, who forces economic liberalization violently on a country is still coercive even if their reforms promote economic freedom. you can't force freedom violently. Pinochet was a violent guy, he was no anarchist, but certainly better than most democrats.   ",
    "url" : "http://templeofthehumanspirit.wordpress.com/2011/02/04/the-rational-mecca/"
  }, {
    "id" : 21,
    "title" : "Calling the IRS",
    "snippet" : "So today I had to call the IRS to get some information for filling my taxes. Typically this is done via an automated machine, but for whatever reason I got routed to speak to a real person. While on hold the hold machine said:\n\n\"Thank you for waiting. Our representatives our busy assisting other customers.\"\n\nTo which I found this funny. Am I really a customer to the IRS? I don't really have a choice in the matter, nor am I \"always right\". In fact quite often they say you are wrong. Just something short and funny I encountered that I thought you guys might like.  *Welcome home*, is the most common jail greeting.  If you don't pay your taxes, they put you in prison and make other people pay taxes to fund your upkeep.\n\nI wonder what would happen if nobody paid their taxes :D Too many cowards. Coward - a person with something to lose. Everyone dies. Few truly live. Too many cowards. It's not that they're cowards, it's an externality problem. The cost of resisting taxation is borne entirely by me, but the benefit is realised by everyone. Whilst it's in everyone's interest to resist taxation, it's in each individuals case to go along with it and let everyone *else* resist taxation. Therefore, no-one resists taxation and we have a market failure. It's not a market failure when use of force is involved, it's a failure by aggression... \"Market failure\" has nothing to do with markets. A market failure is when every person acting in their own interests does not lead to the best outcome from the point of view of the group. &gt;the point of view of the group\n\nNo such thing. What definition would you use instead? Of \"market failure\"? \"A situation which an economist wants to use to justify state intervention\". It's an entirely subjective, arbitrary distinction. Of \"market failure\"? \"A situation which an economist wants to use to justify state intervention\". It's an entirely subjective, arbitrary distinction. \"Market failure\" has nothing to do with markets. A market failure is when every person acting in their own interests does not lead to the best outcome from the point of view of the group.  Doublespeak.\n\nI still don't understand how George Orwell was a socialist. He was a libertarian socialist, hence \"Homage to Catalonia\"\n\n Isn't libertarian socialist an oxymoron? :T [Google is your friend](http://en.wikipedia.org/wiki/Libertarian_socialism) I am on a site with a person who knows the answer and is most likely going to present it in a way that is unbiased and so I ask it isn't oxymoronic because there is no contradiction between worker ownership of the means of production and free association.  How would one make all private property public without the use of force? Socialism has a degree of nuance, many of them (socialists) believe in private property but not in the same form as you might. \n\nA socialist may say that private property is only being kept from being public by the use of force, which to some degree is true, as the only reality of property is the degree to which you can exclude others from it. Disagreement comes when you consider whether using force to exclude others from your property is legitimate or not. Possessions are also kept from being public by the use of force. How would one make all private property public without the use of force? How would one make all public property private without the use of force?\n\nLet me preface this by saying I believe the use of private property is the best solution to scarcity, but it still has inherent force/coercion. Joe is born into Area X. He has no property to his name because all of it is already claimed by others. He can not hunt, grow, or gather food and other materials needed for basic survival because of this. The only way he can keep himself alive is to get a job. Because he is legally not able to gather his basic needs on his own, the community as a whole is essentially able to coerce labor out of him. While he may get to choose what company he actually works for, businesses as a whole are able to coerce labor out of the non-property owners because that is really their only source of resources needed for survival. Not working is not an option because it means certain death.\n\nAs long as scarcity exists, there is no system free of coercion or force. \n\nBut as I mentioned earlier, I still think free markets and private property are the best way to handle scarcity.  Well if you want to raise the question of how to make public property private you must ask yourself, what is public property? \n\nBesides that you have to ask what options your theoretical homeless man has. He can work, which is not forced, or he can be homeless. He can buy property, because I highly doubt a world where no one is willing to sell or barter things exists, or he can pay for transportation to another area where there is more available land. There is also the question of who his parents are and how much property they have. If they abandon him he's pretty screwed, but I really cannot think of any society or world where people are happy with what they have and are not willing to exchange property and services to get what they want in return for something someone else wants How would one make all private property public without the use of force? it isn't oxymoronic because there is no contradiction between worker ownership of the means of production and free association.  Workers can buy shares of the company they work for. wait what's the relevance of this? I'm just saying that we currently live in a society where workers can own the businesses they work for.  So libertarian socialism doesn't seem to be introducing anything new. Isn't libertarian socialist an oxymoron? :T He was a libertarian socialist, hence \"Homage to Catalonia\"\n\n  work will set you free I don't know, that doesn't sound inspirational enough. Maybe using a different language would help. Latin's no good, it just sounds archaic. I don't know, maybe try German? That gives it a bit more \"umph\", don't you think? Arbeit wird frei machen?  Not that much \"umph\" imo, maybe Russian...  \n\nEdit:  (I'm kidding, I got the joke guys.  Call off the downvote brigade...)   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18l91h/calling_the_irs/"
  }, {
    "id" : 22,
    "title" : "eEconomics  - What is the Stock Market?",
    "snippet" : "   Meh, he's done better. \n\nI'd like to see someone tackle what it actually means to own a corporation. I know what it means to start a corporation, to control a corporation, to purchase the [tangible] assets of a corporation, but the part where any 3rd party schmuck can purchase a claim on the productivity of a corporation's labor force becomes a bit nebulous.\n\nCase in point: A friend started a network admin company in the late nineties, and after growing to a successful ~50 person entity he sold it to a large publicly traded organization for a tidy sum. Maybe you can guess what happens next; fast forward a decade and management of the purchased entity is in shambles and my friend now owns a *different* network admin company that curiously has about 20% of his old company's customers/employees and growing. Meh, he's done better. \n\nI'd like to see someone tackle what it actually means to own a corporation. I know what it means to start a corporation, to control a corporation, to purchase the [tangible] assets of a corporation, but the part where any 3rd party schmuck can purchase a claim on the productivity of a corporation's labor force becomes a bit nebulous.\n\nCase in point: A friend started a network admin company in the late nineties, and after growing to a successful ~50 person entity he sold it to a large publicly traded organization for a tidy sum. Maybe you can guess what happens next; fast forward a decade and management of the purchased entity is in shambles and my friend now owns a *different* network admin company that curiously has about 20% of his old company's customers/employees and growing.",
    "url" : "http://www.youtube.com/watch?v=KAQr5Qrh4xQ"
  }, {
    "id" : 23,
    "title" : "Where Are My Data?!",
    "url" : "http://cafehayek.com/2013/02/wheres-my-data.html"
  }, {
    "id" : 24,
    "title" : "Thought /r/Anarcho_Capitalism would enjoy this ",
    "snippet" : "  I read this quote and I immediately think of an obnoxious teenager full of tattoos and piercings  \"Hey look at me, I'm so cool because I am an Ancap like Milton Friendman and Slipknot. Ron Paul should be President!\" \"Hey look at me, I'm so cool because I am an Ancap like Milton Friendman and Slipknot. Ron Paul should be President!\" Slipknot are AnCaps???\n\nFinally we get some musicians on our side! \\&gt;Slipknot\n\n\\&gt;Musicians I don't get it... I don't get it...  \"Not living by society's standards\".\n\nYeah except we all pay our taxes and don't live any differently from statists. Having different opinions does not equal living differently. \n\nThose same words could apply to almost any philosophical, political or any other movement. or as stefan molyneux said live as though the state doesnt exist  If I did that I would be arrested within the week.\n\nPolice - What are you doing sir?\n\nMe - I'm homesteading this field motherfucker.\n\nPolice - That field is a state owned park sir, you can't build that th...\n\nMe - State? What's that?\n\nPolice - You're nicked sunshine! your missing the point. it is to live as freely as one person can in this current system.  Everyone does that, whether they are statists, socialists, AnCaps or chiropodists. It is impossible not to act in such a way. Every time you make a choice you are exercising freedom. Not everyone goes shooting, buys precious metals, uses bitcoin, does not consent to search, etc...\n\nThere are plenty of ways to exercise freedoms within the current system, freedoms that many people don't exercise because of fear of the state.  &gt;Not everyone goes shooting, buys precious metals, uses bitcoin, does not consent to search, etc...\n\nI don't do the first three, but not out of fear of the state, just because I'm not that interested. non sequitur I agree with the initial poster you replied to who said this:\n\n&gt;Every time you make a choice you are exercising freedom.\n\nSeems like in your reply, you're saying that only doing certain things you think are exercising freedom qualify as exercising freedom, and people don't exercise it because they're afraid. I was just offering a counterpoint.\n\nPersonally, I think most people don't give two shits about the state on a daily basis, especially when it comes to their personal actions.  Not everyone goes shooting, buys precious metals, uses bitcoin, does not consent to search, etc...\n\nThere are plenty of ways to exercise freedoms within the current system, freedoms that many people don't exercise because of fear of the state.  \"Not living by society's standards\".\n\nYeah except we all pay our taxes and don't live any differently from statists. Having different opinions does not equal living differently. \n\nThose same words could apply to almost any philosophical, political or any other movement.    ",
    "url" : "http://i.imgur.com/DQ2v6CO.jpg"
  }, {
    "id" : 25,
    "title" : "Jim Grant On Global Central Bank Currency Devaluation: Monetary Revolution Is Devouring Its Children",
    "url" : "http://www.youtube.com/watch?v=kukWsqdCJMQ"
  }, {
    "id" : 26,
    "title" : "Why has the price of gas gone up so much recently?",
    "snippet" : "The gas prices have really jumped up a lot? Any AnCaps that can explain to me why this might be?\n\nUsually I think gas prices correlate a lot with inflation but I wouldn't think Inflation would cause such a drastic jump up of prices.  Inflation, likely, has little or nothing to do with the recent price spike. A quick googling of the issues seems to point to the summer spike in demand starting to appear. Suppliers are also switching to more expensive, \"cleaner\", EPA demanded, summer blends. \n\nI could see the recent blizzard on the east coast having had an impact as well. \n\nI'm not really surprised at the recent hike. If regular unleaded gets above $4.30 - 4.50, here in WI, then I might get a little worried as to wtf is going on. But, I'd say right now its about where it \"should\" be.  Madisonian here. Where in WI are you if you don't mind me asking? Ah, Madison. I grew up there. Wonderful place. A tad small for my liking though. \n\nIn good ole Milwaukee now. \n\nSo, in that sea of liberals, got any AnCap friends/acquaintances around there?  Unfortunately not. I have a good friend who is libertarian but not that into politics, but I try not to proselytize too hard at him.\n\nI will be in MKE area quite often on the weekends this summer for cycling races. I'll try to let you know where/when if you'd like to meet up for a beer or something! Sounds good to me, let me know. Always up for conversation with a fellow AnCap, considering my lack of AnCap (or even libertarian) acquaintances.   No, it's inflation.   Often inflation is not even, because all that printed up money leads to a huge amount of leverage and speclation as it ebs and flows in and out of markets.   The talk about refinieries, depletion of resources, regulations, anything and it's mother to distract from the money printing.   Some of those things trigger the hedge funds pilig on, but in the end it is still inflation.\n\nThe real question, is'nt if this is inflation, but if this is the big one.   Eventually, all this money games are going to cause the USA to have a argentina like currency crises.     I'd guess it's a combination of inflation with some real world supply-demand issues.  For example, isn't the east catching up on industrialization and increasing its use of things like cars? Yes it is, but the core cause across the board for all prices is still the inflation. Many of the industrialization trends are long term trends that the market has plenty of time to catch up with.   No, it's inflation.   Often inflation is not even, because all that printed up money leads to a huge amount of leverage and speclation as it ebs and flows in and out of markets.   The talk about refinieries, depletion of resources, regulations, anything and it's mother to distract from the money printing.   Some of those things trigger the hedge funds pilig on, but in the end it is still inflation.\n\nThe real question, is'nt if this is inflation, but if this is the big one.   Eventually, all this money games are going to cause the USA to have a argentina like currency crises.    ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18m3l7/why_has_the_price_of_gas_gone_up_so_much_recently/"
  }, {
    "id" : 27,
    "title" : "Thoughts on Sticky price/wage theory...",
    "snippet" : "Alright, so I thought I would bring this here instead of r/libertarianism as I have had much greater luck with you guys. \n\nWhat is the Austrian/free-market response to this issue? I understand price theory and its implications, but if Keynes is right in that the stickiness of wages/prices is dominant in the economy, then the price system would give false signals and lead to Keynesian cycles (with decreased demand resulting in decreased employment ect.)\n\nThanks a ton guys! If I am making any false assumptions please tell me.  I think the answer is that it's not a false signal because wage prices reflect an employer's concern about employment contract length and wage levels, etc.  Just because an employer is hesitant to respond, doesn't mean they won't eventually.  Also, if employers can get used to inflation, why can't they get used to deflation?  Further, ask a Keynesian to define a \"false signal\".  I think it means any result they don't like.  I'd recommend posting this to:\n\nhttp://www.reddit.com/r/austrian_economics/\n\n Posting it to /r/austrian is a much better idea, imo.   I'm not an expert in Austrian economics, but my immediate question is \"why does there have to be a response?\" Yes, I think it is rather obvious that companies prefer to fire people than to cut wages, and so some amount of \"stickiness\" in wages is to be expected.    ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18lirg/thoughts_on_sticky_pricewage_theory/"
  }, {
    "id" : 28,
    "title" : "Used to Work For the Police; Became an Ancap; No Longer Work For the Police; Just Bought My First Piece of Capital; Wish Me Luck",
    "snippet" : "  I used to work for the police and (in large part) due to my experience there it slowly drove me from minarchism to voluntarism. I, finally, no longer work there and bought an industrial laser cutter with my savings. Feels good to finally be on the path to doing something productive and working for myself. That's awesome.  Just curious, what are you going to be using the laser cutter for? Pretty much anything I can make money on. It's an extremely flexible tool and gives me the ability to get into really small markets without a lot of difficulty. I plan on doing small stuff like acrylic and wood keychains, leather work (watch bands, belts, [motorcycle masks](http://i.imgur.com/9v4jK.jpg)), and pretty much anything I can get into. It can cut and engrave wood, leather, plastics, cloth and textiles, etc, so there is a pretty wide range of stuff I can get into. As a free bit of advice, which may or may not be helpful to your plans. \n\nMy company makes some small industrial PC devices that go into the field, and we are constantly in need of small custom acrylic boxes, little metal faceplates, etc. \n\nWe have a local CNC guy we deal with, but I'm sure if you find a some local engineering / industrial products companies they would be interested in seeing some of your samples. \n\nSome good things about such clients from your perspective are: (a) They are buying in relatively small quantities (ie. 100 at a time), therefore competing against China isn't a concern, (b) They constantly need something custom - so they prefer to deal locally, and (c) There are healthy profit margins on their products, so they can afford to spend $20 for an enclosure.\n\n That's great advice. I will definitely see if I can scout out some clients in that industry. That's one thing I really love about this tool; that it is so flexible and can very efficiently cater to small markets and there is very little costs in doing small qty, custom output. It would definitely be nice to have some clients that have regular work for me and I can kind of make my bread and butter from. Thanks for the tip. That's great advice. I will definitely see if I can scout out some clients in that industry. That's one thing I really love about this tool; that it is so flexible and can very efficiently cater to small markets and there is very little costs in doing small qty, custom output. It would definitely be nice to have some clients that have regular work for me and I can kind of make my bread and butter from. Thanks for the tip. Pretty much anything I can make money on. It's an extremely flexible tool and gives me the ability to get into really small markets without a lot of difficulty. I plan on doing small stuff like acrylic and wood keychains, leather work (watch bands, belts, [motorcycle masks](http://i.imgur.com/9v4jK.jpg)), and pretty much anything I can get into. It can cut and engrave wood, leather, plastics, cloth and textiles, etc, so there is a pretty wide range of stuff I can get into. Awesome man, I wish you a lot of luck!  Make some Bitcoin-related stuff, including maybe keychains or phone-holders.\n\nYou could also make a shoehorn with \"/r/malefashionadvice\" on it and I bet it would sell well if you made it unique and fun looking. Thanks, after a few years of not-so-great luck, it looks like things will be heading in the right direction. I definitely plan on making some bitcoin related stuff and was even thinking about doing a run of keychains if I could gauge some interest. I wonder how receptive this sub would be to me making some voluntarist keychains. This could totally be a good business model, I see you having a tv show on the history channel. \n\n\n\"TONIGHT.....on Legendary Lasers!  the bossman etches up some CUSTOM keychains, but its easier SAID...then done\"\n\n\n\"Billy [bleep]dammit wheres my mother[bleep]ing templates at!? **[bleeeeeeeep]**\"\n\n(Billy is a swamp man you have hired as your assistant) Pretty much anything I can make money on. It's an extremely flexible tool and gives me the ability to get into really small markets without a lot of difficulty. I plan on doing small stuff like acrylic and wood keychains, leather work (watch bands, belts, [motorcycle masks](http://i.imgur.com/9v4jK.jpg)), and pretty much anything I can get into. It can cut and engrave wood, leather, plastics, cloth and textiles, etc, so there is a pretty wide range of stuff I can get into. Thanks for the reply and the quick education.  Best of luck to you.  :) I used to work for the police and (in large part) due to my experience there it slowly drove me from minarchism to voluntarism. I, finally, no longer work there and bought an industrial laser cutter with my savings. Feels good to finally be on the path to doing something productive and working for myself. I used to be in the navy and in large part to my experience there it drove me from being a neo-con to a minarchist (now well on my way to ancap).  Funny how that works. I used to work for the police and (in large part) due to my experience there it slowly drove me from minarchism to voluntarism. I, finally, no longer work there and bought an industrial laser cutter with my savings. Feels good to finally be on the path to doing something productive and working for myself.  Don't let /r/anarchism know, you're not supposed to have that because it's made of special production atoms that everyone owns.  Congrats, eitauisunity. Create a LLC, transfer your capital to LLC, and bask in state privilege once again. Is that a subcompact s&amp;w mp40 I see?\n\nGood luck! Thanks man. I've set up a couple of LLC's before but I'm still trying to weigh the benefits of it in my state. Also, yes it is in fact a subcompact mp40, I hadn't realized that was sitting there, lol. I was thinking that may be a part of the \"bought my first piece of capital\" statement. I thought you might be thinking of getting into the state business. Lol, I've had *that* \"piece of capital\" for a while now. The best investments are in the things that will protect your life: Fire extinguishers, seat belts and firearms. I never leave the house without at least one seat belt on me. Congrats, eitauisunity. Create a LLC, transfer your capital to LLC, and bask in state privilege once again. Is that a subcompact s&amp;w mp40 I see?\n\nGood luck! OP will still have to pay taxes as if he were a sole proprietorship if he rolls a single-member LLC.\n\nSource: I own a single-member LLC. Basically the only benefit is shielding from most civil liability beyond the border between me and my business. The government treats me as if I am a sole proprietorship.\n\nHopefully OP already knows to claim his equipment as a deduction on his taxes, assuming he actually, you know, makes some money with it this year. OP will still have to pay taxes as if he were a sole proprietorship if he rolls a single-member LLC.\n\nSource: I own a single-member LLC. Basically the only benefit is shielding from most civil liability beyond the border between me and my business. The government treats me as if I am a sole proprietorship.\n\nHopefully OP already knows to claim his equipment as a deduction on his taxes, assuming he actually, you know, makes some money with it this year. Why not set up a S-corp?  Mad props, OP. You're inspirational. I've actually been floating the idea in the back of my mind to open up a 3D printing stand or boutique, like in a mall or other heavy foot traffic shopping area. Stop stealing my thoughts.  That is my IP damn it. Lol. But we won't even have to compete as long as we are in different venues. We can even share 3d print models/templates we acquire.\n\nThese bad boys are nice and really futuristic/high-techy-looking: http://cubify.com/cube/ , which I think would be more impressive for passersby, but I am still looking around.\n\nI've actually contacted the leasing people for my local mall inquiring about booth/cart rental pricing. The last thing I have to do to see if the business would even be viable is figure out material cost for making something and then see if the retail price point is high enough such that I could make enough margin to pay the bills.  Lol. But we won't even have to compete as long as we are in different venues. We can even share 3d print models/templates we acquire.\n\nThese bad boys are nice and really futuristic/high-techy-looking: http://cubify.com/cube/ , which I think would be more impressive for passersby, but I am still looking around.\n\nI've actually contacted the leasing people for my local mall inquiring about booth/cart rental pricing. The last thing I have to do to see if the business would even be viable is figure out material cost for making something and then see if the retail price point is high enough such that I could make enough margin to pay the bills.  TBH I was not quite thinking of using the mall method, although that should generate plenty of interest.  I haven't done much to look into it at this point and don't understand all the specs invoved.  \n\nI would ideally want to get into a market where I could still perform my chemistry experiemants of choice.  From the guy who did that he has a model about the price you wee looking at, but from my understanding that is a pretty small work area for these (although that model looks trendy as hell).  Granted that will all depend on what you want to do on it.  http://3dprinterhub.com/3d-printer-brands#personal\n\nMy main issue is determining what peopel woudl want from them.\n\nI would really like to hold out to see if some basic alloys could be done on these smaller models but it might be worth while getting into it early.\n I was figuring toys, figurines, etc. I think it would make a lot of people stop and watch, and then a parent would pay $5-$10 to let their kid pick out something from a catalog or a set of display items, and then get to watch it being made. It'd be more centered around the novelty of it, but hey, that's what malls are all about! Mad props, OP. You're inspirational. I've actually been floating the idea in the back of my mind to open up a 3D printing stand or boutique, like in a mall or other heavy foot traffic shopping area. Only takes a small investment to start a business.  Well, probably the biggest expense for a really small startup like OP is having to continue paying bills while trying to make the business work. I.e. you need to pay yourself a salary, so the real break even/profit point is higher than you might think at first glance. So even if you have some cash to start the business, you might end up having to take a business loan or something to pay yourself a salary so that you can afford your electricity, mortgage/rent, etc. at home.  Sorry, your capital now belongs to the commune.  If you ever need any modeling help let me know. If you ever need any modeling help let me know.  Congrats. I'm dieing to escape wage slavery and finally own my own business as well. Working with your hands is especially rewarding, because you can see what you accomplished at the end of the day. Good luck. Congrats. I'm dieing to escape wage slavery and finally own my own business as well. Working with your hands is especially rewarding, because you can see what you accomplished at the end of the day. Good luck.  Etau! im proud of you. I wish you luck on your future endeavours.  Having worked for the beast as well... One idea might be to offer the service of engraving an official seal and individual barcodes for inventory tracking. \n\n\nSchool districts would use stickers on PCs but they would get pulled off by little Jimmy Pimpleface all the time.  Congrats on going out on your own.  I did it as well, and it feels good.   I think this is wonderful.  As a serial entrepreneur, let me share some general business advice:\n\n1) Sell something unique. You've got a tool that allows for customization, that's great, just figure out how to maximize the value of that uniqueness and then market that.  The net is full of people selling identical asian made wares.  Let me restate that.  Find something that your competitors can't do, and then take the *benefit* of that unique selling proposition, and market it.   If you're making X for the Y crowd, don't market \"just another X\" market the unique benefits that the Y group finds beneficial.   Focus on the benefits (\"it will let you do Z, W, &amp; Q!\") rather than the features (\"Contains 23megafranks of unobtanium\")\n\n2) Sell something valuable. When you're small, getting a few customers is hard.  You want to be able to live off of the income from a few customers, instead of needing to make 10 million of something at a profit of a penny each.   Way too many people make a million of something at a cost of $5 each when the market value is $3-$4 and there are already plenty on the market.   What can you sell for $10,000? $100,000?  $1,000?  People spend huge amounts of money customizing vehicles and on other hobbies and escapes.   If you're customer is giving you over $500 each time they buy and they think its a steal-- that's a great place to be in (especially if your margin is $250, or even $400!) \n\n3) Fail Fast.  It's hard to know what's good and your friends are going to want to be encouraging.  It's much better to make something straightforward, make a few of them, get them out there and listen to the feedback of the people who are actually giving you money....than to spend months or years working on something grandiose only to find out the market isn't there.  So, I would suggest making prototypes of things and then taking them to enthusiast groups and showing them off and see what they think. \n\nI've learned each of these the hard way.\n\nAn initial suggestion: Robots.  Combat robots and other robot making is a hobby where people will spend thousands of dollars on a 1 pound robot that gets destroyed in the arena.  While combat robotics is on a slow decline after the end of the TV shows, kids robotics is on the upswing with FIRST and programs like that.  The ability to make custom designed parts for them (At a good price) is valuable right there, but putting together packages or kits for the kids might also be a really good business.   It's a niche and so its easier to address.  In my town there's an amature robotics club, and if you just showed up there and told them about your cutter, unless someone else already has one, they'll mob you for a chance to use it.  \n\nSince these laser cutters need a lot of practice to get going, (my friend spent a couple months practicing with it and ended up re-engineering part of his to improve the precision) .... doing some freebies for the robot builders might be good practice....but if you don't need the practice then you could have instant cash flow for custom parts from the local robot builders.\n\nGood luck!\n Congrats on going out on your own.  I did it as well, and it feels good.   I think this is wonderful.  As a serial entrepreneur, let me share some general business advice:\n\n1) Sell something unique. You've got a tool that allows for customization, that's great, just figure out how to maximize the value of that uniqueness and then market that.  The net is full of people selling identical asian made wares.  Let me restate that.  Find something that your competitors can't do, and then take the *benefit* of that unique selling proposition, and market it.   If you're making X for the Y crowd, don't market \"just another X\" market the unique benefits that the Y group finds beneficial.   Focus on the benefits (\"it will let you do Z, W, &amp; Q!\") rather than the features (\"Contains 23megafranks of unobtanium\")\n\n2) Sell something valuable. When you're small, getting a few customers is hard.  You want to be able to live off of the income from a few customers, instead of needing to make 10 million of something at a profit of a penny each.   Way too many people make a million of something at a cost of $5 each when the market value is $3-$4 and there are already plenty on the market.   What can you sell for $10,000? $100,000?  $1,000?  People spend huge amounts of money customizing vehicles and on other hobbies and escapes.   If you're customer is giving you over $500 each time they buy and they think its a steal-- that's a great place to be in (especially if your margin is $250, or even $400!) \n\n3) Fail Fast.  It's hard to know what's good and your friends are going to want to be encouraging.  It's much better to make something straightforward, make a few of them, get them out there and listen to the feedback of the people who are actually giving you money....than to spend months or years working on something grandiose only to find out the market isn't there.  So, I would suggest making prototypes of things and then taking them to enthusiast groups and showing them off and see what they think. \n\nI've learned each of these the hard way.\n\nAn initial suggestion: Robots.  Combat robots and other robot making is a hobby where people will spend thousands of dollars on a 1 pound robot that gets destroyed in the arena.  While combat robotics is on a slow decline after the end of the TV shows, kids robotics is on the upswing with FIRST and programs like that.  The ability to make custom designed parts for them (At a good price) is valuable right there, but putting together packages or kits for the kids might also be a really good business.   It's a niche and so its easier to address.  In my town there's an amature robotics club, and if you just showed up there and told them about your cutter, unless someone else already has one, they'll mob you for a chance to use it.  \n\nSince these laser cutters need a lot of practice to get going, (my friend spent a couple months practicing with it and ended up re-engineering part of his to improve the precision) .... doing some freebies for the robot builders might be good practice....but if you don't need the practice then you could have instant cash flow for custom parts from the local robot builders.\n\nGood luck!\n  What a change, kudos to you for your integrity! What were your primary influences outside of your experiences within the police force? How close are your familial relationships and what effect has your philosophy and decisions brought to those relationships? Well, a lot of my influence came from this sub initially, but once I pretty much decided I was an ancap is when I joined the mumble/minecraft communit known as /r/civcraft (then called /r/ancapminecraft). There are a lot of really good people in that community and it was a really good forum to develop some of my ideas. My family connections are...somewhat of an odd situation, but that's another story. \n\nAs far as what my philosophy has brought to my relationships it has definitely had a positive impact, but I've seen the biggest improvement in my overall happiness and personal development. It's been an interesting couple of years and I'm glad to be out from under all of that cognitive dissonance. If you don't care to share your familial relationships, I understand, that is quite personal. But if you're worried that we would not find that interesting, I would find them very interesting. I think they are a key part of the ancap philosophy. \n\nWhat arguments from /r/civcraft were most influential? Do you feel that the presentation had as much of an effect on your acceptance of it as the substance? If you found the presentation contributive, what about it attracted you?\n\nHow do your feel your cognitive dissonance has changed? Have you identified the source of it in your past? Do you feel that you are still vulnerable to it?\n\nWhat was your most difficult hurdle in becoming an ancap?\n\nHow were your relationships with your coworkers affected by your philosophical development? If you don't care to share your familial relationships, I understand, that is quite personal. But if you're worried that we would not find that interesting, I would find them very interesting. I think they are a key part of the ancap philosophy. \n\nWhat arguments from /r/civcraft were most influential? Do you feel that the presentation had as much of an effect on your acceptance of it as the substance? If you found the presentation contributive, what about it attracted you?\n\nHow do your feel your cognitive dissonance has changed? Have you identified the source of it in your past? Do you feel that you are still vulnerable to it?\n\nWhat was your most difficult hurdle in becoming an ancap?\n\nHow were your relationships with your coworkers affected by your philosophical development?  Whoa, cool. How much does a setup like that even cost?       When you find your niche, build a website or hire an ancap like me to do it theft free and then spam us for your services. Yes. I will be participating in as much agorism and theft free exchanges as possible. I like the idea of keeping as much money as I can get away with from people who will just blow it on blowing up poor people and perpetuating a giant ponzi scheme.\n\nI also will definitely have a preference for working with other ancaps/voluntarists on collaboration stuff. \n\nI'll friend you on here and pm if I ever need anything web-related (although I already know a guy in australia who is a voluntarist and might be willing to help me out as well).    DUDE!  Engrave all the things, engrave guitars, belt buckles, flippin anything.  That would be awesome Yes. Everything I can get my hands on will be engraved. I can't wait to get it set up and functional (I have an appointment tomorrow for one of their technicians to call me to walk me through setup). I have a shitload of test materials that I am going to experiment with. I'll probably post pictures when I can. I was even thinking of video documenting it and maybe even doing some tutorials and youtube stuff. Yes. Everything I can get my hands on will be engraved. I can't wait to get it set up and functional (I have an appointment tomorrow for one of their technicians to call me to walk me through setup). I have a shitload of test materials that I am going to experiment with. I'll probably post pictures when I can. I was even thinking of video documenting it and maybe even doing some tutorials and youtube stuff. Yes. Everything I can get my hands on will be engraved. I can't wait to get it set up and functional (I have an appointment tomorrow for one of their technicians to call me to walk me through setup). I have a shitload of test materials that I am going to experiment with. I'll probably post pictures when I can. I was even thinking of video documenting it and maybe even doing some tutorials and youtube stuff. Yes. Everything I can get my hands on will be engraved. I can't wait to get it set up and functional (I have an appointment tomorrow for one of their technicians to call me to walk me through setup). I have a shitload of test materials that I am going to experiment with. I'll probably post pictures when I can. I was even thinking of video documenting it and maybe even doing some tutorials and youtube stuff. I'd love to have pistol slides and/or gun lowers custom engraved...  You should make/engrave some awesome voluntaryist/ancap related merch and post it here, I'm sure people (me, especially) would throw bitcoins at you for it!  Nice! Will you ship internationally? I wouldn't mind a voluntarist-themed belt, keychain or similar, if the price wasn't too high for me, that is, which it sadly might be since a poor student rarely can afford custom made stuff. Either way I like the initative!\n\nAs an ex-cop, how would you approach and debate voluntarism with cops? How should I make the point that they're throwing innocent people in cages to prevent their cognitive dissonance from going rogue and shutting down all possibility of them ever thinking \"no victim no crime\"?    Hey it's Eitau! I wish you well with your venture! =)   I want to make some wrestling belts that are laser engraved - we should talk!",
    "url" : "http://imgur.com/a/2iBeC"
  }, {
    "id" : 29,
    "title" : "Austin Peterson vs Thom Hartmann - Battles Lines Crossed Over Minimum Wage",
    "snippet" : "  It's just a yelling match, although I don't entirely blame Austin, Thom would be one frustrating person to have a conversation with.   Goddamn, that was a pointless conversation. \n\nAs media hosts, you'd think they'd know how to have a conversation that is meant to inform people, (is that not the media's job?) not to prove that \"I'm right you're wrong, and I'm going to prove it by yelling what I've already said louder than you\".\n\nThis segment was epic fail. There's literally nothing to get from it. The host sets out to understand the opposite's perspective and from the beginning starts interjecting, \"No, you're wrong. NO, you're wrong. GODDAMMIT, NO, YOU'RE WRONG.\"\n\nAlso: NFL =/= capitalism. Not in the slightest.  &gt; As media hosts, you'd think they'd know how to have a conversation that is meant to inform people, (is that not the media's job?)\n\nHuh, their job is to sell advertisements and covert propaganda to a large audience for as much profit as possible. I'd say instigating critical thinking would be counter productive to their ends.",
    "url" : "http://www.youtube.com/watch?v=0sxrgFIiZhA"
  }, {
    "id" : 30,
    "title" : "Good Guy Meteor (Fallacy Edition)",
    "snippet" : " ",
    "url" : "http://m.quickmeme.com/meme/3t0izv/"
  }, {
    "id" : 31,
    "title" : "VIDEO: Making Libertarianism Cool: Are Fun Parties the Key to Winning the Trust of the Next Generation?",
    "snippet" : "  No. The people who join things because of social image are what Marx would call \"useful idiots.\" They can, indeed, be useful, but they should never be confused with real ideologues. They only make the rest of us look bad. Only if they're given as much legitimacy as those of us who actually have spent time examining the philosophy.\n\nIt's easy to see the difference between the philosophers at /r/anarcho_capitalism and the mob at /r/libertarian. No. The people who join things because of social image are what Marx would call \"useful idiots.\" They can, indeed, be useful, but they should never be confused with real ideologues. but if those idiots find it more socially appealing to join the mob then we lose   PJMedia is a Republican operation. These guys are aware that they will not be able to survive unless they rebrand to something that appeals to young people. They won't succeed at this, as libertarian thought, even in its most watered-down form, is anathema to effective democratic campaigning. You can't win by saying \"less special interest goodies for everyone!\"\n\nHowever, I think this guy seems to be a good fellow, and his approach seems sensible. We angry internet dorks may reflexively recoil to the idea of having our preserve invaded by people who shave properly and don't button their top buttons, but additional, heterogenous approaches are worth welcoming.\n\nThese moves help to soften up the general population. I don't consider the general population to be 'idiotic.' If anything, intellectuals like me are the real idiots, who waste gargantuan amounts of time on unprofitable reading and arguing. \n\nCompare that to the so-called idiot, who is rationally ignorant about most things other than what earns them money and what provides them pleasure. Attempting to convert ordinary people into intellectuals isn't a scalable strategy, because there are so few tangible benefits and many tangible negatives to reading dozens of books on social theory.  PJMedia is a Republican operation. These guys are aware that they will not be able to survive unless they rebrand to something that appeals to young people. They won't succeed at this, as libertarian thought, even in its most watered-down form, is anathema to effective democratic campaigning. You can't win by saying \"less special interest goodies for everyone!\"\n\nHowever, I think this guy seems to be a good fellow, and his approach seems sensible. We angry internet dorks may reflexively recoil to the idea of having our preserve invaded by people who shave properly and don't button their top buttons, but additional, heterogenous approaches are worth welcoming.\n\nThese moves help to soften up the general population. I don't consider the general population to be 'idiotic.' If anything, intellectuals like me are the real idiots, who waste gargantuan amounts of time on unprofitable reading and arguing. \n\nCompare that to the so-called idiot, who is rationally ignorant about most things other than what earns them money and what provides them pleasure. Attempting to convert ordinary people into intellectuals isn't a scalable strategy, because there are so few tangible benefits and many tangible negatives to reading dozens of books on social theory.  &gt;We angry internet dorks may reflexively recoil to the idea of having our preserve invaded by people who shave properly and don't button their top buttons, but additional, heterogenous approaches are worth welcoming.\n\nWait, what?\n\nWe are the clean shaven, well-dressed ones.  Most of us have career level jobs or are in universities studying something that will lead to a career level job.\n\n&gt;If anything, intellectuals like me are the real idiots, who waste gargantuan amounts of time on unprofitable reading and arguing.\n\nWell, this is subjective.  Using my valuations, learning this material was one of the most profitable things I've ever done.\n\n&gt;who is rationally ignorant\n\nI believe in justified rational ignorance, but this, again, is subjective to the person.\n\n&gt;Attempting to convert ordinary people into intellectuals isn't a scalable strategy, because there are so few tangible benefits and many tangible negatives to reading dozens of books on social theory.\n\nI agree; I don't see democracy as ever having been the true engine of social change. ",
    "url" : "http://www.pjtv.com/s/GEYTKMBT"
  }, {
    "id" : 32,
    "title" : "Praxeology, Peace, Comedy and Music",
    "snippet" : " ",
    "url" : "http://www.everything-voluntary.com/2013/02/praxeology-peace-comedy-and-music.html"
  }, {
    "id" : 33,
    "title" : "Ron Paul to host daily radio program and podcast",
    "snippet" : "  Misleading title, these are 60-second radio spots. Which is just about perfect for a man of his age and communication skills.\n\nDon't get me wrong, I love the good doctor. His presidential campaigns introduced untold thousands of people to the ideas of freedom and personal responsibility. All I'm saying is that he's also 77 years old and (sometimes) has the unfortunate habit of rambling instead of cutting to the core of his message. He achieved his successes *in spite* of his communication skills, not because of them. I think this short format will require him to strike the root more directly, and allow him to enjoy his retirement a little. Looking forward to hearing it. I think it was around 25-30% of his followers who did not vote, and will not.\n\nThat was a good rounding up after 3 decades of political service, but the other 70% became even harder statists (constitutionals)... I'm a libertarian. What is the main difference between me and a constitutionalist? Not very educated in their party's beliefs. Limited gov (minarchism) = monopoly of the force. \n\nEven the word libertarian is used in exchange of minarchism today.\n\nIf you think a state apparatus is needed, to me that is a statist, instead of statist light as some prefer.  I describe myself as a libertarian because I believe in zero government involvement in an individual's financial and social situations. I believe it's what Charles Murray describes as the \"big L libertarian\". There is no purpose for government. However I do believe that the path to voluntarism is by taking away the governement's powers from the inside. I like Ron Paul, I wouldn't describe him as a statist. He's closely associated with the libertarian party and describes himself as an AnCap. Like him, I believe having liberty-minded people in government can help take down the wannabe dictators. I do not think switching from a government-dependent society where many people rely on welfare to a voluntary society would work very well. Many people do not understand the concepts of individualism and independence, and many people do not even understand what capitalism is anymore.  &gt; However I do believe that the path to voluntarism is by taking away the governement's powers from the inside.\n\n\nAnd, how is it going? \n\n\n&gt;  I like Ron Paul, I wouldn't describe him as a statist.\n\n\nAs I said, *statist light*\n\n\n&gt; He's closely associated with the libertarian party \n\nThat never increased more than 1% through out its life.\n\n\n&gt; describes himself as an AnCap.\n\n\nI highly doubt that. Voting is a violation of the nap, he wanted votes to break the nap.\n\n\n&gt; Like him, I believe having liberty-minded people in government can help take down the wannabe dictators.\n\n\nAnd, how has that gone? You must remember that the current system was not pushed with intellect, but rather dictatorial and moral. It is useless to invest intellect to fight legal criminals.\n\n\n&gt; I do not think switching from a government-dependent society where many people rely on welfare to a voluntary society would work very well.\n\n\nCare about yourself, your kids, partner, friends and colleagues. You are in no position to change anything else other than yourself. \n\n\n&gt; Many people do not understand the concepts of individualism and independence, and many people do not even understand what capitalism is anymore.\n\n\nThat is because most libertarians just give theoretical scenarios, rather than change anything in their own lifes.\n\n\nWho would take a 300kg man seriously, advertising a diet plan?\n\nThat is what many people feel when they interact with your average libertarian.   I didn't really seem to disagree with you on any points but apparently this is an argument now? He has described himself as an AnCap before. And I firmly believe a switch to an AnCap society TOMORROW would not work because people are so used to leeching off of the government and the government leeching back. You quoted most of my response and countered with more \"libertarians are statists too\". I don't know what to say, if you want people to think the way you do and become Ancaps as well you should probably reconsider the way you market your believes (don't go on a rampage and fight with everyone). Also, you said something along the lines of \"how's that working out for you?\" [on my phone, I cannot see what you wrote]. We have not decreased government's power, we've only increased it because we have these power-hungry republicans and democrats making more and more laws. You say we propose theoretical situations but 1) I find that to be contradictory to the belief of individualism, since you're generalizing all of us into a group that has the exact same beliefs? I disagree and 2) Id like to see what you propose in order to switch to an AnCap society. Assassinate everyone in the White House and capital building? It's not a theoretical situation at all. It's to get idiots out of office and repeal laws until government is nonexistent. I like Ancaps but some of you really like fighting even when someone like myself agrees with you on many points. &gt; I didn't really seem to disagree with you on any points but apparently this is an argument now?\n\n\nJust an exchange of ideas. \n\n\n&gt; He has described himself as an AnCap before.\n\n\nLink or it did not happen. \n\n\n&gt; And I firmly believe a switch to an AnCap society TOMORROW would not work because people are so used to leeching off of the government and the government leeching back. You quoted most of my response and countered with more \"libertarians are statists too\". \n\n\nThat does not change the fact that you prefer the state still. \n\n\n&gt; Also, you said something along the lines of \"how's that working out for you?\" [on my phone, I cannot see what you wrote]. We have not decreased government's power, we've only increased it because we have these power-hungry republicans and democrats making more and more laws.\n\n\nFrom its founding 30 years ago, the libertarian party went from 1% down to.89 in the last elections.\n\nI am going with the facts.\n\n\n&gt; 1) I find that to be contradictory to the belief of individualism, since you're generalizing all of us into a group that has the exact same beliefs? \n\n\nThere is the seen and unseen. Political process is a killer, never a problem solver. History is pretty clear. \n\n&gt;Id like to see what you propose in order to switch to an AnCap society. \n\n&gt;&gt;Care about yourself, your kids, partner, friends and colleagues. You are in no position to change anything else other than yourself.\n\nThat is my advise to all\n\n\n&gt; Assassinate everyone in the White House and capital building? It's not a theoretical situation at all. It's to get idiots out of office and repeal laws until government is nonexistent. I like Ancaps but some of you really like fighting even when someone like myself agrees with you on many points.\n\n\nThere is absolutely no difference between you and a statist if you think that, you both want to coerce me and other napsters.  &gt; I didn't really seem to disagree with you on any points but apparently this is an argument now?\n\n\nJust an exchange of ideas. \n\n\n&gt; He has described himself as an AnCap before.\n\n\nLink or it did not happen. \n\n\n&gt; And I firmly believe a switch to an AnCap society TOMORROW would not work because people are so used to leeching off of the government and the government leeching back. You quoted most of my response and countered with more \"libertarians are statists too\". \n\n\nThat does not change the fact that you prefer the state still. \n\n\n&gt; Also, you said something along the lines of \"how's that working out for you?\" [on my phone, I cannot see what you wrote]. We have not decreased government's power, we've only increased it because we have these power-hungry republicans and democrats making more and more laws.\n\n\nFrom its founding 30 years ago, the libertarian party went from 1% down to.89 in the last elections.\n\nI am going with the facts.\n\n\n&gt; 1) I find that to be contradictory to the belief of individualism, since you're generalizing all of us into a group that has the exact same beliefs? \n\n\nThere is the seen and unseen. Political process is a killer, never a problem solver. History is pretty clear. \n\n&gt;Id like to see what you propose in order to switch to an AnCap society. \n\n&gt;&gt;Care about yourself, your kids, partner, friends and colleagues. You are in no position to change anything else other than yourself.\n\nThat is my advise to all\n\n\n&gt; Assassinate everyone in the White House and capital building? It's not a theoretical situation at all. It's to get idiots out of office and repeal laws until government is nonexistent. I like Ancaps but some of you really like fighting even when someone like myself agrees with you on many points.\n\n\nThere is absolutely no difference between you and a statist if you think that, you both want to coerce me and other napsters.  Limited gov (minarchism) = monopoly of the force. \n\nEven the word libertarian is used in exchange of minarchism today.\n\nIf you think a state apparatus is needed, to me that is a statist, instead of statist light as some prefer.  Also, I was asking what the constitutionalist party believes in is all. As I mentioned I think the path to freedom is not immediate and the constitution is important before we get there. Specifically because of the bill of rights. It does not grant us rights but it does guarantee them. Because of the bill or rights, an individual informed of \"the law\" may easily prevent police abuse of power with the fifth and fourth amendment, not to mention the first, sixth, and ninth.  The Constitution Party? [Here's](http://www.constitutionparty.com/OurPrinciples/2012Platform/tabid/127/Default.aspx) the answer to that question. It's a fairly libertarian platform, but with restrictions on things like gay marriage, gambling, adult entertainment, and immigration.\n\nThat said, the Constitution Party doesn't have a claim over the word \"constitutionalist\" (I don't even know if they use it themselves). When someone talks about constitutionalists, they're just describing people who believe in the sanctity of the U.S. Constitution regardless of what political parties they might be involved in. These tend to be nationalistic \"patriot\" types who revere the U.S. founders as prophets and the Constitution and Declaration of Independence as sacred texts. A lot of conservatives who set out on the journey to discover freedom end up in this camp and never get any further. The religion of state-worship is very hard for people to leave behind.  I want mah Tom Woods. ",
    "url" : "http://rt.com/usa/news/ron-paul-radio-courtside-252/"
  }, {
    "id" : 34,
    "title" : "Libertarianism, Race, and the Titanic",
    "snippet" : "  These kind of podcast would have been cool 10 years ago to build up in my opinion.\n\n\nBut today we know that reason and evidence play no part in the statist world shaping up. That is why I think it is useless trying to prove that other statists are wrong, when the statist did not convince anybody to be right to begin with.  &gt;That is why I think it is useless trying to prove that other statists are wrong, when the statist did not convince anybody to be right to begin with.\n\n\nThey have rationales for what they believe, just like very religious people, and in the same way they can be exploded, I know because I've done it and I've been in their shoes myself growing up as a moderate liberal / believer, yet I was convinced otherwise. \n\nIf you think political discourse with \"statists\" is *necessarily* futile, ok, that's a nice opinion but your statement is ahistorical and logically makes no sense; if people who believed in dumb stuff could never be convinced of anything else through reason because reason wasn't used in the first place to implant their ideas we'd still be in the stone age.\n\n\n\n",
    "url" : "http://www.youtube.com/watch?v=uY9ODLE9uj8"
  }, {
    "id" : 35,
    "title" : "The next time you're put on the spot and pressured to justify your views in a short time window, consider borrowing from this distilled style of talking about anarchy.",
    "snippet" : "  Milton Friedman also brought about this style of discussion...\n\n[See here.](http://www.youtube.com/watch?v=RWsx1X8PV_A)  that video is 90 minutes long. you called that distilled? Well, it's what he's saying right where I linked it, to get people to stop looking at government and policymakers as anything but mortal, ignorant humans.  Just because we opt for the gov't to do something does not imply anything about increased reliability.\n\nIf a person wants to watch all of it though, from the beginning, I'd highly encourage it.  This video is easily one of the best out there on the subject.",
    "url" : "http://www.youtube.com/watch?v=FOFdvPyp1rI&amp;t=42m10s"
  }, {
    "id" : 36,
    "title" : "Ex-Cop/Ex-Military to Voluntarist",
    "snippet" : "   ",
    "url" : "http://www.youtube.com/watch?v=SjsaVzebFrE"
  }, {
    "id" : 37,
    "title" : "If you are calling for minimum wage increases than you have to acknowledge that you are creating inflation through your monetary policy. Right?",
    "snippet" : "  i like how the two sides of the debate were referred to as \"advocates\" and \"business groups\".  Setting the narrative in emotional terms is very important when the facts are against you. well, it is always important, rhetorically. however, I have not ever seen any other argument made for the minimum wage. its always \n\n\"this will create jobs\"\n\n\"how?\"\n\n\"by giving them more money, do you want there to be a wage death spiral?\"\n\n\"doesn't it create more unemployment?\"\n\n\"wtf why do you hate poor people?\" well, it is always important, rhetorically. however, I have not ever seen any other argument made for the minimum wage. its always \n\n\"this will create jobs\"\n\n\"how?\"\n\n\"by giving them more money, do you want there to be a wage death spiral?\"\n\n\"doesn't it create more unemployment?\"\n\n\"wtf why do you hate poor people?\" Setting the narrative in emotional terms is very important when the facts are against you. Thats funny since I never see actual data in this sub I don't understand why this is downvoted. No data is actually one core tenet of Austrian economics : use of deductive systems instead of empiricism. And you're proud of that? I am not AnCap.\n\nI am actually a SRSer, even though this account doesn't post in the Fempire any more.  The minimum wage is bad because it creates unemployment and decreases efficiency. But it does NOT cause inflation. I don't believe the title is saying that, it's saying that monetary policy is causing inflation, which in turn leads to politicians calling to raise the minimum wage. So a rising minimum wage is a symptom of inflation, not the other way around. \n\n(not arguing with you, just pointing that out cause when I first read the title I also thought it was saying minimum wage caused inflation) The minimum wage is bad because it creates unemployment and decreases efficiency. But it does NOT cause inflation. The minimum wage is bad because it creates unemployment and decreases efficiency. But it does NOT cause inflation. Thank you.  Minimum wage does not change the monetary supply.  Prices will rise because of the increased cost of production - not because of inflation. unfortunately team Orwell changed the meaning of inflation to mean an increase in prices over time. It's no longer tied to the supply of money. So if we're practicing our double speak, yes a minimum wage increase causes inflation. unfortunately team Orwell changed the meaning of inflation to mean an increase in prices over time. It's no longer tied to the supply of money. So if we're practicing our double speak, yes a minimum wage increase causes inflation. I was thinking that, but what's \"Team Orwell?\" Theres  a great book called 1984 by george orwell unfortunately team Orwell changed the meaning of inflation to mean an increase in prices over time. It's no longer tied to the supply of money. So if we're practicing our double speak, yes a minimum wage increase causes inflation. What the fuck are you talking about? What the fuck are you talking about? The minimum wage is bad because it creates unemployment and decreases efficiency. But it does NOT cause inflation. The minimum wage is bad because it creates unemployment and decreases efficiency. But it does NOT cause inflation.  Take it as someone from Australia... our forced minimum wage is dictated by age and unions, and you know what? It sucks.\n\nI'm 20 now (just a young one), and my minimum union based rate (almost all big store rates are based on union contracts, even if you are not part of a union) is at over $20 an hour or so. And you know what that does?\n\nIt means I can not get a casual job for the life of me (while at university). They're hiring the 16 year olds whom they can pay $8.40 per hour. These jobs often don't need previous experience. \n\nI would rather that these larger retailers pay for experience rather than for age. Just because I'm 20 doesn't mean I know the in's and out's of running in a retail setting. Some 17 year olds probably know more, yet they would be paid almost $10 less than me, simply due to my age.\n\nThe price of living here is also ridiculous. It is literally cheaper for me to live in Paris than it is here (Brisbane).  Your minimum wage is $20 an hour and that still hasn't fixed your problems?\n\nPerhaps we need to double that ... In my opinion, it needs to go even higher. In my opinion, it needs to go even higher. Take it as someone from Australia... our forced minimum wage is dictated by age and unions, and you know what? It sucks.\n\nI'm 20 now (just a young one), and my minimum union based rate (almost all big store rates are based on union contracts, even if you are not part of a union) is at over $20 an hour or so. And you know what that does?\n\nIt means I can not get a casual job for the life of me (while at university). They're hiring the 16 year olds whom they can pay $8.40 per hour. These jobs often don't need previous experience. \n\nI would rather that these larger retailers pay for experience rather than for age. Just because I'm 20 doesn't mean I know the in's and out's of running in a retail setting. Some 17 year olds probably know more, yet they would be paid almost $10 less than me, simply due to my age.\n\nThe price of living here is also ridiculous. It is literally cheaper for me to live in Paris than it is here (Brisbane).  Go Broncos!  They don't have to acknowledge anything. They're still blaming Bush for the everything that's wrong in the world while refusing to admit that Obama's policies have anything to do with it.\n\nObama is still campaigning as the outsider who's waging a fierce battle against the establishment forces for the good of the little guy. If he won't acknowledge that he's part of the government, why would he have to acknowledge this?\n\nIt's interesting that most dictators follow the same paradigm. Castro, Chavez, Mao, etc all claim to be fighting against the oppressive forces as they themselves are actually running the oppressive machinery... and the people largely believe them. You people are fucking hilarious. There's a guy 6 inches about this post writing about how everyone is being RAPED and a ton of people here agree with him and yet you can still post something about how it is *Obama* that acts oppressed by the world at large. \n\nHoly.... fucking... shit. That you didn't perceive the monstrous hypocrisy there is.... perfectly An-Cap of you.  They are two different posts posted by two different individuals.\n\nI don't understand your point. You're posting on a Reddit where more people cry RAPE than they do over at /r/feminist and you're simultaneously claiming that Obama is complaining too much about being oppressed. \n\n DAE reading comprehension? One post by one person using rape as an analogy does not make this a sub-reddit full of people crying about rape. Also, nobody said Obama was being oppressed, just that he's being a hypocrite. http://www.reddit.com/r/Anarcho_Capitalism/search?q=rape+&amp;restrict_sr=on\n\n You're posting on a Reddit where more people cry RAPE than they do over at /r/feminist and you're simultaneously claiming that Obama is complaining too much about being oppressed. \n\n You people are fucking hilarious. There's a guy 6 inches about this post writing about how everyone is being RAPED and a ton of people here agree with him and yet you can still post something about how it is *Obama* that acts oppressed by the world at large. \n\nHoly.... fucking... shit. That you didn't perceive the monstrous hypocrisy there is.... perfectly An-Cap of you.   \"If you commit rape it will create detrimental economic situations whereby stagflationary fiat monetary polices will have a crowding out effect of consensual sex partners and a liquidity trap do to the lack of BLAH BLAH BLAH MONEY MULTIPLIER BLAH BLAH.\"\n\nReally?! How about the fact that **rape is evil**?! Do we have to argue about the economics of everything? Can't we just leave it at \"it's fucking evil, don't do it\"?\n\nUtilitarians gonna util. I mean, no. People care about what works. Whether or not something will be better or worse off is what matters to most people. You have to take a pragmatic, not idealistic, point of view when arguing these points. As much as the moral implications matter to you or I, and as much as it seems right to argue from that standpoint, most people simply don't give a shit and will dismiss your \"pipe dreams\" or \"fantasy utopia\" just as quickly as your bring it up. I only hear utilitarian arguments from Libertarians. All the other people I speak with always use the argument from morality.\n\n* need welfare because we should care about the poor\n\n* need foreign invasions to spread democracy, to bring freedom to people\n\n* need universal healthcare because we care about the sick\n\n* need the financial regulations to keep things fair for the little guy  To rephrase impshakes point:\n\nIf you raise the minimum wage, then that cost has to be passed on to the consumers and all prices go up.  Effectively negating the point of an increase in wages because an individuals ability to purchase things will remain the same.  This is just a shell game to make the uneducated feel better about themselves.  It's effectively does nothing. That wasn't my point, but I agree with what you are saying as well.\n\nMy point was federal monetary policy (QE/bailouts/interest rates) is causing inflation. Then they try to solve the inflation problem they are creating by applying minimum wage. To rephrase impshakes point:\n\nIf you raise the minimum wage, then that cost has to be passed on to the consumers and all prices go up.  Effectively negating the point of an increase in wages because an individuals ability to purchase things will remain the same.  This is just a shell game to make the uneducated feel better about themselves.  It's effectively does nothing. Costs cannot be passed on to the consumer.  Supply and demand sets the price.\n\nAny inflation that occurs would be a result of employment dropping, resulting in less productivity, which lowers supply.  This isn't technically inflation by the definition used by Austrians and other free-market economists - its not a monetary phenomenon. Costs are part of the equation for what an item can be sold at.\n\nIf costs exceed what people are willing to pay, then the current providers will be unable to continue providing the item or service.  It's simple math. Costs cannot be passed on to the consumer.  Supply and demand sets the price.\n\nAny inflation that occurs would be a result of employment dropping, resulting in less productivity, which lowers supply.  This isn't technically inflation by the definition used by Austrians and other free-market economists - its not a monetary phenomenon. &gt; Costs cannot be passed on to the consumer. Supply and demand sets the price.\n\nRaising minimum wage will reduce supply as people who can't make a profit quit.  Supply going down leads to prices going up.  How much depends on how elastic the demand is. To rephrase impshakes point:\n\nIf you raise the minimum wage, then that cost has to be passed on to the consumers and all prices go up.  Effectively negating the point of an increase in wages because an individuals ability to purchase things will remain the same.  This is just a shell game to make the uneducated feel better about themselves.  It's effectively does nothing. &gt;If you raise the minimum wage, then that cost has to be passed on to the consumers and all prices go up. \n\nRight. Unless the owner absorbs the cost some other way. Taking lower pay themselves, increasing efficiency, added customers due to... I don't know... the fact that lots of people are making more money.... because the minimum wage went up.  \n\nSo NOT \"all pries will go up\" is really the actual thing that will happen. But you keep using that economics \"knowledge\" that is so popular here to reach the conclusions you find preferable.  That assumes that businesses are not already trying to run as efficiently as possible.  It may be possible for a few to absorb the costs that way but they will be in the vast minority.  Most businesses will simply need to pass the costs on.  \n\nAnd why wouldn't they, everyone will have larger sums of money anyway.   &gt;It may be possible for a few to absorb the costs that way but they will be in the vast minority. \n\nThat's some excellent conjecture based on no evidence whatsoever. Keep up the good An-Cap work. \n\n&gt;Most businesses will simply need to pass the costs on.\n\nThat's certainly the conclusion you seem to have decided must be right. When you make an argument or present evidence for it let me know.\n\n&gt;And why wouldn't they, everyone will have larger sums of money anyway.\n\nRight. But not everyone can raise prices at the exact same instant and, according to your way of thinking, if people raise prices before other people then those with higher prices will lose business to those with lower prices, then the magic of competition will drive the risen prices lower. Right? Right. Economics!\n\n &gt;It may be possible for a few to absorb the costs that way but they will be in the vast minority. \n\nThat's some excellent conjecture based on no evidence whatsoever. Keep up the good An-Cap work. \n\n&gt;Most businesses will simply need to pass the costs on.\n\nThat's certainly the conclusion you seem to have decided must be right. When you make an argument or present evidence for it let me know.\n\n&gt;And why wouldn't they, everyone will have larger sums of money anyway.\n\nRight. But not everyone can raise prices at the exact same instant and, according to your way of thinking, if people raise prices before other people then those with higher prices will lose business to those with lower prices, then the magic of competition will drive the risen prices lower. Right? Right. Economics!\n\n None of your arguments are established with evidence either.\n\nYou are obviously a little bit obsessed with the ancap point of view and you sound somewhat angry. You're all over this thread and your link to \"mentions of rape in this sub\" elsewhere in this post included two of your very own posts (going back 6 months).\n\nI've found the members of this sub to be pretty open to very hard debate as long as the interest is mutual. You aren't really exhibiting any genuine interest here. Correct me if I am wrong, but your goal seems rhetorical and part of some sort of power struggle.\n\nWhy not let the anger go for a moment and try to connect with someone on here? Just because you disagree doesn't mean you have to feel such animosity. So no, you don't have any evidence? \n\nI don't want to connect with you because you hold a destructive and contradictory ideology that seeks to dismantle one of the better creations of the human race. \n\n &gt;It may be possible for a few to absorb the costs that way but they will be in the vast minority. \n\nThat's some excellent conjecture based on no evidence whatsoever. Keep up the good An-Cap work. \n\n&gt;Most businesses will simply need to pass the costs on.\n\nThat's certainly the conclusion you seem to have decided must be right. When you make an argument or present evidence for it let me know.\n\n&gt;And why wouldn't they, everyone will have larger sums of money anyway.\n\nRight. But not everyone can raise prices at the exact same instant and, according to your way of thinking, if people raise prices before other people then those with higher prices will lose business to those with lower prices, then the magic of competition will drive the risen prices lower. Right? Right. Economics!\n\n &gt;if people raise prices before other people then those with higher prices will lose business to those with lower prices, then the magic of competition will drive the risen prices lower.\n\nNot if they can't afford to drop prices. Then they just go out of business. &gt;If you raise the minimum wage, then that cost has to be passed on to the consumers and all prices go up. \n\nRight. Unless the owner absorbs the cost some other way. Taking lower pay themselves, increasing efficiency, added customers due to... I don't know... the fact that lots of people are making more money.... because the minimum wage went up.  \n\nSo NOT \"all pries will go up\" is really the actual thing that will happen. But you keep using that economics \"knowledge\" that is so popular here to reach the conclusions you find preferable.  The owner can only absorb costs in a few, very limited ways. Most companies that employ minimum wage people have very low profit margins. In order to absorb those costs, the owner will probably have to reduce their workforce, not expand as much or as quickly as intended, or produce a more substandard product. \n\nEventually, they will have to raise prices in order to offset what they cannot absorb. They will have to time it properly and do it carefully, but it will certainly happen.\n\n&gt;the fact that lots of people are making more money\n\nAnd when prices go up, those who were making above minimum wage can purchase less.  &gt;Most companies that employ minimum wage people have very low profit margins.\n\nProof? \n\n&gt;In order to absorb those costs, the owner will probably have to reduce their workforce, not expand as much or as quickly as intended, or produce a more substandard product.\n\nBut you're just ignoring what I said and repeating something else with no proof for the thing you're repeating. Why couldn't they keep prices down by increasing efficiency or because they have so many added customers or because their customers have more money? And don't answer with the word \"probably\" in it. \n\n&gt;And when prices go up, those who were making above minimum wage can purchase less.\n\nBut you have yet to give me an argument as to why prices have to go up. Except your continued saying so. \n\n &gt;Proof? \n\nExperience. Go look up your own proof. You claim that they can just absorb the cost. Prove it.\n\n&gt;Why couldn't they keep prices down by increasing efficiency \n\nDo you really think that companies are just fucking around and spending money when they don't need to? In many industries, companies have already reduced inefficiencies. \n\nTake fast food for example. When I was a manager, our overall profit for our store was about $100K per year. The owner made less than most corporate-owned stores paid their GM. When the minimum wage went up, he simply didn't have the money to pay people more. So he cut hours. The next time it went up, he cut health insurance for the management. The third time it went up, the franchise company had finally authorized that he could raise prices. He was lucky, the other companies in our state had already raised prices so he was still competitive. After the third time the minimum wage was raised, his profit was almost non-existent. \n\n&gt;But you have yet to give me an argument as to why prices have to go up. Except your continued saying so. \n\nPlease read. \n\n &gt;Experience. Go look up your own proof. You claim that they can just absorb the cost. Prove it.\n\nPDF file: http://laborcenter.berkeley.edu/retail/bigbox_livingwage_policies11.pdf\n\nThat's accounting for a 12$ wage and they still find an almost 0% price increase. Now we're talking about only raising it to 9$ an hour. And that's the largest employer of minimum wage workers in the US. \n\nSorry. \n\n&gt;In many industries, companies have already reduced inefficiencies.\n\nAnd in many others they haven't. \n\n\n\n\n\n Your link flies in the face of reality. \n\n[Article](http://www.downsizinggovernment.org/labor/negative-effects-minimum-wage-laws)\n\n&gt;\"Some policymakers may believe that companies simply absorb the costs of minimum wage increases through reduced profits, but that's rarely the case. Instead, businesses rationally respond to such mandates by cutting employment and making other decisions to maintain their net earnings. These behavioral responses usually offset the positive labor market results that policymakers are hoping for.\"\n\nSome detrimental effects:\n\n    Increasing the likelihood and duration of unemployment for low-wage workers, particularly during economic downturns;\n    Encouraging employers to cut worker training;\n    Increasing job turnover;\n    Discouraging part-time work and reducing school attendance;\n    Driving workers into uncovered jobs, thus reducing wages in those sectors;\n    Encouraging employers to cut back on fringe benefits;\n    Encouraging employers to install labor-saving devices;\n    Increasing inflationary pressure;\n    Increasing teenage crime rates as a result of higher unemployment; and\n    Encouraging employers to hire illegal aliens.\n\n\n\n\n The conclusions in the the section you've quoted all seem to come (according to the footnote) from this document: \n\nhttp://web.archive.org/web/20110629183749/http://www.house.gov/jec/cost-gov/regs/minimum/50years.htm\n\nThe committee that proffers this document is made up entirely of republicans and the document is filled with one line conclusions, like the ones you've quoted, that they seem to have gleaned from articles without the slightest bit of evidence or analysis given. It's really just a list of consequences and list of articles they think spell out those consequences. But those articles could be from anywhere by anyone. \n\n&gt;Your link flies in the face of reality.\n\nYou do know, right, that that's about as a convincing rebuttal as \"Nyah, nyah... no you're wrong!\". \n\nMaybe you're not interested in debating this anymore. \n      and if minimum wage is tied to cost of living? productivity? should there even be a minimum wage? if there should be what should determine it? I'm sorry I was just reading comments, I am not Ancap, but am curious to see how this philosophy deals with these questions    If you are calling for minimum wage increases, you have to acknowledge that you are advocating killing people who disagree with you, as with all governmental enforcements. Inflation is a symptom, the gun in the room is the problem.  I found out today in /r/Libertarian that economists did a nice calculation to come up with the $9 an hour.  They arrived at that rate because it was the rate in which it would increase economic activity without being detrimental to the lower classes. \n\nYep, I said /r/Libertarian. [deleted] That's what happens when you pretend that left-leaning statism (that is anti-prohibition, anti-war, pro-\"civil rights\", but still largely authoritarian) is compatible with libertarianism. I understand wanting to have a big tent ideology, but sometimes the overlap is incidental or superficial at best. There are also a lot of leftists and socialists who love to go there and troll.  Plenty of the \"real\" subscribers to /r/libertarian are real libertarians and more often than not, in my opinion, have the highest upvoted comments.  It seems like the trolls come in waves. The trolls came in storm recently to express facts and whatnot in defense of minimum wage. I don't go there often, but I was depressed, I felt like I was in another sub entirely... Damn socialists and their facts and evidence! [deleted] If you are calling for minimum wage increases, you have to acknowledge that you are advocating killing people who disagree with you, as with all governmental enforcements. Inflation is a symptom, the gun in the room is the problem.  If you are calling for minimum wage increases, you have to acknowledge that you are advocating killing people who disagree with you, as with all governmental enforcements. Inflation is a symptom, the gun in the room is the problem. ",
    "url" : "http://www.denverpost.com/business/ci_22585618/obamas-call-minimum-wage-increase-renews-economic-debate"
  }, {
    "id" : 38,
    "title" : "Does your State do this?",
    "snippet" : "I'm pretty much broke: apart from some scraps to buy food for the week, I hold no savings, have no income, and thus cannot afford to pay anything that's non-essential for living. \n\nThink it couldn't get worse? It can! Apparently I have to pay a property tax on the house my parents owned. My parents built this house with their own resources, and the State never contributed with anything towards it. This tax exceeds what money I have left, so I cannot pay it.\n\nIf I don't pay it now, interest will accrue and in a few month's time I will have to pay even more money! Eventually, give or take 2-3 years, the State will come knocking at my door and if I still don't pay up it will seize my house, kick me out and imprison me.\n\nBy the way, I live in an Eastern European country. And no, I'm not asking for any financial help from here.\n\nDoes your State do this? Does it confiscate your property if you cannot pay a tax on it? I know that some countries have personal bankruptcy laws, so if you're broke you don't pay taxes, obviously!\n\n      &gt; apart from some scraps buy food for the week\n\nCheck our /r/dumpsterdiving. I do this and get lots of free food.\n\n&gt; Does your State do this?\n\nYes. However, there are some states where you don't have to pay property taxes, [and some states are better than others for other types of taxes.](http://www.dailyfinance.com/2010/04/13/5-most-tax-friendly-states-to-live-in/)\n\n&gt; Does it confiscate your property if you cannot pay a tax on it? \n\nAs far as I know.\n\n&gt; I know that some countries have personal bankruptcy laws, so if you're broke you don't pay taxes, obviously!\n\nYup, this is the only way to avoid taxes, other than armed resistance.  &gt;Check our /r/dumpsterdiving. I do this and get lots of free food.\n\nMay I ask if you consider yourself low-income? I can't see myself doing that. I feel bad when I see hobos in NYC doing that and as a sharp-dressed man, it would look very out of place. Though I have found a $500 bike perfect condition in a dumpster and an old computer monitor (didn't have to dive, they were showing). I don't want to report my income here, but let's just say that with expenses and current student loan payments, I'm not able to save very much per month, and am close to living paycheck to paycheck, despite having an okay job.\n\nI mostly dumpster dive food, and if other people did it in my area, I likely wouldn't. But I'm the only one I've ever seen at the place I go to, so I feel like that food would definitely get wasted if I didn't save it. I dnt get all my food from dumpsterdiving, but it helps out quite a bit, and it allows me to save more for uncertain events. I've also dumpstered and repaired all the furniture in my apartment. Do you dumpsterdive at a super market?     The only thing worse than this is when an HOA seizes someones house for not paying HOA dues or fines. No, HOA agreements are part of a contract that you sign. A real one, unlike the \"social contract\" supposedly justifying this.      Germany, no. Property tax are paid by welfare if you are poor to afford it (&lt;860 €  I believe)  An Italian woman told me they don't even have it in Italy. I think she is from Venice. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18j4z0/does_your_state_do_this/"
  }, {
    "id" : 39,
    "title" : "Before, I only knew that cash holding wasn't a bad thing. Now I realise it is a good thing.",
    "snippet" : "  Like most Keynesian fallacies, a judicious application of Say's law dispels the myth.\n\nMoney is simply an abstract representation of products. It serves as an intermediary between production and consumption. A person produces to earn money, holds that money for some intermediate time, then spends that money to consume. If instead that person hoards their money, they have essentially worked for \"free\". They've contributed products to the market, but have not asked for any products in return. Oh god dammit. My attempts to summarize this concept are usually thesis length.\n\nVery well put, bravo.   If I perceive that people are going to hoard cash in the near future, and I assume that cash will become more scarce, and I start hoarding early with the goal of spending when other people are hoarding, what does that make me? I have worked for free for a period of time. At a later date I exchange my money for more products. This is good for me as an individual, but bad for the economy if everyone does it.\n\n\"Furthermore, there is no reason to assume people will spend ever again, so this situation may well be permanent.\"\n\nPeople spend money when they must. When the car breaks down, the fridge breaks down, the roof leaks. So we can say that people will duct tape things together or try cheaper repairs but eventually there comes a time when a new roof is needed, or a new car, or a new fridge. There is no reason to assume people will never spend again.\n\nI think perhaps I'm not speaking the same language as the economists,",
    "url" : "https://smilingdavesblog.wordpress.com/2013/02/14/how-mises-dismissed-that-whole-keynesian-thing-with-a-decisive-one-liner/"
  }, {
    "id" : 40,
    "title" : "\"Libertarian icon Friedrich Hayek would support the individual mandate\" -(xpost from /r/progressive)",
    "snippet" : "  The most powerful persuasive argument to a leftist is an appeal to authority.\n\nSurprised? Nope, not at all. Emotions and authority are what they have. Preferably emotional authorities.  I think this might be why liberals love science so much. People often use science as an argument from authority, ie \"scientists say that evolution is true, so that means that evolution is true.\" This is a terrible argument, both because it is fallacious and because all it does is make people go into, \"my authority is better than your authority\" mode. This partially explains the level of discourse we have today. Actually, I've worked out a fairly complex theory with regards to this, and I think that's the crux of it. Here's the simple version:\n\nThinking is hard. We all know that. Some of us, by nature, get enough reward out of it that we do it pretty often. For fun. Building a comprehensive philosophy/worldview requires a hell of a lot of thinking, and what's more, required you to constantly be rethinking things in light of new information. Most people realize this and respond with \"ain't nobody got time for that!\" But that's not entirely true, and some people at least appear to have done so. The obvious response is to latch on to such person (be he a TV or radio personality, a religious or political speaker, or other authority figure) and accept whatever this person says. \n\nNow here's the key: they don't just accept the facts, because that doesn't fulfill the need they have for a coherent system. Rather, they take what this figure says and more or less transplant it into their own life/way of thinking wholesale, because what they really want is a core philosophy. But since they've just adopted one rather than thinking through it themselves, they don't have the mental framework necessary to analyze it critically or individually, and ti becomes a sort of all or nothing. What's even worse, because they lack the framework or perspective to critique it, it becomes a core part of their identity as a person. This leads to a lack of distance to analyze it even if they were sufficiently practiced at thinking.\n\nPractically, what this results in, is a population of people who uncritically accept large swaths of their guiding principles and internalize them such that they cannot engage in any sort of discussion because to question any single point is to question the whole system, but it's even worse than that: attacking this system is viewed as a personal attack, so instead of reasonable discussion, the conversation devolves into a mudslinging match because the other party perceives everything as an insult.\n\nNone of us here are immune to this, either. I would like to think we're all a lot more interested in building a consistent worldview and being open to new understanding, but I know how easy it is to slip into the default mode of accepting and never questioning. As a Christian, this is especially important to me: ultimately, all of us are going to be operating out of some core beliefs that we use as a framework to build the rest of our worldview. That's how knowledge works. But I should be constantly working to reevaluate my own assumptions, and more I should be keenly aware of what they are and how they influence everything else I think and perceive. More generally, we all need to be careful that we're not taking the lazy route and just accepting what we read or heard and integrating it without doing our due diligence: that goes for Molyneux, Kinsella, Mises, or Rothbard. Or anyone, really: we need to keep a culture of healthy skepticism about any ideas that are coming into our circles and keep pushing each other to constantly question and reevaluate. It's a lot of work, but it's important if this movement ever has a chance to be more than a hobby.\n\nI guess I should also point out that I'm of the firm opinion that we don't need to agree on everything. As a matter of fact, I view disagreement on things (the IP debate comes to mind) as being core to the movement's success because it shows that we're not one monolithic blob just mindlessly circlejerking on everything. Even if we disagree, we should absolutely be encouraging each other to develop competing ideas so we can dialog, as even if the new ideas are shown to be flawed we've at least had to engage them as well as our own ideas, and that should in theory only lead to a better understanding for all of us. Yes, i agree that we all need to make sure that arent being lazy. Thats one reason i love david friedman, he provides some of the best rebuttals to his positions ive ever seen. I often ask people to provide a rebuttal to one of their positions, the amount of people who cant think of one is alarming. Preferably emotional authorities.  Emotional authorities and authoritarian emotions.   &gt; \"Hayek is actually a moderate social democrat, and since we live in the age of social democracy, this makes him a \"respectable\" and \"responsible\" scholar.\"\n\nhttp://lewrockwell.com/hoppe/hoppe28.1.html Wow this is surprising. I had not read much Hayek but I thought this was out of character for him. Apparently I was mistaken.   ",
    "url" : "http://www.rawstory.com/rs/2013/02/14/professor-libertarian-icon-friedrich-hayek-would-support-the-individual-mandate/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+TheRawStory+%28The+Raw+Story%29"
  }, {
    "id" : 41,
    "title" : "The Real State of the Union - 2013",
    "snippet" : "  is it safe to guess that peter doesn't say anything he hasn't already said before pretty much?\n\nunfortunately i need to manage my time better ",
    "url" : "http://www.youtube.com/watch?v=yYaMKd75aKI"
  }, {
    "id" : 42,
    "title" : "Well guys... my take on the future",
    "snippet" : "I've finally decided. I intend to go to graduate school to study cryptography and security.\n\nNow you're probably all like \"Cool, but what do we care?\"\n\nA few months ago, I could only imagine a few ways to see the dream of an anarcho-capitalist community realised. Until then, I had figured that we probably wouldn't see one in our lifetime. \n\nThen I rediscovered [Bitcoin](http://www.reddit.com/r/bitcoin). I used to think Bitcoin was a crock -- useless, nothing spectacular. After delving into the Bitcoin community, I see now there is a lot of depth there that opens a lot of opportunities -- for liberty, wealth, and education. It's a fantastic amalgamation of cryptography, mathematics, finance, economics, and politics.\n\nAnd it opened my eyes to other realisations. [Second Realm](http://anarplex.net/hosted/files/secondrealm/secondrealm.pdf) gives us the idea of an enclave within the geographical confines of the state. \n\nI still believe that our best chance at an anarcho-capitalist society lies outside the state, but cryptography gives us the opportunity to truly attempt agorism in the present and to try to establish partial freedom from the state today. \n\nSo I'm going to learn all I can about cryptography and Bitcoin. I'm going to try to ensure protection of a fantastic currency. I'm going to try to gain wealth. I'm going to learn how to start a true enclave. And some day, I'm going to launch a spacecraft to Mars.\n\n**So I want to hear from you: what are you going to do?**\n\n  &gt;So I'm going to learn all I can about cryptography and Bitcoin. I'm going to try to ensure protection of a fantastic currency. I'm going to try to gain wealth. I'm going to learn how to start a true enclave. And some day, I'm going to launch a spacecraft to Mars.\n\nLove it.  Godspeed you crazy bastard.\n\n&gt;So I want to hear from you: what are you going to do?\n\nWork.  Save. Educate my own children.  Sew the seeds of dissent.  I would just like to mention some things to you. First great idea.\n\nThe problem with crypto is always that it is not easy to use. Making crypto easy to use is the most importend thing.\n\nAlso you should not only look at bitcoin, you should also look at ecash, it has some advantages over something like bitcoin. I imagen a system where you have bitcoin as the base money (kind of like gold) and on top of that you have a distributed network of ecash providers. Its to complicated to go into depth here. This would have some advantages.\n\nIf you care for me to explain this further pm me or something.\n\n  Prove that private industry *can* do what statists claim only government can do, and do it better. :)  ChaosMotor will build the roads Bahaha! Always the roads ;) Where we're going we don't even need em! Prove that private industry *can* do what statists claim only government can do, and do it better. :)  You involved in a small-scale defence firm or something?\n\nThis only makes me more curious! Unfortunately I've already said too much. If people in my industry really *understood* my strategy I'd be super fucked.  Prove that private industry *can* do what statists claim only government can do, and do it better. :)   Bitcoin, cryptography, bittorrent and fucking 3D printers. They can't own us forever.   I have been contemplating the same approach to downsizing the State's power: https://en.wikipedia.org/wiki/Financial_cryptography.\n\nBut what if they start filtering the Internet? As they do, for instance, in North Korea or China. Ultimately, I think that the State will manage to trump any attempt at reducing it.\n\nDo you already hold on academic degree? Couldn't you just educate yourself without getting one in cryptography? You'd save time and money.\n &gt;But what if they start filtering the Internet? As they do, for instance, in North Korea or China.\n\nUse [Tor](https://www.torproject.org/). What if they shut it down: pull the plug, smash the cables or whatever? What if they shut it down: pull the plug, smash the cables or whatever? If they physically disconnect the data cables and isolate the country from the rest of the Internet, then satellite access would seem to be the next logical step. I have been contemplating the same approach to downsizing the State's power: https://en.wikipedia.org/wiki/Financial_cryptography.\n\nBut what if they start filtering the Internet? As they do, for instance, in North Korea or China. Ultimately, I think that the State will manage to trump any attempt at reducing it.\n\nDo you already hold on academic degree? Couldn't you just educate yourself without getting one in cryptography? You'd save time and money.\n I hope that if it gets to that point, everyone will rebel, or it will attract more people to the cause. In any case, there are always P2P connections that could be created. Perhaps we'd see the creation of large underground private networks, instead. Actually, people are creatures of comfort who mostly engage in rebellious behavior when it comes to survival, but not even then. (North Koreans are dying of starvation, yet they haven't started an uprising, for example.) So I don't think that they will ever rebel against something as Internet censorship.\n\nBut, fortunately for us, technology advances at a mind-bending speed. The state, however, thrives on tradition and the status quo. Because of that we'll always be one step forward when it comes to circumventing technologies. I have been contemplating the same approach to downsizing the State's power: https://en.wikipedia.org/wiki/Financial_cryptography.\n\nBut what if they start filtering the Internet? As they do, for instance, in North Korea or China. Ultimately, I think that the State will manage to trump any attempt at reducing it.\n\nDo you already hold on academic degree? Couldn't you just educate yourself without getting one in cryptography? You'd save time and money.\n I have been contemplating the same approach to downsizing the State's power: https://en.wikipedia.org/wiki/Financial_cryptography.\n\nBut what if they start filtering the Internet? As they do, for instance, in North Korea or China. Ultimately, I think that the State will manage to trump any attempt at reducing it.\n\nDo you already hold on academic degree? Couldn't you just educate yourself without getting one in cryptography? You'd save time and money.\n  why do you need to goto school to learn these things? Couldn't you just buy the books they teach from and save yourself a bunch of money?  Just my 0.000741BTC but my understanding of bitcoin is that its security as a currency depends entirely upon the cryptographic strength of its algorithms. I know that quantum computing is perpetually 5 years away, but if we assume it actually is 5 years away, quantum computing promises to severely disrupt cryptography and if it did, it could likely make every transaction forgeable and bitcoins therefore worthless. That's my primary concern with bitcoins. Anyone with a better understanding may be able explain why my concerns are unfounded though. There are already [cryptographic algorithms](http://en.wikipedia.org/wiki/Post-quantum_cryptography) that can't be easily ``cracked\" with a quantum computer. The big deal is about quantum computers being able to brute-force things like AES more efficiently.\n\nBut the algorithms themselves, while sexy, have never been the issue. Implementation is so crucial, and why even in the pre-quantum computer age of RSA, there are still security breaches all the time. Just my 0.000741BTC but my understanding of bitcoin is that its security as a currency depends entirely upon the cryptographic strength of its algorithms. I know that quantum computing is perpetually 5 years away, but if we assume it actually is 5 years away, quantum computing promises to severely disrupt cryptography and if it did, it could likely make every transaction forgeable and bitcoins therefore worthless. That's my primary concern with bitcoins. Anyone with a better understanding may be able explain why my concerns are unfounded though. Just my 0.000741BTC but my understanding of bitcoin is that its security as a currency depends entirely upon the cryptographic strength of its algorithms. I know that quantum computing is perpetually 5 years away, but if we assume it actually is 5 years away, quantum computing promises to severely disrupt cryptography and if it did, it could likely make every transaction forgeable and bitcoins therefore worthless. That's my primary concern with bitcoins. Anyone with a better understanding may be able explain why my concerns are unfounded though.  &gt;So I want to hear from you: what are you going to do?\n\nhttp://www.ancapfreethinker.info/?p=88\n\nSoon...  I also plan on working with cryptography to bring about a freer society.\n\nBitcoin has reignited my passion for cryptography and has given me a lot of hope for the future. As ancaps/libertarians we spend a lot of time arguing with statists with very little success in getting our views applied. Bitcoin, crypto-anarchy, and techno-anarchy in general, is the response of \"We're tired of arguing with you guys and are going to proceed in making your opinion irrelevant to our ability to be free.\"\n\nThere is a sub-reddit called /r/CryptoAnarchy which is dedicated to this topic. Unfortunately it is pretty much a dead sub-reddit. Maybe if enough people are interested we can revive it or start another one. We could definitely try to revive it if people show interest. There are a lot of elements of cryptoanarchy that are important to the current anarchocapitalist movement, imo.   I wish I had done something useful, like engineering or what you're doing.  Instead I'm doing a Master's in economic history at a (surprisingly left-wing) UK school, and probably doing another Master's in straight econ next year.  I'm leaning toward doing the whole survivalist thing at some point.  Tinfoil hat on - I'm convinced that the unfunded liabilities of Social Security and Medicare are so large that the reckoning will be catastrophic for the US and world economy.  I'm also really apprehensive about where drone technology and general surveillance is going.  If something isn't done to rein in the government's power in the next five years or so, I will be very afraid indeed. I have the same concerns about the increase in surveillance and military methods/equipment. I'm convinced some sort of financial downfall will occur -- but I'm not convinced it will be in the short term. \n\nRight now I'm studying Computational/Applied Mathematics as well as Political Science in undergraduate, by the way (and the former is technically classified under engineering, yes). I wish I had done something useful, like engineering or what you're doing.  Instead I'm doing a Master's in economic history at a (surprisingly left-wing) UK school, and probably doing another Master's in straight econ next year.  I'm leaning toward doing the whole survivalist thing at some point.  Tinfoil hat on - I'm convinced that the unfunded liabilities of Social Security and Medicare are so large that the reckoning will be catastrophic for the US and world economy.  I'm also really apprehensive about where drone technology and general surveillance is going.  If something isn't done to rein in the government's power in the next five years or so, I will be very afraid indeed. &gt; I'm leaning toward doing the whole survivalist thing at some point.\n\nWe can probably help with that in /r/preppers.  I am at an ivy league law school. I want to become an academic to, among other things, study alternative legal systems like the dispute resolution used by Silk Road.\n\n&gt; I'm going to try to ensure protection of a fantastic currency.\n\nThe real issue with bitcoin is being able to trade it for real currencies through exchanges.\n\n&gt; And some day, I'm going to launch a spacecraft to Mars.\n\nElon Musk (CEO of SpaceX and Tesla) is planning to launch a shuttle to Mars. You might consider joining his crew, or settling part of Mars as an anarcho-capitalist society.  Liquidity of Bitcoin is a large issue, of course, but it's not my major concern. There are other aspects which I find interesting and that will need work in the future in order to maintain usefulness (like transaction size).\n\nMusk says he is going to launch, but I'm not sure how/when, but I agree that that would be an incredible opportunity. &gt; Liquidity of Bitcoin is a large issue, of course, but it's not my major concern.\n\nI meant the ability to exchange dollars for bitcoins, and bitcoins for dollars, is an issue. If the exchanges and other electronic cash-for-bitcoin transfers get shut down, a person could only get into bitcoin by selling goods/services to people via bitcoin or exchanging physical cash for bitcoin.  Why do you think that these transfers would get shut down? (and why would something else be immune to the same problem, especially if it was state-induced?)\n\nBut yes, if they did get shut down, it would be important to figure out some way to convert.     I'm not an activist--I just want an enjoyable career and a romantic wife--but, if that's the way a person wants to live their life, so be it.\n\nAnarcho-Capitalism / Voluntaryism, for me, has always been about having a clearer lens through which to see the world and a better set of behaviors for happier interpersonal relationships to *directly* make my *own* life better.  I can really only control myself and this is how best I can increase my own happiness.  I don't perceive being a societal martyr as a productive path, but that's me. I don't plan to be a social martyr, but this coincides so directly with what I want to do with my life that I've decided to make it my full-time, and don't worry -- I enjoy this sort of stuff :) ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18iu2i/well_guys_my_take_on_the_future/"
  }, {
    "id" : 43,
    "title" : "NHS \"culture of oppression and fear\"",
    "snippet" : "[Article 1.](http://www.telegraph.co.uk/health/healthnews/9869579/NHS-whistleblower-paid-500000-to-keep-quiet-over-patient-safety-breaks-silence-to-expose-culture-of-fear.html) Highlights:\n\n* NHS whistleblower paid £500,000 to keep quiet\n\n* he prioritised scarce resources on emergency care despite pressure from above to meet targets on non-emergency treatment “whatever the demand”\n* NHS employees being gagged from speaking out over patient safety.\n* as many as 500 patients may have died needlessly because of poor care\n* Sacked NHS employee: \"This is a culture of fear, a culture of oppression\"\n\n[Article 2.](http://www.guardian.co.uk/uk/2013/feb/14/nhs-whistleblower-quit-gagged) Highlights:\n\n* He claims he was forced to quit for refusing to meet government targets\n* He added: \"You have to remember that if you work in the NHS and you cross the people in power, there will be consequences for you and people are appointed to do specific jobs of getting rid of people. I think if you consider that had they got a case against me that was reasonable and it was gross misconduct, then why would they spend so much time, effort and money to silence me?\"\n* \"I am still gagged. There's nearly 3,000 pages of evidence of which I have only been able to talk about a few. Those are the things I would like the health committee to expose,\" he said.\n* The BBC reported that Walker had been threatened with legal action because of the interview.\n\nThe whole thing reminds me of this [Mises Daily article](http://mises.org/daily/3650) about Soviet healthcare.   The NHS is basically worshipped here. It's a divine temple of the state. The NHS is basically worshipped here. It's a divine temple of the state.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18jju9/nhs_culture_of_oppression_and_fear/"
  }, {
    "id" : 44,
    "title" : "What types of careers would a typical Anarcho-capitalist enjoy and pursue because of those beliefs?",
    "snippet" : "  Entrepreneurship, or self-employment. Aspiring writer.  Professional Internet Crackpot And here I am, just a struggling amateur internet crackpot. Professional Internet Crackpot I myself am but an amateur, but if you've got a good way to monetize this I would eagerly subscribe to your newsletter. I'll give you a link to my newsletter but it'll cost you 5$ a month   I want to become a videogame designer and critic and look for ways we can start using games to investigate new concepts. For instance, the fact that the vast majority of modern games are built around the concept that direct physical conflict is the only option (many times putting your character alone against enemies filled with an apparently single-minded desire to do you physical harm) seems strange to me. Is it really so hard to design a game based on mutually beneficial cooperation? Games are almost always zero-sum. There are winners and there are losers, even if that loser is the game itself (solitaire, DM's monsters and challenges, etc.).\n\nIn a game where win conditions include competition between players, mutual benefit is not possible in the long run.\n\nMutual benefit generally occurs in games where the players win and the game loses. Then again, this is obvious. The player faction is simply one player vs. another player known as the game, so there is still no mutual benefit between competing factions.\n\nA game without explicit win conditions (Minecraft) will see more mutual exchanges between players. Essentially, when win conditions are subjective, there is no absolute *cost* to cooperation, only a circumstantial and relative one. In a game with an objective win condition, the *benefits* of cooperation become circumstantial and relative; the reverse (Catan, Monopoly, etc.). I don't think considering a purely player vs. computer game as \"zero sum\" is really valid. Except in some cases where the computer is simulating a player (like in an RTS), the computer gets so payoff or utility from any outcome. It's just an element of the game. Game theory itself doesn't really deal with these sorts of things, as they're not really \"games\" in the sense that it's interested in.\n\nBut even within these solo experiences, I think there's a lot more room to tackle interesting themes. For instance, I just played through Far Cry 3 a few months ago. While the story itself has some elements of joining up with others to achieve mutual goals against aggressors, the game itself doesn't really reinforce that. It's more or less about making yourself as strong as possible so that you can win on your own merits. Basically the only time I helped others was because the \"help\" I gave them benefited me directly. Radio towered? I wanted the map revealed. Safehouse? Provides a convenient quick-travel point. What if the game were remade so that to defeat your enemies you had to have the support of the other warriors a lot more, so more of your time was spent doing things that did not, in and of themselves, benefit you in order to get \"paid back\" with the help you did need.\n\nBut more than that, I disagree that in competitive games mutual benefit is not possible. Yes, in our current culture we've got a very binary sense of win/loss where there can be no mutual benefit becuase there can be only 1 winner. But I don't think that's a fundamental law, more just a cultural norm that we've not really questioned. To change it, first we'd have to come up with a new way to \"score\" things and get people to accept that. This actually does happen in some sports: it's not always 1 point for win, 0 for a loss. Sometimes having a draw causes the players to each get half a point. And in hockey, losing a \"draw\" that results in a shootout is still slightly better than a loss. So what if we made some form of competitive game which awarded a point to the winner and 0 points to everyone else, but if some global \"loss condition\" was met then all players lost points. This would have to be part of some long-term scoring system, as you're right that when every match is completely isolated then it's generally in your best interest to go out in flames rather than to play conservatively if it looks like you're not going to win. Even then, I don't think that this is a global law, though, it all depends on how the players perceive payout.\n\nBut that's the problem, isn't it? We view all competition as some sort of \"I better get everything I can at all expense, because the pie is only so big\" when in reality it isn't. The market is a giant game where mutual benefit is not only possible, it happens all the time. Why can't our videogames simulate this in more concrete ways, and why do we settle for the \"us versus them\" model in so many popular games?\n Like I said (and you elaborated on), it has to do with win conditions. In real life there is no win condition. The game of life just continues, yes you may die, but there is satisfaction in passing off progress to future generations (one day there may be enough progress that you won't die; immortality). A religion may set a win condition (apocalypse is coming, etc.), but one may reject the validity of that religion and so it remains one goal amongst other options.\n\nIn a game that ends upon a win condition of which the players are certain will happen as a consequence of X, then players will work towards  that consequence (assuming they can restart the game after the win).\n\nYou can have a game in which competition and cooperation are both feasible, but the game would need an uncertain win condition (nobody knows exactly how to win, or when winning will happen) or no win condition. Sandboxes will tend to favor cooperation.\n\nHence why mmorpg's and sandbox games see competition and cooperation. There is no way to end the game, no scores, and no objective measuring stick for accomplishment. People make their own win conditions with an infinite time-frame for achievement and thus there is always time for mutual benefit. I want to become a videogame designer and critic and look for ways we can start using games to investigate new concepts. For instance, the fact that the vast majority of modern games are built around the concept that direct physical conflict is the only option (many times putting your character alone against enemies filled with an apparently single-minded desire to do you physical harm) seems strange to me. Is it really so hard to design a game based on mutually beneficial cooperation? I always thought designing video games sounded cool. But I never wanted to learn how to program. You could still be a graphics, sound, story, voice, or other guy *Dude,* the other guy sounds good... I always thought designing video games sounded cool. But I never wanted to learn how to program. I want to become a videogame designer and critic and look for ways we can start using games to investigate new concepts. For instance, the fact that the vast majority of modern games are built around the concept that direct physical conflict is the only option (many times putting your character alone against enemies filled with an apparently single-minded desire to do you physical harm) seems strange to me. Is it really so hard to design a game based on mutually beneficial cooperation? I want to become a videogame designer and critic and look for ways we can start using games to investigate new concepts. For instance, the fact that the vast majority of modern games are built around the concept that direct physical conflict is the only option (many times putting your character alone against enemies filled with an apparently single-minded desire to do you physical harm) seems strange to me. Is it really so hard to design a game based on mutually beneficial cooperation? They've been trying it over on [/r/Civcraft](/r/Civcraft) for nearly a year now, but Minecraft is really too basic a platform to try it as consequences are weak, you can become self sufficient in a few hours or less and never need go near another player.\n\nWurm Online is good but probably about as hard as you want to get with the current level of technology (i.e. mouse/keyboard and 2D monitor). It has about the freest economy of any game i've played, in game currency is freely traded for services and real money and in game players often sell currency cheaper than the game creators, everything that can be traded or sold is, you have deeds for property rights, all the land is terraform-able and claimable, though buy and claim land too close to someone else's property can cause tensions. It's quite a slow game as well so can be a serious time sink, it took over a year and hundreds of man hours to build canal between two lakes.\n\nIt's not perfect (the game has many flaws but a loyal base of players), consequences are still weak, you can't starve to death (it drains your stamina so all tasks/walking become torturous with low food and water levels), and when you do die you lose a bit of XP from a few skills but little else providing you can get back to your corpse and get the gear back off it. Yeah, I've followed CivCraft but don't have the time to really play it enough to get a solid personal understanding, so I read about it when I can. I've long wanted to work on pulling together some sort of terraforming simulator because I think it would provide some interesting dynamics. Mostly, it would make it obvious what land had been \"homesteaded\" but you could still work out ways to encourage mutual cooperation by having a diverse necessity of skills needed. Maybe one person develops along the path that allows them to claim land and make it viable for use by others, but at the expense of developing the ability to really use the land. Then someone who focused on harvesting raw materials would have incentive to partner with him and use the \"claimed\" land to extract actual value. It could demonstrate how a system of land-ownership can exist peacefully and voluntarily where the renters are engaged in mutually beneficial exchange with the landlords. It would also let the socialist types build their own system and demonstrate how they envision such a system working if the person who originally develops the land is unable to keep an interest in it once it goes on to the user.\n\nI've never heard of Wurm online, but I may check it out. If only I actually had time to really play a game these days... I want to become a videogame designer and critic and look for ways we can start using games to investigate new concepts. For instance, the fact that the vast majority of modern games are built around the concept that direct physical conflict is the only option (many times putting your character alone against enemies filled with an apparently single-minded desire to do you physical harm) seems strange to me. Is it really so hard to design a game based on mutually beneficial cooperation? You should contact ttk2. He might have something you'd be interested in. Something beyond CivCraft? I follow the happenings there a bit, though sadly I don't have time to play around. I'd love to get to the point in my career that I have some more flexibility for hobby programming and exploring, but sadly I'm still at the \"code monkey\" stage most of the time. Yes, beyond civcraft. I want to become a videogame designer and critic and look for ways we can start using games to investigate new concepts. For instance, the fact that the vast majority of modern games are built around the concept that direct physical conflict is the only option (many times putting your character alone against enemies filled with an apparently single-minded desire to do you physical harm) seems strange to me. Is it really so hard to design a game based on mutually beneficial cooperation? You may have just described my ideal job.   this is going to sound crazy, but I would go into organic farming. After peak oil really makes an impact, then farming is going to really start to pay much better. In Cuba, farmers are some of the best paid. Im sure there is some money to be made right now if you are an agorist organic farmer :) for everyone else though peak oil is going to hurt farming for a while before it helps. this is going to sound crazy, but I would go into organic farming. After peak oil really makes an impact, then farming is going to really start to pay much better. In Cuba, farmers are some of the best paid.   Computer science all the way. Good pay, high bargaining power, good potential for self-employment if you're sharp. Also has multidisciplinary synergy with almost any field due to the ability to create abstract models and efficiencies through automation. Biology, chemistry, brewing, graphic design, engineering, project management... etc. I can confirm this. I know several non-computer people who say they'd love to hire more CS guys. Our personalities and skillsets are highly valued when it comes to tackling large, complex projects because by nature we look at something big and work to break it down into manageable chunks (preferably ones that someone else has already solved :P ). I'm personally sticking with programming for a software company as I'm still in the \"skill and experience building\" stage of things, but I don't regret the hours I poured into my degree for a single minute. I wish more people would recognize this. A software engineer at the senior level with the ability to see the big picture can analyze and improve any system. The biggest obstacle is that most senior-level people (even developers that have been at it for 30 years) cannot and do not want to see the big picture. Agreed. It also works against us sometimes because I'd often rather pursue one individual aspect all the way to its conclusion, but that can prevent me from giving everything else its proper attention. It really is an art learning to see the big picture and to anticipate issues without having the luxury of working through everything all the way. Fortunately, I have a boss who is awesome at it, so I've got a great role model to work from for a while.  Musician. Man its fun singin' about my hate for the state! Just curious, do you have any music on the web? I'd love to find some good tunes aboit liberty and haven't really heard much. Musician. Man its fun singin' about my hate for the state! I'm into music as well If you like hip hop check out jedi mind tricks song about vietnam. Cant remember the name. Rock/indie, check out kings of convenience \"rule my world\"    Something in IT is a great option.   I was planning on becoming a physician, so that I could, you know, heal people. But given the insane amount of unwarranted red-tape around this profession, I think I'll steer clear and choose something like Software Engineering.  There's nothing inherent in the ideology that favors certain career paths.\n\nThat being said, present ancaps are predominantly engineers, scientists, and programmers.  This is more just because of where we are; there's no contradiction in being a passionate, creative painter or writer and a firebrand ancap/voluntarist. I think it's because ancaps are people who are open to confronting reality, and the economic reality is that you don't get food on the table by being a creative type.   I wanted to add pharmaceuticals and bio-engineering. This is a field that i work in, and it's been great so far. R&amp;D is a global endeavor, with our company having office locations and labs in a bunch of countries around the world. It's really great to collaborate on specific projects with individuals from all over the world.\n\nIt's nice to know that the work you're doing is going to help improve people's quality of life. While some pharma companies get a bad rap for pushing too many drugs and things like that, there are lots of us out there that are working on good research, the technology and understanding of which will eventually be able to help out people all over the world. You gotta go through med school to go into any type of pharmaceuticals right?  No. Only a very few types of jobs within industry require an MD, such as senior scientists, Medical Monitors, etc. Some large companies only employ 1 or 2 MDs as scientific advisers, and they're only hired if they have like 20 years of experience working in hospitals. Most people that work for my company have a B.S., an M.S. (majority of scientists/researchers) and then fewer have Ph.D.'s and MD's. \n\nHow old are you now? What you thinking about doing?",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18jhft/what_types_of_careers_would_a_typical/"
  }, {
    "id" : 45,
    "title" : "How to Spend a Million Dollars to Promote Liberty. Someone please Kickstarter this",
    "snippet" : "  We're no longer in an age of books. Whats needed today is videos, TV shows and movies that promote our message. How about taking action in our personal relationships? How many libertarians talk about no positive obligations, but then attend social functions or family events when they don't want to? Proclaim that no one has value independent of their actions - govt workers are not inherently virtuous, but in the same breath speak about how important family is. For every libertarian who truly feels there is a gun in the room, how many continue to associate with statists who advocate their death? Who says that irrational thinking can lead to dangerous and deadly conclusions like statism, but exempt religion from rational analysis.  How about taking action in our personal relationships? How many libertarians talk about no positive obligations, but then attend social functions or family events when they don't want to? Proclaim that no one has value independent of their actions - govt workers are not inherently virtuous, but in the same breath speak about how important family is. For every libertarian who truly feels there is a gun in the room, how many continue to associate with statists who advocate their death? Who says that irrational thinking can lead to dangerous and deadly conclusions like statism, but exempt religion from rational analysis.  I think of most of my relationships like the Grandad and Uncle Ruckus on \"the Boondocks\".  I know they are all ignorant, but shame on me for just giving up on them.  The best way to help promote liberty is to find ways of making money off of it. Spending money on a cause isn't sustainable.\n\nAs the vulgar expression goes, if you have to force it, it's probably shit. The best way to help promote liberty is to find ways of making money off of it. Spending money on a cause isn't sustainable.\n\nAs the vulgar expression goes, if you have to force it, it's probably shit.      ... Not like that money could go to people who need it or anything... Where does your money go? None of it to leisure pursuits? Well, I give to charity and keep enough for me to survive, like food, bills, clothes etc.\n\nAnd, by the way, if I had a million dollars I would give most of it to charity and keep enough to get by and try not drown myself in the filth that is consumerist capitalism. Really? Food, cloths, and charity? No leisure budget whatsoever?\n\nAs a principle, would you be against all leisure and consumption spending? Personally I'm also anti-consumption, but I'm more focused on being pro-investing in economic and technological growth. Giving money to charity for people to consume luxuries (ie: most charitable operations) is a waste. Well, what do you define as \"leisure\"? And also, I support charities that give food and clothes to the less fortunate, not consume luxuries. Well, what do you define as \"leisure\"? And also, I support charities that give food and clothes to the less fortunate, not consume luxuries.",
    "url" : "http://daviddfriedman.blogspot.com/2013/02/how-to-spend-million-dollars-to-promote.html"
  }, {
    "id" : 46,
    "title" : "British community installs their own gigabit.",
    "snippet" : "  That's awesome that a small community can do this, and severely undercut the behemoth that is BT. Several States in the US made this illegal when lobbied by Comcast, cox, and Verizon.\n\nhurrah for government! I don't know how many people have *argued* with me that it's the market that has coalesced into the duopolies of wired Comcast/Time Warner and wireless AT&amp;T/Verizon? ",
    "url" : "http://www.bbc.co.uk/news/technology-21442348"
  }, {
    "id" : 47,
    "title" : "Utility Banking",
    "snippet" : "This is probably a bat shit crazy idea, but it may generate some discussion. I had been theorizing about using shares of utility companies as currency. \n\nUtility companies are considerably more stable than other sectors and usually have high dividend yields to off-set the minimal growth. This would mean that by simply owning the \"currency\" the individual would gain interest (from dividends). Normal commercial banks make money by loaning it out at a higher interest than they pay the account they borrowed it from. A utility bank could have an advantage because the owner would be making dividends as well as the interest from normal commercial banking practices. \n\nThe dividends present a problem, however. If the shares are the currency then the dividends would also be paid in shares. This is not workable because there is a set amount of the company for individuals to own (100%), which would imply that dividends need be paid in another currency (US dollars, bitcoins, etc).\n\nAnother potential problem is the volatility of the company(ies). Utilities may be stable compared to other sectors but it may not be stable enough to serve as a currency.\n\nA healthy growing economy will grow each year (I think 3-4% is normal for the U.S.), meaning that the currency will need to be inflated slightly to match expansion. The utility bank would need to perform a 1.03-1.04:1 stock split. Speaking of stock splits, the bank could also perform splits to keep the currency at a practical value or just allow fractions of a unit to be traded, like bitcoin (.10 for a gallon of gas instead of 1 unit for 10 gallons).\n\n**Pros**\n\n* easily traded electronic currency\n* dividends allow for profit by using the currency\n* multiple ways to easily adjust for inflation/deflation\n\n**Cons**\n\n* potentially too volatile for a currency\n* requires another currency to pay dividends\n\nI'm typing this as I watch a movie so I am sure there are plenty of mistakes and this may just be a bad idea lol  I think it's too volatile. Dividends would be very confusing to manage. Perhaps people would just use a bitcoin transaction account, trading with bitcoin banknotes. By that I mean notes that you can use to redeem bitcoins from banks, which would then allow fractional reserve banking. I think it's too volatile. Dividends would be very confusing to manage. Perhaps people would just use a bitcoin transaction account, trading with bitcoin banknotes. By that I mean notes that you can use to redeem bitcoins from banks, which would then allow fractional reserve banking. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18jye6/utility_banking/"
  }, {
    "id" : 48,
    "title" : "To any into personality theory, the INTP subreddit asked a question: Is every INTP a classic 19th century capitalist?",
    "snippet" : "  laughed at this comment:\n\n&gt;Capitalists, they are fat, ugly men with wicked faces. You can see that they are dressed in a long black coat which is called a frock coat, and a queer, shiny hat shaped like a stovepipe, which was called a top hat. This is the uniform of the capitalists, and no one else is allowed to wear it. The capitalists owned everything in the world, and everyone else is their slave.But, for all I know there might never have been any such law as the jus primae noctis, or any such creature as a capitalist, or any such garment as a top hat.  I hover between ISTJ and INTJ depending on the day. I think the main factors in libertarianism is mainly the I, and T, which is introversion (does not look to others for energy), and Thinking, which means you use more logic and objective reasoning over emotion.\n\nThe sensing/intuition and perception/judging don't play a huge part, I don't think. I hover between ISTJ and INTJ depending on the day. I think the main factors in libertarianism is mainly the I, and T, which is introversion (does not look to others for energy), and Thinking, which means you use more logic and objective reasoning over emotion.\n\nThe sensing/intuition and perception/judging don't play a huge part, I don't think.   ",
    "url" : "http://www.reddit.com/r/INTP/comments/18jro3/is_every_intp_a_classic_19th_century_capitalist/"
  }, {
    "id" : 49,
    "title" : "Real quick, I need some help finding an article I read. ",
    "snippet" : "I read an article on Mieses.com or Everything-Voluntary.com, I can't remember, but it outlined the flaws of democracy.\n\nIt gave a fantastic anaolgy that went along the lines of: Imagine there are 5 people living in an area, there are 5 plots of land, one for each person. There becomes a problem with the land and we all meet and discuss what to do. 3 people decide to get cats, one decides to get poison and I decide to get a fence\n\nLong and short of it, it says that in a democracy the 4 people voted then to get cats instead of fences, and I then have to stick with getting a cat but im alergic to cats, and that's why I didn't want it. So now I have to stick with having this cat, and now I also have to suffer. \n\n\nDoes anyone know what article I'm talking about? Im in the process of trying to convert one of my stubborn \"liberal\" friends. I'm ding this for manny of my friends in my school, and I really need your guys help with this. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18jvty/real_quick_i_need_some_help_finding_an_article_i/"
  } ],
  "processing-time-source" : 74,
  "processing-result.title" : "anarcho_capitalism4_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/anarcho_capitalism4_reddit.xml"
  }
}