{
  "processing-time-total" : 1744,
  "clusters" : [ {
    "id" : 0,
    "size" : 7,
    "score" : 54.92579138160975,
    "phrases" : [ "Political" ],
    "documents" : [ 5, 12, 15, 17, 29, 42, 44 ],
    "attributes" : {
      "score" : 54.92579138160975
    }
  }, {
    "id" : 1,
    "size" : 5,
    "score" : 27.959812121644934,
    "phrases" : [ "An-cap Society" ],
    "documents" : [ 5, 17, 32, 41, 47 ],
    "attributes" : {
      "score" : 27.959812121644934
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 52.061231891037764,
    "phrases" : [ "Anarcho-capitalism" ],
    "documents" : [ 1, 5, 26, 36, 41 ],
    "attributes" : {
      "score" : 52.061231891037764
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 32.07811629097877,
    "phrases" : [ "Schools got Better" ],
    "documents" : [ 5, 12, 17, 22, 33 ],
    "attributes" : {
      "score" : 32.07811629097877
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 70.96401043148694,
    "phrases" : [ "Willing to Accept" ],
    "documents" : [ 5, 12, 17, 24, 31 ],
    "attributes" : {
      "score" : 70.96401043148694
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 116.77501746165426,
    "phrases" : [ "Build the Roads" ],
    "documents" : [ 31, 36, 38, 48 ],
    "attributes" : {
      "score" : 116.77501746165426
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 29.194291273045938,
    "phrases" : [ "Definition of the State" ],
    "documents" : [ 5, 12, 15, 17 ],
    "attributes" : {
      "score" : 29.194291273045938
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 78.41004188677641,
    "phrases" : [ "According to his Ability" ],
    "documents" : [ 0, 12, 28 ],
    "attributes" : {
      "score" : 78.41004188677641
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 44.26985791661941,
    "phrases" : [ "Education" ],
    "documents" : [ 17, 33, 45 ],
    "attributes" : {
      "score" : 44.26985791661941
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 126.09576671066199,
    "phrases" : [ "New Contract" ],
    "documents" : [ 2, 31, 36 ],
    "attributes" : {
      "score" : 126.09576671066199
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 18.53711005132534,
    "phrases" : [ "U.S." ],
    "documents" : [ 3, 22, 39 ],
    "attributes" : {
      "score" : 18.53711005132534
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 57.89242410767021,
    "phrases" : [ "Air" ],
    "documents" : [ 7, 39 ],
    "attributes" : {
      "score" : 57.89242410767021
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 85.70452260732866,
    "phrases" : [ "Anonymously Buy Bitcoins" ],
    "documents" : [ 12, 24 ],
    "attributes" : {
      "score" : 85.70452260732866
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 73.40433437041672,
    "phrases" : [ "Attorneys Work" ],
    "documents" : [ 12, 31 ],
    "attributes" : {
      "score" : 73.40433437041672
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 101.7326253572062,
    "phrases" : [ "David Friedman Thinks Austrian Economics can Explain" ],
    "documents" : [ 5, 33 ],
    "attributes" : {
      "score" : 101.7326253572062
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 49.69111077299252,
    "phrases" : [ "Emerge" ],
    "documents" : [ 36, 40 ],
    "attributes" : {
      "score" : 49.69111077299252
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 40.715013498485696,
    "phrases" : [ "Hayek" ],
    "documents" : [ 5, 43 ],
    "attributes" : {
      "score" : 40.715013498485696
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 79.65476431439986,
    "phrases" : [ "Jeffrey Tucker" ],
    "documents" : [ 35, 46 ],
    "attributes" : {
      "score" : 79.65476431439986
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 51.533719731255836,
    "phrases" : [ "Look at the Law from the Perspective" ],
    "documents" : [ 2, 31 ],
    "attributes" : {
      "score" : 51.533719731255836
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 66.65318020370282,
    "phrases" : [ "Movie" ],
    "documents" : [ 5, 19 ],
    "attributes" : {
      "score" : 66.65318020370282
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 73.02282893203324,
    "phrases" : [ "Stephan Kinsella" ],
    "documents" : [ 9, 18 ],
    "attributes" : {
      "score" : 73.02282893203324
    }
  }, {
    "id" : 21,
    "size" : 17,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 4, 6, 8, 10, 11, 13, 14, 16, 20, 21, 23, 25, 27, 30, 34, 37, 49 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1655,
  "documents" : [ {
    "id" : 0,
    "title" : "Where does self-ownership come from? What are the valid arguments for it?",
    "snippet" : "What the title says.  Ownership is a legal term. Ownership comes from power. If you homesteaded a stick but I take it from you, and I now have power over it, how is that not ownership according to your definition? A precise application of your principle precludes any kind of property protection, even the wobbly 'possession' of the left-anarchists. I am not prescribing, I am describing. I have not put forth a principle in that post.\n\n[This](http://www.youtube.com/watch?v=sEME-1KMUT4) video provides more elaboration.    Depends what you mean. In an ethical sense, self-ownership comes from the fact that you can not even argue against the idea of self-ownership without employing yourself, i.e., exacting exclusive control of your body. Therefore, every position opposing it, in its very voicing, is contradicted by its proponents in their very actions.\n\nAs to in the practical sense. Your self-ownership is determined by your ability to defend it against others, just as all ownership stems from nothing more than your ability to hold on to something. What do you think in response to those who say that self ownership is impossible? I'd like to know their argument.\n\nIt's one thing to say you're unconvinced, it's another to claim impossibility. The latter requires argument. I believe you were an an-com at one point?  What did you think about self-ownership during this period?      Big thanks for all your replies and resources. Allow me to play the devils advocate here: its all good when we are talking about people who are demonstrably capable of agency (and their parents in the case of children), but what about the following:\n\n* What if you through some condition are utterly incapable of exercising control over your mind and body? E.g. born or through some disease or accident in adulthood rendered a paraplegic with cerebral palsy or some other severely debilitating physical and mental conditions.\n\n* What if someone else is controlling your mind and your body, e.g. through physical, pharmacological or psychological means?\n\n* What is someone who lacks control over his mind and body (for no fault of his own, e.g. either because he suffers from some condition or because he is the victim of someone controlling him through some means) in some fashion kills someone else? Or harms someone in a way that renders that person also incapable of exercising control over mind or body? Big thanks for all your replies and resources. Allow me to play the devils advocate here: its all good when we are talking about people who are demonstrably capable of agency (and their parents in the case of children), but what about the following:\n\n* What if you through some condition are utterly incapable of exercising control over your mind and body? E.g. born or through some disease or accident in adulthood rendered a paraplegic with cerebral palsy or some other severely debilitating physical and mental conditions.\n\n* What if someone else is controlling your mind and your body, e.g. through physical, pharmacological or psychological means?\n\n* What is someone who lacks control over his mind and body (for no fault of his own, e.g. either because he suffers from some condition or because he is the victim of someone controlling him through some means) in some fashion kills someone else? Or harms someone in a way that renders that person also incapable of exercising control over mind or body? Big thanks for all your replies and resources. Allow me to play the devils advocate here: its all good when we are talking about people who are demonstrably capable of agency (and their parents in the case of children), but what about the following:\n\n* What if you through some condition are utterly incapable of exercising control over your mind and body? E.g. born or through some disease or accident in adulthood rendered a paraplegic with cerebral palsy or some other severely debilitating physical and mental conditions.\n\n* What if someone else is controlling your mind and your body, e.g. through physical, pharmacological or psychological means?\n\n* What is someone who lacks control over his mind and body (for no fault of his own, e.g. either because he suffers from some condition or because he is the victim of someone controlling him through some means) in some fashion kills someone else? Or harms someone in a way that renders that person also incapable of exercising control over mind or body?        ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18xt4c/where_does_selfownership_come_from_what_are_the/"
  }, {
    "id" : 1,
    "title" : "How about Albert Camus?",
    "snippet" : "What do you think about Albert Camus in relation to anarcho-capitalism?    ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18xvyu/how_about_albert_camus/"
  }, {
    "id" : 2,
    "title" : "Thoughts about Oliver Wendell Holmes: moral skeptic who says you need to look at the law from the perspective of a \"bad\" man. Doesn't \"bad\" imply moral positivism?",
    "snippet" : "  I'm not sure if there is a more destructive Supreme Court justice in US history than Holmes. But to answer your question, I don't think \"bad man\" means an immoral person, per se, but rather he wants us to look at the law from the perspective of someone who would be breaking that law.  &gt; I'm not sure if there is a more destructive Supreme Court justice in US history than Holmes.\n\nMay I ask why you feel that way? Was it his reasoning in Otis, Schenck, Abrams, Buck, some other case, or something else entirely? Just curious. I sort of admire him because, to my knowledge, he was only person person publicly to call Abraham Lincoln an \"old fool\" to his face. It's not that I'm opposed to legal realism, that's not what made him destructive. It's his repeated deference to legislatures and the state. I'd blame him above anyone else for destroying the Contracts clause, which was once a great bulwark against state power. His dissent in *Lochner* paved the way for New Deal judges. ",
    "url" : "http://en.wikipedia.org/wiki/Oliver_Wendell_Holmes,_Jr."
  }, {
    "id" : 3,
    "title" : "Pot Grower Mike Boutin on Discovery Channel's Weed Country. - Guy does a good job articulating the current situation.",
    "snippet" : "  It's sad man.  So much shit wrong with the drug war.  I honestly don't see how people who enforce this shit sleep at night.   Completely agree.  I always find myself explaining to people that Lincoln never ended slavery in the U.S. and it still exists, but in a different form. Prisons are full of 'slaves' like this guy who are not forcing anyone to do anything and should be left alone. Completely agree.  I always find myself explaining to people that Lincoln never ended slavery in the U.S. and it still exists, but in a different form. Prisons are full of 'slaves' like this guy who are not forcing anyone to do anything and should be left alone. I usually get yelled at when I do that.  It usually goes something like this, \"How dare you compare a person's choice to do drugs and them facing the legal consequences of those actions and slavery.  Slaves didn't have a choice to be slaves, drug users choose to do drugs.\". I then try and use some logic and explain how drug use is an arbitrary identity trait like being black is and it falls on deaf ears.",
    "url" : "http://www.youtube.com/watch?v=KTWv_uzKzlg"
  }, {
    "id" : 4,
    "title" : "New Ron Paul book on the public school system/schooling in general. Due out in September.",
    "snippet" : "   Mandatory link drop:\n\nhttp://candlemind.com/projects/progclub/file/michael/getEducated.php?listID=9 Mandatory link drop:\n\nhttp://candlemind.com/projects/progclub/file/michael/getEducated.php?listID=9 Obligatory?  I hope he does one on health care.  Or, what is a good book on libertarian principles and healthcare. Try\n\nhttp://candlemind.com/projects/progclub/file/michael/getEducated.php?listID=29 ",
    "url" : "http://www.lewrockwell.com/blog/lewrw/archives/132603.html"
  }, {
    "id" : 5,
    "title" : "Paul Krugman: \"Austrian economics has very much of the psychology of a cult\"",
    "snippet" : "  reminds me of the Tom Woods quote:\n\n\"Libertarianism is 'cultish,' say the sophisticates. Of course, there's nothing cultish at all about allegiance to the state, with its flags, its songs, its mass murders, its little children saluting and paying homage to pictures of their dear leaders on the wall, etc.\" Some offshoots of libertarianism are definitely cultish. Unfortunately. Some offshoots of libertarianism are definitely cultish. Unfortunately. Which ones?  Just curious... I'm not a big fan of Randian Libertarians. Ayn Rand is a fiction writer and developed a poorly thought out philosophy about why it's great to be selfish and how she's right about everything. I find people who are really into her to be quite cultish in their beliefs. Then again, all political/economic ideologies are prone to cult-like-followers. I  sometime lurk in /r/objectivism and... I would also say they're is a cultish feel there.  \n\nAnd then, there is Molyneux :p He literally has one of the best voices ever. He also says that tattoos are the result of child abuse. He also says that tattoos are the result of child abuse. I'd like to see a source on that. But I never said I agree with him on every single issue, I just said he has a nice voice &gt;I think you're totally right, the metaphor is over-extended. What I meant is you're attacking an innocent - in this case, your body.\n\n&gt;Our bodies did the best they could to save us from abuse when we were children - and then, when we are free, we take out our anxieties and dissociation on our bodies by attacking them, just as our parents did.\n\n&gt;Tattoos are scorched and blackened tears.\n\nhttp://board.freedomainradio.com/forums/p/10337/91609.aspx\n\nI guess he's never heard of art for art's sake. He also says that tattoos are the result of child abuse. Tattoos and piercings are body mutilation. But people can do whatever they want with their bodies. I just wish future them could be there to talk them out of it. You misspelled art. I  sometime lurk in /r/objectivism and... I would also say they're is a cultish feel there.  \n\nAnd then, there is Molyneux :p I think Molyneux tends to attract people who are desperately looking for something (or someone) to cling to. I guess that's true of any cult, but really it's just a necessary condition, not a sufficient one. It could perhaps be said that he encourages that type of behavior with his child abuse talk, but really I just think that he attracts sycophants for some reason and there's not a whole lot he can do about it. Not that he would do something about it if he could. I think Molyneaux makes the mistake of not differentiating his arguments against the state, which are fairly cogent, from his opinions on psychology, which are... not always so great. \n\nIt's somewhat irresponsible, but people have the right to listen to him, he doesn't force anyone to. And people are responsible for sorting out what makes sense and what doesn't. I think Molyneux tends to attract people who are desperately looking for something (or someone) to cling to. I guess that's true of any cult, but really it's just a necessary condition, not a sufficient one. It could perhaps be said that he encourages that type of behavior with his child abuse talk, but really I just think that he attracts sycophants for some reason and there's not a whole lot he can do about it. Not that he would do something about it if he could. I  sometime lurk in /r/objectivism and... I would also say they're is a cultish feel there.  \n\nAnd then, there is Molyneux :p &gt;Molyneux\n\nIs it his ideas or his followers? yes. Could you elaborate? Just genuinely interested. :-) His ideas about attributing anything and everything to child abuse concern me.  His fan boys take it to the next level.  That's all it really is.  However, his response to Jon Stewart was pretty badass. I'm not a big fan of Randian Libertarians. Ayn Rand is a fiction writer and developed a poorly thought out philosophy about why it's great to be selfish and how she's right about everything. I find people who are really into her to be quite cultish in their beliefs. Then again, all political/economic ideologies are prone to cult-like-followers. Get out. See what I mean? My god nobody got the joke! XD  I'm not a big fan of Randian Libertarians. Ayn Rand is a fiction writer and developed a poorly thought out philosophy about why it's great to be selfish and how she's right about everything. I find people who are really into her to be quite cultish in their beliefs. Then again, all political/economic ideologies are prone to cult-like-followers. &gt;why it's great to be selfish\n\nAs opposed to self-denial?  What's untenable about psychological egoism?\n\nIf I had to critique Rand, I wouldn't have chosen that. I don't think selfishness is necessarily opposed to self-denial. I think her advocation of selfishness prompts others to become selfish. I also think that self-denial is a form of self-discipline and therefore somewhat of a noble trait. &gt;self-denial is a form of self-discipline\n\nThis is necessarily a contradiction.  What is disciplining the self if not the self, and how would this be a form of self-denial? I don't think so. If I deny myself from i dunno eating chocolate pudding between meals, it's a form of self-discipline. But, this is you enforcing your will on another part of you, not you denying yourself, long-term desires superseding short-term ones. I don't think so. If I deny myself from i dunno eating chocolate pudding between meals, it's a form of self-discipline. I don't think selfishness is necessarily opposed to self-denial. I think her advocation of selfishness prompts others to become selfish. I also think that self-denial is a form of self-discipline and therefore somewhat of a noble trait. I think this Nathaniel Brandon piece called \"Counterfeit Individualism\" does a decent job of explaining people uncofortability around selfishness. http://youtu.be/zGPynf3kohM Swingin' jazz fusion soundtrack aside this movie is rubbish and has a very propaganda feel to it. Slow motion footage of Barrack Obama looking stern while talking about the evil will of 'collectivists' is hardly a good way to make a point.\n\nWhat I object to with Rand's presentation of the individual is her reliance on a strict binary opposition between 'individual' and 'collective' as a basis for her theory. What is a 'collective' if not a group of 'individuals.' Likewise, where do the interests of the 'individual' truly separate from the 'collective.' I think Rand's logic here is deeply flawed. After all, don't individual Randian Libertarians share collective interests with others? I think the biggest problem with how Rand defends selfishness is that she fails to realize that the interests of both the individual and the collective cannot exist if not in relation to one another.\n\nRand then uses this illogical division to then demonize the collective. I don't have issue with acting in one's own self interest but there needs to be a point where the individual realizes their own existence within a greater collective. To accuse others of being 'collectivists' when they disagree with your personal opinion is simply illogical. I could go deeper in my analysis of her work but it's dinner time and it's never good to deconstruct when you're hungry. I don't disagree completely, but I think that forced collectives are the issue. Voluntarily congregating and working together for a common goal and shared reward is fine, as is pure individualism. Forcing people into collectives that require funds taken by force from the members who have been forced into it in the first place is inherenty wrong. \n\nCollectives happen naturally anyways, by the individuals selfishness. What I mean is, an individual sees personal profit in joining in a collective group to accomplish a goal. The goal wasn't to make a collective for the collective's sake, but for the profit and betterment of each individual. \n\nThe people that have the whole little mindset of \"all one\" and such are usually operating on the principle that things like money and time should be taken from the individual (by force) and given to a collective for the betterment of the collective. But this is really somehwat backwards. If you better each individual in a collective, you've improved the collective. A collective worth being will be.\n\n I'm not a big fan of Randian Libertarians. Ayn Rand is a fiction writer and developed a poorly thought out philosophy about why it's great to be selfish and how she's right about everything. I find people who are really into her to be quite cultish in their beliefs. Then again, all political/economic ideologies are prone to cult-like-followers. &gt;I'm not a big fan of Randian Libertarians. Ayn Rand is a fiction writer\n\nNope.\n\n&gt;and developed a poorly thought out philosophy\n\nThat you've easily disproven, right?\n\n&gt;about why it's great to be selfish and how she's right about everything. I find people who are really into her to be quite cultish in their beliefs. Then again, all political/economic ideologies are prone to cult-like-followers.\n\nYou really don't seem to understand Rand at all. &gt;I'm not a big fan of Randian Libertarians. Ayn Rand is a fiction writer\n\nNope.\n\n&gt;and developed a poorly thought out philosophy\n\nThat you've easily disproven, right?\n\n&gt;about why it's great to be selfish and how she's right about everything. I find people who are really into her to be quite cultish in their beliefs. Then again, all political/economic ideologies are prone to cult-like-followers.\n\nYou really don't seem to understand Rand at all. Wait, did you seriously just deny that Ayn Rand was a fiction writer? Wow. Just wow... You are aware she wrote non-fiction books, right? Yeah and? How does that make her any less a fiction writer? Especially when he Fiction was far better, and is far more well read than he non-fiction.\n\nJust as a novelist can sometimes work on screenplays, at their heart they're still a novelist. Rand's forte was by far fiction, and she should have stuck to it. It was clear that the original post was dismissing her as a fiction writer. She is much more than that. She is a philosopher first, and a writer second, and she wrote far more non-fiction books than novels.\n\nFurthermore, Rand's fiction is widely denounced for lacking in quality. While I don't agree with the criticisms, I would not characterize her solely by her fiction works. It was clear that the original post was dismissing her as a fiction writer. She is much more than that. She is a philosopher first, and a writer second, and she wrote far more non-fiction books than novels.\n\nFurthermore, Rand's fiction is widely denounced for lacking in quality. While I don't agree with the criticisms, I would not characterize her solely by her fiction works. Which ones?  Just curious... Glenn Beck libertarians; most immortalize the founders as demigods and treat the Constitution as if Moses carried it down Mount Sinai along with the 10 commandants. At least the constitution actually exists... At least the constitution actually exists... reminds me of the Tom Woods quote:\n\n\"Libertarianism is 'cultish,' say the sophisticates. Of course, there's nothing cultish at all about allegiance to the state, with its flags, its songs, its mass murders, its little children saluting and paying homage to pictures of their dear leaders on the wall, etc.\" reminds me of the Tom Woods quote:\n\n\"Libertarianism is 'cultish,' say the sophisticates. Of course, there's nothing cultish at all about allegiance to the state, with its flags, its songs, its mass murders, its little children saluting and paying homage to pictures of their dear leaders on the wall, etc.\" reminds me of the Tom Woods quote:\n\n\"Libertarianism is 'cultish,' say the sophisticates. Of course, there's nothing cultish at all about allegiance to the state, with its flags, its songs, its mass murders, its little children saluting and paying homage to pictures of their dear leaders on the wall, etc.\" &gt;its flags, its songs, its mass murders, its little children saluting and paying homage to pictures of their dear leaders on the wall\n\nBecause non-Libertarians must be in favor of those things?  he loses all credibility when he says Austrians have a large influence in the GOP lol Right, it was *that* and not the wishing war with invading aliens that damaged his credibility.  :-D The alien thing was a joke, though.(?) he loses all credibility when he says Austrians have a large influence in the GOP lol Technically the Koch brothers identify as Austrian/Libertarian. To many Koch=GOP he loses all credibility when he says Austrians have a large influence in the GOP lol When did he have credibility?  i try to give every article a chance, even if he calls me a cultist because, what if i *am* wrong?\n\nbut he blew it at the end and proved he had no idea what he was talking about The times I've been reading, and thought \"This guys knows what he's talking about,\" and the author is Krugman: 0.  he loses all credibility when he says Austrians have a large influence in the GOP lol Why? I've seen a lot of support for Austrian economics from members of the GOP. he loses all credibility when he says Austrians have a large influence in the GOP lol  Yeah, ad hominem attacks don't inspire me to rethink Keynsian economics. It's not the sort of blog where there's much in-depth objective analysis. It IS the sort of blog where the author says things his readers already agree with so they can celebrate having their opinion verified by a Nobel-winning economist.\n\nIn fairness, it is likely Krugman truly thinks these things himself to some extent, but to say that the standards on his blog don't meet his intellectual capability would be understating it a bit. An intellectual doesn't use ad hominem attacks.  People that can't defend themselves with facts do that. Not necessarily.  I can back up my opposition to Obama with plenty of facts and logic, but that doesn't stop me from calling him a murderous, power-grabbing, manipulative, cult-leading jackass. Not necessarily.  I can back up my opposition to Obama with plenty of facts and logic, but that doesn't stop me from calling him a murderous, power-grabbing, manipulative, cult-leading jackass. An intellectual doesn't use ad hominem attacks.  People that can't defend themselves with facts do that. It's not the sort of blog where there's much in-depth objective analysis. It IS the sort of blog where the author says things his readers already agree with so they can celebrate having their opinion verified by a Nobel-winning economist.\n\nIn fairness, it is likely Krugman truly thinks these things himself to some extent, but to say that the standards on his blog don't meet his intellectual capability would be understating it a bit. It's not the sort of blog where there's much in-depth objective analysis. It IS the sort of blog where the author says things his readers already agree with so they can celebrate having their opinion verified by a Nobel-winning economist.\n\nIn fairness, it is likely Krugman truly thinks these things himself to some extent, but to say that the standards on his blog don't meet his intellectual capability would be understating it a bit. I don't understand this qualified praise people always have for him. Was there a time when he did actual economics? Yeah, that's kind of what he won the Nobel for... They don't hand those out to political bloggers, you have to actually contribute something substantial. His work in international trade is definitely up to par.  They do however hand them out willy-nilly, I.E. Obama, for something he didn't even do. \"Extraordinary efforts to strengthen international diplomacy and cooperation between peoples\". How he managed that beyond mentally sucking off other world leaders in front of the world is beyond me. Yeah, that's one they'll be regretting for CENTURIES... They do however hand them out willy-nilly, I.E. Obama, for something he didn't even do. \"Extraordinary efforts to strengthen international diplomacy and cooperation between peoples\". How he managed that beyond mentally sucking off other world leaders in front of the world is beyond me. I don't understand this qualified praise people always have for him. Was there a time when he did actual economics? Yeah, ad hominem attacks don't inspire me to rethink Keynsian economics.  One of the comments claims that Friedman and the Chicago school are actually followers of the Austrian school. There is no hope for these people For what it's worth, David Friedman claims that the difference between Austrian economics and other schools of economics is mostly marketing. David Friedman thinks Austrian economics can explain most phenomena, and so can other schools of economics. However, none can explain all phenomena.\n\nI find it odd that Krugman claims to not take Austrian economics seriously, but he still bashes it; I wouldn't write a blog post about some ideology that I didn't take seriously. There is a fundamental difference between Austrian economics and mainstream economics, most noticeably on the macro level, in the very method each side uses to reach their conclusions. It's more than just marketing.  Actually, a lot of neoclassical \"first principles\" ideas reflect those in Austrian thought, simply with different wording. The trouble is when people stray from those principles (e.g. by trying to add and subtract numbers in utility functions, which are supposed to represent how people rank their preferences).\n\nFurthermore, arguably all the \"anti-empiricist\" parts of Austrian theory ([which are a matter of controversy in themselves](http://www.cato-unbound.org/archives/september-2012/)) imply is that one has to have a deductive explanation for a tendency before one can just pull it from a historical dataset. That's probably not that controversial.\n\nI think that at this point, anyone interested in Austrian ideas would probably do best to present themselves as a neoclassical-type interested in experimental economics. Experimental economics is, I think, compatible with praxeological methods (see [this paper](http://mises.org/journals/scholar/powell3.pdf) on the matter), and is taken seriously by outsiders. Vernon Smith, the founder of experimental economics who won a Nobel Prize for it, [endorses this view, and claims that the field tends to support Mises' hypotheses](http://www.cato.org/sites/cato.org/files/serials/files/cato-journal/1999/11/cj19n2-1.pdf). \n\nUltimately, I think we would maximize our influence by working within the mainstream, not fruitlessly talking past it. There is a fundamental difference between Austrian economics and mainstream economics, most noticeably on the macro level, in the very method each side uses to reach their conclusions. It's more than just marketing.  There is a fundamental difference between Austrian economics and mainstream economics, most noticeably on the macro level, in the very method each side uses to reach their conclusions. It's more than just marketing.  Could you point me in the direction that explains Austrian's view on macro economics? Please and thank you! I personally ignore macro economics for the most part, because it deals with trade in between states, and of course I'm not really interested in states. For what it's worth, David Friedman claims that the difference between Austrian economics and other schools of economics is mostly marketing. David Friedman thinks Austrian economics can explain most phenomena, and so can other schools of economics. However, none can explain all phenomena.\n\nI find it odd that Krugman claims to not take Austrian economics seriously, but he still bashes it; I wouldn't write a blog post about some ideology that I didn't take seriously.  [deleted] Describe money that is \"worth something.\" [deleted] I was not aware that trading was illegal.\n\n&gt; Go to a tribe in the middle of the Amazonian rainforest. Try trading your paper money to them for something. \n\nWhat services would I want from said tribe that I couldn't get in the US with my \"worthless\" paper money? [deleted] &gt; but try and get an employment situation that paid in alternative currencies\n\nWe tried that in America. It was called company scrip and it was a huge failure.\n\n&gt; Take it outside that environment, and it's value changes.\n\nMy wife and I have spent a fair amount of time outside the US. It's not surprising to us that people in western and third world countries gladly accepted our \"paper\" because it has worth.\n\n&gt; The things of real value are land, food, water, shelter, etc. \n\nHave you ever lived outside the US for an extended amount of time? Seriously?\n\nI still don't understand your argument. Do you want the US and developed societies to resort to tribal culture? [deleted] &gt; If you don't understand the argument, then say so. \n\nTry reading my comment.\n\n&gt; We're not getting anywhere with this anyway. \n\nI'll wait for you to rebut my points. I'm not holding my breath. [deleted]  For all that there is to say about Krugman, I do feel there are some sects of the austrian group that can make me uncomfortable at times. Some have a harsh attitude toward even minarchists as they don't accept all tenets of austrian teachings (particularly the complete absence of government). What makes me most uneasy is when people start saying that anyone who isn't wholeheartedly convinced that an anarcho capitalist society is both possible AND desirable has a sort of moral failing.\n\nFor example, I've seen people say that they downright refuse to respect Milton Friedman because he didn't explicitly claim to be an anarcho capitalist, and promoted some government policies as being better than others (the implication being, in the mind of the commenter, that Friedman was a confirmed statist who supported the initiation of violence against citizens).\n\nIn particular I guess I take issue with the way some, but not all, austrians treat anarch-capitalism as a religion or moral philosophy where if you don't adhere to the dogma as espoused by its leaders, you are shunned and frowned upon. That's not the worst crime in the world, but I can see why some would consider it cultish.\n\n***\n\nAll that having been said, Krugman does little to point out what issues he has with austrians or why he thinks there is a cult mentality. Further, he fails to address what the wiki-battle is actually about (could someone please enlighten me what exactly is being debated over there?). Finally, either he or his editor put a title on the post that seems almost deliberately inciting. It's just obnoxious, really.\n\nTL;DR There are some aspects of certain austrian groups that come off as cultish, but Krugman is still obnoxious about it (as is his wont), instead of being constructively critical.  Look who's projecting again. i love the 'i voted for kodos'  If I ever met that guy the NAP can go out the broken window :D If I ever met that guy the NAP can go out the broken window :D  I've asked before, but it bears repeating: \"When did Krugman the Wise abandon reason for madness?\"\nhttp://i.imgur.com/BZOzS5B.jpg\n\n(image courtesy of Sea_Bat) I've asked before, but it bears repeating: \"When did Krugman the Wise abandon reason for madness?\"\nhttp://i.imgur.com/BZOzS5B.jpg\n\n(image courtesy of Sea_Bat) Was there ever a time when he was wise?  I'm not trying to turn this into a circle-jerk; I'm genuinely curious as to whether there was ever a point at which he was a good economist. Was there ever a time when he was wise?  I'm not trying to turn this into a circle-jerk; I'm genuinely curious as to whether there was ever a point at which he was a good economist.     check out the comment section Why did you tell me to do that. &amp;#3232;\\_&amp;#3232;\n\n&gt;The fact that this cult has a large influence within the GOP is proof enough that Austrian economics is a scam.\n\nBut they...they don't. \n\n&gt;The two principle Austrians were Frederich Hayek, and as far as Americans are concerned, **Milton Friedman**.\n\nNO! No. He was a leader of the *Chicago* school. \n Why did you tell me to do that. &amp;#3232;\\_&amp;#3232;\n\n&gt;The fact that this cult has a large influence within the GOP is proof enough that Austrian economics is a scam.\n\nBut they...they don't. \n\n&gt;The two principle Austrians were Frederich Hayek, and as far as Americans are concerned, **Milton Friedman**.\n\nNO! No. He was a leader of the *Chicago* school. \n check out the comment section check out the comment section Those comments made me want to vomit blood.    Why does anyone listen to this ratfaced loser. Because he used to be an economist who made some important contributions to international trade theory.  Now he's just a hack who uses his background as an academic to lend false substance to his political views. His past work needs to be scrutinized again. What he got a Nobel prize for is not very impressive. What did you get your Nobel prize for? I don't have one because I am not stupid. *I don't have one because I am not stupid.*\n\nAre you certain? The evidence at hand indicates otherwise. Bringing the ELS friends? Nope. Just wandered through and saw a whole bunch of stupid with your name on it. I don't have one because I am not stupid. Like I mentioned before. This is the kind of debate I've come to expect from libertarians and A-C. Empty calories, but still entertaining. Because he used to be an economist who made some important contributions to international trade theory.  Now he's just a hack who uses his background as an academic to lend false substance to his political views. This, and he says what many would like to hear. And since he has a Nobel, he *CAN'T* be wrong. That's how Nobels work, for Krugman and Stiglitz anyway. Less so for Hayek, Friedman, Smith, Lucas, etc. Or perhaps, with the exception of Friedman, they had less willingness to become public personas. You touched on a really fascinating bit of cognitive dissonance here. Seriously, why is it that Krugman's Nobel Prize makes him right about pretty much everything (in the eyes of his Keynesian readership), and Hayek and Friedman are simply discarded as \"cultist\"? This, and he says what many would like to hear. And since he has a Nobel, he *CAN'T* be wrong. That's how Nobels work, for Krugman and Stiglitz anyway. Less so for Hayek, Friedman, Smith, Lucas, etc. Or perhaps, with the exception of Friedman, they had less willingness to become public personas. It's funny, because Krugman's blog almost *never* deals with the stuff he won his Nobel for.  Coming up with good ideas about international trade doesn't validate vulgar Keynesianism on domestic issues.  It is so strange to me that people listen to him on these issues, because he's not even a very sophisticated proponent of Keynesian thought.   I've given this a bit of thought over the last few years. I think it comes down to the people that read his blog. Do you suspect they are more commonly economics enthusiasts, or passionate liberals? I strongly suspect the latter. I agree with your suspicions.  He and Brad DeLong basically provide an echo chamber for their readers.  Neither really has anything particularly interesting to say, they just smear their ideological opponents in suprisingly vicious terms.  There's no prominent free-market-oriented blogger who resorts to ad hominem attacks with as much glee as that pair. I've given this a bit of thought over the last few years. I think it comes down to the people that read his blog. Do you suspect they are more commonly economics enthusiasts, or passionate liberals? I strongly suspect the latter. Why does anyone listen to this ratfaced loser. Why does anyone listen to this ratfaced loser.  The most frustrating thing is that if you talk to non-Austrian economists, the first thing they talk about is the lack of data/math/rigor in the Austrian school. People percieve the collection of data as somehow being more rigorous than other means of arriving at a position. This belies an underlying fault in their understanding of math/statistics, but it certainly does a disservice to us in the eyes of the layman. Uh, this is actually a valid concern. Even if Austrianism makes testable claims that are largely verifiable, if there's not concentrated statistical proof of the claims working, then it's largely hearsay in comparison to papers that have several pages of regression coefficient tables.\n\nI've seen no statistics from Austrians, and I've bought and read every major Austrian text imaginable. It doesn't mean I don't believe some of the major claims like preference, but it's *really* hard to argue that an Austrian system works when hundreds of papers have tested and proven the opposite and people would gladly send you the JSTOR links and the papers are filled with sections about how they control for validity issues and unforeseen variables and all you can do is send them a well written persuasive essay. There's even a subdiscipline of economics that deals primarily with human interaction (experimental econ and behavioral econ) and what they do is put human action into statistical probabilities.\n\nLogic is a great foundation to a philosophy, but it can only take you so far. Logic has to be proven, because much as we want it to, you can't argue with the universe to make it work like you want. Sometimes you have to figure out how the universe works.\n\nEDIT: How interesting the universe is. [I've found Bob Murphy doing some empirical work](http://consultingbyrpm.com/blog/2013/02/i-get-empirical-on-minimum-wage.html). A good step in the right direction for the school of thought. While I agree that empirical work is needed in the Subjectivist Austrian corpus more than there currently is - though we can look to Rothbard and others' work on economic history as at least partially empirical, as well as to new Austrians like Ben Powell and Dan D'Amico who are doing overtly empirical work - you have to understand something about logic. See, this thing called 'logic' underlies every working model conceived. The antithesis of logic, which is truly a fundamental rule set we infer from interacting with reality (or perceiving such), is pure randomness. No model can subsist on randomness because by definition that precludes prediction. Ergo, if anything is truly random, to the extent that it is random, it cannot be modeled or processed logically. That's a nice way of saying that any genuinely random thing is non-cognitive. It's inconceivable. \n\nGiven that maths also rely upon logic, just the same as the fundamental Subjectivist theorems, if logic is as shaky in its inferences and deductive-inductive syntheses as you say, the same applies to all models and every assumption necessary to generate a model. There are certain things that must be inferred or assumed to exist, just as we find in maths, for any working model. Uh, this is actually a valid concern. Even if Austrianism makes testable claims that are largely verifiable, if there's not concentrated statistical proof of the claims working, then it's largely hearsay in comparison to papers that have several pages of regression coefficient tables.\n\nI've seen no statistics from Austrians, and I've bought and read every major Austrian text imaginable. It doesn't mean I don't believe some of the major claims like preference, but it's *really* hard to argue that an Austrian system works when hundreds of papers have tested and proven the opposite and people would gladly send you the JSTOR links and the papers are filled with sections about how they control for validity issues and unforeseen variables and all you can do is send them a well written persuasive essay. There's even a subdiscipline of economics that deals primarily with human interaction (experimental econ and behavioral econ) and what they do is put human action into statistical probabilities.\n\nLogic is a great foundation to a philosophy, but it can only take you so far. Logic has to be proven, because much as we want it to, you can't argue with the universe to make it work like you want. Sometimes you have to figure out how the universe works.\n\nEDIT: How interesting the universe is. [I've found Bob Murphy doing some empirical work](http://consultingbyrpm.com/blog/2013/02/i-get-empirical-on-minimum-wage.html). A good step in the right direction for the school of thought. I should really do more reading about these things and yet I can't (there are literally thousands of pages of other material that I should be reading right now.)\n\nWould you be willing to give a very brief summary of a few studies which you say disprove Austrian principles/thought/predictions?\n\nBehavioral econ often seems to confirm my economic positions. Statists like to talk about how people \"don't make rational decisions\" as an excuse for state intervention. I think that their concept of rationality is narrowly defined and maybe a bit elitist. People value things other than money sometimes. I'd say one of the more common ones is the minimum wage. Labor demand is so inelastic that moderate increases in the minimum wage don't lead to real unemployment, just a higher unemployment rate because more people enter the labor force because labor supply is highly elastic in relation to expected wages. The reason labor demand is inelastic is because employers hire and fire largely based on the level of service they need to function, and will just pass the wage costs down the line to the consumer.\n\nThere have been many natural experiments that have looked at minimum wage effects and found minimum wage to have a small effect if any on an economy. Some of the more powerful studies look at two towns across state lines from each other and finding that both towns have similar levels of employment but different minimum wages.\n\nThis doesn't entirely disprove Austrian theory, given that a sufficiently high increase in the minimum wage could very easily demolish an economy, given that demand is not totally inelastic, but it certainly validates politicians' and economists' claims for moderate increases in the minimum wage. The literature predicts that if the minimum wage were tied to the CPI, like Obama wants, it would have no real effects one way or the other. Could you elaborate on this part?\n\n&gt;Labor demand is so inelastic that **moderate increases in the minimum wage don't lead to real unemployment, just a higher unemployment rate** because more people enter the labor force because labor supply is highly elastic in relation to expected wages.\n\nI understand why labor demand would be inelastic and why labor supply would be elastic, but what's the difference between \"real unemployment\" and the unemployment rate?\n\nI would agree that claiming the minimum wage always increases unemployment can be misleading because it assumes all else equal which, as we know, is not applicable to a real economy. Though higher prices are still a detriment to the people as it nullifies the value of their [now higher] wages.\n\nAre there any studies that show minimum wage has some sort of net benefit? If literature predicts that indexing the minimum wage to CPI has no real effects, then what's the point of it? I'd say one of the more common ones is the minimum wage. Labor demand is so inelastic that moderate increases in the minimum wage don't lead to real unemployment, just a higher unemployment rate because more people enter the labor force because labor supply is highly elastic in relation to expected wages. The reason labor demand is inelastic is because employers hire and fire largely based on the level of service they need to function, and will just pass the wage costs down the line to the consumer.\n\nThere have been many natural experiments that have looked at minimum wage effects and found minimum wage to have a small effect if any on an economy. Some of the more powerful studies look at two towns across state lines from each other and finding that both towns have similar levels of employment but different minimum wages.\n\nThis doesn't entirely disprove Austrian theory, given that a sufficiently high increase in the minimum wage could very easily demolish an economy, given that demand is not totally inelastic, but it certainly validates politicians' and economists' claims for moderate increases in the minimum wage. The literature predicts that if the minimum wage were tied to the CPI, like Obama wants, it would have no real effects one way or the other. That's a very interesting point. It makes me wonder why labor supply is elastic in relation to minimum wage. Does the 20% wage increase incentivise people to come off of welfare/other support?\n\nI think the more interesting point is the one you made about CPI and such. If the government continually dilutes the $ purchasing power (although technically most people claim the CPI is constant right now through the QE's, although I feel like I've seen the prices on some items go up significantly), but also adjusts minimum wage for CPI, then isn't it an effective tax (via both monetary inflation and passing the cost of labor on to the consumers) on all above-minimum wage earners? I could agree with that, but isn't that the goal of the government, to have a progressive tax system? The most frustrating thing is that if you talk to non-Austrian economists, the first thing they talk about is the lack of data/math/rigor in the Austrian school. People percieve the collection of data as somehow being more rigorous than other means of arriving at a position. This belies an underlying fault in their understanding of math/statistics, but it certainly does a disservice to us in the eyes of the layman. I talk about the lack of scientific foundation in praxeology, not the lack of data or math. \n\nMost of the data and math used with any bed of economics is based upon price and goods / resources moved. \n\nTaking this type of data and applying fictional models to it may make for decent counterfactual questions (such as \"What if we change the tax rate during the 1930s\"), but doesn't provide any beneficial scientific knowledge, as it's not a testable, isolating method.\n\nAustrians just seem to be in love with the idea of infinite choice, whether or not that's scientifically valid. Austrians make testable statements about human behavior. I don't usually see anyone attacking these conclusions scientifically, by falsifying the claims. I usually only see people complaining that the Austrians use unorthodox methods. Why assume their methods are wrong if no one has shown that their conclusions conflict with reality? &gt;Austrians make testable statements about human behavior\n\nGot one that's reproducible anywhere?   Krugman: \"I have a Nobel prize, listen to me!\"\n\nOther economists: \"But so did Hayek, and he said the opposite to you.\"\n\nKrugman: \"Yeah, but he's, like, a cult...\"    Anytime I run across an annoying Paul Krugman article, I just read [this](http://faculty.chicagobooth.edu/john.cochrane/research/papers/ecaf_2077.pdf) to calm my mind.  Yeah, those cultish scientists with their stupid science religion!\n\nReally, the economic discourse has fallen to the level of basically yelling \"No, *you're* a poo-poo head!\" at each other.    I'll be honest here.\n\nYou could spend all day long trying to burn down strawmen only to find there is an infinite amount of straw to be brought to the fire. \n\nWhile I appreciate a good argument that challenges my point of view, articles like this never lead to anything constructive and are not worth sharing. \n\nIf you try to crash a circle jerk, you're just going to get splooge in your eye.   This has nothing to do with anarcho-capitalism. It's tied to Ludwig von Mises' and student Murray Rothbard, who is the forefather of AnCap and the entire Libertarian movement.  I understand the relationship between Austrian economics and the coining of the term anarcho-capitalism. But the two are not synonymous.\n\nBeing an anarcho-capitalist does not, in any way, imply that one subscribes to Austrian economics. Yes, you're correct, and David Friedman is an example of one such an-cap.  But those cases are few and far between, especially amongst those who care about the subject enough to go to message boards \n\nFor example: Doug Stanhope is an anarcho-capitalist, I've confirmed as much through a conversation I had with him, but he doesn't care enough to figure out labels or learn anything beyond that the government sucks.  I would expect him not to know what Austrian economics is, but he doesn't read message boards either.  Those that do likely subscribe to AE or, at the very least, know what AE is.\n\nI think within the context of where we are and what this is about, it's relevant to this subreddit. Yes, you're correct, and David Friedman is an example of one such an-cap.  But those cases are few and far between, especially amongst those who care about the subject enough to go to message boards \n\nFor example: Doug Stanhope is an anarcho-capitalist, I've confirmed as much through a conversation I had with him, but he doesn't care enough to figure out labels or learn anything beyond that the government sucks.  I would expect him not to know what Austrian economics is, but he doesn't read message boards either.  Those that do likely subscribe to AE or, at the very least, know what AE is.\n\nI think within the context of where we are and what this is about, it's relevant to this subreddit. What economic philosophy does David Friedman subscribe to/ What economic philosophy does David Friedman subscribe to/ I understand the relationship between Austrian economics and the coining of the term anarcho-capitalism. But the two are not synonymous.\n\nBeing an anarcho-capitalist does not, in any way, imply that one subscribes to Austrian economics. It's tied to Ludwig von Mises' and student Murray Rothbard, who is the forefather of AnCap and the entire Libertarian movement.  &gt;entire Libertarian movement.\n\nMight want to check out some Proudhon, there... This has nothing to do with anarcho-capitalism. I wish people wouldn't down vote when someone questions posts as being relevant for a subreddit.  \n\nI actually agree with you.  The article might be of interest, but is better suited for r/Austrian. I wish people wouldn't down vote when someone questions posts as being relevant for a subreddit.  \n\nI actually agree with you.  The article might be of interest, but is better suited for r/Austrian. This has nothing to do with anarcho-capitalism.   Yet again I'm left wondering: Who gives a damn? \n\nAre we all going to lose our shit every time this mouth breather mentions Austrian economics? Every moment you spend talking about Krugman is a moment he has robbed you of.       Ad hominem much?",
    "url" : "http://krugman.blogs.nytimes.com/2013/02/20/fine-austrian-whines/"
  }, {
    "id" : 6,
    "title" : "I am a recent defector from North Korea, joined by Movements.org and Liberty in North Korea (LiNK)... ask me anything! : IAmA",
    "snippet" : "  [One of my favourite responses](http://www.reddit.com/r/IAmA/comments/18umza/i_am_a_recent_defector_from_north_korea_joined_by/c8i698m).\n\nSome of the responses to it are saaaaaad though. I literally said \"fuck yes\" out loud when I was reading that today. Such an excellent response.    I love reading about how people created their own markets.  This just goes to show you that society, in the absence of government oversight, simply reverts to a system of voluntary exchange. It's quite amazing really, even in the most oppressive authoritarian regime in the world there is still agorist action taking place. It tells you a lot about human nature, and it should give socialists some real food for thought. [deleted]",
    "url" : "http://www.reddit.com/r/IAmA/comments/18umza/i_am_a_recent_defector_from_north_korea_joined_by/"
  }, {
    "id" : 7,
    "title" : "Tonight (2.20.13) Decline to State will be airing a prerecorded interview with Kevin Carson",
    "snippet" : "He is a free market socialist.  Understand more about new philosophies.  Listen live at www.declinefm.com.  Sorry quick and to the point.    Does \"free market socialism\" = \"mutualism\"? Sorry I just quick hammered out this promo about 15 min before it aired.  I wasn't very careful in word choice.  He is a mutualist.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18xh01/tonight_22013_decline_to_state_will_be_airing_a/"
  }, {
    "id" : 8,
    "title" : "Anarcho-Collectivists: Is a HOME-BUSINESS Considered PERSONAL or PRIVATE PROPERTY?",
    "snippet" : "    Not a collectivist, but I could imagine them viewing any situation where you are self-employed as \"workers owning the means of production\". Until you hire or employ someone else, then you become a \"petite bourgeoisie\". If you hire or employ another person to do your job you become a capitalist, I think... It really is fucking absurd isn't it?  So, if I am self-employed and make $80k/yr, but then I decide I don't want to deal with all of the stress so I hire someone to do half of my job and pay him $40k a year, I'm the antichrist to them.",
    "url" : "http://voluntaryvirtues.com/2013/02/20/anarcho-collectivists-is-a-home-business-considered-personal-or-private-property/"
  }, {
    "id" : 9,
    "title" : "Stephan Kinsella - Ron Paul is using gov't to steal from supporters",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=q9aFHFqcKvo"
  }, {
    "id" : 10,
    "title" : "An example of how the free-market or profit-driven companies raise health standards--requiring employees to be non-smokers.",
    "snippet" : "  You're forgetting that employers have an incentive to do this only because they have to provide health insurance coverage.  Nevertheless, I don't see anything wrong with this (and I'm a smoker and I work in the tobacco industry).  If I were an employer, I would have a preference to hire healthy and productive employees anyway.  I don't want to hire someone who has to go out for a smoke every hour and has a good chance of developing health problems.  I also wouldn't have a preference of hiring heavy drinkers or obese people either (or ugly/unhygenic people if they have to deal with customers). You're forgetting that employers have an incentive to do this only because they have to provide health insurance coverage.  Nevertheless, I don't see anything wrong with this (and I'm a smoker and I work in the tobacco industry).  If I were an employer, I would have a preference to hire healthy and productive employees anyway.  I don't want to hire someone who has to go out for a smoke every hour and has a good chance of developing health problems.  I also wouldn't have a preference of hiring heavy drinkers or obese people either (or ugly/unhygenic people if they have to deal with customers). Aren't there long-term health risks associated with sitting at a desk for hours in front of a computer without ever taking breaks to stand up, walk around, refocus eyes etc?\n\nCome on man, if you can't disprove the health risks associated with your product, you can at least find out all the problems associated with everything else to make up for it. :p ",
    "url" : "http://blogs.phillymag.com/bewellphilly/2013/02/20/upenn-health-hire-smokers-starting-july-1st/"
  }, {
    "id" : 11,
    "title" : "How does the state influence science. From higher ed to research and development? ",
    "snippet" : "My gf and I have talked about ancap and its principles on and off for about a year. Now she considers herself a minarchist. She is getting her PhD in the hard sciences and wants to do post doc work on cancer research. I think it may help sway her if I could articulate how the state hinders the field and industry of science. What sources Should I check out? What are your two cents?      ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18x9wc/how_does_the_state_influence_science_from_higher/"
  }, {
    "id" : 12,
    "title" : "IRS Audit, moral support please?.",
    "snippet" : "I want to just tell them to pack sand and leave me alone, but the rape-cage threat is pretty persuasive.  \n\nWhat can I do to maintain my dignity by not just bending over and willingly taking it, while not going to jail, where I'd likely be pushed over to take it..... seems like I'm between a rock and a hard-place.  \n\nThe cognitive dissonance between not wanting to be violated by an IRS agent OR Ben Dover is giving me an ulcer.... \n\nI woke up about a year ago, so I'm still learning about the evils of State, this is driving the message home. \n\nThis would be so much easier if I'd taken the blue pill.....\n\n**Edit, UPDATE:**  Meeting this morning went fairly well, he looked at the stuff I brought with, and asked for a bunch more.  He said \"This is the only thing holding up your refund, let's get this done quickly so you can get your money back.\"\n\n&gt; so you can get *your money* back\n\nthis guy may not be too bad to deal with, definitely could be worse.....  Avoid prison.\n\nLet the fuckers take your money but make the decision not to let the fuckers bring you down. I'm not in your position and I imagine I'd experience many moments of rage but I'd do my damn best to shrug it off and not let it dominate my life.\n\nPlus, we will hold a discussion on the best and most daring troll you can perform on the agents that have intruded into your life. Avoid prison.\n\nLet the fuckers take your money but make the decision not to let the fuckers bring you down. I'm not in your position and I imagine I'd experience many moments of rage but I'd do my damn best to shrug it off and not let it dominate my life.\n\nPlus, we will hold a discussion on the best and most daring troll you can perform on the agents that have intruded into your life. &gt; Avoid prison.\n\nYes, that is my goal.\n\n&gt; shrug it off and not let it dominate my life.\n\nI'd actually forgotten about it (suppressed it?) till my phone reminded me of the meeting tomorrow.  I'm gathering (avoiding) paperwork right now....\n\nI'm not going to help them at all.  Just going to give them a shoe-box full of receipts and say \"find it yourself\" when they ask specifics. A tip I learned from my father--don't set any of your documents on the table. They somehow are deemed submitted to the court at that point. If you keep them in your lap, the court has no claim to their presense at that trial (until you put them forward upon request, that is). A tip I learned from my father--don't set any of your documents on the table. They somehow are deemed submitted to the court at that point. If you keep them in your lap, the court has no claim to their presense at that trial (until you put them forward upon request, that is). I kind of just want to hand him the stack and say \"find it yourself\". They have to have a justification to request specific pieces of information from you throughout the process. If you just hand them everything, you're giving them a free pass on you. \n\nThey'd probably just have some intern sort it out anyway.  Hire a good attorney / CPA to represent you. \n\nHonestly, the money you will spend on them will be worth it for your sanity alone. If only for the protection of your psyche so you don't actually have to speak to those miscreants.\n\n I already have a good attorney working on it.  He started when they started levying my accts, he go them to actually look at the ammended return, which they conveniently hadn't received 3 times.... I already have a good attorney working on it.  He started when they started levying my accts, he go them to actually look at the ammended return, which they conveniently hadn't received 3 times.... [deleted]  If it helps any, you probably won't go to jail.  There were something like 400 people put in jail last year, as in 1 out of a million.   The IRS doesn't use jail to punish non compliance, but to string people up as an example.  If you are famous, and your jailing will scare a lot of people into compliance, then there is a chance they will push it, if you did some big serious thing that defrauded the mafia or encouraged lots of people to not comply, oops, I mean government, then they may go after you too, but otherwise it is unlikely.  You will probably just get the computer automated leans and asset seizures from the bank otherwise.\n\nIn fact, 2 million people don't even file every year.  The truth is that the IRS simply can't keep up.  However, if they find evaded taxes, they do get paid off commission though, so you must worry about that.  Agents can be very eager to \"get theirs\", usually they go after the richer people though.  \n\nTo understand the IRS you have to understand that they are dealing with a country of 310 million people.  They simply can't enforce compliance directly, so the only other way they can enforce is through brow-beating and fear mongering, and through automated processes like computers sifting through millions of returns and spitting out red flags.  \n\nSo your may want to try putting on an act to appease them, act terrified, scared of their awesome power ... and that you're going to let all your friends know not to mess with the IRS.   Most understand they are criminals who are stealing your hard earned income, and that they are beating hard working people into the dirt, but like any human they still like to feel good about themselves and believe that they are nice reasonable guys just doing their job.   So you may want to play to that to limit their extortion.  I'm sure you have some story about how you have struggled.  Many are just jaded bureaucrats, they don't give a shit about anything, and are just going through the motions.  If you sense this kind of person, sometimes entertainment strategies work.  Just be a funny character that gives them a laugh, and a fun break in a long days work.  It may minimize your costs.  \n\nLike any criminal who puts you in a threatening situation, you probably don't want to provoke them unless you can get them to screw up and seize the initiative to overpower them.  Not likely with the IRS, they are all trained to deal with people, and have the full backing of the state mafia.  If you are in extreme desperate situation, sometimes inferred death threats or making them think you are a kook about to lose it and go on a shooting spree may work.   Dealing with this kind of crap directly has to many unknowns and costs for them, and there is a good chance they will back off, but then again there is a good chance they won't, and you will end up in deep shit.  I do not recommend such strategies unless your kid is dying of cancer, and they are taking the last penny that you have to pay for it, and even if you do them you must take extreme care to scare the shit out of them without actually illegally threatening them.  An extremely fine art ... not for armatures.  Even then, you would probably have better luck taking your case to the media.\n\nSpeaking of which, you don't want to come off as highly unimportant, somebody they can pick on with out potential consequences, without people rallying for them.   However, you don't want to make yourself so important that they think that nailing you will set an example, and scare everybody into line.   Projecting the right message is an art.  Try to get a feel for the bureaucrat, and adjust accordingly.  \n\nIf you think they are being jerks or unfair, don't provoke it.  The IRS has this huge bureaucracy for appeals, so you will have plenty of chances.  But the last thing you need is somebody rubbed the wrong way who has made nailing you their personal crusade.   \n\nGood luck. &gt; If it helps any, you probably won't go to jail. There were something like 400 people put in jail last year, as in 1 out of a million. The IRS doesn't use jail to punish non compliance, but to string people up as an example. If you are famous..\n\nThat does help, thank you.  Not famous or important to anyone other than my friends/family.  \n\nThey've already seized what they could, I setup a pmt plan to stop them from seizing my paychecks so I could survive.  It's ironic that they're pushing me underground where I would (will?) pay zero taxes.  They are forcing me to cut expenses to the bone, once this is cleared up I won't need nearly as much income and I can put myself in a lower tax bracket (I'm a contractor, I work when I want/how much I want).  I rent, so no house to sieze, and no bank accts left.  brow beaten indeed...\n\nI've already met with the agent once, he seemed like a nice guy, very polite, and he's known my attorney for years.  He asked how I found my att, who happens to be a tax specialist. I told him I found him when the IRS started to Levy my accts for the taxes they thought I owed but didn't, he seemed genuinely surprised I was being levied and hopefully even a bit sympathetic to my case.  But he's *still* an agent of Sauron. &gt;I've already met with the agent once, he seemed like a nice guy, very polite\n\nI used to volunteer at a church, and I met a lot of church members who would also volunteer with me.  Once one of the women I was working with started bragging about how she was an IRS agent who nabbed people who were avoiding paying taxes.  I stopped responding to her at that point.  The other church members asked me why I wasn't replying to her and I explained, and they were 100% sympathetic with my position.\n\nIt's important to not attack them, just don't treat them with respect.  They should be aware that they are human scum.  I highly recommend looking into [Marc Stevens.](http://marcstevens.net/) There is a good chance they will still steamroll you, but if you really want to fight them, this is the only thing I've ever heard that has any chance.\n\nAs for moral support, I've resolved to stop pay taxes starting in 2013. I paid last years and no more. I figure that by the time they get around to auditing me the US will have collapsed or I'll just leave the US. I have nothing tieing me here, except the belief that there is more support here for my way of thinking than elsewhere. thanks. \n\n&gt; by the time they get around to auditing me the US will have collapsed \n\nthat's a big if... if we could only be so lucky.  If I was single, I'd be in South America already... but that's how they get you, hold your family over your head. I'm in the same boat, trust me. My family will go where I decide, but like you I hate to subject them to what I would be willing to accept.\n\nMy mindset is still that of a US nationalist in many ways (long schooling indoctrination). I fear leaving the US and losing the ability to ever return. I fear that if I go to another country, I'll be dirt poor and then miss out on the luxuries of the US.\n\nSo I understand your dilemma. I'm waiting for the the right group to start an ancap society elsewhere. I've seen some communities in Chile that look interesting, but it seems you have to be rich to go there. It's all such a gamble, I agree. Thats why if I get pushed too far, then I won't hesitate. \n\nthe nice thing about Marc Stevens is that it gives us a small 9tiny) chance to live in the US while avoiding income taxes. A lot of it is based on the fact that the government is over-burdened as it is already. I'm in the same boat, trust me. My family will go where I decide, but like you I hate to subject them to what I would be willing to accept.\n\nMy mindset is still that of a US nationalist in many ways (long schooling indoctrination). I fear leaving the US and losing the ability to ever return. I fear that if I go to another country, I'll be dirt poor and then miss out on the luxuries of the US.\n\nSo I understand your dilemma. I'm waiting for the the right group to start an ancap society elsewhere. I've seen some communities in Chile that look interesting, but it seems you have to be rich to go there. It's all such a gamble, I agree. Thats why if I get pushed too far, then I won't hesitate. \n\nthe nice thing about Marc Stevens is that it gives us a small 9tiny) chance to live in the US while avoiding income taxes. A lot of it is based on the fact that the government is over-burdened as it is already.   \"Yes sir/No sir\"\n\nThen take your winnings and participate in agorist activities.  yeah, if I can get my money back, I\"ll be buying a bitcoin or two with it ;) Good man. Feel for you, friend. I hate how people turn their backs on each other when facing abuse of authority, out of fear and self-loathing. \n\nI'm a business owner and this could have happened to me just as easily as you.\n\nIf there's anything I can help with, please feel free to PM me.\n  I'll just set this right here:\n\n*  /r/Bitcoin \n\n_______________\n\nIn before trolls: I realize btc isn't totally anonymous and that most people can't pay all (or even most) of their bills with it.  That said, it's probably anonymous enough to stymie a typical audit.  The IRS doesn't have the resources to launch a full cyber investigation on every joe-blow American who comes up a few k short.  And the couple bucks you hide away in btc could make the difference between a slap on the wrist and criminal liability.     Better to be robed then caged and tourtered.   What happened, you didn't pay your taxes?\n\nI have always paid by taxes or at least they take my money from my paycheck.  And then I pay a small fee at the end of the year.  I never hear back, am I doing it right?  There is no acknowledgement or website I check.\n\nSomebody had already filed in my name and the IRS didn't do anything about it.\n\nAre taxes are the one thing we can all relate to in terms of direct government control over the us.  And they seem to have a crappy implementation of collecting money.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18vxno/irs_audit_moral_support_please/"
  }, {
    "id" : 13,
    "title" : "The State Deems Me a Criminal For Totaling My Car | FreeYal",
    "snippet" : " ",
    "url" : "http://freeyael.com/post/43578657903/the-state-deems-me-a-criminal-for-totaling-my-car"
  }, {
    "id" : 14,
    "title" : "AVTM- Manipulating footage to make cops look evil",
    "snippet" : "   I mean, sure, I have issue with the stat and with public officials. But at least from what I saw of the video the guy cop didn't do anything wrong. Oh yeah I agree with you 100% on that. I think Adam was trying to contrast reactions of police in the Washington area. One he got arrested for dancing... hes got beef with the state.  as do I\n\nthis video showed the best case scenario and he was just being pushy. not my cup of tea\n Really? Because what I saw was agent of the state refusing to address the grievances of an \"American Citizen\" for whatever that's worth. Again, that man was not the proper channel to go through.",
    "url" : "http://www.youtube.com/watch?v=--y9Mhjf0g0"
  }, {
    "id" : 15,
    "title" : "Opinions on Max Weber's works?",
    "snippet" : "So, I'm aware that our definition of \"The State\" is based upon Max Weber's definition of the State from his work \"Politics as a Vocation\". I'm curious though, if anyone here has read other works by Weber and if they would recommend them for me to read further; also, what should I, as a libertarian, expect from Weber's works?  The decisive reason for the advance of the bureaucratic organisation has always been its purely technical superiority over any other form of organisation.\n\nMax Weber, from his book \"Economy and Society\"\n\nLooks like he mentions democratic reform a lot as an ideal, what are you hoping to get from reading his works?  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18xhy6/opinions_on_max_webers_works/"
  }, {
    "id" : 16,
    "title" : "How do you think addresses would work in an AnCap world?",
    "snippet" : "This thought just crossed my mind. Suppose I'm shipping a package to a friend. Currently, they live at 123 State St., Statesville, [State] [Zip Code]. But if we didn't have states, or even formal \"cities,\" what do you think package/mail services would do to compensate for this? I'm interested in hearing some ideas.\n\nAlso, as a bonus, tell me what your answer would have been 50 years ago, if it would have different (due to tech).  Who knows what a private mail service might come up with sans A city, state, zip. People are clever. \n\nAnd also, if city states zip are a really good method.  We could still use it in ancapistan. Just because the state is gone, doesn't mean we can't still call regions of land by their commonly heald names.   Gps coordinates? Longitude altitude?\n\n50 years ago, follow this road, turn left after the huge dark tree, and the 3rd church to the right.  &gt;Gps coordinates? Longitude altitude?\n\nYeah, that's what I was thinking too. **But how precise do they get? It might be a hassle, and very confusing, to have to remember the exact coordinates of your house on the fly.**\n\n&gt;50 years ago, follow this road, turn left after the huge dark tree, and the 3rd church to the right.\n\nNow how in the world would that work if I'm sending a package 500 miles?\n\nEDIT: Bold parts were added. A GPS receiver using one decimal degree for its seconds -- N39 12' 34.5\" W84 54' 32.1\", for example -- has a precision of 3.1m north-south and 2.4m east-west.\n\nSo a total of 14 digits replaces everything else down to a few meters. Good enough for me. Nice! Didn't realize they could be so precise with so few digits. GPS's can actually be extremely precise even at low cost, but.. surprise surprise:\n\nThe state doesn't think it's safe to let the general population have such a powerful positioning system, so privately-held GPS's are systematically made less accurate. &gt;Gps coordinates? Longitude altitude?\n\nYeah, that's what I was thinking too. **But how precise do they get? It might be a hassle, and very confusing, to have to remember the exact coordinates of your house on the fly.**\n\n&gt;50 years ago, follow this road, turn left after the huge dark tree, and the 3rd church to the right.\n\nNow how in the world would that work if I'm sending a package 500 miles?\n\nEDIT: Bold parts were added. &gt;Gps coordinates? Longitude altitude?\n\nYeah, that's what I was thinking too. **But how precise do they get? It might be a hassle, and very confusing, to have to remember the exact coordinates of your house on the fly.**\n\n&gt;50 years ago, follow this road, turn left after the huge dark tree, and the 3rd church to the right.\n\nNow how in the world would that work if I'm sending a package 500 miles?\n\nEDIT: Bold parts were added.  I am against the monopoly that is the government, not arbitrary names of geographical locations. I see no reason why shipping addresses would change, at least to any considerable degree. Yes, I suppose people today might just stick to old customs. But what about in a word that never had government to begin with? People named things before government.       Costa Rica doesn't have street addresses. They navigate by landmarks. It works for them. Look into it. What I find amazing is that they do have addresses, they just don't use them. And apparently some of the landmarks they use for reference don't even exist any more, but people continue to refer to the places where they used to be by their names.   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18wy42/how_do_you_think_addresses_would_work_in_an_ancap/"
  }, {
    "id" : 17,
    "title" : "How have LRC and the Mises Institute Helped you?",
    "snippet" : "I'm writing a short article about how lewrockwell.com and the Mises institute have had an effect on libertarian anarchists. I would really like to include several short stories and/or quotes about how LRC, LvMI, or individual contributors have helped your intellectual development, and/or your life in general.\n\nFeel free to comment here, or e-mail me at tHCondition@gmail.com\n\nThanks in advance!  I had a my \"aha!\" moment in 2008 during the presidential elections. I talked to my father about contenders that election cycle, and mentioned I was for Rudy Giuliani. He frowned at this and handed me a \"Texas Straight Talk\" by Ron Paul. I was so surprised that one man expressed all these things I knew to be true, yet didn't have the means to express them myself. Very quickly, I was drawn into reading LRC and Mises.org every day. \n\nIn fact I was so inspired by what these men stood for, that I changed my major to Economics and started writing for my school newspaper. In just 4.5 years, I've changed from being an ill-informed neocon supporting a puppet like Giuliani to a full-fledged anarcho-capitalist and am now capable of defending the foundations of a free society absent of government intrusion very well.\n\nLRC and the Mises institute have provided me an intellectual debt so great I can't really describe it. It has literally changed my life for the better. I had a my \"aha!\" moment in 2008 during the presidential elections. I talked to my father about contenders that election cycle, and mentioned I was for Rudy Giuliani. He frowned at this and handed me a \"Texas Straight Talk\" by Ron Paul. I was so surprised that one man expressed all these things I knew to be true, yet didn't have the means to express them myself. Very quickly, I was drawn into reading LRC and Mises.org every day. \n\nIn fact I was so inspired by what these men stood for, that I changed my major to Economics and started writing for my school newspaper. In just 4.5 years, I've changed from being an ill-informed neocon supporting a puppet like Giuliani to a full-fledged anarcho-capitalist and am now capable of defending the foundations of a free society absent of government intrusion very well.\n\nLRC and the Mises institute have provided me an intellectual debt so great I can't really describe it. It has literally changed my life for the better. Any name you'd prefer the quote to be under, or does \"ThundaStome\" work? lol Hahah ThundaStome will do just fine. Happy to help. Thank you for the help man. I think it's turning out really nice. I just want to add a few more \"testimonials\" like that. I want to do something to remind those old fogeys in Auburn Alabama how much they really freakin mean to all of us ;-) Sure thing. Where will this article appear? You sending it straight to Lew?  it'll be more like an open letter, and itll be on my blog at thehumanecondition.com You have probably seen a few recent posts on this sub that originate from their. check it out!\n\nI'll definitely send it to lew, but i'll go ahead and publish it at the same time I guess. Ok cool. Yeah I'd definitely send it straight to him. I've emailed him probably 5 or 6 times and he responds almost every time, along with other columnists on LRC. Especially Butler Shaffer, that dude always gets back to me. Anyways good luck, I'll check out that site. Ok cool. Yeah I'd definitely send it straight to him. I've emailed him probably 5 or 6 times and he responds almost every time, along with other columnists on LRC. Especially Butler Shaffer, that dude always gets back to me. Anyways good luck, I'll check out that site.  I came onto the scene of LRC a bit reluctant. I suppose you could have called me a libertarian but I was hesitant about the site itself due to the \"anti-war\" slogan at the top. I was always taught war was a necessary evil and anyone who disagreed with the military or its actions were simply unpatriotic. LRC with its countless articles helped me understand my logical inconsistencies and showed me a superior way of thinking. I was thoroughly attracted to the logic based theories and thoughts. I have always thought my being a Christian would hinder my ability to fully accept anarchism (primarily because of the extremely negative connotations associated with it). After a time of reading books the authors on the site recommended and doing a lot of trying to prove anarchism to be a flawed ideology, I realized freedom was the ultimate answer and I have since come to embrace the fact that I hate the state as well as being an anarcho-capitalist. Now I have been blessed with the opportunity to write for a couple of local newspapers discussing my beliefs and I get quite a kick out of it.  I came onto the scene of LRC a bit reluctant. I suppose you could have called me a libertarian but I was hesitant about the site itself due to the \"anti-war\" slogan at the top. I was always taught war was a necessary evil and anyone who disagreed with the military or its actions were simply unpatriotic. LRC with its countless articles helped me understand my logical inconsistencies and showed me a superior way of thinking. I was thoroughly attracted to the logic based theories and thoughts. I have always thought my being a Christian would hinder my ability to fully accept anarchism (primarily because of the extremely negative connotations associated with it). After a time of reading books the authors on the site recommended and doing a lot of trying to prove anarchism to be a flawed ideology, I realized freedom was the ultimate answer and I have since come to embrace the fact that I hate the state as well as being an anarcho-capitalist. Now I have been blessed with the opportunity to write for a couple of local newspapers discussing my beliefs and I get quite a kick out of it.  Would you prefer to be quoted as AnCapJake or something else? AnCapJake will work. Good luck with the article. I look forward to reading it. thank you. I said this further down the page,\n\nThank you for the help man. I think it's turning out really nice. I just want to add a few more \"testimonials\" like that. I want to do something to remind those old fogeys in Auburn Alabama how much they really freakin mean to all of us ;-)\n\nbut it's still true! (15 seconds later) I reread my initial comment, and I seem to have worded it in a way that is not consistent with what I was trying to say. In the part I said that I embrace the fact that I hate the state as well as being an ancap, it is supposed to mean that I embrace being an ancap, not that I hate being an ancap. Just a bit of clarification haha.    I think it has hindered more than helped (seen/unseen).\n\nMises was a semi socialist, Lew and Ron the founders religionists, many more members of it did not even follow their own words on nap on their own family's, and the majority will never give up their socialist tenure. Most of the students that they prepare can only go to statist institutions to find jobs, and do not correspond to free market principals (supply/demand).\n\n\nMises tries too hard to be intellectual in the age of moral fights. Especially when they mingle in politics and statism. \n\nThat is my personal observation from across the pond. \n\n\nI guess it has helped me to learn that there is no point in learning/teaching about freedom, if I am a hypocrite. \n\n\n\n\n  I didn't want to be ancap, but my friends at Mises kept making ancap arguments in their discussion groups.  It really frustrated me that in my mind that I couldn't prove them wrong, because I really wanted to believe in the constitution and limited government and the founding fathers.  Meanwhile, people on other blogs would make arguments like \"why should the government do the police, and not welfare\" ... and they were easy enough to answer as a libertarian, but because of the influence I started to more and more answer them like an anarcho capitalist.  Doing so was so intellectually liberating.  Before then I kept swinging between libertarian and libertarian-republican as my mind tried to reconcile the role of government and freedom, but after that I became solidly part of the ancap camp.  I always associated anarchists with terrorists, and even now I prefer be called anarcho capitalist or extreme libertarian.  It took me awhile to understand that anarchy can mean without rulers, but not without law ... even though to others it still means without law.  Also to understand that law is more than edicts written on parchment by fat ass bureaucrats.\n\nAnother great thing that LvMI, and specifically Kinsella, did was mainstream the anti-IP movement.   I had known for awhile that IP was fake, and anti-free market, and that was a very lonely belief to have in the mid-90's.  I was called a communist!  Not any more, they have freed me of that yoke.  In addition, LvMI practiced what the preach, and the intellectual contribution they made by making copies of all their literature free is eternal if you ask me.   IMHO, nothing has done more to push the freedom movement over the top in the information age, and even more importantly turn it into a movement that is based off of education/services, and not book royalties.  \n\nEverywhere you turn, there are links to LRC or LvMI.  You can nail down opponents of liberty on almost any issue.  It has radically altered the landscape of online debate in all political topics.  When I was young there was ABC, NBC, and CBS, and that was it, and they spewed out socialism all day long.  Anybody who questioned the statist dogma was considered alone and crazy.   Well, not any more.  Libertarians and ancaps are flourishing and growing at an extremely rapid pace.  LvMI is the tip of the spear.\n\nAlso, LvMI helps people in the real world. IMHO, it should be mandatory schooling for professional investors.  They helped me figure out to start buying gold like crazy at $450/oz and silver at $7/oz.  I did extremely well while my friends got killed with housing.  We're not talking bullshit theories here, were talking real world results, and real money.  Who know how many other people have had their ass saved by LvMI. Wow thanks so much for the thoughtful reply. THis will most definitely be featured in the article. I agree with just about everything you said. Those guys are great. How would you like to be quoted, \"Redditor argoff\" work or would you rather something else? Sure, that's fine. I didn't want to be ancap, but my friends at Mises kept making ancap arguments in their discussion groups.  It really frustrated me that in my mind that I couldn't prove them wrong, because I really wanted to believe in the constitution and limited government and the founding fathers.  Meanwhile, people on other blogs would make arguments like \"why should the government do the police, and not welfare\" ... and they were easy enough to answer as a libertarian, but because of the influence I started to more and more answer them like an anarcho capitalist.  Doing so was so intellectually liberating.  Before then I kept swinging between libertarian and libertarian-republican as my mind tried to reconcile the role of government and freedom, but after that I became solidly part of the ancap camp.  I always associated anarchists with terrorists, and even now I prefer be called anarcho capitalist or extreme libertarian.  It took me awhile to understand that anarchy can mean without rulers, but not without law ... even though to others it still means without law.  Also to understand that law is more than edicts written on parchment by fat ass bureaucrats.\n\nAnother great thing that LvMI, and specifically Kinsella, did was mainstream the anti-IP movement.   I had known for awhile that IP was fake, and anti-free market, and that was a very lonely belief to have in the mid-90's.  I was called a communist!  Not any more, they have freed me of that yoke.  In addition, LvMI practiced what the preach, and the intellectual contribution they made by making copies of all their literature free is eternal if you ask me.   IMHO, nothing has done more to push the freedom movement over the top in the information age, and even more importantly turn it into a movement that is based off of education/services, and not book royalties.  \n\nEverywhere you turn, there are links to LRC or LvMI.  You can nail down opponents of liberty on almost any issue.  It has radically altered the landscape of online debate in all political topics.  When I was young there was ABC, NBC, and CBS, and that was it, and they spewed out socialism all day long.  Anybody who questioned the statist dogma was considered alone and crazy.   Well, not any more.  Libertarians and ancaps are flourishing and growing at an extremely rapid pace.  LvMI is the tip of the spear.\n\nAlso, LvMI helps people in the real world. IMHO, it should be mandatory schooling for professional investors.  They helped me figure out to start buying gold like crazy at $450/oz and silver at $7/oz.  I did extremely well while my friends got killed with housing.  We're not talking bullshit theories here, were talking real world results, and real money.  Who know how many other people have had their ass saved by LvMI. I made slight adjustments for grammar/wording. Does this represent what you said accurately?\n\nI didn't want to be An-Cap, but my friends at Mises.org kept making An-Cap arguments in their discussion groups. It really frustrated me that in my mind that I could not prove them wrong, because I really wanted to believe in the constitution, limited government and the founding fathers. Meanwhile, people on other blogs would make arguments like \"why should the government do the police, and not welfare\" ... and they were easy enough to answer as a libertarian, but because of the influence, I started to answer them more like an anarcho capitalist. Doing so was so intellectually liberating. Before then I kept swinging between libertarian and libertarian-republican as my mind tried to reconcile the role of government and freedom, but after that, I became solidly a part of the An-Cap camp. I always associated anarchists with terrorists, and even now I prefer be called anarcho capitalist or extreme libertarian. It took me awhile to understand that anarchy could mean without rulers, but not without law ... even though to others it still means without law. Also, to understand that law is more than edicts written on parchment by fat ass bureaucrats.\n\n\nAnother great thing that the LvMI and specifically Stephen Kinsella did was mainstream the anti-IP movement. I had known for a while that IP was fake, and anti-free market, and that was a very lonely belief to have in the mid-90's. I was called a communist! Not any more, they have freed me of that yoke. In addition, the LvMI practices what they preach, and the intellectual contribution they made by making copies of all their literature available for free is eternal if you ask me. IMHO, nothing has done more to push the freedom movement over the top in the information age, and even more importantly turn it into a movement that is based on education/services, and not book royalties.\n\n\nEverywhere you turn, there are links to LRC or LvMI. You can nail down opponents of liberty on almost any issue. It has radically altered the landscape of online debate in all political topics. When I was young there was ABC, NBC, and CBS, that was it, and they spewed out socialism all day long. Anybody who questioned the statist dogma was considered alone and crazy. Well, not any more. Libertarians and An-Caps are flourishing and growing at an extremely rapid pace. LvMI is the tip of the spear.\n\n\nAlso, LvMI helps people in the real world. IMHO, it should be mandatory schooling for professional investors. They helped me figure out to start buying gold like crazy at $450/oz and silver at $7/oz. I did extremely well while my friends got killed with housing. We're not talking bullshit theories here, were talking real world results, and real money. Who know how many other people have had their ass saved by LvMI.\n\n- Redditor argoff\n yeah, sounds good\n\nAlso,  \"know\" in the last sentence should be \"knows\"  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18wfv5/how_have_lrc_and_the_mises_institute_helped_you/"
  }, {
    "id" : 18,
    "title" : "Why Walter Block and Stephan Kinsella Sound Like Central Planners When They Talk About Debtor's Prison",
    "snippet" : " ",
    "url" : "http://www.economicpolicyjournal.com/2013/02/why-walter-block-and-stephan-kinsella.html"
  }, {
    "id" : 19,
    "title" : "Off-beat: Great song, with the lyrics from a great movie.",
    "snippet" : "  movie? In the comments he says the samples are from the Charlie Chaplin movie *A King in New York* [link](http://www.youtube.com/watch?v=jw_GqL3pW84)\n\nEdit: I've been running into alot of Chaplin clips lately. Just saw [this](http://www.youtube.com/watch?v=6FMNFvKEy4c) clip the other day from *The Great Dictator*",
    "url" : "https://www.youtube.com/watch?v=Ll99FcuwlxU"
  }, {
    "id" : 20,
    "title" : "What Voluntaryists Believe And Why",
    "snippet" : "   The concept \"believe\" always seems odd to me; most of the time it seems to imply some kind of faith, dogma, or spiritualism.  I might conclude collectivism is destructive, but it seems odd to \"believe\" that.  I might conclude/observe/understand \"2+2=4\" but it seems odd to have some kind of belief in that as well. I actually think \"believe\" is appropriate when articulating prescriptive statements. I don't think there's an objective, logical means of justifying such statements, so presenting them as \"take it or leave it\" seems most genuine. One can accomplish that with an \"opinion\" or \"informed opinion.\"  is opinion not a belief? Yes &amp; no.  This one of those instances where language obscures concepts.\n\n**Beliefs**\n\nThe word belief covers a category of concepts, and may be used in a semantically correct way to refer to faith (i.e. religious faith), conclusions, preferences, ideology, dogma, or \"world view.\"  Beliefs also tend to imply something is factual, or known with certainty.\n\n**Opinion**\n\nOpinion more narrowly refers to either preferences, or conclusions based on available information.  Opinions tend to carry a recognition of agnosticism; recognizing a possibility of \"being wrong\" due to incomplete information, chance, or some other factor.\n\n---\n\nLinguistically, yes, beliefs and options overlap.  However conceptually and with practical application, they are quite different.  Of course the label voluntar-**ism** may actually be a belief system.\n\nThen it might also be worth noting that a person like myself is not a voluntarist *(NBD, it's just a label)*, but instead prefers and values voluntary interactions.\n\n",
    "url" : "http://www.everything-voluntary.com/2013/02/what-voluntaryists-believe-and-why.html"
  }, {
    "id" : 21,
    "title" : "Question about voluntarism.",
    "snippet" : "While I don't know if I consider myself AnCap or not, I have recently been questioning some of the principles voluntarism.  The biggest place I see a difference between what volunteerists believe what would happen and what I think would actually happen if state services (mostly referring to all the different types of welfare that exist) were to be abolished.  The AnCap believes that people who support welfare, who vote for welfare legislation, and promote the idea of spreading wealth, do not need to be forced to do so, i.e. you don't need to tax people for things they believe are good.  However, I think this contrasts human nature.  People who believe that it is right to give to the poor (or, for this context, people who think it's wrong *not* to give to the poor) are very inclined to check a box on a ballot that says \"yes we should do this.\"  However, it is undeniably true that it is infinitely easier to vote for something than to take initiative and actually do it.  My uncle is a perfect example.  He's a left-wing statist from NY.  He believes it should be illegal to drive a car that gets less than 50 mpg or so.  However, he drives a Volkswagon that gets about 23.  He is the kind of person that, through observation, I think makes up the majority of our society in that he is very willing to promote laws, but not willing to do what those laws say unless he is forced to do so.  This may not be very well written but I think you get the gist of my question.\n\nTL;DR I don't think enough people are intrinsically good enough to do things unless their forced    The above (IMO) is a matter of *\"put your money where your mouth is.\"*  If no one genuinely cares enough about *\"the poor\"* to actually help them with their own money, then behind all the moralizing speech of *\"what about the poor/children/etc\"* is nothing but bullshit, hypocrisy, and ulterior motives. To play devil's advocate, I think most people of that stripe would say that there aren't enough people who, if they all did chip in voluntarily, would accumulate enough money to take care of the poor. People are greedy! We therefore need the forced participation of unwilling members (especially rich people) so that the endeavor will be worth it. The above (IMO) is a matter of *\"put your money where your mouth is.\"*  If no one genuinely cares enough about *\"the poor\"* to actually help them with their own money, then behind all the moralizing speech of *\"what about the poor/children/etc\"* is nothing but bullshit, hypocrisy, and ulterior motives. One could make the argument that that's why we *need* these programs.      ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18wk6r/question_about_voluntarism/"
  }, {
    "id" : 22,
    "title" : "Truth: The Freedomain Radio Documentary - Teaser",
    "snippet" : "   Donated :) Two bucks? Donated :) Donated :) :( Lengthy explanation of \"frowny face.\"   Unfortunately this documentary (or teaser) is very America-centric and fearmongering. I am not from America and most of the statistics wouldn't fit for my country. If the authors intention is to make an universal statement about the wrongness of government he has to concentrate on more than just one example. I am from the Netherlands and poverty has decreased over the last decades, the schools got better, the number of drug addicts has sunken, we are closing prisons because we don't have the criminals to fill them with. I am still an voluntarist because I believe that we all would be much better off, but I do realize that even governments can do things right. Nitpicking only bad examples might be good to convince the already convinced, but as a statist I'd as easily pick out examples of market failures and government successes. And as a statist not from America I'd only be encouraged of my prejudices about Americans as being fat, stupid and violent. If you really want to convince people, you have to show them the good things that came from government, and then show them how we could make them better. Focusing on the U.S. empire makes sense at this point in time.  It's the most destructive force around us regardless where on the planet you happen to live. Using specific examples tends to help the average person understand what is trying to be explained even if it's lost on a minority given that it's U.S.-centric.\n\nBy the way, my wife and I lived in the Netherlands for ~2.5 yrs (2004-07) and really enjoyed it except for the REALLY crappy weather and REALLY dense living conditions.  The Dutch have a solid culture and get much love from my family.  Unfortunately this documentary (or teaser) is very America-centric and fearmongering. I am not from America and most of the statistics wouldn't fit for my country. If the authors intention is to make an universal statement about the wrongness of government he has to concentrate on more than just one example. I am from the Netherlands and poverty has decreased over the last decades, the schools got better, the number of drug addicts has sunken, we are closing prisons because we don't have the criminals to fill them with. I am still an voluntarist because I believe that we all would be much better off, but I do realize that even governments can do things right. Nitpicking only bad examples might be good to convince the already convinced, but as a statist I'd as easily pick out examples of market failures and government successes. And as a statist not from America I'd only be encouraged of my prejudices about Americans as being fat, stupid and violent. If you really want to convince people, you have to show them the good things that came from government, and then show them how we could make them better. \"governments can do things right...\" do you give taxes willingly or against your will? Uhm, hey mate. I don't like paying taxes and I'd prefer them to be voluntarily, but I don't think that makes for a convincing argument for the average statist for whom taxes are a \"necessary evil\". I was trying to make the point that if you only demonize the government without recognizing the good things it can do for people, you are at risk of turning it into a caricature that doesn't respond to the reality of the people you are trying to convince and they wont listen to you.\n\nFor example: we had a paper mill (or something like that) in our town who was polluting the river for decades. At the beginning of the millennia a good friend of mine was running for labour to become major on the promise to clean up the river (he's a really passionate environmentalist). He got elected and he managed to do what generations of politicians had failed to do: he cleaned up the river. People are loving him here and he's now in his third turn. \n\nMy point is? If I'd try to talk to them and telling them how taxes are theft and the government is evil, they'd give me a funny look or two and not for a second take me seriously. But If I recognize the merits of my friend the major, the good he has done for the community etc. pp. and then continue to explain them how we could have prevented the situation in the first place with stronger property rights, then maybe (and that's still a big maybe here in good ol' socialist europe) I get a handful of them to think.  how many wars were not funded with taxes? What's the point you're trying to convey?  It's pretty hard to get people to voluntarily pay for wasteful rampant destruction. Yeah, but what has this to do with anything I said? \n\n(besides the point there were several wars of private individuals / companies in history)  Not sure, I think he's just pointing out that something bad can come of taxes just as much as something \"good\" can. So it's best to assess the best method for achieving the good goals. Like, would the river pollution problem have been fixed faster with property rights, or through government force. Taxes themselves are (besides actually being theft in my view) are neutral to solving other problems. Do they solve efficiently, or do they create more. The funny look you said they give you is because they view taxes as inherently good (for fixing other things). Rather than viewing them as a neutral and observing their effects. If that makes any sense. &gt;Not sure, I think he's just pointing out that something bad can come of taxes just as much as something \"good\" can. So it's best to assess the best method for achieving the good goals. Like, would the river pollution problem have been fixed faster with property rights, or through government force. Taxes themselves are (besides actually being theft in my view) are neutral to solving other problems. Do they solve efficiently, or do they create more. The funny look you said they give you is because they view taxes as inherently good (for fixing other things). Rather than viewing them as a neutral and observing their effects. If that makes any sense.\n\nThat's pretty much what I was trying to say. People don't view taxes as good or bad in my opinion, they view them as necessary. The take the bad that comes with the good because they think there is no alternative. As someone trying to convince them of the contrary, you have to show them alternatives, not throw some moralizing platitudes at them.  What's the point you're trying to convey?  Uhm, hey mate. I don't like paying taxes and I'd prefer them to be voluntarily, but I don't think that makes for a convincing argument for the average statist for whom taxes are a \"necessary evil\". I was trying to make the point that if you only demonize the government without recognizing the good things it can do for people, you are at risk of turning it into a caricature that doesn't respond to the reality of the people you are trying to convince and they wont listen to you.\n\nFor example: we had a paper mill (or something like that) in our town who was polluting the river for decades. At the beginning of the millennia a good friend of mine was running for labour to become major on the promise to clean up the river (he's a really passionate environmentalist). He got elected and he managed to do what generations of politicians had failed to do: he cleaned up the river. People are loving him here and he's now in his third turn. \n\nMy point is? If I'd try to talk to them and telling them how taxes are theft and the government is evil, they'd give me a funny look or two and not for a second take me seriously. But If I recognize the merits of my friend the major, the good he has done for the community etc. pp. and then continue to explain them how we could have prevented the situation in the first place with stronger property rights, then maybe (and that's still a big maybe here in good ol' socialist europe) I get a handful of them to think.    This seems very Zeitgeisty... At least there will be people to explain all parts of it, unlike the marxist robot scheme.  Hey, I can assure you that Marxbot5000 comes fully stocked with the latest in economic calculation algorithm technology! This seems very Zeitgeisty... That's a good thing; Zeitgeist was very successful. Zeitgeist was successful at duping people. Its method of hypnotizing music, selective semi-related video shots, and creepy voice over is not something to admire. \n\n[LearnLiberty](http://www.youtube.com/user/LearnLiberty/videos?flow=grid&amp;view=0&amp;sort=p) does a great job of using visuals and voiceovers without being creepy and instead to be upfront about what their message is.\n\nStefan jumps far too quickly from point to point and doesn't elaborate on them. Most people do not agree with the intermittent points that he is throwing at the viewer. Its Stefan's preferred method of communication: making many points quickly after each other and making it impossible for the other side to consider them. Zeitgeist was successful at duping people. Its method of hypnotizing music, selective semi-related video shots, and creepy voice over is not something to admire. \n\n[LearnLiberty](http://www.youtube.com/user/LearnLiberty/videos?flow=grid&amp;view=0&amp;sort=p) does a great job of using visuals and voiceovers without being creepy and instead to be upfront about what their message is.\n\nStefan jumps far too quickly from point to point and doesn't elaborate on them. Most people do not agree with the intermittent points that he is throwing at the viewer. Its Stefan's preferred method of communication: making many points quickly after each other and making it impossible for the other side to consider them. Zeitgeist was successful at duping people. Its method of hypnotizing music, selective semi-related video shots, and creepy voice over is not something to admire. \n\n[LearnLiberty](http://www.youtube.com/user/LearnLiberty/videos?flow=grid&amp;view=0&amp;sort=p) does a great job of using visuals and voiceovers without being creepy and instead to be upfront about what their message is.\n\nStefan jumps far too quickly from point to point and doesn't elaborate on them. Most people do not agree with the intermittent points that he is throwing at the viewer. Its Stefan's preferred method of communication: making many points quickly after each other and making it impossible for the other side to consider them. Zeitgeist was successful at duping people. Its method of hypnotizing music, selective semi-related video shots, and creepy voice over is not something to admire. \n\n[LearnLiberty](http://www.youtube.com/user/LearnLiberty/videos?flow=grid&amp;view=0&amp;sort=p) does a great job of using visuals and voiceovers without being creepy and instead to be upfront about what their message is.\n\nStefan jumps far too quickly from point to point and doesn't elaborate on them. Most people do not agree with the intermittent points that he is throwing at the viewer. Its Stefan's preferred method of communication: making many points quickly after each other and making it impossible for the other side to consider them. This seems very Zeitgeisty...  This might seem harsh but. I don't like it very much. The animations are not that great and the text animations annoy me. As i listen to his podcasts a lot it is realy just like him speaking realy slowly and strangely with more advanced than usual graphics. Some of the animations I thought were good and the way in which he speaks with the animations is a unique idea in some ways. But overall i thought it was ok but not sure what i expected anyway. Possibly more stock footage. But it is difficult to do a documentary with no interviews and just your voice, it turns in to just animations and a voice track and then it is easy to get carried away with animations. I didn't want to be negative nancy and bring this up, but now that you mentioned it I'll say, like the hypocritical pussy that I am, that I agree, especially about the typography animation. It's redundant.\n\nEDIT: but I guess it's kind of ok to be a bit negative now that the positive comments are on top. Nobody takes the bottom comments to seriously anyway. I might be a bit more critical on the topic of documentaries than some people in general. I have seen many documentaries as I have collected them for 10 years.  Let's not forget that this documentary is entirely funded by Stefan Molyneux himself and donations, and he will be releasing the complete documentary FOR FREE.  What has that got to do with anything? You guys are complaining about the low level animations and stock images, etc etc, which is fine, but I'm saying the documentary was built on a very low budget, just keeping it in context. Those animations are not \"low level\" they are just a specific type of animations and a certain amount that i am saying i am not fond with. I hear your point but I don't think that it is a result of a lack of funding. I have seen other documentaries built by one person that was effective. So the financial aspect is not the best excuse. In fact because he is paying someone it should be of a high standard, which from what i saw it is. I don't think the standard is the problem, i just think the way in which it is done, I am not fond of it. As i mentioned in my earlier posts. \n\nIn my opinion if you are going to do a doc with just a voice and animations with NO stock footage, then you are going to have to do animations like RSA animate or something realy amazing. \n\nBut this was just a trailer so we will have to wait and see. I was only trying to give some constructive feedback. This might seem harsh but. I don't like it very much. The animations are not that great and the text animations annoy me. As i listen to his podcasts a lot it is realy just like him speaking realy slowly and strangely with more advanced than usual graphics. Some of the animations I thought were good and the way in which he speaks with the animations is a unique idea in some ways. But overall i thought it was ok but not sure what i expected anyway. Possibly more stock footage. But it is difficult to do a documentary with no interviews and just your voice, it turns in to just animations and a voice track and then it is easy to get carried away with animations. This might seem harsh but. I don't like it very much. The animations are not that great and the text animations annoy me. As i listen to his podcasts a lot it is realy just like him speaking realy slowly and strangely with more advanced than usual graphics. Some of the animations I thought were good and the way in which he speaks with the animations is a unique idea in some ways. But overall i thought it was ok but not sure what i expected anyway. Possibly more stock footage. But it is difficult to do a documentary with no interviews and just your voice, it turns in to just animations and a voice track and then it is easy to get carried away with animations.  The internet has ruined me. Goatse @ 5:57?  He confuses countries and nations. Identifying with a nation is not the same as identifying with a country or state. What is the difference? Countries and states are basically what he describes them to be, however a nation is a group of individuals who share the same ancestry, traditions, culture, history, language, etc. I could still call myself Danish, for example, even though I was currently living in Australia. This question has been answered 2300 years ago when Diogenes said \"I am a cosmopolitan\", \"Asked where he came from, he answered: 'I am a citizen of the world (kosmopolits)'\"\n\nI think you are mixing cults and cultures. So because Diogenes did not want to identify with any specific culture that means culture is an invalid concept or a bad idea?  Yes. Free association is not based on some bigoted divides that old kings used to use to get their loot.   Sorry, what? Only bigots play with facts that are accidental at birth.  I'm sorry, I'm really trying to understand your perspective but you're not helping. Countries and states are basically what he describes them to be, however a nation is a group of individuals who share the same ancestry, traditions, culture, history, language, etc. I could still call myself Danish, for example, even though I was currently living in Australia. What is the difference? Maybe LiberTed means \"nation\" to be synonymous (or rather, related) to \"ethnicity\". So for example, there are Jews but there was not always a Jewish state. A nation in my mind is roughly, the ethnic group plus a territory plus maybe some common, cultural beliefs and preferences.  &gt; Maybe LiberTed means \"nation\" to be synonymous (or rather, related) to \"ethnicity\"\n\n\nAre we going with the \"pure ethnicity\"? \n\n\n&gt;  A nation in my mind is roughly, the ethnic group plus a territory plus maybe some common, cultural beliefs and preferences.\n\n\nSo the cult of culture? Some friendly advice: You are echoing too much Stefan. Take a moment to consider the perspective of people who are sympathetic to your perspective but don't necessarily, fully agree with you.\n\nAlso, liberally attaching the stigma of \"cult\" to anything is very nasty (something Stefan understands this very well when people call freedomainradio a cult).  &gt; Also, liberally attaching the stigma of \"cult\" to anything is very nasty\n\n\nThe cult comes from a single rulers preferences, nothing to do with their subject. As luis the xiv or another number said, \"I am the state\", the french culture was moulded of him, not of his subjects.\n\nI am sure what you call in your head \"culture\" was an invention of some tyrant to get his way too. I really think your (mis)understanding of the concept of culture is very superficial. See my advice above. &gt; See my advice above.\n\nYour emotional advice of how I should care about others feelings rather than facts?\n\nI dont want to sound rude, but I do think you dearly want to hang onto something that you had no choice over, such as ethnicity, colour, or under who's cult you born to be a tax cattle. You're not rude just completely presumptuous and a bit narrow minded. If you must know, I have rebelled against my parents, \"my\" culture, \"my\" country and \"my\" religion. I have completely rejected all of them. However, I have come to understand that just because I don't like *my* parents and *my* culture doesn't mean that parents or culture or whichever of the above are bad or useless things. \n\nAlso, I never implied that you shouldn't care about facts. Don't twist my words. I'm not your enemy.  ",
    "url" : "http://www.youtube.com/watch?v=0uK_AyKg0W0"
  }, {
    "id" : 23,
    "title" : "4 FREE ANARCHY IN NYC TICKETS!!!, Sovereign In The City, Peaceful Streets Project, Cannabis ,",
    "url" : "http://voluntaryvirtues.com/2013/02/20/4-free-anarchy-in-nyc-tickets-sovereign-in-the-city-peaceful-streets-project-cannabis/"
  }, {
    "id" : 24,
    "title" : "End the Fed: Hoard Bitcoins",
    "snippet" : "  I just got onboard w/ BTC's just under 2 weeks ago, and they're already up 50%. Yes, I'm a bit excited (but I'm also nervous) - while I do plan to hold onto them for the long haul, I'm also concerned that they're in a bubble. (although, compared to it's last deflationary fall in value, the fundamentals have changed - there's simply more people now than ever, so a huge drop is much less likely - I hope.) Its a massive bubble if I had to bet. BTC have legitimate value and use but at their current prices its kinda over blown. Don't hold anything you can't afford to loose in them. I totally agree with your cautionary advice. It's smart to stay diversified and not risk anything you can't afford to lose.\n\nIt may even be true that the price is currently a bubble in the short term. However I think on the order of 5-10 years from now the price has nowhere to go but up. Yup. It has to do with inflation, people jumping onto the bitcoin wagon, and speculations. \n\nI think 30 dollars for a bitcoin is too expensive but we'll see. That's the beauty of the markets, let the markets deal on its own. (OMFG, YOU CAN'T JUST LET DO ITS OWN THING. SO CHAOTIC!)  I think 30 dollars is way WAY too low actually. I think I might have a longer view than most bitcoin users though. It's going to be a fun year. :) I don't mind the high prices. BTC are easily divisible. My issue is with the current price and how it got where it is. To much growth to quickly causes speculative bubbles. One day it will pop and people will cry... On the other hand I am fine with a 30 USD price tag so long as it got their via long sustained growth.  It's only a speculative bubble if the growth in price is out of proportion with the growth in use. We can't really know if the growth is bubbly without some way of objectively comparing the growth in price to the growth in use. I am reasonably certain it's a speculative bubble because one person selling off a largish amount of bitcoin (100K USD or so) can have major effects on the price, even if it's a tiny amount compared to what's in circulation. That just means trading volume is low, not that it's a speculative bubble. I don't mind the high prices. BTC are easily divisible. My issue is with the current price and how it got where it is. To much growth to quickly causes speculative bubbles. One day it will pop and people will cry... On the other hand I am fine with a 30 USD price tag so long as it got their via long sustained growth.  I just got onboard w/ BTC's just under 2 weeks ago, and they're already up 50%. Yes, I'm a bit excited (but I'm also nervous) - while I do plan to hold onto them for the long haul, I'm also concerned that they're in a bubble. (although, compared to it's last deflationary fall in value, the fundamentals have changed - there's simply more people now than ever, so a huge drop is much less likely - I hope.) They're due for a correction very soon. Nothing major, but below $20 USD.  They're due for a correction very soon. Nothing major, but below $20 USD.   How do you anonymously buy bitcoins?  Bitinstant is not responding to anybody's hails. Mtgox is more like MtGov. \n\nAlso, gov is mad. I bet they are screaming and kicking but in the end, everybody will be using bitcoins. Cause fuck you, that's why.  How do you anonymously buy bitcoins?  Bitinstant is not responding to anybody's hails. Mtgox is more like MtGov. \n\nAlso, gov is mad. I bet they are screaming and kicking but in the end, everybody will be using bitcoins. Cause fuck you, that's why.   Ok, came across this randomly but can someone explain the concept of bit coin?\n Bitcoin is an online distributed peer to peer currency.  It cannot be counterfeited and it cannot be taken over by a government.\n\nYou can learn more at http://www.weusecoins.org Since it's peer to peer I bet majority consensus can change rules of the game. Government certainly has resources to do this. Am I wrong? Since it's peer to peer I bet majority consensus can change rules of the game. Government certainly has resources to do this. Am I wrong? You aren't wrong in principle, but in practice, due to the nature of Bitcoin, those things are either extremely unlikely or downright impossible.\n\nFor instance: the Bitcoin Network has more processing power into it than the top 100 supercomputers in the world combined.\n\nMost of those supercomputers are owned/run by goverments or science foundations funded by governments.\n\nSecond, there's a practical reason why govts cant take over bitcoin by buying them up.  Even if they did, there'd still be non-govt Bitcoins about, making them MORE scarce.  If anything, it will go the way of gold, which govts hold the majority of, but is still traded publicly.\n\nPretty much any action government takes to try and hurt bitcoin would actually end up helping it. What if the government makes it illegal to exchange $ into bitcoins? As far as I can see, the greatest worth of Bitcoins is due to it's ability to be exchanged into $.  Id say 1) [Bitcoin isn't only traded in USD (and that BTC is inherently international)](http://www.bitcoinwatch.com/) and 2) even if they make that illegal, it would increase the value of BTC just like drugs are way more expensive than they need to be. I didn't meant USD exclusively. I was more talking about what would happen if Bitcoins would be declared illegal and couldn't be exchanged into \"real\" currency anymore? Most transaction I do wouldn't be possible if the vendor receiving my Bitcoins couldn't exchange them back into \"real\" currencies. Without the ability to buy stuff with Bitcoins, they wouldn't have any value for me.  Most of the civilized world has deemed internet piracy illegal but that's not going anywhere.  Also, Bitcoin isn't only valuable to Americans.\n\n&gt;what would happen if Bitcoins would be declared illegal\n\nBy whom?  The US govt?  All its allies?  Don't take for granted that there are over 200 countries out there and that there are many other people who would love for the dollar to not be the standard for currency around the world (who aren't under US law or under any of its allies). I haven' thought about it to much, but I am not sure if I understand your comparison. Piracy and Drugs have value by themselves, they give you a free game or make you high, Bitcoins has value due to the fact, that it currently can be traded for stuff I want (like drugs). If they it loses that ability, it doesn't has any value anymore for me. I feel like you haven't answered my question of what would happen if Bitcoin would be declared illegal. I know, that if Bitcoin would be declared illegal to be exchanged into , I wouldn't be able to order Pizza with it anymore for example. There are means to make Bitcoins illegal in all relevant currencies: most countries in the world are members of the WTO and that's only one way to get most currencies to outlaw alternative currencies.  Id say 1) [Bitcoin isn't only traded in USD (and that BTC is inherently international)](http://www.bitcoinwatch.com/) and 2) even if they make that illegal, it would increase the value of BTC just like drugs are way more expensive than they need to be. You aren't wrong in principle, but in practice, due to the nature of Bitcoin, those things are either extremely unlikely or downright impossible.\n\nFor instance: the Bitcoin Network has more processing power into it than the top 100 supercomputers in the world combined.\n\nMost of those supercomputers are owned/run by goverments or science foundations funded by governments.\n\nSecond, there's a practical reason why govts cant take over bitcoin by buying them up.  Even if they did, there'd still be non-govt Bitcoins about, making them MORE scarce.  If anything, it will go the way of gold, which govts hold the majority of, but is still traded publicly.\n\nPretty much any action government takes to try and hurt bitcoin would actually end up helping it. I think there's one exception. If gov't kept an unpredictable buying/selling cycle, it would be conceivable that they could disrupt the price such that it would be relatively difficult for people to use it. (unpredictable trade value). Ok, came across this randomly but can someone explain the concept of bit coin?\n   Bitcoin noob here.\nCan bitcoins be hacked or something?\nCould this replace gold and fiat currencies?\nCouldn't we have physical bitcoins that we trade in real life? &gt;Can bitcoins be hacked or something?\n\nThe protocol itself cannot be taken over by now.  There's too much processing power behind the network.\n\n&gt;Could this replace gold and fiat currencies?\n\nYes and no.  I think those other currencies will always exist, and I think we may even see fiat fractional reserve online central banks that are backed by Bitcoin.  Bitcoin \"solves\" a lot of problems, but there are still reasons why many wouldn't want to use it exclusively (for instance, it take 5 minutes to an hour to verify a transaction)\n\n&gt;Couldn't we have physical bitcoins that we trade in real life?\n\nBitcoins are just an account balance to a wallet address on the blockchain network.  It's one long transaction list.  You can write down the wallet id (or its private key) and give that to someone, so in a sense, yes you can trade them physically.  I wouldn't recommend this, though, since once someone has a copy of that private key, they can spend the bitcoins associated with it at will on the network (or transfer to a more secure wallet for later use).\n\nIf you're interested in more, check out http://www.weusecoins.org ! &gt;(for instance, it take 5 minutes to an hour to verify a transaction)\n\n\nCould these wait times be improved or become instantaneous?\n\n&gt;You can write down the wallet id (or its private key) and give that to someone, so in a sense, yes you can trade them physically. I wouldn't recommend this, though, since once someone has a copy of that private key, they can spend the bitcoins associated with it at will on the network (or transfer to a more secure wallet for later use).\n\n\nI think the only way bitcoins could work as a mainstream currency is if there was a way to transfer them out of the virtual world and into thinks like actual coins, paper, credit cards etc. So they can be used for everyday transactions like buying coffee. &gt;Could these wait times be improved or become instantaneous?\n\nNo, not with the current protocol.  The best I can see is if, say, you open up a bank and offer bank accounts that dish out Awesome__Name Dollars when people deposit their bitcoins.\n\nIf two of your customers want to transact, you can do a ledger to ledger transfer instantaneously, but that's based on a third party trust-based infrastructure.  This can be extended to the degree of you trading with other banks who have other customers, but it's still the same 'problem'.\n\nBitcoin **has** to take that amount of time because the hashing algorithm is hard to solve, but easy to check; it's part of the magic of Bitcoin.  It makes it so that people can't forge past transactions, because by the time they finish a block, the rest of the network is 100000 blocks ahead.\n\n&gt;So they can be used for everyday transactions like buying coffee.\n\nThis has already started happening.  If you go to [Pizza For Coins](http://www.PizzaForCoins.com), you can pay them Bitcoins, and they will order and pay for your Dominoes Pizza to be delivered.\n\nBut the credit card thing would only work at a Bitcoin Backed bank that offers a credit line in their own competitive currency. (okay not the ONLY way, but one of the ways) interesting, thanks    To me bitcoins have no value as money. They are more like digital, pseudo anonymous cheques. Cheques themselves are not money, people accept them out of expectation that they can be redeemed for money. As such bitcoins are more of a competition for Paypal than for Fed and as such might hold value because they are becoming increasingly useful as such service. They are not money though. Throwing it here just to remind people that not everybody thinks of bitcoin the same way. What is money?  How do you define money?  What criteria and attributes must something have to be considered money?\n\nBitcoin is already used as a store of value and as a means of exchange.  [See PizzaForCoins, a service which takes your Bitcoins and buys your Dominoes Pizza for delivery with their USD](http://www.pizzaforcoins.com)\n\nReddit accepts Bitcoin as a form of payment for Reddit Gold.\n\nAre these not enough to consider it a means of exchange? Debit cards are even more popular than bitcoin but do basically the same thing to me. Are debit cards money? No. Without ability to convert debit card balance to money debit cards are worthless. I feel the same thing is true with bitcoins - they are completely useless by themselves and only accepted by people as long as are tradable for money. It is theoretically very easy to test - abolish possibility of exchange bitcoins for money and see what happens ;) (people will stop investing money into CPUs/GPUs to mine bitcoins and almost everybody will stop accepting it except for recreational purposes). Money is universally acceptable means of exchange. Bitcoin is Paypal 2.0. Bitcoin is only a means of exchange as much as debit/credit card is. Don't misunderstand me - I love Bitcoin for what it is - competition to debit cards/paypal/google checkout etc - but it is not money. To me bitcoins have no value as money. They are more like digital, pseudo anonymous cheques. Cheques themselves are not money, people accept them out of expectation that they can be redeemed for money. As such bitcoins are more of a competition for Paypal than for Fed and as such might hold value because they are becoming increasingly useful as such service. They are not money though. Throwing it here just to remind people that not everybody thinks of bitcoin the same way. &gt;people accept them out of expectation that they can be redeemed for money  \n \nNo, people accept MONEY out of expecation that it can be redeemed for GOODS.  To me bitcoins have no value as money. They are more like digital, pseudo anonymous cheques. Cheques themselves are not money, people accept them out of expectation that they can be redeemed for money. As such bitcoins are more of a competition for Paypal than for Fed and as such might hold value because they are becoming increasingly useful as such service. They are not money though. Throwing it here just to remind people that not everybody thinks of bitcoin the same way. Actually to me bitcoin is a scam, like fiat money, but hey, at least people buy into it voluntarily.",
    "url" : "http://themisescircle.org/blog/2013/02/19/end-the-fed-hoard-bitcoins/"
  }, {
    "id" : 25,
    "title" : "Constitutional Security Force Develops As Result of Police Chief's Efforts - Thoughts on this from an Ancap perspective?",
    "snippet" : "   I just can't get behind this idea.  I appreciate the spirit of it but it seems contrary to Ancap ideas.  I have Libertarian friends who are really behind this.    ",
    "url" : "http://freedomoutpost.com/2013/02/constitutional-security-force-develops-as-result-of-police-chiefs-efforts/"
  }, {
    "id" : 26,
    "title" : "Arachno-Capitalism Triumphantly Revisited",
    "snippet" : "  Is this like three dimensional chess trolling? I have no idea what that is. i'm putting my money on him being a troll, who is with me? On who being a troll? Dammit are you trolling now?\n\nI should have this down by now,\n  I don't like the comments here one bit. This subreddit used to be a place of serious discussion of principles/morals/economics. Now, it's devolved to to troll-calling and \"wat\"s. The man in this video brings up some valid points worth serious discussion and you people just dismiss them all and hide behind your close-minded fantasy ideology of \"anarcho-capitalism\".\n\nSheesh, I didn't think this was /r/Anarchism.  I don't like the comments here one bit. This subreddit used to be a place of serious discussion of principles/morals/economics. Now, it's devolved to to troll-calling and \"wat\"s. The man in this video brings up some valid points worth serious discussion and you people just dismiss them all and hide behind your close-minded fantasy ideology of \"anarcho-capitalism\".\n\nSheesh, I didn't think this was /r/Anarchism.  I don't like the comments here one bit. This subreddit used to be a place of serious discussion of principles/morals/economics. Now, it's devolved to to troll-calling and \"wat\"s. The man in this video brings up some valid points worth serious discussion and you people just dismiss them all and hide behind your close-minded fantasy ideology of \"anarcho-capitalism\".\n\nSheesh, I didn't think this was /r/Anarchism.  I don't understand your point?  How many people here are even being hostile?  Sometimes Poe's Law is a harsh mistress.... I tried to make a funny. Guess it didn't work. :(    Maybe he doesn't know it yet, but arachno-capitalism should be about paying with spiders. If you replace spiders on webs with 'the world wide web', then paying with spiders is paying with internet items, e.g. bitcoins. Then arachno-capitalism = bitcoin-capitalism, which comes reasonably close to anarcho-capitalism. \n\nHilarious how he found someone saying anachro-capitalism: \"it's funny and you feel for them at the same time\". Anyway, what is anachro-capitalism? Capitalism at the wrong time in history? Anachro-capitalism is feudalism without kings. No it's Capitalism without exchange! No, it's socialism without collectives! Maybe he doesn't know it yet, but arachno-capitalism should be about paying with spiders. If you replace spiders on webs with 'the world wide web', then paying with spiders is paying with internet items, e.g. bitcoins. Then arachno-capitalism = bitcoin-capitalism, which comes reasonably close to anarcho-capitalism. \n\nHilarious how he found someone saying anachro-capitalism: \"it's funny and you feel for them at the same time\". Anyway, what is anachro-capitalism? Capitalism at the wrong time in history?     ",
    "url" : "http://www.youtube.com/watch?v=GXeGGDrqH6Y"
  }, {
    "id" : 27,
    "title" : "Obama supporters say the darndest things - We have to keep on spreading ANCAP philosophy",
    "snippet" : "   Whoa, did that one guy actually change his mind about Obama and the government?!  I really hope that his eyes truly were opened a bit.     ",
    "url" : "http://www.youtube.com/watch?v=6XNM2Vu7Njw"
  }, {
    "id" : 28,
    "title" : "What's wrong with \"from each according to his ability, to each according to his need\"?",
    "snippet" : "What do you all make of [\"to each according to his contribution\"](http://en.wikipedia.org/wiki/To_each_according_to_his_contribution) and [\"from each according to his ability, to each according to his need\"](http://en.wikipedia.org/wiki/From_each_according_to_his_ability,_to_each_according_to_his_need). These seem like totally decent ideas that don't oppose anarch-capitalism. At the same time, I know the philosophies are totally opposed... can someone help me understand this?  I need a steak. You have the ability to provide. \n\nShould I send some guys with guns over to your house or will you bring it voluntarily?\n\n  There's nothing wrong with that idea at all. In fact, I think it's a wonderful doctrine. The problem comes in when it's enforced at gunpoint.    I *suppose* it's not against ancapism, but *who is doing the from-ing and the to-ing*? I assume there'd be a lot of communes in ancapistan where a few people voluntarily give to a big golden pot according to his ability, and then it is distributed to those in need, but I don't see that being the norm of communities.      That is the family system that a child should grow up in, perfect communism. There you learn how to live, but after you grow up you should learn how to make a living.\n\n\nAll those communists who cite that line are just grown children who missed out on the youth, and want the state to help them play forever.     ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18wb9f/whats_wrong_with_from_each_according_to_his/"
  }, {
    "id" : 29,
    "title" : "Name ideas for a website?",
    "snippet" : "Hi guys, so I would like to make a website using the Sunlight API which allows you to monitor congress by what they say and who said what when and some other features, possibly one where you can email congresspeople based on what they said recently or something. I was wondering if any of you had ideas for the domain name? My first thoughts were for something along the lines of watchcongress.xxx or whataretheysaying.xxx but any and all suggestions are welcome! I also hope one day that the the not yet existent site can go somewhat mainstream and appeal to the 'masses,' and if we're lucky, maybe have some impact on congress. I am not really a fan of political action, but I feel like if you can email a congressperson nearly automatically a few hours after they speak in favor of gun centralization and enough people do it, they may start to watch themselves a bit. At the moment, the only way to watch congress is on C-SPAN or filtered through other media and this might be able to bridge the gap. Also any feedback on the idea is much appreciated. Thanks!\n\nEdit: Thanks for the accurate and colorful submissions, but for now I am going with watchcongress.co.  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18wm8e/name_ideas_for_a_website/"
  }, {
    "id" : 30,
    "title" : "Biden: \"Buy A Shotgun, Buy A Shotgun\" How about no... ",
    "snippet" : "  Then why do our soldiers and police need AR 15's?   To address the point:\n\nA shotgun loaded with ~~bird shot~~ [at least 0 buck shot](http://www.theboxotruth.com/docs/bot3_2.htm) will sufficiently damage any intruder in your house ~~with less risk of penetrating and killing something which is not your target~~.  A shotgun also allows more tolerance for jitters, adrenaline and dark conditions.  This is also why hollow point handgun ammunition is better for home defense, it breaks up more when it impacts a surface so you have less risk of over-penetration.  I've shot sheet-rock with a shotgun, a rifle and hollow point.  The sheet-rock never stood much of a chance at close encounter range.\n\nBUT: most cities, counties or states have laws which will make you a criminal for firing warning shots as Biden suggests.  So fuck him, identify your target, ensure it is a threat to you, and destroy it.  Hell, even in Iraq we would have been punished for warning shots but praised for lethal use of force.\n\nAs Dick Cheney proved, a shotgun is not always a lethal weapon and if someone is invading my domicile I sure as hell want them dead.  I made it a year without killing anyone in Iraq, I can certainly figure out what a good target is (and I wake up well, some people do not).\n\nI would still choose a shotgun over my M-16 (yea, the real thing, a scary bogeyman) for home defense, because it affords me more coverage of an unknown target.  I will still prefer a rifle over a shotgun because they're just more fun at a target range.  I would prefer security cameras and automatic alarms over any of the above because most criminals will bail at the slightest activity.  They can go rob my gun free neighbors.\n\nI will still prefer government butting the fuck out of my personal choices (or self-imploding altogether) given that this is the closest option I have. To address the point:\n\nA shotgun loaded with ~~bird shot~~ [at least 0 buck shot](http://www.theboxotruth.com/docs/bot3_2.htm) will sufficiently damage any intruder in your house ~~with less risk of penetrating and killing something which is not your target~~.  A shotgun also allows more tolerance for jitters, adrenaline and dark conditions.  This is also why hollow point handgun ammunition is better for home defense, it breaks up more when it impacts a surface so you have less risk of over-penetration.  I've shot sheet-rock with a shotgun, a rifle and hollow point.  The sheet-rock never stood much of a chance at close encounter range.\n\nBUT: most cities, counties or states have laws which will make you a criminal for firing warning shots as Biden suggests.  So fuck him, identify your target, ensure it is a threat to you, and destroy it.  Hell, even in Iraq we would have been punished for warning shots but praised for lethal use of force.\n\nAs Dick Cheney proved, a shotgun is not always a lethal weapon and if someone is invading my domicile I sure as hell want them dead.  I made it a year without killing anyone in Iraq, I can certainly figure out what a good target is (and I wake up well, some people do not).\n\nI would still choose a shotgun over my M-16 (yea, the real thing, a scary bogeyman) for home defense, because it affords me more coverage of an unknown target.  I will still prefer a rifle over a shotgun because they're just more fun at a target range.  I would prefer security cameras and automatic alarms over any of the above because most criminals will bail at the slightest activity.  They can go rob my gun free neighbors.\n\nI will still prefer government butting the fuck out of my personal choices (or self-imploding altogether) given that this is the closest option I have. &gt;A shotgun loaded with bird shot will sufficiently damage any intruder in your house with less risk of penetrating and killing something which is not your target.\n\nThis is completely false. Birdshot is NOT an effective man stopper and will likely only cause superficial wounds.\n\n&gt;A shotgun also allows more tolerance for jitters, adrenaline and dark conditions.\n\nShooting it once perhaps or with a semi-auto shotgun. But reloading a pump or double barrel will be hindered by nerves. \n\n&gt;As Dick Cheney proved, a shotgun is not always a lethal weapon\n\nAgain, birdshot.\n\n&gt;I would still choose a shotgun over my M-16 (yea, the real thing, a scary bogeyman) for home defense, because it affords me more coverage of an unknown target.\n\nAn AR-15 loaded with lightweight HP will penetrate LESS than a shotgun. It will give you more rounds with less recoil. And you can effectively operate it with one hand.\n\nSorry I don't mean to single you out but you are upvoted to the top of this thread and there is a lot of misinformation. To address the point:\n\nA shotgun loaded with ~~bird shot~~ [at least 0 buck shot](http://www.theboxotruth.com/docs/bot3_2.htm) will sufficiently damage any intruder in your house ~~with less risk of penetrating and killing something which is not your target~~.  A shotgun also allows more tolerance for jitters, adrenaline and dark conditions.  This is also why hollow point handgun ammunition is better for home defense, it breaks up more when it impacts a surface so you have less risk of over-penetration.  I've shot sheet-rock with a shotgun, a rifle and hollow point.  The sheet-rock never stood much of a chance at close encounter range.\n\nBUT: most cities, counties or states have laws which will make you a criminal for firing warning shots as Biden suggests.  So fuck him, identify your target, ensure it is a threat to you, and destroy it.  Hell, even in Iraq we would have been punished for warning shots but praised for lethal use of force.\n\nAs Dick Cheney proved, a shotgun is not always a lethal weapon and if someone is invading my domicile I sure as hell want them dead.  I made it a year without killing anyone in Iraq, I can certainly figure out what a good target is (and I wake up well, some people do not).\n\nI would still choose a shotgun over my M-16 (yea, the real thing, a scary bogeyman) for home defense, because it affords me more coverage of an unknown target.  I will still prefer a rifle over a shotgun because they're just more fun at a target range.  I would prefer security cameras and automatic alarms over any of the above because most criminals will bail at the slightest activity.  They can go rob my gun free neighbors.\n\nI will still prefer government butting the fuck out of my personal choices (or self-imploding altogether) given that this is the closest option I have. Wasn't there a thread on /r/guns just a few weeks ago about a guy who got shot with 12 gauge no.8 at like 4 feet and it didn't really do all that much damage? Granted, if I recall correctly, he was only hit in the arm. Bird shot will do damage and even kill for sure, but I fee like I would want more than three rounds in my 12 gauge next to my bed. That's why I prefer to have my Glock 22 on my nightstand; if I manage to miss 15 shots, assuming I don't throw in my spare mags, the noise should be enough to handle the situation. Also I rent a brick house not an apartment so I'm not to concerned with bullet penetration.  Go to a range and set up some bricks with rebar to keep them upright and tell me about bullet penetration at close range.  You'll probably be surprised if you use FMJs.\n\nMy 12 gauge holds 4+1 rounds.  If I miss that much... yea.  (also I'm a Para P13ish fan, because if your gun is so light you notice every round missing then you have a problem).\n\nIf in a home defense situation you have the advantage or clarity to reload, you probably should have used something stronger in the first place.  Like I said, if you have a system set up that lets them know you know they are there, it's most likely they leave and rob your gun free neighbors.\n\nEverything is debatable until reality hits.  At that point you do what you feel is safest and best for you. To address the point:\n\nA shotgun loaded with ~~bird shot~~ [at least 0 buck shot](http://www.theboxotruth.com/docs/bot3_2.htm) will sufficiently damage any intruder in your house ~~with less risk of penetrating and killing something which is not your target~~.  A shotgun also allows more tolerance for jitters, adrenaline and dark conditions.  This is also why hollow point handgun ammunition is better for home defense, it breaks up more when it impacts a surface so you have less risk of over-penetration.  I've shot sheet-rock with a shotgun, a rifle and hollow point.  The sheet-rock never stood much of a chance at close encounter range.\n\nBUT: most cities, counties or states have laws which will make you a criminal for firing warning shots as Biden suggests.  So fuck him, identify your target, ensure it is a threat to you, and destroy it.  Hell, even in Iraq we would have been punished for warning shots but praised for lethal use of force.\n\nAs Dick Cheney proved, a shotgun is not always a lethal weapon and if someone is invading my domicile I sure as hell want them dead.  I made it a year without killing anyone in Iraq, I can certainly figure out what a good target is (and I wake up well, some people do not).\n\nI would still choose a shotgun over my M-16 (yea, the real thing, a scary bogeyman) for home defense, because it affords me more coverage of an unknown target.  I will still prefer a rifle over a shotgun because they're just more fun at a target range.  I would prefer security cameras and automatic alarms over any of the above because most criminals will bail at the slightest activity.  They can go rob my gun free neighbors.\n\nI will still prefer government butting the fuck out of my personal choices (or self-imploding altogether) given that this is the closest option I have. No birdshot! #4 buckshot all the way     ",
    "url" : "http://www.youtube.com/watch?feature=player_embedded&amp;v=HHZ7zXLvOkY#!"
  }, {
    "id" : 31,
    "title" : "One potential problem with completely unregulated property rights that I'm having trouble finding a solution for:",
    "snippet" : "Perhaps this belongs in /r/voluntarism, I'm not sure. Anyway, say you have a piece of land. You are living there and you piss off one of your neighbors. He's rich and decides to buy all the land around you just to fuck with you. Now, you have two options: either you just chill on your land like a hermit and hope you can be self-sufficient. OR, you could violate his property rights. Now, personally, I know what I'd do in this situation, but I'm not sure everyone is as aggressive as me. What would most r/ancap/ have to say about this?  It would never be a problem in practice. \n\nJust look at how it works now. When you buy property - you also secure easements from neighboring property owners that connect your land to some public roadway. \n\nThis is not an issue in a city or subdivision where your land is directly connected to the public roadway, but in rural areas where there are lots of private roads your property deed will list the ingress/egress easements you have from neighbors. \n\nThose easements are essentially a permanent use-license for that specific patch of ground to be used only for transit (ie. you can't build on an easement, but can use that patch for ingress/egress purposes). \n\nAs such, the rich neighbor couldn't just invalidate that pre-existing contract by buying the parcel that contained your easement - since your contract to secure that easement would already be in place. \n\nThus, the only way for him to effectively do that would be to buy the easement rights back from you...which depending on how much he was offering may be tempting to just install a helipad on your roof and grant him complete ownership. \n\n\n What if there are no such guarantees in the contract? Or if there is no contract?  What if you agreed to buy some land on the moon from a guy you met in a bar? \n\nHow does AnCap vs State solve the problem?\n\nPoint is, why would you ever buy land without having egress / ingress easements? Further, these aren't obscure or unknown ideas - a large part of real estate attorneys work is to make sure all such details exist before allowing the transaction to proceed. Why would not giving a select group of people the ability to kill/steal change any of this?\n\n What if you agreed to buy some land on the moon from a guy you met in a bar? \n\nHow does AnCap vs State solve the problem?\n\nPoint is, why would you ever buy land without having egress / ingress easements? Further, these aren't obscure or unknown ideas - a large part of real estate attorneys work is to make sure all such details exist before allowing the transaction to proceed. Why would not giving a select group of people the ability to kill/steal change any of this?\n\n Maybe both individuals homesteaded the land. Maybe they genuinely were not aware of any such clauses to include in the contract. Its easy to just brush off the problem, but it doesnt answer the question. How does having a State change the issue at all?\n\nYou can still become landlocked if you don't secure easements first.  Im not advocating having a state or saying that it necessarily makes any difference. My question is why and how any society would tolerate, recognize and enforce such silly property law as described. What if there are no such guarantees in the contract? Or if there is no contract?   What on earth would you have done to this guy to make him spend millions of dollars just to piss you off?  I'm sure the two of you can come to a reasonable agreement. Until then, just trespass. You're advocating a system of property rights in which the solution to certain conflicts is violating property rights? You're advocating a system of property rights in which the solution to certain conflicts is violating property rights? You're advocating a system of property rights in which the solution to certain conflicts is violating property rights?  None of these other answers are really sufficient.  The short and sweet answer is that the contract you sign when purchasing your house would guarantee road access, among other things, making this sort of practice illegal. None of these other answers are really sufficient.  The short and sweet answer is that the contract you sign when purchasing your house would guarantee road access, among other things, making this sort of practice illegal. Contract with who, the rich guy? Once he buys all the other pieces of land, any contract you might have had with those other owners is null and void. Not true, since they don't have the rights to violate a pre-existing contract with you. They cannot enter into a contract that violates existing contracts, so either the new contract is completely null and void (which means the transfer of property hasn't actually happened) or the easement is still respected.\n\nIt makes a lot more sense if you're coming from the perspective of being able to homestead certain functions of property, and that property is inherently granular. Thus a contract cannot sell a specific use for property that has already been contractually assigned to another party: by securing the easement, you've obtained the right to use a specified portion of the property to access the road. Whether you got this by purchasing the rights from the current owner of the land in question or from simply agreeing with him doesn't matter: if it's in the contract you have purchasing the land that you own access rights then no one else can take that away from you without your permission. Otherwise it's aggression.  &gt;  if it's in the contract you have purchasing the land that you own access rights then no one else can take that away from you without your permission. Otherwise it's aggression\n\nLet me ask this then. Can I sign a contract with my neighbor that obligates whoever owns my land pays a tax to my neighbor? In return my neighbor provides a service (e.g. police/fire), but it's assumed that he will never release that property from this obligation. So regardless of who buys that land from that point forward owes a property tax.   Honestly, I'm really not the best person to ask. Kinsella and Murphy have both written on this sort of thing, though I don't know their their specific perspectives are 100% compatible. The general idea is that conditional title transfers can be made and that \"property\" is not a single physical thing but a variety of interrelated concepts. In the case of road access easement, there's a specific element of the \"property\" that the homeowner has obtained, so no one can retroactively take that away from him. In your case, it looks more like you (the seller) are maintaining some element of the property and charging \"rent\" in the form of a contractual obligation to purchase a product form a third party. Anyone who tried to occupy the physical land without recognizing that claim (which you'd never relinquished) would thus be committing aggression against you and would be liable for a tort. But take that with a grain of salt, as I'm not even an expert on current contract theory, so I'd defer to anyone more familiar with the literature for such a specific case.\n\nThen again, there's lots of complexity with regards to what happens if the original tenants simply move out and the land is left empty. I'm not sure how the abandonment would be resolved with regards to your claim versus the claim they have that they no longer defend, so that would probably ultimate be up for some arbiter to decide if you don't reclaim the property and someone else comes in and wants to homestead it. Thats exactly my way of thinking as well. There are quite a few variables here and to conclude that a contract can remain attached to the land without the consent of the owner implies that an outside governing body is ensuring compliance. Thats what the state does today, so it makes sense in todays context. In an anarchy though there would be no central authority to register deeds with and therefore no way to ensure compliance past the lifetime of the owners. \n\nConsider ultimately that a contract is nothing more than an agreement to do business. breaking a contract needs to have terms for default built into and can't been enforced through violence. A broken contract means the end of a business relationship, not a permission to aggress against someone else. I agree with you on several points: a contract itself will only matter so much as the body enforcing it (which is not required to be a state), and that in many cases the \"punishment\" for breaking a contract would be a negative mark in your reputation (much like a bad credit score is today, which is basically a specialized form of this whole issue). And I very much subscribe to the idea that we can't really say for sure what the market would do were it free, since the market is smarter than any of us individually. That being said, I've thought it through, and here's one way I could imagine the scenario you describe playing out:\n\nYou own property and someone wants to buy it. You wish to sell it to them with the requirement that they purchase some service (let's say police protection) from a third party because it helps maintain safety in the region. So what you do is you sell them the land outright with a stipulation that they sign a contract with the third party for ongoing services so long as that group (and probably your own entity) remain in existence. Additionally, there'd be a stipulation banning transfer of the property without your permission. This contract would be secured by some collateral (much like a loan is) which, in this case, would be the property you're selling. Thus, any deviation from the terms of the contract (such as ceasing to pay for the service or trying to sell it) would authorize you to reclaim the property, but that would be the end of it (unless the new owners somehow resisted this collection, in which case they'd be aggressors).\n\nNow, I personally would wonder who exactly would willingly buy something with such a stipulation in the contract, but that's not for me to decide. I imagine that, in order to attract customers, you'd likely need to sweeten the deal in many cases. One way of doing so would be to add a buyback clause: if the owners no longer wish to keep up their end of the deal, then they are permitted to sell the property back to you instead of simply forfeiting it if they're unable to find someone to buy it from them and take over the contractual duty.\n\nDoes that make sense? &gt; Additionally, there'd be a stipulation banning transfer of the property without your permission. This contract would be secured by some collateral (much like a loan is) which, in this case, would be the property you're selling. \n\nI highly doubt that people would enter into a contract where failure resulted in forfeiting the property. It's a possibility though that some transaction would be in this form, but I don't think you can base an entire society on this. I agree that contract enforcement does require collateral though. I address that in the end: this is theoretical, I don't see why anyone would accept it. That's why I propose the buyback or something along those lines, but ultimately the market is much wiser than I am. Ultimately, if I own land and can't get anyone to buy it from me under the conditions I set, then I'm either not going to get anyone to purchase it or I'll have to adjust my conditions. &gt;  if it's in the contract you have purchasing the land that you own access rights then no one else can take that away from you without your permission. Otherwise it's aggression\n\nLet me ask this then. Can I sign a contract with my neighbor that obligates whoever owns my land pays a tax to my neighbor? In return my neighbor provides a service (e.g. police/fire), but it's assumed that he will never release that property from this obligation. So regardless of who buys that land from that point forward owes a property tax.   I imagine at some point you have heard a Libertarian claim that a capitalist region can contain a socialist region, but a socialist region cannot contain a capitalist region, or something to that effect. The foundation for this, and what you are referring to now, is called a 'Heathian state', where some socialists could buy or homestead a piece of land and declare that all who enter the region can do so only under the condition that they shall surrender rights to any property they bring with them, and shall not claim any rights on anything in the region.\n\nSocialism, ironically, made possible by a respect of property rights. Very good point, but the scenario as laid out initially wasn't this. A socialist community would never have the ability to sell it's land piecemeal and those entering it would be contracted into the totality of the communal land. Therefore any outside contracts would be with the commune and not any one individual over a portion of the land.\n\nWhat we're discussing is whether a contract can be attached to the land rather than the person. So can I attach some crazy contract onto my property and have my grandchildren obligated to fulfill that contract centuries later? No. A contract is between people, not attached to land. First paragraph is completely correct; I was simply responding to the question you had just posed. On to the second paragraph.\n\n&gt;A contract is between people, not attached to land.\n\nI completely agree, and this is why, to explain on a tangent, I would argue it is not possible for a human to marry a pillow, since marriage, as any ancap would agree, is a matter of private contract. Scratching your head?\n\nhttp://metro.co.uk/2010/03/09/man-marries-pillow-154906/\n\nBack on point, I absolutely, 100% agree with you. You can't make a contract with a material object, contracts are only possible between sentient beings.\n\nThat said, contracts tied to material objects are possible, they exist today, and will exist in an ancap world. How is this ethical or even possible? If you are lucky enough to be rich enough to buy anything of historical significance, you will almost certainly do so only upon condition of agreeing to a contract that states you will preserve and protect the property to a reasonable degree, the degree normally determined by a court or private arbiter declared in the contract, and upon sale of the property, shall sell only upon condition of the buyer agreeing to the terms in this contract, although more commonly, a copy of this contract, that references the previous contract as the a priori.\n\nIn short, YOU agree to only sell the property under condition that the next buyer also agree to the terms of the contract you agreed to, or a contract YOUR contract specified as being for the next buyer. Before you ask, no, unless it conflicts with the existing contract, there is no reason you could not add another contract containing your own conditions into the purchase agreement, but the original agreement, or the conditions determined by the agreement, must still be met.\n\nSo the next question, or what should be the next question on your mind, and something I have discussed at length is, what happens when someone sells a piece of land with a contract that states a building or artifact shall be preserved indefinitely. i.e, the contract specifies NO TIME LIMIT FOR EXPIRATION or expressly forbids it. So, in a million years, the item has been continuously traded and the contract persists. I would argue, in this scenario, the contract, quite simply, persists, as I am a 'rights inviolate' ancap.\n\nBut is there any way out of these agreements? I would argue that the only time an unspecified term contract can no longer persist is when the current owner looses the right to the property. This can happen in a number of ways, the simplest being that the owner defaults on other debts and as a result looses rights to his possessions in the sell off. BUT THEN (Sorry about the length...) you can imagine someone setting up a fly-by-night corporation or getting some bum to purchase the land, default intentionally, and have the agreement removed. A condition in the contract about property loss would be ineffective, since the property is lost, but a fine may be executed for doing so, probably payable to some preservation charity. Nice comment, you've sorta addressed my disagree with you in your final paragraph, but I'd like to expand upon this.\n\nIf I decide to default on a contract, what does that mean will happen? Does that give the right of someone to use violence against me or does it give the right to collect a fine? Which court will any breach be heard in? \n\nLets take it one step further and suppose I'm a communist that is buying the land and your claim of an easement doesn't mesh with my view of property. perhaps when you say the word \"easement\" I take that to mean that you'll pay an appropriate toll while passing through the land, because that is what I would do if I used someone elses land. \n\nThe point I'm driving at is that a contract is between people. You can stipulate land or material in a contract, but there has to be a meeting of the minds between two people. If anything, the contract would have to stipulate that the current owner would invite the other party of the contract to the sale of the land, requiring the next owner to sign a contract allowing easement. the new owner and the easement owner would then haggle out a new contract between them at that point. \n\nI think we also need to remember that contracts might be abandoned as well. We need to recognize that any property can be abandoned and a contract is just another form of property. If an offer is extended to attend the sale of the property and the easement owner doesn't attend the sale, then the contract is abandoned and/or in default.  None of these other answers are really sufficient.  The short and sweet answer is that the contract you sign when purchasing your house would guarantee road access, among other things, making this sort of practice illegal. How can you be so sure of that? And what if the contract contains no such guarantees? Or there is no contract?  How can you be so sure of that? And what if the contract contains no such guarantees? Or there is no contract?     Wouldn't this fall under the principle of non-aggression? By preventing you from freely coming/going from your property, are they not denying you the right to your property?   No offence but I have yet to find any satisfying reply in this thread. Most simply shrug off the problem by saying it will invariably say in the contract this and that, or try to present their own view of how property rights should work without explaining how others are to be forced to comply with this. Remember, in an ancap society there is no single central authority which can decide how property should work for everyone in society- the legal system polycentric.\n\nThe real question is why and how any society would tolerate, recognize and enforce such silly property rights laws as described in the OP in the first place.   My answer is that he can't protect his entire property all the time. If you are in a feud with him, you don't really have any obligation to respect his property. You might have contracts with other people in the community requiring you to respect his property rights, but these people might allow you to violate the jerks property when they see his goal of enclosing you.\n\nOf course there might just be a single road leading to yours, so practically it would be easy for him to block that single road and force you to drive your car through the brush. \n\nUltimately, you might have to abandon that property, because you can't afford to piss off your rich and popular neighbors. If you want to do this, then you better be rich and popular yourself, so as to buy some land yourself. &gt;If you are in a feud with him, you don't really have any obligation to respect his property.\n\nuhh... what? What establishes property rights besides mutual agreement and contracts? If there is truly a feud between two people, it seems illogical to assume they will respect any contracts between each other, thus making them void. If they still honored their contracts, then it's not really a feud. \n\nAs I said though, there could be contracts with others in the community that would preclude trespassing even on your enemies property. If we disagree about something, that doesn't free us of any obligations we have to towards  each other.  By breaking a stipulation of a contract we agreed to, you're aggressing against me and/or my property.  Which, under freedom of contract, or natural law, would be illegal and I would then have just cause to use force against you, or seek reparations.  I don't a think persons feelings one way or the other means anything.       ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18vu08/one_potential_problem_with_completely_unregulated/"
  }, {
    "id" : 32,
    "title" : "I haven't seen posted here wrt Charter Cities, and Honduras in particular. It seems like a very significant opportunity to makes strides toward an an-cap society and demonstrate the benefits of capitalism.",
    "snippet" : "   Definitely been posted here before. ",
    "url" : "http://athousandnations.com/2013/01/26/sign-of-model-city-revival-in-honduras/"
  }, {
    "id" : 33,
    "title" : "Marriage, Dating, Sex and Vikings - David Friedman",
    "snippet" : "  This guy could be my \"annoying\" (not!) uncle at any holiday dinner.\n\nThe simpletons who he'd bore can take a walk.\n\nDon't you guys find it funny how he's so compelling here *precisely because* what he's really discussing is *a priori economic logic*.  It was the same way with his dad; Milton was at his best when he was just discussing economic logic, not econometric analysis.  Block was right when he said, if you scratch below the surface of many of these Chicago types, you find an implicit, partial Austrian.\n\n----\n\n\"separate halves\"\n\n&lt;Staredad&gt; I doubt that either of the Friedmans would consider any economic logic to be a priori. I think they would if pressed hard on it.  Where the two would start to squirm is when you get into epistemology. I disagree.\n\nCan you give an example of economic reasoning that does not presuppose an understanding about the nature of economic actors? Well, I'm in agreement with that position; I'm saying not every economist is so philosophically educated.\n\nThe two Friedmans are/were very educated, but, as far as I can tell, we're weak in philosophy of science / epistemology.  It's not that they didn't know *anything* about the subjects, but had strange (but mainstream) views on them Milton Friedman's writings on the philosophy of economics were essentially the bedrock of the Chicago school's methodology (and are *basically* standard mainstream economic philosophy).\n\nI'd encourage you to read Friedman's *Essays in Positive Economics*, which I think makes one hell of a case for economics as an empirically driven, scientific enterprise.\n\nPersonally, I do not have a great deal of confidence in the Austrian philosophy. Friedman was certainly not the first to speak about economics as a value-free science.\n\nConcerning methodology, econometrics and statistical analysis have several, grave flaws [[1](http://www.youtube.com/watch?v=6bF_gPioOoc), [2](http://www.youtube.com/watch?v=TI5fjTz1Rbw)].\n\nAs far as what Milton said, it's nothing more than vogue falsificationism and, though you may think it bravely rigorous, is really quite shallow.\n\nIt's interesting, though, that you say you're not confident about AE, but did say earlier,\n\n&gt;Can you give an example of economic reasoning that does not presuppose an understanding about the nature of economic actors?\n\nI must have agreed with you out of accident then.  When Austrians talk about \"an understanding about the nature of economic actors,\" they mean empathic knowledge of the actor.  So, logical reasoning about human action would require that understanding, but it isn't arrived at through empiricism, which is what I'm guessing you meant? &gt;Friedman was certainly not the first to speak about economics as a value-free science.\n\nI said no such thing. I merely pointed out that Friedman is widely considered to be an authority on the issue, and one would not get that sense from your previous comment.\n\n&gt; Concerning methodology, econometrics and statistical analysis have several, grave flaws.\n\nI'll watch and comment on the videos later. I don't have enough time right now.\n\n&gt; As far as what Milton said, it's nothing more than vogue falsificationism...\n\n\"*Vogue falsificationism*\" (or '*the scientific method*' for the rest of us) is the best tool the human race has for building systems of knowledge. And Friedman gave an eloquent defense for its application in the economic sciences.\n\nFreud couldn't adequately decipher the human condition from his armchair, and Austrians fall similarly short.\n\n&gt;... but it isn't arrived at through empiricism...\n\nAny line of economic reasoning requires axioms that are necessarily derived from one's sensory experiences, which is essentially the definition of a posteriori logic. You simply cannot have an empathic knowledge of the economic actor without living in the world and experiencing economic phenomena.\n\n &gt;one would not get that sense from your previous comment\n\nPrior to you bringing up those writings, I never said anything about his view of value-free economics.  I was criticizing his methodology; it makes certain epistemological assumptions, fatal ones.\n\n&gt;\"Vogue falsificationism\" (or 'the scientific method' for the rest of us) is the best tool the human race has for building systems of knowledge.\n\nYou're explaining this to someone who's studied math, the natural sciences, and the philosophy of both his whole life.  I don't need to be educated on or spurned for not appreciating what the method is capable of, in the right contexts.\n\nThe criticism being made by Austrians is not against the Scientific Method *per se*, but its misapplication in the field of economics.\n\nI should also say to you, since you drew the equivocation, that falsicationism is not really what the Scientific Method partakes in; it's merely the best technique we have at being more *confident* in a given paradigm and only in those circumstances where a number of preconditions are strongly believed to be met.\n\n&gt;Freud couldn't adequately decipher the human condition from his armchair, and Austrians fall similarly short.\n\nThat you would draw this analogy tells me you don't *really* quite understand the Austrian school outside of \"they hate Science!\"\n\n&gt;You simply cannot have an empathic knowledge of the economic actor without living in the world and experiencing economic phenomena.\n\nThis need not be the same thing as econometrics; indeed, econometrics doesn't grant empathic knowledge of actors.  It gives you nonfunctions masquerading as functions. I doubt that either of the Friedmans would consider any economic logic to be a priori. This guy could be my \"annoying\" (not!) uncle at any holiday dinner.\n\nThe simpletons who he'd bore can take a walk.\n\nDon't you guys find it funny how he's so compelling here *precisely because* what he's really discussing is *a priori economic logic*.  It was the same way with his dad; Milton was at his best when he was just discussing economic logic, not econometric analysis.  Block was right when he said, if you scratch below the surface of many of these Chicago types, you find an implicit, partial Austrian.\n\n----\n\n\"separate halves\"\n\n&lt;Staredad&gt; &gt;a priori economic logic\n\nHas this logic been formalized ? I mean, did someone make a program which can check its proofs ?\n\n[It has been done with maths](http://us.metamath.org/), in multiple ways.   I wish I knew of him back in 1996, things could have panned for the better.   Legalize prostitution? Anyone?",
    "url" : "http://www.youtube.com/watch?v=fZD-xDvQLrg"
  }, {
    "id" : 34,
    "title" : "Steven Levitt, author of Freakonomics is doing an AMA. Not an Austrian but still an interesting economist",
    "snippet" : "  I find it humorous that many of the posts criticize him for drawing conclusions where they question the methodology.  Drunk walking is 7 times more dangerous than drunk driving; was this in an urban setting versus suburban where there is more traffic, etc?  It seems like redditors are questioning how valid conclusions are based upon the intentional or unintentional skewing of data.\n\nYet you'll find that most of them will be without that same doubt when saying that FDR's policies ended the Great Depression.  Or that the real problem with the stimulus was that we didn't spend enough.   You only become a critical thinker when you want to prove your opponent wrong.  Wow.  This simple statement just blew my mind. It is true to some degree for every single person. I find even myself lapsing all the time around like minded people. \n\nAlways try to look for truth no matter where it takes you. (If you don't like me telling you what to do you can you might be a fan of this place. /r/firstworldanarchists ) You only become a critical thinker when you want to prove your opponent wrong.  You just won Reddit I don't know what this means, but okay. :D  I'm just going to highlight some of my favorite responses...\n\n[Universal Healthcare](http://www.reddit.com/r/IAmA/comments/18tp7t/i_am_steven_levitt_author_of_freakonomics_ask_me/c8hvhsb)\n\n[Gun Control](http://www.reddit.com/r/IAmA/comments/18tp7t/i_am_steven_levitt_author_of_freakonomics_ask_me/c8hvh4s)\n\n[Bitcoins](http://www.reddit.com/r/IAmA/comments/18tp7t/i_am_steven_levitt_author_of_freakonomics_ask_me/c8hvonl) Hah, the bitcoin comment is golden. By golden you mean embarassing?   Why does being austrian matter?",
    "url" : "http://www.reddit.com/r/IAmA/comments/18tp7t/i_am_steven_levitt_author_of_freakonomics_ask_me/"
  }, {
    "id" : 35,
    "title" : "Where to buy black and yellow bow tie/Ancap chic?",
    "snippet" : "I've seen altogether too many Jeffrey Tucker posts in the past week to hold off on this any longer. I absolutely need to own a a black and yellow \"ancap flag\"-esque bow tie, but I've been unable to find one through googling. Now, I realize I might have better luck on /r/malefashionadvice and this may be breaking the rules, but one could argue the possession of a library of bow ties to be tangential at the very least to anarchist principles.\n\nAlso, any links to any ancap-related apparel would be appreciated.  http://www.tiesnsuch.co.uk/black-bright-yellow-striped-silk-bow-tie-p-1485.html\n\nCould be pre-tied, which is all I've been able to find. MUST BUY. I think we have a winner. http://www.tiesnsuch.co.uk/black-bright-yellow-striped-silk-bow-tie-set-p-1642.html\n\nJust to follow-up, they have a set that comes with cufflinks and a pocket square +tip 0.05 btc verify     If I can't find a black-and-yellow bandana to wear under my bike helmet before summer rolls around, I'm going to have to make one myself. And since I know nothing whatsoever about textiles, it's going to get ugly.   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18uont/where_to_buy_black_and_yellow_bow_tieancap_chic/"
  }, {
    "id" : 36,
    "title" : "Where do anarcho-capitalists draw the line for contracts made under duress?",
    "snippet" : "**(1)** I'll start with a simple situation. If I point a gun at you and say sign over the title of your house to me or I'll shoot you, and as a result you sign your house over to me out of fear of your life, then our contract is invalid because you made it under duress. As an obvious matter, I created the situation that caused you to be in duress.\n\n**(2)** Now, I'll move into a trickier situation. Under anarcho-capitalist principles (which have been incorporated into United States law), there is no duty to save someone. If you see your neighbor drowning in her pool and you refuse to try to save her, you cannot be punished. \n\nIf you saw your neighbor drowning, and you yelled to her \"I will save you if you transfer the title of your house to me,\" and your neighbor agrees, would this contract be upheld under anarcho-capitalist principles? This is different from the gun-to-the-head situation because you did not cause her duress; in fact, the neighbor would have been even worse off had you not been there to save her as she presumably values her life more than she values her house. I would say the contract would be upheld by an anarcho-capitalist court - but, I will admit this decision feels unjust.\n\n**(3)** Last, I would like to bring up a situation somewhat analogous to situation (2). Let's say Tom is a villager in rural China. Tom's village farms for subsistence and has not been directly affected by colonialism or the Chinese government. Tom's ancestors have lived in the village for generations. Tom takes a job at a sweatshop because it would give him a higher standard of living than he had in his village (as demonstrated through his revealed preference). Tom can leave the sweatshop and go back to his village at any time. The contract with the sweatshop would undoubtedly be upheld under anarcho-capitalist principles.\n\nIt has been a while since I read *Machinery of Freedom*, *Ethics of Liberty*, and *For a New Liberty* - I suspect these books take a crack at answering my question.  1 and 3 are pretty clear.  1 is duress and an invalid contract.  3 is a valid contract of employment under the assumption that he *is* free to leave at any time and go home.\n\nNumber 2 has an easy solution if you look deeper.  She goes for an arbitration before a jury.  Can you honestly imagine them upholding it?  \n\nIt's the same scenario as breaking into a cabin in the woods during a blizzard to keep from freezing to death.  Are you guilty?  Sure.  Should the penalties be waived?  Absolutely.  *You don't treat someone in fear of their life by the same standards, and people (and juries) know it.*\n\nAltruism is the reason most people turn down rewards when they perform life-saving actions.  Behave selfishly, and you will be corrected. &gt; Number 2 has an easy solution if you look deeper. She goes for an arbitration before a jury. Can you honestly imagine them upholding it?\n\nYou should expand on your point - asking me this question has not convinced me of anything.\n\nThe first thing to consider is that you could have watched your neighbor drown with no legal consequences (this is both true under ancap theory and US law). Most people would rather lose their life than their house; your neighbor confirms her preference for her house over her life through her revealed preference in making the contract. You clearly valued her house over the hassle of saving her.\n\nIf an arbitrator invalidates this contract, what other types of contracts could be invalidated?\n\n&gt; It's the same scenario as breaking into a cabin in the woods during a blizzard to keep from freezing to death. Are you guilty? Sure. Should the penalties be waived? Absolutely. You don't treat someone in fear of their life by the same standards, and people (and juries) know it.\n\nAgain, I don't think penalties would be waived. A jury would hold the trespasser responsible for damages to the property (e.g. a broken window) so the entire trespass would not be forgiven. If the front door of the cabin were unlocked, the jury could reasonably charge the trespasser the market rate for one night at a cabin. *Penalties* would be waived, not damages.  You should absolutely pay for damages and replacement value of the food.  But not punitive measures.\n\n\nThe arbitrator doesn't breach the contract, she does.\n\nWhat is the penalty for her for breach of contract?  Did they both sign a contract with explicit wording?  Because if they didn't, there's no way for him to end up with the house.  After the fact, her life is not in danger; he can't put it back *into* danger with a prepared ironclad contract.  Without one, the most he will get out of an arbitration *is what the jury can be convinced to support.*\n\nNone the less, this is one of those hypothetical questions that almost never happens in real life.  Humans aren't wired that way.  We'll be afraid to act, step over people dying in the street like we don't see them, or plunge in regardless of our own safety.  Any other response is entirely foreign without mitigating circumstances (training, situation, mental pathology).  So while it's interesting to argue, it's still up to a jury to consider each case for its appropriateness. &gt; Penalties would be waived, not damages. You should absolutely pay for damages and replacement value of the food. But not punitive measures.\n\nPenalties might not be waived. We can probably agree that the penalties (if any) will be much less in a survival situation than in a normal breaking and entering. \n\n&gt; What is the penalty for her for breach of contract?\n\nWhen one party completes \"perfect performance,\" the other party must follow through with its end of the deal (either through \"specific performance\" or via cash equivalent). Therefore, the penalty in this case would be the neighbor's house or the cash value of the house.\n\nAlternatively, going back to the hypothetical, you could have stipulated that if your neighbor breached the contract then you get all of her non-house assets (i.e. she puts up her other assets as collateral). Your neighbor could breach on these damages, too. One way to prevent contract breaches is to put the money in escrow, controlled by a third party. But even then, the third party could breach.\n\nIn short, there could be an unlimited number of breaches, but such breaches aren't justified under anarcho-capitalist principles. I want to discuss these hypothetical situations under anarcho-capitalist principles because we could endlessly speculate how many breaches could happen and who would enforce the damages.\n\n&gt; Did they both sign a contract with explicit wording? Because if they didn't, there's no way for him to end up with the house.\n\nContracts don't need to be in writing under US law and common law.\n\n&gt; None the less, this is one of those hypothetical questions that almost never happens in real life.\n\nI agree. I only want to help clarify the outer limits of duress. &gt;Penalties might not be waived.  We can probably agree that the penalties (if any) will be much less in a survival situation than in a normal breaking and entering. \n\nAgreed.  I should have said \"should be waived\" because it's not absolutely true, but likely will be; most owners would waive it themselves I suspect.\n\n&gt;One way to prevent contract breaches is to put the money in escrow, controlled by a third party. \n\nWhich is one of the ways that insurance makes so much sense.  Not only does it transfer it to a third party, but it also allows statistical analysis to valuate a life and what constitutes reasonable payment, and it does it outside of \"the heat of the moment\" with reasoned consideration and impartiality.\n\n&gt;we could endlessly speculate how many breaches could happen and who would enforce the damages.\n\nAnd will.  And like our current system, it will all be settled by precedent.  Arbitrations and juries will ultimately decide, and as time goes on, those previous decisions add weight to later decisions.\n\nHow they ultimately decide is of course unknown (which is why we do it), but my gut feeling is that contracts like this come close enough to the limit of duress that juries will back away from it *unless* it is via a pre-arranged third party solution such as insurance.  Which is really how it should be.  Anything that even hints at duress will void contracts for values greater than those established by insurers if they go to arbitration. &gt; Which is one of the ways that insurance makes so much sense. Not only does it transfer it to a third party, but it also allows statistical analysis to valuate a life and what constitutes reasonable payment, and it does it outside of \"the heat of the moment\" with reasoned consideration and impartiality.\n\nAnarcho-capitalists hold that value is subjective under contract. In my opinion, most people value their lives more than their houses.\n\nI realize we have trailed off into speculation about how, as a *practical matter*, to best prevent breaches and resolve broken contracts. I set up these hypothetical situations to clarify the outer limits of duress *in theory*. I originally claimed that duress is only a valid escape from a contract if one party caused the other's duress. How do you feel about (2)'s validity in theory?  Not sure if my response is in accordance with the opinions of others here, but I would say simply that any person can break the terms of a contract at any time, and it's up to everybody else to determine for themselves if that was a reasonable action to take or a sign of bad character, affecting the reputation of the contract-breaker accordingly. I am not sure what you are getting at in your answer.\n\nI will use Rothbard's take on contracts to flesh out why (2) is a legitimate contract. X says to Y \"I presently give up my right to $5 in exchange for a roast beef sandwich.\" If Y makes X a roast beef sandwich, X is bound by the contract.\n\nRothbard distinguishes the contract between X and Y from *expectation damages*, as such damages rely on the promise of *future* will, as future will is inalienable. W says to Z \"I will give you in the future $5 in exchange for a roast beef sandwich.\" If Z makes W a roast beef sandwich, W is not obligated to give Z the $5.\n\nThe difference between the contract between X and Y and that between W and Z may seem like mere semantics, but the difference is trading something one presently possesses in the here-and-now vs. an agreement to do something in the future.\n\nIn (2), the drowning neighbor trades her house, in the here-and-now, with you. The trade is finalized upon the completion of you saving her life. If I'm drowning, and you hold a contract a foot above the water for me to sign away my house, I'm going to do it, and then I'm going to get out of the pool, get my keys, lock myself in my house, and tell you to fuck off. Want the house? Come and take it. Want somebody else to take it for you? You're going to need to prove the validity of the contract. Contracts are pieces of paper. They only hold legitimacy when other people recognize them. You appear to argue your stance only from a practical sense, while I argue it from a theoretical sense. In theory, (2) is a valid contract.\n\nI could just as easily claim that stealing your wallet is not a crime because, from a practical standpoint, you can't prove I stole it. An action is only a crime if a court/DRO/arbitrator/etc. recognizes it to be a crime.\n\n&gt; Contracts are pieces of paper.\n\nThis is not necessarily true, but you might have used it as a metaphor. All I mean to say is that it's just a piece of paper if you're the only person who recognizes it as valid. Unless you have the means to *physically* control and maintain control of my house, claiming ownership on paper does nothing, even if I do sign it.   &gt; I will save you if you transfer the title of your house to me,\" and your neighbor agrees, would this contract be upheld under anarcho-capitalist principles?\n\nShe could have misheard what he said.  There's insufficient evidence of agreement to prove the existence of a contract. I would like to discuss this question as a matter of theory, not practice. A murderer should be punished as a matter of theory, but in practice, murderers fail to be convicted.\n\nI could have just as easily said there was irrefutable video evidence of the events when I created the hypothetical situation. &gt; irrefutable video evidence\n\nHow exactly would that prove that she heard him?  You basically asked what I would say if was on the jury, and that's what I would say.\n\nYou can't expect law to make sense when it's totally divorced from reality.  The law of evidence is no more or less 'theoretical' than the law of contract, but it underpins it in practice, along with every other area of law.  If it is not possible to produce evidence to show that there is a contract, on a balance of probabilities, the court cannot look any further.\n\nThis is why two should write down agreements they want to be enforced - it serves as a record of the terms, and it provides the presumption that someone who has had the time to go through the terms carefully has indeed understood them, and therefore actually agreed to them.  I think that it can still be considered a contract made under duress, since the drowning person's choice is agree or die. The individual attempting to cash in on the other end of the contract (getting the house) would not owe anything or have committed a crime per se, but the contract would be void and I imagine the person who was trying to get the house would be ostracized to some extent for being a total asshole.\n\ntl;dr: Contracts made under duress are invalid. Duress can be imposed (the gun to the head) or exploited (the pool and the situation of \"immediate death vs contract\"). In the first, it is a crime, in the second, it is not.  These two facts make the duress claim problematic: (1) You are under no obligation to save your drowning neighbor. You could microwave some popcorn and watch her drown with no liability. (2) Your neighbor is better off alive without possession of her house than dead with possession of her house. (I understand the second fact is subjective; perhaps she would rather retain possession of her house for her heirs, but her revealed preference under the contract is that she values her life more than her house.)\n\nI do not own a house, but I would trade all of my possessions to be rescued. I would also trade all of my possessions to be rescued. I am sure that the neighbor is not committing a crime. However, I think that the circumstance \"agree to this contract or die\" is effectively the same as the one in the scenario with the gun pointed to the person's head; that is to say, the contract ought to be considered void.\n\nAnd anyway, the neighbor would still be ostracized, at least in part, for being an asshole and taking advantage of the drowning neighbor. &gt; I think that the circumstance \"agree to this contract or die\" is effectively the same as the one in the scenario with the gun pointed to the person's head\n\nThe difference between the drowning scenario vs. gun to the head scenario is that you didn't cause your neighbor to drown; you would create the gun to the head scenario.\n\nHow would you feel if you needed a rare emergency surgery, and the only qualified surgeon in the area asked for you to trade your house in exchange for the surgery?   I've had way too many of these kinds of conversations.\n\nstatist logic:\n\n* how would ancap deal with X. \n* That's not perfect, therefore ancap is invalid. \n* Refuse to admit the current state also doesn't perfectly handle X.\n\nedit: for bonus points make X needlessly complicated How does your comment relate to anything in this thread? your hypotheticals reminded me of many painfully boring conversations I've had with statists. I decided to distill them into 3 bullets since all statists use the same logic and are incapable of comparing ideologies objectively. I am an ancap. I do not want to use these cases to show anarcho-capitalism to be invalid. Instead, I wanted to discuss these \"edge cases\" with r/anarcho_capitalism to figure out arguments for/against each edge case because duress is a loosely-defined term. I did not think you were a statist and trying to invalidate ancapdom, my comment was on what your question evoked from my memory.\n\nhowever, I do not value hypothetical discussions of societies that do not exist. You cannot correctly predict something with so many moving parts, it's better to learn as you go along. &gt; however, I do not value hypothetical discussions of societies that do not exist. You cannot correctly predict something with so many moving parts, it's better to learn as you go along.\n\nI agree with your sentiment for entrepreneurial questions like \"Who builds the roads?\" \"Who funds the prisons?\" etc.\n\nBut my hypothetical was a legal question, more along the lines of \"Will murderers be punished?\" or \"If I build a log cabin in the woods, is it mine?\" Such questions can be answered using anarcho-capitalist principles without speculation.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ve1o/where_do_anarchocapitalists_draw_the_line_for/"
  }, {
    "id" : 37,
    "title" : "\"I think capitalism is the best socio economic  system to date\" ",
    "snippet" : "  All I see is the same, well-countered, statist arguments being pushed as answers to the claim OP makes. I'm feeling more and more disheartened by the mentality of people lately and I think it's worsening my depression... Hey, don't let the mainstream mentality depress you. There's a lot to be optimistic about as an Anarcho-Capitalist at this moment. We live in a world where it's getting more and more difficult for governments to spread their lies and propoganda because they can't regulate the internet. And for the same reason the liberty movement, on the contrary, is growing. Not to mention the markets, once we consume enough capital people will recognize the mess we are in and awake to the benefits of free markets.\n\nI'm postitive that the truth will prevail in the end and that our current societies based on violence will be replaced by societies based on the NAP and voluntary exchange. It might be 20 years or it might be 200 years, who knows, but in the meantime I'm going to have fun working against violence and for a free society.\n\nDepression is just mental pain. Pain is our friend, it shows us what to do and what not to do, think about it, if you put your hand in a fire you will feel pain. Is that bad? No! Pain motivates us to withdraw from damaging situations, to protect a damaged body part while it heals, and to avoid similar experiences in the future. That's the way we should view depressions. Make radical changes in your life to find out if you really are doing what you love and if you are living as free as you can. It's enough of an issue with governments limiting your freedom don't make it worse by limiting yourself even further with your own thoughts and actions. \"Depression is just mental pain. Pain is our friend...(the rest of the paragraph)\" Spoken like someone who doesn't have depression. Depression is an everyday thing for me and has been for the past 20 years. It won't go away and will pretty much be with me for the rest of my life.  ",
    "url" : "http://www.reddit.com/r/changemyview/comments/18ssrl/i_think_capitalism_is_the_best_socioeconomic/"
  }, {
    "id" : 38,
    "title" : "How government solved the healthcare crisis. ",
    "snippet" : "  Why does nobody talk about this shit?\n\nImagine how many lives we could save by freeing the healthcare market.\nThink of all the innovation we're missing out on. Imagine if healthcare was like the consumer electronics industry. Fuck. Because horizontal enforcement has people believing that holding your health for ransom by needing to turn a profit is the problem and that we're all in it together, blah blah blah. Shit, I can't even convincingly make a statist argument anymore. Who would build the roads!!? Where we're going, we don't even need roads! :D Who would build the roads!!? Where we're going, we don't even need roads! :D ",
    "url" : "http://www.freenation.org/a/f12l3.html"
  }, {
    "id" : 39,
    "title" : "Terrifying Video Demonstrates Bug-Sized Lethal Drones Being Developed By U.S. Air Force",
    "snippet" : "  Inexpensive, easy to use technology can be used by both sides...  Yeah this is kinda freaky, but honestly not really surprising.  This really isn't anything groundbreaking here, it's just a natural application of the continuing development of drone tech (read: fancy RC cars), robotics, and information technology.  \n\nDrone tech is quickly becoming available to the masses.  In a few years maybe you'll be able to toss a couple of handheld quad-copters that fire .22 and controlled with your iphone into the gunsafe...\n\nThe future is coming faster than anyone realizes, so get ready for it. Yeah this is kinda freaky, but honestly not really surprising.  This really isn't anything groundbreaking here, it's just a natural application of the continuing development of drone tech (read: fancy RC cars), robotics, and information technology.  \n\nDrone tech is quickly becoming available to the masses.  In a few years maybe you'll be able to toss a couple of handheld quad-copters that fire .22 and controlled with your iphone into the gunsafe...\n\nThe future is coming faster than anyone realizes, so get ready for it. Customized by your 3-D printer.",
    "url" : "http://www.mediaite.com/online/terrifying-video-demonstrates-bug-sized-lethal-drones-being-developed-by-u-s-air-force/"
  }, {
    "id" : 40,
    "title" : "If a voluntarist society emerged, do you think campus-socialists would claim it as validation of their views?",
    "snippet" : "Otherwise, assuming it were to emerge not through some philosophical mass-awakening, but through technological innovation and typical economic incentives (some sort of bitcoin scenario, for instance), what do you imagine the reaction would be like from the unsuspecting general public?     ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18vecw/if_a_voluntarist_society_emerged_do_you_think/"
  }, {
    "id" : 41,
    "title" : "Realistic transition to an an-cap society.",
    "snippet" : "So it's often said that socialism is simply the transition period before a true communist society can be realized. What would this transition period look like if society was progressing towards an an-cap society? And more importantly, can this even be obtained considering the America we live in now? \n\nI'm asking these questions because while anarcho-capitalism is an intriguing idea to think about, it's hard for me to see a realistic situation in which it could be realized.      The transition will come when one of the world's largest and more innovative corporations suddenly realizes it doesn't need the state to be secure, and can secure itself from the state.\n\nI'm betting on Google right now, but it could be another one that hasn't been created yet. The transition will come when one of the world's largest and more innovative corporations suddenly realizes it doesn't need the state to be secure, and can secure itself from the state.\n\nI'm betting on Google right now, but it could be another one that hasn't been created yet.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18uvu7/realistic_transition_to_an_ancap_society/"
  }, {
    "id" : 42,
    "title" : "The Political Enemy Is Politics Itself",
    "snippet" : "  Although I think the piece could be written more generally and neutrally, I did enjoy this line:\n\n&gt;It leads to open-ended, multidirectional social evolution heading wherever free men and women dare to go.",
    "url" : "http://www.everything-voluntary.com/2013/02/the-political-enemy-is-politics-itself.html"
  }, {
    "id" : 43,
    "title" : "Hayek defines Krugman in 1944",
    "snippet" : "&gt;That no single purpose must be allowed in peace to have absolute preference over all others applies even to the one aim which everybody now agrees come in the front rank: the conquest of unemployment. There can be no doubt that this must be the goal of our greatest endeavor; even so, it does not mean that such an aim should be allowed to donate us to the exclusion of everything else, that, as the glib phrase runs, it must be accomplished \"at any price.\" It is, in fact, in this field that the fascination of vague but popular phrases like \"full employment\" may well lead to extremely shortsighted measures, and where the categorical and irresponsible \"it must be done at all cost\" of the single-minded idealist is likely to do the greatest harm. \n\nF.A. Hayek. The Road to Serfdom: the definitive addition. p 213  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18u50a/hayek_defines_krugman_in_1944/"
  }, {
    "id" : 44,
    "title" : "Something terrible has happened politically in my state.  Please talk me out of getting involved in politics again and keep me on the ancap path...",
    "snippet" : "When Apple makes a bad product you don't write angry letters to Apple and organize meetings and argue and vote.  You just go buy a Samsung.  You get what you want right away with no fuss and no arguing.  \n\nIf my state does something stupid, then I should therefore just move states instead of trying to save it.\n\nI want to focus on growing my businesses.  Instead I keep wasting time arguing with people and getting angry about politics and things that I can never change.  \n\nDoes anyone have any inspirational reading to keep me from jumping back into politics?  nothing wrong with being involved in politics. Yes there is.  If you live surrounded by communists why should you waste time trying to change their minds? Yes there is.  If you live surrounded by communists why should you waste time trying to change their minds? ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18v78n/something_terrible_has_happened_politically_in_my/"
  }, {
    "id" : 45,
    "title" : "Care to pay a visit to /r/education?",
    "snippet" : "http://www.reddit.com/r/education/ seems like a bit of a circlejerk where users mostly complain about the poor quality of public \"education\", that there isnt more \"free\" public \"education\" (I know, wtf?) and how anyone evil enough (such people are clearly evil, and hate children and education) to not agree to their agenda is a shockingly stupid and poor excuse for a human being.\n\nIve posted a few modest libertarian replies, would be cool if more people could pick up the pen and try to illustrate our point of view on the subject *without* engaging in flaming, downvoting and overly aggressive circlejerking on our part.\n\n**Please no downvoting!**  Here's one I made earlier...\n\nhttp://www.reddit.com/r/Teachers/comments/18gmda/education_isnt_a_business/c8f6d0l You have quite good argumentation skills. I especially loved the line:\n\n&gt;The last time someone tried to \"not treat food production like a business\", 25 million people died of starvation.\n\nJust enough rhetoric to keep the attention while still backing your argument. Would be nice if we could leave the downvote brigade here though. There is nothing to be gained by that kind of behaviour. People will just feel alienated by the horde mentality such things tend to show.  Would be nice if we could leave the downvote brigade here though. There is nothing to be gained by that kind of behaviour. People will just feel alienated by the horde mentality such things tend to show.  Would be nice if we could leave the downvote brigade here though. There is nothing to be gained by that kind of behaviour. People will just feel alienated by the horde mentality such things tend to show.  Here's one I made earlier...\n\nhttp://www.reddit.com/r/Teachers/comments/18gmda/education_isnt_a_business/c8f6d0l Incredible, love it!  There is a lot of free education out there in this place called \"the internet.\" There's plenty of cheap education modules for valuable skills out there, also.\n\nWhat there's not are inexpensive services to brainwash your kid into becoming an unthinking automaton. Public education is doing what it's supposed to do: make your kid dumb, compliant, violent, and promiscuous. \n\nIt's going to be tough to persuade professional educators, because their continued employment requires that they ignore you. You'd have to offer them something more valuable than the cost to them. Luckily, as states are forced to cut budgets, perhaps more soon-to-be-unemployed educators will be interested in alternatives. We dont have to persuade anyone of these people, I dont see how we ever could. But it could be useful to point out to them that they are backing a system in which people are violently expropriated to fund what is essentially indoctrination camps.  I used to post on education forums to just try and start discussion about unschooling and natural learning... it almost never works out. I know that is not what you are talking about but I just get frustrated. \n\nThese people only see their way. They can't imagine it any other way. I remember when I was substituting and the first day I realized \"this whole system is fucked and I was totally right in hating it as a kid\" by the 20th time I substituted I felt the same. It's pretty hard to convince people of a position which undermines their way of life.   &gt;In business, you dump out the bad products. Do you dump out the bad kids?\n\nThis is the mentality that evidences an underlying problem with many educators. Seems to me like this is a gross misunderstanding and subsequent nonsensical oversimplification. If there is a demand for educating \"bad kids\", then there will be entities which compete to do so and in the long run generally only the successful ones will be employed for this purpose.  I've seen some of your comments in there, good work.   Ok I tried out a post.   I'm sure I'll be banned and down-voted to minus infinity for this, but fine, I'll give it a shot.\n\nhttp://www.reddit.com/r/education/comments/18u6oa/counter_intuitive_thoughts_about_teacher_pay/  Holy shiiiiiit lets see how this ends up\n\nhttp://www.reddit.com/r/education/comments/18usjd/school_sucks_the_american_way/ ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/18ti1e/care_to_pay_a_visit_to_reducation/"
  }, {
    "id" : 46,
    "title" : "The Libertarienne Show with Jeffrey Tucker @ ISFLC 2013",
    "snippet" : "     ",
    "url" : "http://www.youtube.com/watch?v=yPUnfmuNQhI"
  }, {
    "id" : 47,
    "title" : "NYC government suing Hasidic Jews for posting modesty guidelines in privately owned shops ",
    "snippet" : "  \"Take that, hated minority! We shan't have any of your misogynist Jew scheming here in good Brooklyn! Our proud womyn can waltz into any store they like in a halter top!\"\n\nAs someone from Brooklyn who disdains the Hasidic community for various reasons, I defend their right to discriminate against customers for any reason that they choose. The guidelines applied to men too. If you notice, the Hasidic men must dress \"modestly\" as well. I see them walking around in full suit in the scalding heat of summer all the time.\n\nI'm not sure if it's an attempt to keep non-Hacids out of their shops. It might be, but frankly, I don't really care. \"Take that, hated minority! We shan't have any of your misogynist Jew scheming here in good Brooklyn! Our proud womyn can waltz into any store they like in a halter top!\"\n\nAs someone from Brooklyn who disdains the Hasidic community for various reasons, I defend their right to discriminate against customers for any reason that they choose. So, \"whites only\" would be cool with you, too? Yes.\n\nAnd I doubt very many people would go to that store and it would close, but the owner should be able to do what he wants with his private property so long as he isn't harming others.  We have to let people make the wrong decisions in a free society. Yes.\n\nAnd I doubt very many people would go to that store and it would close, but the owner should be able to do what he wants with his private property so long as he isn't harming others.  We have to let people make the wrong decisions in a free society. Inspired by Rand Paul there? Yes, Rand Paul invented the neo-con idea that people, and not their government, should be in control of their own property. I don't think he did (not so sure the neo-cons are the origin for that matter, either), but your explanation sounded like his almost verbatim. It's a standard answer to a terrible strawman that's been running around for the last few decades. So, \"whites only\" would be cool with you, too? I'd find it distastful. I'd discriminate against the shop. But property owners have rights to exclude people from their premises for whatever reason. [premises]  So dress codes and conduct guidelines don't fly on private property anymore. I guess we'll see what happens when someone disrobes and takes a shit in the middle of a fancy NYC three Michelin star restaurant. In Manhattan, this becomes \"Art\" and gains another star.   If the city of New York is allowed to have dress code rules in public places, in example no \"nakedness/indecency\" then these citizens have that same right.\n\nThe government is given its ability to rule \"by the people\" therefore if these Hasidic Jews don't have the ability to have modesty guidelines, neither does NYC. &gt;The government is given its ability to rule \"by the people\"\n\nThat's how the claim goes, but it isn't true.   [deleted] On what basis do you distinguish between \"no Irish\" being inappropriate but \"no one who is dressed like a slob\" being a valid reason to exclude someone from your property? Try walking into a fancier restaraunt that requires at a minimum a business casual dress code when you're wearing ripped jeans and a stained wife beater and use that argument when they refuse to seat you. Or even try getting a burger at a McDonald's with a no shirt, no shoes, no service sticker in their window when you're wearing neither a shirt nor shoes. [deleted] Freedom of association, that is the freedom to associate with whomever people wish to associate with based on whatever criteria they feel is appropriate, is generally esteemed as an an-cap principle. The government has no right to dictate who people choose to do business with. \"No Irish\" may be quite distasteful, however in a truly free society it is the prerogative of free people to harbor such sentiments. \n\nHere is a short chapter from Milton Friedman's book (Capitalism and Freedom) entitled Capitalism and Discrimination that you may find to be of profit. It is clearly somewhat dated (pre-passage of Pub.L. 88352, 78 Stat. 241) but the principles ought still stand: \n\n**[Capitalism and Discrimination](https://www.dropbox.com/s/272wecgwgogx9ss/Capitalism%20and%20Discrimination.pdf)** I am loving the delicious irony of the freedom of association being advocated by \"Deuteronomy\". Here's a short essay a friend wrote a couple of years ago: [The Abrahamic Legacy: The Jewish Ideal of Freedom](http://www.lewrockwell.com/orig11/oberstein1.1.1.html) I also love the delicious irony of people who believe in God (with no evidence aside from the authority of religious texts and religious leaders) advocating mental autonomy.\n\n&gt;Man was given a mind to be able to relate to reality and subsequently to God\n\nFucking lol.\n\nI can't say I'm upset when I see religious people advocating anarchist philosophy, but I have to marvel at the mental gymnastics involved. Though most do, there are many who affirm theism without reliance upon religious texts/leaders - I don't see such efforts as exhibited in this short article as mental gymnastics but rather as genuine attempts by regular folks to understand. Frankly though, I have no desire to debate the issue with you - I am simply glad that we both cherish and uphold the tenets of freedom. \n\nEdit: left out a letter.  [deleted] ",
    "url" : "http://www.haaretz.com/jewish-world/jewish-world-news/new-york-city-suing-ultra-orthodox-for-posting-modesty-guidelines-in-stores.premium-1.503804"
  }, {
    "id" : 48,
    "title" : "Who will build the roads?",
    "snippet" : "   I don't think the roads argument is supposed to be about it being physically difficult or costly to build roads, but simply a matter of people not understanding how you can get all that land ownership without eminent domain and seeing it as something that should be \"free\" (i.e. paid in taxes). I think it's more about the free rider problem, spatial monopolies, and the inconvenience of tolls. Anyways, it was a joke =/ humor is not allowed &lt;robot voice&gt; ",
    "url" : "http://i.imgur.com/YjZEPMe.jpg"
  }, {
    "id" : 49,
    "title" : "How Capitalism Creates The Welfare State",
    "snippet" : " ",
    "url" : "http://dish.andrewsullivan.com/2013/02/19/how-capitalism-creates-the-welfare-state/"
  } ],
  "processing-time-source" : 89,
  "processing-result.title" : "anarcho_capitalism2_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/anarcho_capitalism2_reddit.xml"
  }
}