{
  "processing-time-total" : 1812,
  "clusters" : [ {
    "id" : 0,
    "size" : 6,
    "score" : 66.50484168324023,
    "phrases" : [ "Property Rights" ],
    "documents" : [ 3, 13, 19, 21, 34, 43 ],
    "attributes" : {
      "score" : 66.50484168324023
    }
  }, {
    "id" : 1,
    "size" : 5,
    "score" : 61.03601992633624,
    "phrases" : [ "Profit" ],
    "documents" : [ 9, 13, 21, 25, 48 ],
    "attributes" : {
      "score" : 61.03601992633624
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 47.869412722072454,
    "phrases" : [ "YouTube" ],
    "documents" : [ 5, 7, 21, 32, 48 ],
    "attributes" : {
      "score" : 47.869412722072454
    }
  }, {
    "id" : 3,
    "size" : 4,
    "score" : 67.53190221415049,
    "phrases" : [ "Black" ],
    "documents" : [ 0, 17, 23, 33 ],
    "attributes" : {
      "score" : 67.53190221415049
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 73.54879087857232,
    "phrases" : [ "Homestead Land" ],
    "documents" : [ 1, 3, 13, 19 ],
    "attributes" : {
      "score" : 73.54879087857232
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 41.51323652923591,
    "phrases" : [ "Price" ],
    "documents" : [ 13, 22, 26, 36 ],
    "attributes" : {
      "score" : 41.51323652923591
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 56.37848982273892,
    "phrases" : [ "Reading List" ],
    "documents" : [ 12, 19, 21, 33 ],
    "attributes" : {
      "score" : 56.37848982273892
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 78.36373117550856,
    "phrases" : [ "Economy" ],
    "documents" : [ 13, 14, 38 ],
    "attributes" : {
      "score" : 78.36373117550856
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 69.31559463183702,
    "phrases" : [ "Education and Welfare" ],
    "documents" : [ 0, 17, 19 ],
    "attributes" : {
      "score" : 69.31559463183702
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 48.98500394722214,
    "phrases" : [ "Language" ],
    "documents" : [ 19, 45, 49 ],
    "attributes" : {
      "score" : 48.98500394722214
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 63.587042667586836,
    "phrases" : [ "Listen to the Video" ],
    "documents" : [ 21, 35, 45 ],
    "attributes" : {
      "score" : 63.587042667586836
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 44.97610551145729,
    "phrases" : [ "Safety" ],
    "documents" : [ 17, 41, 43 ],
    "attributes" : {
      "score" : 44.97610551145729
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 136.43079371971103,
    "phrases" : [ "Tax Revenue" ],
    "documents" : [ 19, 21, 48 ],
    "attributes" : {
      "score" : 136.43079371971103
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 53.839212828538855,
    "phrases" : [ "Unemployment" ],
    "documents" : [ 15, 17, 27 ],
    "attributes" : {
      "score" : 53.839212828538855
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 43.41343341753955,
    "phrases" : [ "Anarcho Capitalism" ],
    "documents" : [ 13, 45 ],
    "attributes" : {
      "score" : 43.41343341753955
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 112.63388051003226,
    "phrases" : [ "Defense Firms" ],
    "documents" : [ 3, 21 ],
    "attributes" : {
      "score" : 112.63388051003226
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 61.180686318477846,
    "phrases" : [ "Destroyed" ],
    "documents" : [ 24, 33 ],
    "attributes" : {
      "score" : 61.180686318477846
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 45.887820540991314,
    "phrases" : [ "Experiment Happened to see how People Justify" ],
    "documents" : [ 21, 28 ],
    "attributes" : {
      "score" : 45.887820540991314
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 110.65310216783506,
    "phrases" : [ "Road Crews" ],
    "documents" : [ 21, 48 ],
    "attributes" : {
      "score" : 110.65310216783506
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 107.88785679238534,
    "phrases" : [ "Robert P. Murphy" ],
    "documents" : [ 2, 18 ],
    "attributes" : {
      "score" : 107.88785679238534
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 87.77103714435133,
    "phrases" : [ "Set of Intro Liberty Packages" ],
    "documents" : [ 17, 21 ],
    "attributes" : {
      "score" : 87.77103714435133
    }
  }, {
    "id" : 21,
    "size" : 17,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 4, 6, 8, 10, 11, 16, 20, 29, 30, 31, 37, 39, 40, 42, 44, 46, 47 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1721,
  "documents" : [ {
    "id" : 0,
    "title" : "A couple more questions for you guys...",
    "snippet" : "I was here a day or two ago with a couple of questions regarding education and welfare, which I was happily answered, and for that, I thank you guys, because you are the best. So I'm here with just a couple more questions that you will hopefully answer.\n\n1. Is there any real example of Anarcho-Capitalism taking place in any place in any time? I don't mean *close*, as in less government, I mean truly no government and people living in a productive, capitalistic society with Anarchism.\n2. How will any country turn from what it is to Anarcho-Capitalism? Will it be sudden or not? What will happen if it *is* sudden?\n3. What about currency? I don't think a bartering system would work entirely well in a capitalistic society, or at least like one to the scale of the US or any first world country, without a central currency. Would there be any tools, like the internet, that would decentralize it like BitCoins? How would somebody go about making a completely decentralized currency in an Anarcho-Capitalist society?\n4. What would the court system be like? If somebody breached a contract or stole, who would be on the case, and would jails be privatized? How would we know if they are treating the prisoners fairly or not? And, also, if courts were privatized, how would we know if THEY were fair?  1. For data points comparing measures of productivity and 'societal success' to economic freedom (i.e. freedom from state/king control), all of recorded human history should probably be fair game for analysis. Of course, the answers that come from that analysis may not be as black and white as you would prefer, which I can appreciate; it may not *feel* as satisfying to correlate measures of economic freedom with quantity of trade, quality of life, and the level of innovation over time and region. Certainly, there are some nice examples in certain fields, in certain industries, and even entire times and places, but rather than bore you with history and data, I would proffer a more current example. Of course, I am biased, but the internet seems pretty anarcho-capitalistic to me.\n2. *Hang on, let me get my tarot cards. They're down in my basement.*\n3. You are correct, a currency is a great tool that helps people surmount the limitations in barter! (As far as I know, you do not need a monopoly on force to create a currency.)\n4. I don't know, but I've never heard a better explanation than what [Dr. David Friedman provides here.](http://youtu.be/jTYkdEU_B4o) That video at the end got me so excited because I realized how awesome of a system that would be! But thank you for your response, and I realize now that there can be more than one currency in a country, but what happens with currency creation? Would currency be a business as well? How would that play out? Currency is no different than any other product or service. It's value is subjectively determined by the people using it. If they have reason to believe that the issuer of the currency is not managing it properly, they will simply switch to something different and the currency will die. \n\nBTW, I doesn't make a whole lot of sense to ask how something *would* happen. No one will be able to definitively answer the question. Best anyone can do is offer possibilities about what *might* happen but they will never be anything other than guesses.    ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17o11w/a_couple_more_questions_for_you_guys/"
  }, {
    "id" : 1,
    "title" : "How can one reconcile the homesteading principle with a communities desire for environmental preservation?",
    "snippet" : "    Untouched nature is a valuable commodity, as people will spend a lot of money to visit it.\n\nThe real question is how do you claim an area of land without actually using it to grow crops or to build on?  Untouched nature is a valuable commodity, as people will spend a lot of money to visit it.\n\nThe real question is how do you claim an area of land without actually using it to grow crops or to build on?  I would say that by patrolling and putting signs on a particular piece of land, that is laying claim to it. Of course patrolling a vast area to ensure nobody trespasses on it would be quite difficult and expensive, but thats the purpose of the homesteading principle. If we just allow people to arbitrarily claim land, enforced after the fact through violence, then we haven't escaped todays system. Therefore people can homestead a piece of forest by hiring a guard every 50 feet to patrol the edge of the forest. If someone doesn't want to invest that, then the land is available for others to homestead. I suppose it is possible that people could homestead land for one purpose and then when it is no longer useful for that purpose (such as some natural resource like coal running out) they could sell it on to someone who would use it as a nature reserve or holiday destination. Why would you think that something had to be done on the land first (e.g. coal mining)? it seems obvious to me, just put up a fence and stop people from crossing it. But you also said\n&gt;If we just allow people to arbitrarily claim land, enforced after the fact through violence, then we haven't escaped todays system\n ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17om6w/how_can_one_reconcile_the_homesteading_principle/"
  }, {
    "id" : 2,
    "title" : "Consumer Protection: Government vs Market Regulation | Peter G. Klein and Robert P. Murphy ",
    "url" : "http://www.youtube.com/watch?v=GM2ZMhjyT0U"
  }, {
    "id" : 3,
    "title" : "VIDEO: David Friedman on \"Law Without The State\"",
    "snippet" : "    [deleted] [deleted] What happens when more than one person makes a claim on the same land? [deleted] You've just described my entire theory of rights. \n\nHow can two people agree on what rights each other have? They will fight, agree (whether just between the two of them or with outside help), or disengage from one another. For those who seek to avoid fighting, and most people do, we will choose one of the other two options; for everyone else, we have both personal defense and defense with help from others (e.g. friends, neighbors, a hired defense firm, etc.). *lifeishowitis* linked to this article that supports your theory and indicates that property is an evolutionary adaptation humans and other animals have developed to reduce conflict that arises from competition over scarce resources. \n\n[The property ‘instinct’](http://rstb.royalsocietypublishing.org/content/359/1451/1763.full.pdf#page=1) [deleted] Fighting for land is the initiation of force... you are breaking the non-aggression principle. Working it out among themselves might not be good for future generations. And arbitrator have a bias towards their own views. Someone who homesteads a piece of land and then fights off a trespasser is 'fighting for the land', but is not (under a private propertarian view of property) initiating force. As far as I can tell, it means threatening to shoot anyone who tries to use what you have decided is 'yours'... which isn't very non-violent. Nor very different from statism of some sort. You've not \"decided\" that it's yours, you're working with homesteading theory. As far as I can tell, it means threatening to shoot anyone who tries to use what you have decided is 'yours'... which isn't very non-violent. Nor very different from statism of some sort. It *is* violent, but it *isn't* the *initiation* of violence. Very different from  statism, which only maintains authority via *initiations* of violence.  It just seems to me that you are initiating force by saying this is mine and not ours... It would be if I didn't add the parenthetical \"(under a private propertarian view of property)\". What happens when more than one person makes a claim on the same land? [David Friedman explained how animals resolved this in the video.](https://www.youtube.com/watch?feature=player_detailpage&amp;v=vSrf9j2pvmU#t=100s) Territorial animals don't consider themselves equals... there is an alpha and then there is the rest. I don't see the possibility to have a society that supports personal equality and property rights as we know them.",
    "url" : "https://www.youtube.com/watch?v=vSrf9j2pvmU"
  }, {
    "id" : 4,
    "title" : "Economics of Risk and Insurance: From Healthcare to Welfare | Hans-Hermann Hoppe",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=isWQWbpXNR8"
  }, {
    "id" : 5,
    "title" : "A Great Youtube Playlist on WW2 from an Austo-lib Perspective",
    "snippet" : "    Why is this man nude chested in some of the videos... ? He works out of state so he spends a lot of time in hotel rooms. I guess he just wakes up and decides to do video's without getting ready. I have another theory, but I'm not sure it's appropriate, lol.  [deleted]",
    "url" : "http://www.youtube.com/playlist?list=PL5vgLO9OEuDmh0pBQQLTWQFDUE0lSd6og"
  }, {
    "id" : 6,
    "title" : "Before the statists erase it...",
    "snippet" : "  I have that shirt I have that shirt I have that shirt me too :D but I ordered slightly too big. In america L size means european XL probably.   [deleted] yes [deleted]",
    "url" : "http://imgur.com/tt6mTBC"
  }, {
    "id" : 7,
    "title" : "Hans-Herman Hoppe: On Habitual Immoralists and Democratic Government - YouTube",
    "url" : "http://youtu.be/b4EGi2Re0EY"
  }, {
    "id" : 8,
    "title" : "Very Important Economic Info from Garett Jones",
    "url" : "http://econlog.econlib.org/archives/2013/01/wasteful_hiring.html"
  }, {
    "id" : 9,
    "title" : "Are Profits Evil? | Panel Duscussion",
    "snippet" : " ",
    "url" : "http://youtu.be/VPukFYAQ4fU"
  }, {
    "id" : 10,
    "title" : "On becoming an illegal immigrant... [x-post from Political Discussion]",
    "snippet" : "  This is a thought I had which evokes some An-Cap tendencies that may illustrate how illegal immigration could be a boon for An-Cap ideas in practice. I've started this with some minor success. if anyone is serious in doing this (it's risky), I would suggest reading up on [Marc Stevens here](http://marcstevens.net/)\n\nSo a few weeks ago i was stopped by a cop for speeding. I told him I wasn't a citizen of his state. He asked me what state I was from and I told him none. He asked me if i was a US citizen and I said no. I was a bit scared with those answers, but I didn't get arrested.  Seriously?  You're putting me on... I'm serious. Besides, why would it surprise you if you just got done saying that your linked article could be a good idea for ancaps? I have seen this idea in a different format and I am actually trying to do it. Perhaps you thought we were all sitting on our butts, just playing make-believe anarchist? :) I don't know how to respond to that.  Think whatever you want about my motives.  Thanks for the info. lol...what is so shocking to you? You sound like I'm crazy for exerting my individualism. If the american forefathers didn't have the backbone to challenege the notion that they weren't subjets to a king, then the US would never have been created.",
    "url" : "http://www.reddit.com/r/PoliticalDiscussion/comments/17nvdk/on_becoming_an_illegal_immigrant/"
  }, {
    "id" : 11,
    "title" : "David Friedman, in the Machinery,shows that life is not the ultimate social value (as in taxation isn't justified by life-saving government spending like healthcare). I thought that this video summed it up well - Lonely Island, YOLO",
    "url" : "http://www.youtube.com/watch?feature=player_embedded&amp;v=z5Otla5157c"
  }, {
    "id" : 12,
    "title" : "Libertarian / Austrian Econ / AnCap reading list",
    "snippet" : "Hi everyone, \n\nI've been around /r/Anarcho_Capitalism for quite some time now, do have some fairly good understanding of Austrian Economics, Libertarian Philosophy and the ideas behind Anarcho-Capitalism ...\n\nAs I don't have that much to do in February, I was wondering if you could give me some leads as to *advanced* topics in the fields mentioned above. I've already read some books/essays from Menger, Mises, Hayek (the socialist ;), Rothbard, Hoppe, several other weblogs, some academic papers (QJAE for the win)...\n\nDear redditors, could you give me some more leads to *interesting* topics to pursue?\n\nBest,\nsky  I would read David Friedman's *Machinery of Freedom* available online his website for free. I would link to it but I'm on my phone. It's a more middle-of-the-road approach to being an ancap.  I would read David Friedman's *Machinery of Freedom* available online his website for free. I would link to it but I'm on my phone. It's a more middle-of-the-road approach to being an ancap.  I would read David Friedman's *Machinery of Freedom* available online his website for free. I would link to it but I'm on my phone. It's a more middle-of-the-road approach to being an ancap.        [Libertarian Media/News Sources](http://www.reddit.com/r/Anarcho_Capitalism/comments/16vttz/where_do_you_guys_go_for_libertarianrelated/)\n\n*Other Resources:* *and Common Reading List:*\n\n[Link 1](http://www.reddit.com/r/Anarcho_Capitalism/comments/euv0p/looking_for_books_to_get_into_ancap/)\n\n[Link 2](http://www.reddit.com/r/Anarcho_Capitalism/comments/gbxqb/what_are_some_recommended_books_on/)\n\n[Link 3](http://www.reddit.com/r/Anarcho_Capitalism/comments/rhp0z/what_are_you_favorite_ancap_books_and_why/)    ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17mjqe/libertarian_austrian_econ_ancap_reading_list/"
  }, {
    "id" : 13,
    "title" : "The Well-Tempered Anarchist | The American Conservative (Some dismissive mentions of anarcho capitalism)",
    "snippet" : "  &gt;Contrary to the atomic individualism that underlies much contemporary “free market” political economy, Scott insists that individuals are significantly shaped by the framework of social institutions in which they conduct their lives. Human beings were never the atomic individuals of neoclassical economics, but its hegemony is making them more and more resemble its assumptions about them:\n\nI hate this angle.  For some reason, everyone seems to think ancaps imagine a world where every man is an island.  This is basically the extreme opposite of our view.  The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone.  Exchange is mutually beneficial and we want it everywhere and unburdened by third parties.  We love society!\n\nAlso...  what is his argument anyway?  \"Humans always existed in groups, thus groups have dominion over humans\"  Do you think anyone who makes this type of argument would argue for forced mating eugenics programs because the 'benefit the collective\"? (well I know they *did* argue that, but thankfully Hitler showed everyone where that level of commitment to the \"collective\" gets us.) I'm so tired of this argument myself for the reasons you stated.\n\nAlso, this:\n\n&gt;Further, the neoliberal celebration of the individual maximizer over society, of individual freehold property over common property, of the treatment of land (nature) and labor (human work life) as market commodities, and… cost-benefit analysis (e.g. shadow pricing for the value of a sunset or an endangered view) all encourage habits of social calculation that smack of social Darwinism.\n\nWhenever I hear an anarchist use \"social darwinism\" in response to ancap I immediately move on. &gt;Contrary to the atomic individualism that underlies much contemporary “free market” political economy, Scott insists that individuals are significantly shaped by the framework of social institutions in which they conduct their lives. Human beings were never the atomic individuals of neoclassical economics, but its hegemony is making them more and more resemble its assumptions about them:\n\nI hate this angle.  For some reason, everyone seems to think ancaps imagine a world where every man is an island.  This is basically the extreme opposite of our view.  The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone.  Exchange is mutually beneficial and we want it everywhere and unburdened by third parties.  We love society!\n\nAlso...  what is his argument anyway?  \"Humans always existed in groups, thus groups have dominion over humans\"  Do you think anyone who makes this type of argument would argue for forced mating eugenics programs because the 'benefit the collective\"? (well I know they *did* argue that, but thankfully Hitler showed everyone where that level of commitment to the \"collective\" gets us.) &gt;Contrary to the atomic individualism that underlies much contemporary “free market” political economy, Scott insists that individuals are significantly shaped by the framework of social institutions in which they conduct their lives. Human beings were never the atomic individuals of neoclassical economics, but its hegemony is making them more and more resemble its assumptions about them:\n\nI hate this angle.  For some reason, everyone seems to think ancaps imagine a world where every man is an island.  This is basically the extreme opposite of our view.  The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone.  Exchange is mutually beneficial and we want it everywhere and unburdened by third parties.  We love society!\n\nAlso...  what is his argument anyway?  \"Humans always existed in groups, thus groups have dominion over humans\"  Do you think anyone who makes this type of argument would argue for forced mating eugenics programs because the 'benefit the collective\"? (well I know they *did* argue that, but thankfully Hitler showed everyone where that level of commitment to the \"collective\" gets us.) &gt; The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone\n\nThe main problem with this is that only the \"struggling to advance our own interests\" is guaranteed.  Making the world a better place is not guaranteed and unproven in practice, not to mention decidedly untrue in theory in many cases outside the broadest macro scale and longest time-frame. That's not the case.  As the anarcho-capitalist framework is based upon struggling to advance your own interests without harming other people or their property, you can only advance those interests by, at the very least, not hurting anyone else, and more easily by helping them in a co-operative manner such as trade. &gt;  As the anarcho-capitalist framework is based upon struggling to advance your own interests without harming other people or their property, \n\nI wouldn't say that's accurate.  More accurate would be \"without committing violent or coercive acts against other people or their property.\"  I would say putting someone else out of business through other means is doing them harm directly.  You might argue that this helps society as a whole, but again, this is unproven. That's not the case.  As the anarcho-capitalist framework is based upon struggling to advance your own interests without harming other people or their property, you can only advance those interests by, at the very least, not hurting anyone else, and more easily by helping them in a co-operative manner such as trade. There are two ways that 'struggling to advance my interests' can make life worse for others.\n\n1)  As HarmDiss notes, my success will make things worse for my competitors.  I think it is obvious that the gains to everyone else in society from competition vastly outweigh this effect, but it seems true none the less.  \n\n2)  Land ownership.  When I fence off arable land, I remove the opportunity for you to do the same.  I may add something valuable, but I also subtract.  When I harvest ore from the ground, I add the opportunity of easily accessed ore to the world (though under my control), but I subtract the same quantity of unowned *in situ* ore.  This problem of taking away opportunities may not violate the NAP, but it certainly can make others' lives worse at the expense of my self-interested activity. Both instances you refer to are not instances of making life worse for others.  In fact, in both cases, the others lives have not changed.  The only way this would count as \"making life worse for others\" is to presume a constant baseline for the future, denying that it is uncertain and unknown. In each case, the other person's life would be better if you never existed. &gt; The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone\n\nThe main problem with this is that only the \"struggling to advance our own interests\" is guaranteed.  Making the world a better place is not guaranteed and unproven in practice, not to mention decidedly untrue in theory in many cases outside the broadest macro scale and longest time-frame. When I offer a service to you for $n, I profit n minus whatever value below that would make it not worth my time and you profit whatever the most you would pay for the service is minus n.  I build, sell, deliver, teach, learn, advertise... in order to reap the profits of my activity.  In doing so, I benefit the lives of everyone I exchange with.\n\nYou live in a world where the average man has luxuries that would shame kings just a century ago.  It wasn't a non-profit initiative that led to your advanced personal plumbing and electricity.  It wasn't a charitable organization that subsidized research, development, and manufacture of personal communication devices that nearly everyone in the country can carry wherever they go.  The vast majority of your day is spent enjoying and benefiting from things that are the result of millions of selfish individual decisions bumping into each other across time. \n\nOn a different note, the global poverty rate has been [cut in half](http://media.economist.com/sites/default/files/imagecache/full-width/images/2012/02/blogs/graphic-detail/20120303_WOC674.gif) over the past 30 years.  There are a billion different factors going into that change, but the liberalization of the Asian economy seems the most obvious and powerful.  You an-caps can't simultaneous claim all the beneficial aspects of our current socio-economic system as \"an-cap\" while deriding all the negative aspects as \"evil corporatism.\"  At best, such a claim is an unproven theory and so I stand by my original comment.\n\nMoreover, claiming all technological progress as the fruit of capitalism is equally absurd.  You could equally well attribute it to the state.  I prefer to see it as what it is: humans pursuing scientific breakthroughs for the sake of science. &gt;Contrary to the atomic individualism that underlies much contemporary “free market” political economy, Scott insists that individuals are significantly shaped by the framework of social institutions in which they conduct their lives. Human beings were never the atomic individuals of neoclassical economics, but its hegemony is making them more and more resemble its assumptions about them:\n\nI hate this angle.  For some reason, everyone seems to think ancaps imagine a world where every man is an island.  This is basically the extreme opposite of our view.  The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone.  Exchange is mutually beneficial and we want it everywhere and unburdened by third parties.  We love society!\n\nAlso...  what is his argument anyway?  \"Humans always existed in groups, thus groups have dominion over humans\"  Do you think anyone who makes this type of argument would argue for forced mating eugenics programs because the 'benefit the collective\"? (well I know they *did* argue that, but thankfully Hitler showed everyone where that level of commitment to the \"collective\" gets us.) &gt;Contrary to the atomic individualism that underlies much contemporary “free market” political economy, Scott insists that individuals are significantly shaped by the framework of social institutions in which they conduct their lives. Human beings were never the atomic individuals of neoclassical economics, but its hegemony is making them more and more resemble its assumptions about them:\n\nI hate this angle.  For some reason, everyone seems to think ancaps imagine a world where every man is an island.  This is basically the extreme opposite of our view.  The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone.  Exchange is mutually beneficial and we want it everywhere and unburdened by third parties.  We love society!\n\nAlso...  what is his argument anyway?  \"Humans always existed in groups, thus groups have dominion over humans\"  Do you think anyone who makes this type of argument would argue for forced mating eugenics programs because the 'benefit the collective\"? (well I know they *did* argue that, but thankfully Hitler showed everyone where that level of commitment to the \"collective\" gets us.) &gt;Contrary to the atomic individualism that underlies much contemporary “free market” political economy, Scott insists that individuals are significantly shaped by the framework of social institutions in which they conduct their lives. Human beings were never the atomic individuals of neoclassical economics, but its hegemony is making them more and more resemble its assumptions about them:\n\nI hate this angle.  For some reason, everyone seems to think ancaps imagine a world where every man is an island.  This is basically the extreme opposite of our view.  The core insight that leads people to anarcho-capitalism is that by struggling to advance our own interests, we make the world a better place for everyone.  Exchange is mutually beneficial and we want it everywhere and unburdened by third parties.  We love society!\n\nAlso...  what is his argument anyway?  \"Humans always existed in groups, thus groups have dominion over humans\"  Do you think anyone who makes this type of argument would argue for forced mating eugenics programs because the 'benefit the collective\"? (well I know they *did* argue that, but thankfully Hitler showed everyone where that level of commitment to the \"collective\" gets us.) Not just Hitler.  Forced sterilizations were legal in the United States until very recently. The last occurring in the 1960s.  Society has always balanced the needs of the indivudal against the needs of the many, and at various points, at least relative to society today, it's veered wildly in both directions.\n\nI think the major criticism with ana-caps is their rosy assessment of what pure individual freedom would mean. As I've told ana-caps before, the nearest analogy to their society is feudalism or the manorism it grew out of.  Serfs didn't start out as slaves, they started out as voluntary fealty to a manor lord who protected them, fed them, and sheltered them on their land in exchange for work.  It was a stateless voluntary society of private property.  It was also pretty damn oppressive.  While in theory you could just change manor lords if you didn't like the conditions, in practice it wasn't very practical.  Just like most people today don't totally upend their lives to move half way across the country even without the threat of starvation or murder. &gt;As I've told ana-caps before, the nearest analogy to their society is feudalism or the manorism it grew out of. Serfs didn't start out as slaves, they started out as voluntary fealty to a manor lord who protected them, fed them, and sheltered them on their land in exchange for work...\n\nI'm a Georgist so I am pretty partial to this critique.  However, I want to play a bit of devil's advocate.\n\nSpencer Heath, the advocate of \"[proprietary communities](http://en.wikipedia.org/wiki/Proprietary_community)\" and major influence on Rothbard's approach to land used modern hotels, shopping-malls, and longer term lease-based housing as a model rather than feudalism.  The landlord offers services like security, maintenance and cleaning of the \"commons\", establishing basic guidelines of dispute management and behavior...  This is the product offered by the landlord and his ability to extract unacceptable liberty concessions is limited by competing landlords. \n\nAnglo-Saxon England following the fall of rome and preceding the Norman conquest is Heath's favorite example of a similar system historically.  Land lords advertised for inhabitants and offered protection and services in exchange for rent.  Landowners founded communities, competed for inhabitants by establishing different services and allowing greater and greater private liberties in the charters that outlined the terms of the \"citizenship\" agreement.  People actively moved to join the founder cities.  Life was pretty good in these communities.  \n\nNow imagine how much better this system can work in a post-agrarian society.  Apparently there is a lot of pressure on New York City to change its lease/rental regulations to allow the growing trend of professionals living in hotel-like communities with little closet rooms and common spaces for all other activities.  I have some serious problems with land ownership, but the land-slavery historically associated with feudalism probably isn't the best model of where enclosure will lead us. Georgism is literally feudalism with a democratic veneer.  I, as an individual, must pay quitrents (usually based on some sort of auction bidding, which presumes the state itself is the owner) to the state or \"community\", in exchange for being allowed to use the land.  This state is democratic and \"limited\", though, so it is supposedly OK.  As far as I can tell, the only difference between this and the actual feudalism that was attempted in the British colonies in America was that there the payments were supposed to be made to oligarchs granted the colony by the King (usually, they were evaded instead) - in both cases, the payments were supposedly used in the best interests of the entire populace, though.  Just like your taxes today.\n\nAnarcho-capitalism is as far away as possibly removed from feudalism - the greatest sin of feudalism was that the State determined who would own the land, and literally *stole it* from the serfs and peasants that homesteaded and worked the land.\n\nThe problem is confusing a landlord - which can never be truly eliminated without a socialist inability to economically use scarce resources - with a feudal lord, who has an arbitrary and unjust claim to vast swaths of land granted to him by the state. That's not how feudalism works at all.  Feudal estates where not \"the state.\"  There was no state. They eventually became \"states\" as a few manor owners ended up with all the property and then they called themselves \"King.\"  But their roots were as private manor owners *hundreds of years before.*  That's the thing about unrestricted private property, it tends to collect in the hands of a few over time for all kinds of reasons just like unrestricted capitalism.\n\nIf your neighboring manor lord comes on hard times, you could leverage the situation to take his property and then let him live there as a vassal that owes fealty to you.  After a few hundreds years of this stuff (and warfare and marriages) one person ends up with all the property until *everyone* is a vassal.  Once *everyone* is a vassal to one person, they start having a collective identity, and sure enough you start having modern nation states based who's living on the private property of the king. &gt;That's not how feudalism works at all. Feudal estates where not \"the state.\" There was no state.\n\nYou should reexamine the history of feudalism.  The feudal system involved land grants from a central state to aristocrats and feudal lords.\n\nThere were no feudal lords before the modern state - there was simply *smaller states*, ruled by lords who gained, like modern states, through conquest and theft of property.\n\n&gt;That's the thing about unrestricted private property, it tends to collect in the hands of a few over time for all kinds of reasons just like unrestricted capitalism.\n\nNeither of these things are true.  \"Unrestricted private property\" and \"unrestricted capitalism\" actually tend for a more equitable and meritorious \"distribution\" of property.\n\n&gt;If your neighboring manor lord comes on hard times, you could leverage the situation to take his property and then let him live there as a vassal that owes fealty to you.\n\nPerhaps this is plausible, but *historically*, the relationship was the opposite - an individual would swear fealty to a ruler, and become friendly with them, then be granted a \"proprietorship\" over some lands, from which they could collect rents from the just owners. Nope.  I'm not going to read books for you, but you need to go the library.  Everything you're asserting is way off base.  Manorialism, the roots of Feudalism grew out of the collapse of the state -- that state being Rome. \n\nRome fell, and all that was left were private manor estates, and if you wanted to make a living not having a manor of your own, you'd had better find one that will *hire* you. \n Georgism is literally feudalism with a democratic veneer.  I, as an individual, must pay quitrents (usually based on some sort of auction bidding, which presumes the state itself is the owner) to the state or \"community\", in exchange for being allowed to use the land.  This state is democratic and \"limited\", though, so it is supposedly OK.  As far as I can tell, the only difference between this and the actual feudalism that was attempted in the British colonies in America was that there the payments were supposed to be made to oligarchs granted the colony by the King (usually, they were evaded instead) - in both cases, the payments were supposedly used in the best interests of the entire populace, though.  Just like your taxes today.\n\nAnarcho-capitalism is as far away as possibly removed from feudalism - the greatest sin of feudalism was that the State determined who would own the land, and literally *stole it* from the serfs and peasants that homesteaded and worked the land.\n\nThe problem is confusing a landlord - which can never be truly eliminated without a socialist inability to economically use scarce resources - with a feudal lord, who has an arbitrary and unjust claim to vast swaths of land granted to him by the state. I don't like states.  But if I was going to have one, I would want it cit-sized and Georgist.  I would also be aggressively against using the LVT to fund \"public goods\" and would instead favor a \"[citizen's dividend](http://en.wikipedia.org/wiki/Citizen%27s_dividend).\" \n\n&gt;Anarcho-capitalism is as far away as possibly removed from feudalism - the greatest sin of feudalism was that the State determined who would own the land, and literally stole it from the serfs and peasants that homesteaded and worked the land.\n\nThe manner of acquisition is extremely important, but it isn't the end of the story.  I think homesteading is a wonderfully \"just\" manner of distributing land, especially in comparison to \"might makes right.\"  However, if it results in a significant segment of the population having no land of any value open to mix their labor with, the false-choice that socialists attribute to the employee-\"capitalist\" relationship starts to become reality.\n\n&gt;The problem is confusing a landlord - *which can never be truly eliminated without a socialist inability to economically use scarce resources*...\n\nGeorgist auction markets have no problems economically using land.  Whoever can make the most efficient use of it will always pay the highest bid. &gt;However, if it results in a significant segment of the population having no land of any value open to mix their labor with, the false-choice that socialists attribute to the employee-\"capitalist\" relationship starts to become reality.\n\nThere is no likelihood of this happening.  It is incredibly infeasible to homestead all the land that is currently unowned, and not worth the cost for much of it in any commercial manner.\n\nHowever, even if it did happen, there is no right to own a scarce resource, including land.  Just as I have no right to steal your food if I am starving, I have no right to steal your money for having land when I have none.\n\n&gt;Georgist auction markets have no problems economically using land. Whoever can make the most efficient use of it will always pay the highest bid.\n\nGeorgist auction markets push the use of land that is better left temporarily idle (i.e. farms that should lay fallow for some time), increase the cost of using unimproved land, and they punish non-commercial uses of land, such as living space.  Additionally, Georgism eliminates the speculation in land that, like in other scarce resources, provides a useful service relating to prices and temporal economization.  \"Where the landowner anticipates that a better line of use will soon become available or is in doubt on the best commitment for the land, he will withhold the land site from use if his saving in \"change-over cost\" will be greater than his opportunity cost of waiting and of forgoing presently obtainable rents. The speculative site-owner is, then, performing a great service to consumers and to the market in not committing the land to a poorer productive use. By waiting to place the land in a superior productive use, he is allocating the land to the uses most desired by the consumers.\"  - Murray Rothbard  \n\nAlso, you have technically made the state the (extremely inefficient and non-competitive) landlord, not eliminated him. &gt;There is no likelihood of this happening. It is incredibly infeasible to homestead all the land that is currently unowned, and not worth the cost for much of it in any commercial manner.\n\nThe land worth homesteading disappears in the blink of an eye.  This happened when colonists first moved to Africa and Australia and when the state released lands in the western US.  If there is no land worth homesteading in any commercial manner, then the only available land isn't conducive to commercial activity.  This is exactly  the scenario I am talking about.  The fact that there will always be plenty of sand in the Sahara for me to build a hut to die in doesn't solve the problem.\n\nFor a current world example... farm hands aren't choosing between picking grapes at well below minimum wage and homesteading their own farm.  They are forced into that situation because there is no arable land to homestead. \n\n&gt;Georgist auction markets push the use of land that is better left temporarily idle\n\nIf the optimal use of a farm is to lay idle, it is in my interest to exclude others by paying compensation both during harvest and during the idle period.  I will profit maximally from the land with this strategy and thus will be able to outbid anyone with other ideas for how to use it.\n\n&gt;and they punish non-commercial uses of land, such as living space\n\nThis makes no sense at all.  I have no idea what the logic for this conclusion is.\n\n&gt;Georgism eliminates the speculation in land...\n\nCan you come up with an example where someone would homestead land, then leave it idle because he envisions some future more profitable use that would be handicapped by current use?  I am struggling to make this \"service\" of land speculators seem real.\n\n&gt;Also, you have technically made the state the (extremely inefficient and non-competitive) landlord, not eliminated him.\n\nI prefer competition in compensation collection firms.\n &gt;As I've told ana-caps before, the nearest analogy to their society is feudalism or the manorism it grew out of. Serfs didn't start out as slaves, they started out as voluntary fealty to a manor lord who protected them, fed them, and sheltered them on their land in exchange for work...\n\nI'm a Georgist so I am pretty partial to this critique.  However, I want to play a bit of devil's advocate.\n\nSpencer Heath, the advocate of \"[proprietary communities](http://en.wikipedia.org/wiki/Proprietary_community)\" and major influence on Rothbard's approach to land used modern hotels, shopping-malls, and longer term lease-based housing as a model rather than feudalism.  The landlord offers services like security, maintenance and cleaning of the \"commons\", establishing basic guidelines of dispute management and behavior...  This is the product offered by the landlord and his ability to extract unacceptable liberty concessions is limited by competing landlords. \n\nAnglo-Saxon England following the fall of rome and preceding the Norman conquest is Heath's favorite example of a similar system historically.  Land lords advertised for inhabitants and offered protection and services in exchange for rent.  Landowners founded communities, competed for inhabitants by establishing different services and allowing greater and greater private liberties in the charters that outlined the terms of the \"citizenship\" agreement.  People actively moved to join the founder cities.  Life was pretty good in these communities.  \n\nNow imagine how much better this system can work in a post-agrarian society.  Apparently there is a lot of pressure on New York City to change its lease/rental regulations to allow the growing trend of professionals living in hotel-like communities with little closet rooms and common spaces for all other activities.  I have some serious problems with land ownership, but the land-slavery historically associated with feudalism probably isn't the best model of where enclosure will lead us.",
    "url" : "http://www.theamericanconservative.com/articles/the-well-tempered-anarchist/"
  }, {
    "id" : 14,
    "title" : "Ben Bernanke was wrong",
    "snippet" : "  I don't blame him. You can't expect any one person or group to know how to control all the money in the entire economy. I agree. Now if only he would realize that himself. Then another person would be in the same position, doing the same thing that he is?",
    "url" : "http://www.youtube.com/watch?v=9QpD64GUoXw"
  }, {
    "id" : 15,
    "title" : "\"Capitalists create unemployment and also use the threat of further unemployment to prevent the mending of ecological damage\"",
    "snippet" : "  ",
    "url" : "http://indypendent.org/2013/01/21/fresh-breath-clean-air"
  }, {
    "id" : 16,
    "title" : "Why democracy is always doomed to failure 101",
    "snippet" : "  Notice none of the politicians quoted complained about the policies or how well the country is being run; they are simply worried about keeping power. The whole thing is one big unpopularity contest (I would call it a popularity contest but democracy is really about who is hated the least). That's actually not a flaw with democracy, it's a flaw with republicanism. Direct democracy fails for other, economic, reasons. That's actually not a flaw with democracy, it's a flaw with republicanism. Direct democracy fails for other, economic, reasons.",
    "url" : "http://www.guardian.co.uk/politics/2013/jan/31/tories-pm-poll-ratings-revolt"
  }, {
    "id" : 17,
    "title" : "A question about education and welfare...",
    "snippet" : "How would education work if it were privatized? And what about welfare? I know welfare is wrong, but how would it go if it were taken away and would there be like a voluntary \"replacement\"?  There are some recent examples of totally private systems.  For example, I believe Hong Kong had a 100% private system till the 70's, without absolutely no government funding of education at all.   Eventually, the government did start to subsidize education, but the system there still remains mostly private, and most of the education money is given to low-income students in the form of partial tuition reimbursements to private schools.  Before the state got involved, there were a lot of grants and other gifts that helped educate the poor, the effect was that most of the people in HK were literate, and educated, without any government involvement.   Some kids slipped through the cracks, but it's that way in the US today too, with high dropout rates.  Anyhow, when people act like the kids won't get educated unless the government does it, they are full of shit.\n\nAs for welfare, I'm not to worried about it.  US government spending is 40% of GDP.   Give that money back to the people, and you'd be amazed at what the hell could happen.\n Ha wow. I guess you're right with the 40% thing. I never thought about it like that and I'm glad that you responded. Very well worded. I think I am definitely AnCap now. Before, these were my only questions that had me skeptical. :)  Education: Khan Academy, MIT OpenCourseWare, Open Yale Courses, /r/homeschool, /r/unschool, Wikipedia, private libraries, private/charity schools.\n\nWelfare: Charity, but with no more government intervention in the markets, manipulation of the value of money through inflation, and draconian laws that keep people from working, there likely won't be much of a need for welfare. Exactly. People really need to start thinking outside the box here. A quality education does not need to be presented in a brick and mortar building. The old model is a failed model. Technology has freed us to find better ways of educating everyone for little cost. Open source education and homeschooling are where it is at.  Education: Khan Academy, MIT OpenCourseWare, Open Yale Courses, /r/homeschool, /r/unschool, Wikipedia, private libraries, private/charity schools.\n\nWelfare: Charity, but with no more government intervention in the markets, manipulation of the value of money through inflation, and draconian laws that keep people from working, there likely won't be much of a need for welfare. The question the market has to answer now isn't how education would work when all these resources are available, the question is how do you standardise peoples' ability in a way that employers can understand. Why pay thousands to get a certificate from a university if you can gather the same knowledge elsewhere and prove your value in another, cheaper way. &gt; the question is how do you standardise peoples' ability in a way that employers can understand\n\nI'm of the idea that in an ancap world, we won't have such a limited # of employers, and most people will be either self-employed, or free-lancers. Sure, some large companies may exist, but most of these super-conglomerates are only possible/necessary with state-backed cronyism.\n\n&gt; Why pay thousands to get a certificate from a university if you can gather the same knowledge elsewhere and prove your value in another, cheaper way.\n\nHopefully in the future, we won't have to. Certain industries may still require education credentials (first to come to mind are medicine, maybe law ([but not necessarily)](http://en.wikipedia.org/wiki/Reading_law)), engineering, other technical professions, etc) but others will be more based on experience, individual characteristics, and other attributes. \n\nI think standardization is just a way for the Government to keep people oppressed, by forcing them to 'learn' in a way that is not only unnatural, but is also harmful to continuing education, since people get so fed up with the process.  Standardized results are a good way for employers to know if they are hiring the best person for the job. Remember standardisation can occur in a market without government influence, such as people using gold as a currency for example.       Sidebar is useful:\n\n[Full set of Intro Liberty Packages](http://www.reddit.com/r/Anarcho_Capitalism/comments/zbujt/anyone_got_the_full_set_of_intro_to_liberty/c63ad2x)\n_______________________________\n\n**PUBLIC EDUCATION -- WHY IT SUCKS**\n___________________________________________\nPublic \"education\" is atrocious. Look at the numbers. Kids are failing out in large numbers, quality is low, and attendance is forced. School is literally a prison for children from poor/low-income families. A lot of those problems stem from teachers unions. They are interested in guarding their salaries instead educating the children. Because of these *--government-protected--* teacher unions, it is **hard-to-impossible** to fire crummy teachers. Guess what happens to the quality of education? It plummets.\n\nCompetition in the market for education leads to quality education at low-to-no cost. Private schools in the free market have financial incentives to tailor their education curriculum to the needs of the child. The state has no such need since it gets funding through theft(taxation). Look at the results: kids are disinterested, they drop out, truancy laws have to be put into place etc....\n\nNot to mention, in a free society information and ideas are FREELY available on the internet(no IP laws). Kids wouldn't even have to leave their home to get whatever type of elementary training and info they need. Most of the garbage they teach, in public schools, has nothing to do with essential market skills that will make you employable once you graduate.\n\nSchools in the free market would likely be more compact and teach the essentials plus a trade. No need to waste nearly a decade and-a-half learning things you'll never use again. It's an economic waste of time and money.\n\nBasically education in a free society will likely be \"free\", because of the internet and no control over the use of information and ideas I.E. eliminating IP law.\n\n____________________________________________________________\n*Child Protection and Education in a free society:*\n\nhttp://www.youtube.com/watch?v=2dwW0D_o1Ww#t=01h47m40s\n__________________________________________\n\n**COVERS ALL THE MAJOR PROBLEMS WITH PUBLIC SCHOOLS**\n\n\n[No incentives in Public Schools (Stefan)](http://www.youtube.com/watch?v=tH3Gg5rBGo8#t=09m40s)\n_________________________________________\n['School Is A Prison!' - Dr Peter Gray Interviewed on Freedomain Radio](http://www.youtube.com/watch?v=d_DJAZ-ByV0)\n________________________________\n[Natural Education, Homeschooling And the Rebirth of Liberty](http://www.youtube.com/watch?v=ty1AXMuY1uY) Sidebar is useful:\n\n[Full set of Intro Liberty Packages](http://www.reddit.com/r/Anarcho_Capitalism/comments/zbujt/anyone_got_the_full_set_of_intro_to_liberty/c63ad2x)\n_______________________________\n\n**PUBLIC EDUCATION -- WHY IT SUCKS**\n___________________________________________\nPublic \"education\" is atrocious. Look at the numbers. Kids are failing out in large numbers, quality is low, and attendance is forced. School is literally a prison for children from poor/low-income families. A lot of those problems stem from teachers unions. They are interested in guarding their salaries instead educating the children. Because of these *--government-protected--* teacher unions, it is **hard-to-impossible** to fire crummy teachers. Guess what happens to the quality of education? It plummets.\n\nCompetition in the market for education leads to quality education at low-to-no cost. Private schools in the free market have financial incentives to tailor their education curriculum to the needs of the child. The state has no such need since it gets funding through theft(taxation). Look at the results: kids are disinterested, they drop out, truancy laws have to be put into place etc....\n\nNot to mention, in a free society information and ideas are FREELY available on the internet(no IP laws). Kids wouldn't even have to leave their home to get whatever type of elementary training and info they need. Most of the garbage they teach, in public schools, has nothing to do with essential market skills that will make you employable once you graduate.\n\nSchools in the free market would likely be more compact and teach the essentials plus a trade. No need to waste nearly a decade and-a-half learning things you'll never use again. It's an economic waste of time and money.\n\nBasically education in a free society will likely be \"free\", because of the internet and no control over the use of information and ideas I.E. eliminating IP law.\n\n____________________________________________________________\n*Child Protection and Education in a free society:*\n\nhttp://www.youtube.com/watch?v=2dwW0D_o1Ww#t=01h47m40s\n__________________________________________\n\n**COVERS ALL THE MAJOR PROBLEMS WITH PUBLIC SCHOOLS**\n\n\n[No incentives in Public Schools (Stefan)](http://www.youtube.com/watch?v=tH3Gg5rBGo8#t=09m40s)\n_________________________________________\n['School Is A Prison!' - Dr Peter Gray Interviewed on Freedomain Radio](http://www.youtube.com/watch?v=d_DJAZ-ByV0)\n________________________________\n[Natural Education, Homeschooling And the Rebirth of Liberty](http://www.youtube.com/watch?v=ty1AXMuY1uY)  **MUTUAL AIDE SOCIETIES**\n__________________________________________\n\n[Article: MUTUAL AIDE SOCIETIES: Origins of the Welfare State in America](http://mises.org/daily/2225)\n__________________________________________\n[Book: From Mutual Aid to the Welfare State](http://www.amazon.com/Mutual-Aid-Welfare-State-Fraternal/dp/0807848417)\n_______________________________________\n\n[Article: Welfare before the Welfare State](http://mises.org/daily/5388)\n\n__________________________________________\n\n\"Mutual aid was particularly popular among the poor and the working class. For instance, in New York City in 1909 40 percent of families earning less than $1,000 a year, little more than the \"living wage,\" had members who were in mutual-aid societies.[2] Ethnicity, however, was an even greater predictor of mutual-aid membership than income. The \"new immigrants,\" such as the Germans, Bohemians, and Russians, many of whom were Jews, participated in mutual-aid societies at approximately twice the rate of native whites and six times the rate of the Irish.[3] This may have been due to new immigrants' need for an enhanced social safety net.\"\n\nBy the 1920s, at least one out of every three males was a member of a mutual-aid society.[4] Members of societies carried over $9 billion worth of life insurance by 1920. During the same period, \"lodges dominated the field of health insurance.\"[5] Numerous lodges offered unemployment benefits. Some black fraternal lodges, taking note of the sporadic nature of African-American employment at the time, allowed members to receive unemployment benefits even if they were up to six months behind in dues\"\n________________________________________________\n\n\n[Mother Jones Report 2012: How Much Do We Spend on the Nonworking Poor?](http://www.motherjones.com/kevin-drum/2012/02/how-much-do-we-spend-nonworking-poor)\n\n\n[More Sources on Government Welfare](http://www.reddit.com/r/Anarcho_Capitalism/comments/tdhec/barack_obama_get_off_julia/c4ltkip/) **MUTUAL AIDE SOCIETIES**\n__________________________________________\n\n[Article: MUTUAL AIDE SOCIETIES: Origins of the Welfare State in America](http://mises.org/daily/2225)\n__________________________________________\n[Book: From Mutual Aid to the Welfare State](http://www.amazon.com/Mutual-Aid-Welfare-State-Fraternal/dp/0807848417)\n_______________________________________\n\n[Article: Welfare before the Welfare State](http://mises.org/daily/5388)\n\n__________________________________________\n\n\"Mutual aid was particularly popular among the poor and the working class. For instance, in New York City in 1909 40 percent of families earning less than $1,000 a year, little more than the \"living wage,\" had members who were in mutual-aid societies.[2] Ethnicity, however, was an even greater predictor of mutual-aid membership than income. The \"new immigrants,\" such as the Germans, Bohemians, and Russians, many of whom were Jews, participated in mutual-aid societies at approximately twice the rate of native whites and six times the rate of the Irish.[3] This may have been due to new immigrants' need for an enhanced social safety net.\"\n\nBy the 1920s, at least one out of every three males was a member of a mutual-aid society.[4] Members of societies carried over $9 billion worth of life insurance by 1920. During the same period, \"lodges dominated the field of health insurance.\"[5] Numerous lodges offered unemployment benefits. Some black fraternal lodges, taking note of the sporadic nature of African-American employment at the time, allowed members to receive unemployment benefits even if they were up to six months behind in dues\"\n________________________________________________\n\n\n[Mother Jones Report 2012: How Much Do We Spend on the Nonworking Poor?](http://www.motherjones.com/kevin-drum/2012/02/how-much-do-we-spend-nonworking-poor)\n\n\n[More Sources on Government Welfare](http://www.reddit.com/r/Anarcho_Capitalism/comments/tdhec/barack_obama_get_off_julia/c4ltkip/)",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17ml23/a_question_about_education_and_welfare/"
  }, {
    "id" : 18,
    "title" : "Why Capitalism Needs Losses, Too | Robert P. Murphy",
    "snippet" : "  It's a shame he'll never debate Krugman. say it the right way ? &gt; It's a shame Krugman will never debate him\n\nFTFY I don't think it really matters all that much.",
    "url" : "http://youtu.be/3PLORO0-ApM"
  }, {
    "id" : 19,
    "title" : "Libertarians who think we cannot have open borders until we get rid of this massive welfare system, do you also oppose tax evasion/tax avoidance by people until we get rid of the massive govt spending programs?",
    "snippet" : "I understand a lot of libertarians make a different case from Nationalists/Racists against open border immigration which is based on \"welfare spending\". The argument being, as long as we have a massive welfare program we cannot afford to have open borders because then people who are paying taxes and paying for the welfare system will get screwed.\n\nBy the same logic, do they also oppose anyone who evades taxes or avoids them? I mean we can't really afford to evade taxes with the whole govt spending system we have in place. If a lot of people start evading taxes, then the rest of the people who do pay taxes will get screwed. Therefore taxes must be paid in full, until we get rid of the govt spending system we have in place.\n\nIf \n\n**open immigration + welfare**\n\ndon't mix, then \n\n**tax evasion + govt spending**\n\ndon't mix either.  I doubt you will find many people who are opposed to open borders on this sub. You might have better luck posting this to the libertarian board.\n\nI would like to take a second to tackle your proposed scenarios though.\n\n&gt;open immigration + welfare\n\nThis will accelerate the downfall of the state, why should we oppose that?\n\n&gt;tax evasion + govt spending\n\nThis will also accelerate the downfall of the state, again why would I care if the state goes bankrupt?\n\nAlthough I would prefer no welfare, and no government spending, I see nothing wrong with either of those scenarios. That is nothing wrong above and beyond the normal reservations against government.\n Open immigration and welfare could result in higher taxes in the short run and very likely even the long run. If ending the state was as easy as bankrupting it, we would have a lot more stateless societies today. The state has fallen many times, it will continue to do so. The hard part is preventing the regrowth of the state, the hard part is creating a stateless society. Open immigration and welfare could result in higher taxes in the short run and very likely even the long run. If ending the state was as easy as bankrupting it, we would have a lot more stateless societies today. Open immigration and welfare could result in higher taxes in the short run and very likely even the long run. If ending the state was as easy as bankrupting it, we would have a lot more stateless societies today. I doubt you will find many people who are opposed to open borders on this sub. You might have better luck posting this to the libertarian board.\n\nI would like to take a second to tackle your proposed scenarios though.\n\n&gt;open immigration + welfare\n\nThis will accelerate the downfall of the state, why should we oppose that?\n\n&gt;tax evasion + govt spending\n\nThis will also accelerate the downfall of the state, again why would I care if the state goes bankrupt?\n\nAlthough I would prefer no welfare, and no government spending, I see nothing wrong with either of those scenarios. That is nothing wrong above and beyond the normal reservations against government.\n I doubt you will find many people who are opposed to open borders on this sub. You might have better luck posting this to the libertarian board.\n\nI would like to take a second to tackle your proposed scenarios though.\n\n&gt;open immigration + welfare\n\nThis will accelerate the downfall of the state, why should we oppose that?\n\n&gt;tax evasion + govt spending\n\nThis will also accelerate the downfall of the state, again why would I care if the state goes bankrupt?\n\nAlthough I would prefer no welfare, and no government spending, I see nothing wrong with either of those scenarios. That is nothing wrong above and beyond the normal reservations against government.\n I doubt you will find many people who are opposed to open borders on this sub. You might have better luck posting this to the libertarian board.\n\nI would like to take a second to tackle your proposed scenarios though.\n\n&gt;open immigration + welfare\n\nThis will accelerate the downfall of the state, why should we oppose that?\n\n&gt;tax evasion + govt spending\n\nThis will also accelerate the downfall of the state, again why would I care if the state goes bankrupt?\n\nAlthough I would prefer no welfare, and no government spending, I see nothing wrong with either of those scenarios. That is nothing wrong above and beyond the normal reservations against government.\n &gt;I doubt you will find many people who are opposed to open borders on this sub. You might have better luck posting this to the libertarian board.\n\nWell, I guess I'm a hell of an anomaly then.\n\nI'm a second-generation (that is, born here but my parents were not) Mexican-American, and I'm against open borders, especially with my motherland. AMA? Sure I'll throw you a few questions.\n\nWhy do you feel that open borders are wrong?\n\nWhat plan would you advocate implementation of, in order to close the borders? &gt;Why do you feel that open borders are wrong?\n\nI don't believe it is *wrong*, I believe that, all else equal, closed borders are preferable.\n\nBecause the state is already actively taking measures to deteriorate the native culture. Property owners in the United States have very few rights with regards to the right of association. Businesses are not allowed to discriminate who they serve, especially in terms of race. And immigrants are given unfair advantages when they enter this country. Solely for being non-white and foreign, you have legal and social advantages in getting accepted into universities, getting a job, getting federal grants, et cetera. And none of these are showing any signs of being anywhere near reformed. If anything, the momentum is going the opposite way. More advantages for non-whites, more discrimination against whites, less consistent property rights, and the education children are receiving every generation is becoming more and more multicultural.\n\nSo, given the immense state action against the American national identity, it only makes sense to me that it seems less wrong to have closed borders as a shameful last resort for maintaining some nation within the borders, than to open the borders completely while still allowing the state to unfairly subsidize immigrants which is leading to the slow decline of the American nation (not the state, the *nation*, read Mises if you don't understand what a nation is).\n\n&gt;What plan would you advocate implementation of, in order to close the borders?\n\nMeh. I dunno. Honestly, that's a really good question. However you propose it to be done, the state will fuck it up one way or another. Since you have listed a series of negative effects, all produced by the state, would it be fair to say that if there was no longer a state your objection to open borders would evaporate? Err, well, by definition yes. Without a state, to talk of \"closed borders\" on the scale that is currently in question makes no sense. Most of the border with Mexico, for example, is not owned. If it was wholly populated by various landowners and they all choose not to allow trespassers over, then I support their exercising the right of association.\n\nHowever, I am certainly not for \"open borders\" in the sense that some people believe there exists a universal right for immigrants to trespass through owned land against the wishes of the landowner. Alright, so we are in agreement on what should happen without a state.\n\nNow would you say that the state owns all of the land on the border?\n\nHow about, does the state own all of the land in America? No and no, of course not. We agree on these things.\n\nHowever, the problem is that anywhere that a nation can own all the land, they are prevented with violence from exercising their right of association freely. If I have to choose, I pick closed borders as the lesser of two evils.\nYes, as the son of two immigrants, that is truly the case.\n\nI feel this way because I have seen what the deterioration of nations does to people. It leaves us without culture, without family, without a common language, without a history. I wouldn't wish that on my worst enemy. People need a narrative within which to fit their lives. Perhaps a rephrase then.\n\nWho owns the land on the border?\n\nWho owns land in America? Is there a collectivized ownership? I doubt you will find many people who are opposed to open borders on this sub. You might have better luck posting this to the libertarian board.\n\nI would like to take a second to tackle your proposed scenarios though.\n\n&gt;open immigration + welfare\n\nThis will accelerate the downfall of the state, why should we oppose that?\n\n&gt;tax evasion + govt spending\n\nThis will also accelerate the downfall of the state, again why would I care if the state goes bankrupt?\n\nAlthough I would prefer no welfare, and no government spending, I see nothing wrong with either of those scenarios. That is nothing wrong above and beyond the normal reservations against government.\n  I once was anti-open border on these grounds...but once I converted to AnCap, I realized the position was moot.  Who enforces the the imaginary lines in the dirt if not the government I wish to abolish?\n\nAnd why do I care about what the government spends its money on?  As a minarchist, I used to think taxes should be spent non-wastefully on things that actually mattered.  Now I realize government has no legitimate mechanism by which to determine what money should be spent on, nor how much to spend on it.  And it's stolen money to begin with...So let's call the whole thing off. &gt;but once I converted to AnCap, I realized the position was moot.\n\nOne of the best things about ancap is the peace of mind from obviating entire swaths of political discourse. &gt;but once I converted to AnCap, I realized the position was moot.\n\nOne of the best things about ancap is the peace of mind from obviating entire swaths of political discourse. &gt;but once I converted to AnCap, I realized the position was moot.\n\nOne of the best things about ancap is the peace of mind from obviating entire swaths of political discourse. Yes, but then there's the anguish you experience realizing others are stuck in the \"Matrix\" which I have yet learned how to deal with.  Tax evasion is not a government policy. Yeah but my question was about libertarian support to various actions. Not libertarian support to various govt policies. Yeah but my question was about libertarian support to various actions. Not libertarian support to various govt policies.  silly logic\n\nAncap are against government spending in general. Whether that is for your mom or for an immigrant, we are still against it. Tax evasion means less revenue for government which is completely different. As we are against government spending we are against the government generating revenue. You did not even refer to the premise of the logic, that is 'open borders must not be allowed because of welfare'. Whether this logic of tax evasion and govt spending silly or not totally depends upon whether or not you argue against immigration or not.\n\nThe point isn't that I have come up with this great idea of opposing all forms of tax evasion and tax avoidance, rather if someone says statement A because of X logic, then do they also agree to B because of the same logic.\n\nIf you don't agree with the open borders/welfare logic then this question isn't for you, you have a consistent position.   &gt;I understand a lot of libertarians make a different case from Nationalists/Racists against open border immigration \n\nHeh, I'm both. Well, anarchist libertarian anyway. \n\n[Kinsella puts the libertarian anti-immigration position better than I can.](http://www.lewrockwell.com/kinsella/kinsella18.html)\n\nBasically, property and services stolen from the residential population should not be given to random strangers, it's a greater violation of the victim's rights to give their stolen property away or diminish its value. If someone stole your car, would you rather get it back in poor condition or *worse* condition? Clearly one of those is worse, higher utility and a rights violation is obviously preferable lower utility and a rights violation. \n\nThere's also one fact, foreigners have **zero** right to publicly owned property. You can have whoever you want on your own property, but not public. Should we send social security checks to Australia? Letting foreigners us public property makes as much sense as any other form of foreign aid. Try getting around while not using the roads. \n\nAs for your actual point, whether I hold tax evaders in equal regard, I'd say it depends. If a person has never truly been a victim of state aggression, whether direct or indirect, they seem to deserve little or no compensation. If we're talking about a person living in a bubble who has been immune to the crimes of the state, it would seem to be a greater violation of the other citizens' rights to allow them access to their stolen property. \n\nOf course, restrictions to access depend entirely on whether the other individuals are wanted or not. If they provide utility, in the eyes of the rightful owners and those owed compensation by the current owners, then I'd say they can be permitted use. In regards to immigration we have this standard, we call rejected persons illegal immigrants. \n\nEdit: Also, I can't say immigrants are really victims of the state. They actively chose to enter into this state, unlike residents who were born into it.  If we don't recognize the idea of a state, what is the definition of a foreigner? What's the difference between my next door neighbor and someone from another country using my stolen goods? Nothing, but the reality of the matter is that the state exists, and is actively stealing people's money.  Therefore we have to deal with policy that affects these conditions here and now.\n\nThis is kinsella's argument. The state exists. And it steals shit. But what's the difference between an immigrant and the dude next door? What's the difference between a person of working age that can spend money and shit against people having kids? At least immigrants can work.\n\nSimple fact is, if the money isn't coming back to me there isn't a difference. The difference is that, as a subjective preference, if the state is going to steal my money and give it to some stranger, I would rather have some things in common with that stranger.\n\nIt is my personal preference for that stranger to share my language, my race, my culture, et cetera.\n\nNations exist. They are entirely distinct from states. Anarcho-nationalist. Interesting. If we don't recognize the idea of a state, what is the definition of a foreigner? What's the difference between my next door neighbor and someone from another country using my stolen goods? There are distinct jurisdictions when it comes to states, I'm not sure what you're asking.  I think that he is trying to say that without the State there is no concept of \"nationality\".What that means is  that we are all just equal people. &gt;I understand a lot of libertarians make a different case from Nationalists/Racists against open border immigration \n\nHeh, I'm both. Well, anarchist libertarian anyway. \n\n[Kinsella puts the libertarian anti-immigration position better than I can.](http://www.lewrockwell.com/kinsella/kinsella18.html)\n\nBasically, property and services stolen from the residential population should not be given to random strangers, it's a greater violation of the victim's rights to give their stolen property away or diminish its value. If someone stole your car, would you rather get it back in poor condition or *worse* condition? Clearly one of those is worse, higher utility and a rights violation is obviously preferable lower utility and a rights violation. \n\nThere's also one fact, foreigners have **zero** right to publicly owned property. You can have whoever you want on your own property, but not public. Should we send social security checks to Australia? Letting foreigners us public property makes as much sense as any other form of foreign aid. Try getting around while not using the roads. \n\nAs for your actual point, whether I hold tax evaders in equal regard, I'd say it depends. If a person has never truly been a victim of state aggression, whether direct or indirect, they seem to deserve little or no compensation. If we're talking about a person living in a bubble who has been immune to the crimes of the state, it would seem to be a greater violation of the other citizens' rights to allow them access to their stolen property. \n\nOf course, restrictions to access depend entirely on whether the other individuals are wanted or not. If they provide utility, in the eyes of the rightful owners and those owed compensation by the current owners, then I'd say they can be permitted use. In regards to immigration we have this standard, we call rejected persons illegal immigrants. \n\nEdit: Also, I can't say immigrants are really victims of the state. They actively chose to enter into this state, unlike residents who were born into it.  While this doesn't refute his own argument, [it should be noted that Kinsella himself is actually pro-immigration](http://www.stephankinsella.com/2010/04/im-pro-immigration-and-pro-open-borders/).\n\n&gt;Basically, property and services stolen from the residential population should not be given to random strangers, it's a greater violation of the victim's rights to give their stolen property away or diminish its value.\n\nImmigrants are also stolen from once they arrive, and are hurt economically by the State in the same ways that natives are. Once they arrive, then, are they entitled to some of the fruits of the State's takings? It would seem so. If someone arrived, got a job, and paid taxes, and yet was arbitrarily denied road access or something like that, I don't think that would make sense.\n\n&gt;Of course, restrictions to access depend entirely on whether the other individuals are wanted or not. If they provide utility, in the eyes of the rightful owners and those owed compensation by the current owners, then I'd say they can be permitted use. In regards to immigration we have this standard, we call rejected persons illegal immigrants.\n\nI think they provide utility. If one were to ban immigration (or restrict it) on the basis that some people might object to immigrants' use of public property, one is violating the rights of those who want to associate with immigrants using their own property (e.g., a landlord who wants to rent apartments to immigrants). The point is, some native residents will have their rights violated either way, so to say that this inherently favors immigration restriction is based on an untenable bias. (In fact, since there should be a general presumption against immigration restrictions from a libertarian perspective, I would say an unresolved dilemma regarding immigration favors those against restriction.)\n\n&gt;Also, I can't say immigrants are really victims of the state. They actively chose to enter into this state, unlike residents who were born into it.\n\nThey might just be escaping a State which is even worse. The \"you can just move\" argument is problematic, in my opinion. And those who are excluded are certainly victims of the State.  I think some societies will have closed borders under anarcho-capitalism. With respect to the United States, I have mixed feelings about immigration. On one hand, I oppose closed borders because there is so much land available to homestead. However, people cannot exclude people from local communities on account of federal law, so societies cannot select their members.     Great question /point!!\n\nI put the onus on any closed border advocate to present his or her view as anything but simple xenophobia.  Why does it matter if it is xenophobic? Does that make the closed border position wrong? &gt;Why does it matter if it is xenophobic? Does that make the closed border position wrong?\n\nXenophobia is a fear. A fear cannot be 'wrong.' It doesn't make sense to say that a *feeling* is *invalid* or anything similar.\n\n\nHowever, it is not necessarily a good idea to make decisions based entirely on fear. Especially when they affect the lives of millions of people.\n\n_________________________\n**Quick Economics Lesson: To get the benefits of free trade, you need to actually interact with other people.** Free trade implies transport of goods and services, immigration is about change of residence. Two completely different things.  Thank you for affirming my original point, re: \"simple xenophobia.\"\n________________________________________\n\nThat's okay, I respect your personal preference. Really, I am *fine* with it; in the future AnCapiverse, I'll work with Indian engineers, drive my Japanese car, watch my Korean TV, get my Swedish massage, eat my dirt cheap Mexican food, and podcast with my Ecuadorian friend Rudd/Throwaway-O.\n\nAt this same time, you'll surely reap all the benefits of living within a predictable, uniform, and homogenous culture with a consistent national ethnic identity...whatever those are. The important thing is that *that* is a choice that you get to make. [deleted] Thank you for affirming my original point, re: \"simple xenophobia.\"\n________________________________________\n\nThat's okay, I respect your personal preference. Really, I am *fine* with it; in the future AnCapiverse, I'll work with Indian engineers, drive my Japanese car, watch my Korean TV, get my Swedish massage, eat my dirt cheap Mexican food, and podcast with my Ecuadorian friend Rudd/Throwaway-O.\n\nAt this same time, you'll surely reap all the benefits of living within a predictable, uniform, and homogenous culture with a consistent national ethnic identity...whatever those are. The important thing is that *that* is a choice that you get to make. &gt;Thank you for affirming my original point, re: \"simple xenophobia.\"\n\nI like the part where you psychologized your opponent by moralizing a personal preference as a phobia.\n\nAnd you, are you nato-phobic because you fear living in a non-multicultural society? pizzlybear is not my \"opponent;\" I respect his preferences.\n\nAnd perhaps you're right, maybe I do have such a fear. I tend to find that people who psychologize people they disagree with as a way of discrediting preferences they don't share have very little respect really for other people's preferences. I'm sorry, is there a point that you are trying to make, relevant to this discussion? Free trade implies transport of goods and services, immigration is about change of residence. Two completely different things.  &gt;Why does it matter if it is xenophobic? Does that make the closed border position wrong?\n\nXenophobia is a fear. A fear cannot be 'wrong.' It doesn't make sense to say that a *feeling* is *invalid* or anything similar.\n\n\nHowever, it is not necessarily a good idea to make decisions based entirely on fear. Especially when they affect the lives of millions of people.\n\n_________________________\n**Quick Economics Lesson: To get the benefits of free trade, you need to actually interact with other people.** &gt;However, it is not necessarily a good idea to make decisions based entirely on fear.\n\nIt's not necessarily a bad idea either. You present this ultimatum as if it makes it necessarily bad, false, or fallacious. I don't think it does; I do think it's distasteful and unfounded, but it's not necessarily wrong. Fear is a useful emotion and many times fear is rational.\n\n&gt;Quick Economics Lesson: To get the benefits of free trade, you need to actually interact with other people.\n\nYou can stop immigration without stopping \"free trade\" (absent labor). So what do you support TheRealPariah? Non-race separatism and non-race separatism accessories. Are our views in conflict? If you think a position based on xenophobia or fear is necessarily wrong, then yes. Otherwise, probably not. I am guessing we both believe that people who want to voluntarily engage in race-separatism and make pacts with each other which prohibit \"immigration\" should be left to their own devices. Great question /point!!\n\nI put the onus on any closed border advocate to present his or her view as anything but simple xenophobia.       Ah, but these aren't really a fair comparison. A increase in spending and a loss in revenue aren't the same thing.\nAn Anarcho-Capitalist/Voluntaryist wants open borders, no government welfare and no taxation. Thus, moving closer to these ideals would tend to be a good thing.\n\nFree immigration is indeed a gain in of itself but it may mean a loss in that it increases government welfare spending which may lead to an increase in tax collection.\n\nTax evasion however doesn't mean an increase in spending, simply a loss in government revenue. Governments may have to increase their tax rates but the total amount taxed ends up being the same.\n\nSo, free immigration is a win/loss as open borders means more freedom and opportunity but also means more government spending. Tax evasion is a win/loss in that the evader saves money assuming he doesn't get caught and a loss because everyone else gets taxed more.\n\nIn my opinion, both of these things are a net win but ideally we could have the first without the second.\nI'm not so worried about there not being enough revenue to pay back debts. It's either going to mean a huuuuuge amount of cuts to government spending or defaulting on the debts. &gt; Free immigration is indeed a gain in of itself but it may mean a loss in that it increases government welfare spending which may lead to an increase in tax collection.\n\nSee the problem is, at that point by supporting tighter restriction controls to avoid eventual increase in taxes you're already supporting initiation of aggression on one set of individuals(people who will not be able to perform trades with each other because of immigration restrictions), to avoid increase in aggression on another set of individuals.\n\nSo the choice is simple, either you do this kind of trade-off analysis and figure out which initiation of aggression you wanna support to achieve more liberty, or you decide that no initiation of aggression must be supported, therefore if supporting of removal of initiation of aggression in one field causes more aggression in another field, then that's how the things are.\n\nWould you start supporting War on Terror if opposing it meant you being arrested and sent to gitmo bay? Even if this were the case, by supporting WoT you won't be going gaining any more liberties, because if the government has a right to send you to prison for being against a war, then you are already massively unfree. Just because yesterday you weren't in jail and today you are, it doesn't mean you are any less free. Ah, but these aren't really a fair comparison. A increase in spending and a loss in revenue aren't the same thing.\nAn Anarcho-Capitalist/Voluntaryist wants open borders, no government welfare and no taxation. Thus, moving closer to these ideals would tend to be a good thing.\n\nFree immigration is indeed a gain in of itself but it may mean a loss in that it increases government welfare spending which may lead to an increase in tax collection.\n\nTax evasion however doesn't mean an increase in spending, simply a loss in government revenue. Governments may have to increase their tax rates but the total amount taxed ends up being the same.\n\nSo, free immigration is a win/loss as open borders means more freedom and opportunity but also means more government spending. Tax evasion is a win/loss in that the evader saves money assuming he doesn't get caught and a loss because everyone else gets taxed more.\n\nIn my opinion, both of these things are a net win but ideally we could have the first without the second.\nI'm not so worried about there not being enough revenue to pay back debts. It's either going to mean a huuuuuge amount of cuts to government spending or defaulting on the debts. &gt;So, free immigration is a win/loss as open borders means more freedom and opportunity but also means more government spending.\n\nNot necessarily; for instance, the State could restrict immigrants from using welfare (see [this page on \"keyhole solutions\"](http://openborders.info/keyhole-solutions/)). In that case, immigration would probably have positive impacts on government budgets, thereby lowering the burden on natives.    Can TL;DR apply to a title? Tax evasion, why not open borders?! They both fuck the state over! Discuss  It makes sense to advocate the abolition of the welfare state before borders are opened This is like saying, we should have school vouchers, before we disband public education.\n\nWe help the institution appear more functional/solvent, and then that helps us get rid of it? &gt;This is like saying, we should have school vouchers, before we disband public education.\n\nNo, because these are two separate issues. In your example, it's a matter of degrees in education alone. But welfare and immigration are not the same concept.    \nDisclaimer: I am a minarchist but don't believe I have the right to force you into a government you don't want.\n\nI would prefer to wait to have open immigration until welfare is limited. I don't want the government to fall apart and I think that if we had some massive immigration it could cause the collapse. If the government collapsed I don't want to think of what could be the result. We would likely not have the strength to keep government limited (or have no government) and as such we would get a large government again, but this time it could be without the constitution. Now, the constitution doesn't provide much stop to the government but every so often it does.\n\nAlso, if we do have open immigration we would likely have more voter fraud from non-citizens or a push to give them citizenship / voting rights. I think this could work counter to our goals.\n\nI am fine if nobody pays taxes as I don't believe in taxes. It would push for voluntary taxes and private companies doing much of what the government does.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17l4oq/libertarians_who_think_we_cannot_have_open/"
  }, {
    "id" : 20,
    "title" : "Illinois school plans to shoot blanks during drill to get students used to gunfire  - NY Daily News",
    "snippet" : "   TheOnion?   Guns banned in illinois?  Who the fuck cares? My (Illinois) elementary school 15 years ago did a demonstration with a police dog where an officer shot blanks in the air to show us both the sound of gunfire and the effectiveness of the dog. It was actually pretty badass to watch. Im sure the upper middle class white students of Cary Grove HS will go on to live upper middle class white lives long after this drill. ",
    "url" : "http://www.nydailynews.com/news/national/duck-cover-school-plans-fire-blanks-gunfire-drill-article-1.1250435#ixzz2JQBHH253"
  }, {
    "id" : 21,
    "title" : "Anarcho-capitalists, these are the things that are keeping me from adopting your viewpoints.",
    "snippet" : "I recently finished my enlistment in the marine corps and since then I‘ve been exploring new philosophies. Before I joined, I was a “my country, right or wrong” conservative. Once I joined, I dropped that view mostly due to the fact that I lost my religion. I didn’t really adopt anything else because, well, I had other things on my mind. Now that I’m out, I discovered the libertarian movement and found to be a very attractive philosophy of life. I’ve listened to some pod casts, watch videos and read some Rothbard and can relate with most anarcho-capitalist views.\n\tThere are, however, some issues I have with a completely anarchic situation and I’m hoping this sub-Reddit could clarify some things for me so I may continue on my road to liberty. :\n\n- Roads, bridges, tunnels. I understand the fact that the free market does a better, more efficient job than the government. The only system where I cannot see this being the case is the building of roads public venues for transportation. How would this look in a purely libertarian world? Would it benefit people enough to want to build miles and miles of roads and bridges that would connect the free market? Would every path or road be have a toll to pay? This is the first reason I’m reluctant to adopt the idea of total government abolition. I believe that the government (by which I don’t mean our shitty government, but a hypothetical one in a hypothetical minarchist world) would do a better job of maintaining a grid of publicly accessible roads.\n\n- Non-interventionism. How far does non-interventionism go? If it truly stands to not intervene 100% of the time, then I cannot support it. I believe that we should un-involve ourselves in 95% of all foreign activity we’re involved in, but I can think of situations where I would rather see us bud our heads in than stand by and watch. If I see my neighbor beating his wife into submission, I will intervene even though it isn’t on my property. Isn’t it our moral obligation to intervene in mass genocides in order to protect the life and liberty of innocent people outside of our country? Should the free market allow for entire private militaries that are potentially just as corruptible and dangerous as a government one?\n\nWhich leads us to \n\n- Standing militaries. I believe in the existence of a standing military but purely for defense against foreign invasion (and possibly to end a genocide now and then). In this modern age, I believe that if we became a purely libertarian nation with no standing military, there are plenty of non-libertarian nations that would wield a much stronger and better organized force against what our free-market could muster up. Should the nation hope and pray that private force is enough to hold, say, the Chinese or Russians (if they so chose to invade us) at bay?\n\nPlease tear apart my arguments and prove to me why I should adopt an even more anarchic point of view. As it stands, I believe an absurdly small government is necessary and inevitable to exist for the express purposes of defense and limited public building. Liberty should fill in the immense blanks.  &gt;Non-interventionism. How far does non-interventionism go?\n\nThis is controversial.  Some say self-defense while an attack is happening.  Some say you can use proportional force to attain restitution.  Personally, I say self-defense only, but viable threats are considered attacks.  So, I think a well-developed philosophy of how and when to respond to threats would cover that 5% intervention in edge cases you're worried about.\n\n&gt;If I see my neighbor beating his wife into submission, I will intervene even though it isn’t on my property.\n\nThe best answer I've heard to this problem is go ahead and intervene when you want in other people's business (neighbor beating his wife / kid, person about to hurt them-self, etc).  However, you always have to live with the consequences of your property invasions.  For example, if you stop a husband from beating up his wife, and she's not ready to leave him and won't back you up, then you're screwed.  If you pull a kid out of an abusive home, but the kid won't verify you're claim, then you're screwed.  If you hurt someone while \"saving\" them, then you're probably screwed.  In ancapistan, go ahead and be a busybody, just understand that you will be personally held liable for any mistakes you make.\n\n&gt;Isn’t it our moral obligation to intervene in mass genocides in order to protect the life and liberty of innocent people outside of our country?\n\nNo.  Did you know that americans volunteered to serve in foreign armies before official american involvement in WWI and WWII?  So, if you feel strongly about what's happening in another country, then buy a ticket and put your ass on the line.  What's immoral is forcing your neighbor's kid to fight for your personal beliefs.\n\n&gt;Should the free market allow for entire private militaries that are potentially just as corruptible and dangerous as a government one?\n\nI love this question.  So you're saying your worst case scenario is....a private military devolves into exactly what we have right now?  Try a thought experiment.  If you're a defense entrepreneur, and a customer had the exact same worries that you have, how would you alleviate that customers worries without taxation?\n\n&gt;Standing militaries. I believe in the existence of a standing military but purely for defense against foreign invasion (and possibly to end a genocide now and then).\n\nI'm a former west pointer with 8 years in the army, and I think standing armies are made up of bureaucrats with guns.    There is no way I would willingly pay for today's \"defense\".  What I want is for my property to be insured in the case of military destruction, for my family to be moved to someplace safe, for the asshole leaders that started the war to be assassinated, for intelligence to warn me personally of looming threats, for advice on how to alleviate those threats, and for last ditch defense of my property.  I'd willingly pay for that.  So, I disagree with you, and I have damn good reasons.  I'm willing to let you form your own bureaucrat army.  Are you willing to grant me the same courtesy?  If you don't, then you'll have to threaten me with death to get my compliance, and I'd love to see how that can possibly be justified.\n\n&gt;In this modern age, I believe that if we became a purely libertarian nation with no standing military, there are plenty of non-libertarian nations that would wield a much stronger and better organized force against what our free-market could muster up.\n\nPeople that want defense, will pay for it.  The people that pay for it will be people that have a lot of property value on the line.  The defense purchasers will pass that expense on to their customers.  There's nothing saying ancapistan won't have \"standing armies\".  Those standing armies, however, will be voluntarily funded.\n\nI personally think we're several generations away from ancapistan being possible.  When the current state collapses (through bankruptcy, hyperinflation, depression, currency collapse, etc) a small minority will question the legitimacy of the state, but the vast majority will clamor for a new state.  Fine, that new state will collapse within a couple hundred years, and another segment of the population will question the state.  People aren't stupid.  After seeing their kids die in stupid foreign wars; after seeing their kids make less money than they did; after seeing their kids have literacy rates less than kids did in the 1800's; eventually people will experiment with something new. Thanks for taking the time to respond. I suppose I didn't fully realize that these things don't need the government in order to exist. It's hard to grow up in such a statist-centered culture and then try to see past that. Props for truly considering this (admittedly fantastic) response. It's a really hard thing to do, to deprogram... BattleSalmon thanks you, GallopingFish. Thanks for taking the time to respond. I suppose I didn't fully realize that these things don't need the government in order to exist. It's hard to grow up in such a statist-centered culture and then try to see past that.  * Roads: You sound like someone who's into reading, so try [The Privatization of Roads and Highways](http://mises.org/books/roads_web.pdf)\n\n* Intervention: I think most AnCaps would agree with you there. Although you'll want to drop the \"we\" when referring to the activities of the state. As an anarcho-capitalist I would fully support (and probably even donate money) to an effort to \"intervene\" and overthrow a regime like the one in North Korea.\n\n* Military: As for standing militaries, the authors of the US Constitution had more or less the right idea in not including one. The nation's standing army is nothing more than an armed and alert citizenry. States are hungry, parasitic monopolies and giving such an entity exclusive control over our civilization's aircraft carriers, machine guns and tanks is a terrible idea. See Hans Hermann Hoppe's [The Private Production of Defense](http://mises.org/journals/jls/14_1/14_1_2.pdf) * Roads: You sound like someone who's into reading, so try [The Privatization of Roads and Highways](http://mises.org/books/roads_web.pdf)\n\n* Intervention: I think most AnCaps would agree with you there. Although you'll want to drop the \"we\" when referring to the activities of the state. As an anarcho-capitalist I would fully support (and probably even donate money) to an effort to \"intervene\" and overthrow a regime like the one in North Korea.\n\n* Military: As for standing militaries, the authors of the US Constitution had more or less the right idea in not including one. The nation's standing army is nothing more than an armed and alert citizenry. States are hungry, parasitic monopolies and giving such an entity exclusive control over our civilization's aircraft carriers, machine guns and tanks is a terrible idea. See Hans Hermann Hoppe's [The Private Production of Defense](http://mises.org/journals/jls/14_1/14_1_2.pdf) * Roads: You sound like someone who's into reading, so try [The Privatization of Roads and Highways](http://mises.org/books/roads_web.pdf)\n\n* Intervention: I think most AnCaps would agree with you there. Although you'll want to drop the \"we\" when referring to the activities of the state. As an anarcho-capitalist I would fully support (and probably even donate money) to an effort to \"intervene\" and overthrow a regime like the one in North Korea.\n\n* Military: As for standing militaries, the authors of the US Constitution had more or less the right idea in not including one. The nation's standing army is nothing more than an armed and alert citizenry. States are hungry, parasitic monopolies and giving such an entity exclusive control over our civilization's aircraft carriers, machine guns and tanks is a terrible idea. See Hans Hermann Hoppe's [The Private Production of Defense](http://mises.org/journals/jls/14_1/14_1_2.pdf)  &gt; Roads, bridges, tunnels.\n\nDisney World as the safest and best maintained roads roads I can think of and they're entirely private. So instead of thinking of a road as a long strip of land, consider it merely as one aspect of a large piece of land. \n\nSo the question becomes more about how do you manage to maintain your driveway without the government handling things for you. Next expand that up to larger pieces of property like shopping malls and other commercial developments. \n\n&gt; Non-interventionism.\n\nintervene all you want, but just recognize that you will be held accountable for your actions. No more having suspects accidentally killing themselves in the back of a cop car and there is no accountability.\n\nSo go for it. if you see a situation that you believe needs your attention, help out. If you're wrong, just be prepared to pay for your mistakes. What this does is makes people weigh in whether they really need to be butting into other peoples business or not. \n\n&gt; Standing militaries. I believe in the existence of a standing military but purely for defense against foreign invasion (and possibly to end a genocide now and then\n\nSo you're going to end a genocide by going in to kill everyone? Wouldn't it make much better sense to demonstrate to the world how a peaceful society resolves disputes and have them follow your lead? Sure there will still be atrocities, but the current system exacerbates the problem.\n\nAs for defending from larger opponents,why not just train a couple of expert assassins. If a foreign leader ever starts to think about invading, then you pay the assassin to kill him. Countries don't go to war against peaceful ancap societies. The leaders may want to exploit that society, but if the risk is personal to the politician, then they'll think twice. I fully understand these points with the imaginary country of Ancapistan, but is it realistic enough to think that we, as a society so used to the state, are capable of switching over to an Ancap society? Or is it more of an unachievable goal that serves as more of a direction.\n\nWhat I'm asking is, being who we are in the foreign game as a military super-power and target of much hate, have we already made it impossible for us to, even gradually, switch to a scenario where we don't have a military? &gt; is it realistic enough to think that we, as a society so used to the state, are capable of switching over to an Ancap society?\n\n It would require warm-up in culture and experimental libertarian societies, a few generations worth at least. There's also agorism, which grows its tendrils from within.\n\n&gt; What I'm asking is, being who we are in the foreign game as a military super-power and target of much hate, have we already made it impossible for us to, even gradually, switch to a scenario where we don't have a military?\n\n While England still has a carrier or two (with a bunch of totally awesome helicopters to land on them), it has a much different world image now than it did in the Pre WW-I years. The hardest thing to do is to talk to people about near anarchic systems without them imagining the typical stigma attached with \"anarchy\". They think burning buildings, gangs of murderous thugs prowling the streets... It's quite a task breaking this presumption down and rebuilding what the actual intent is.\n I fully understand these points with the imaginary country of Ancapistan, but is it realistic enough to think that we, as a society so used to the state, are capable of switching over to an Ancap society? Or is it more of an unachievable goal that serves as more of a direction.\n\nWhat I'm asking is, being who we are in the foreign game as a military super-power and target of much hate, have we already made it impossible for us to, even gradually, switch to a scenario where we don't have a military? &gt; Roads, bridges, tunnels.\n\nDisney World as the safest and best maintained roads roads I can think of and they're entirely private. So instead of thinking of a road as a long strip of land, consider it merely as one aspect of a large piece of land. \n\nSo the question becomes more about how do you manage to maintain your driveway without the government handling things for you. Next expand that up to larger pieces of property like shopping malls and other commercial developments. \n\n&gt; Non-interventionism.\n\nintervene all you want, but just recognize that you will be held accountable for your actions. No more having suspects accidentally killing themselves in the back of a cop car and there is no accountability.\n\nSo go for it. if you see a situation that you believe needs your attention, help out. If you're wrong, just be prepared to pay for your mistakes. What this does is makes people weigh in whether they really need to be butting into other peoples business or not. \n\n&gt; Standing militaries. I believe in the existence of a standing military but purely for defense against foreign invasion (and possibly to end a genocide now and then\n\nSo you're going to end a genocide by going in to kill everyone? Wouldn't it make much better sense to demonstrate to the world how a peaceful society resolves disputes and have them follow your lead? Sure there will still be atrocities, but the current system exacerbates the problem.\n\nAs for defending from larger opponents,why not just train a couple of expert assassins. If a foreign leader ever starts to think about invading, then you pay the assassin to kill him. Countries don't go to war against peaceful ancap societies. The leaders may want to exploit that society, but if the risk is personal to the politician, then they'll think twice. &gt; So instead of thinking of a road as a long strip of land, consider it merely as one aspect of a large piece of land.\n\n Might be a twisty road, though. States use Eminent Domain to straighten kinks.\n\n An AnCap \"interstate\" (can't think of a better word right now) could resemble an Indian road that swerves around what were once the grazing spots of sacred cows. Good. Make the roads crappier and we can finally get going with private air travel. Or the road company would negotiate with the land owner to remove the kink. Good. Make the roads crappier and we can finally get going with private air travel. Or the road company would negotiate with the land owner to remove the kink. &gt; Roads, bridges, tunnels.\n\nDisney World as the safest and best maintained roads roads I can think of and they're entirely private. So instead of thinking of a road as a long strip of land, consider it merely as one aspect of a large piece of land. \n\nSo the question becomes more about how do you manage to maintain your driveway without the government handling things for you. Next expand that up to larger pieces of property like shopping malls and other commercial developments. \n\n&gt; Non-interventionism.\n\nintervene all you want, but just recognize that you will be held accountable for your actions. No more having suspects accidentally killing themselves in the back of a cop car and there is no accountability.\n\nSo go for it. if you see a situation that you believe needs your attention, help out. If you're wrong, just be prepared to pay for your mistakes. What this does is makes people weigh in whether they really need to be butting into other peoples business or not. \n\n&gt; Standing militaries. I believe in the existence of a standing military but purely for defense against foreign invasion (and possibly to end a genocide now and then\n\nSo you're going to end a genocide by going in to kill everyone? Wouldn't it make much better sense to demonstrate to the world how a peaceful society resolves disputes and have them follow your lead? Sure there will still be atrocities, but the current system exacerbates the problem.\n\nAs for defending from larger opponents,why not just train a couple of expert assassins. If a foreign leader ever starts to think about invading, then you pay the assassin to kill him. Countries don't go to war against peaceful ancap societies. The leaders may want to exploit that society, but if the risk is personal to the politician, then they'll think twice. &gt; Countries don't go to war against peaceful ancap societies.\n\n Theocracies might. Thats still a society where the leaders are religious, not the entire society. I mean can you think of any current theocracy that would wish to attack another country? \n\nDon't say Iran, because they have never attacked another country. Also I know a lot of iranian expats and they all say that populace isn't radical like the politicians present them.\n\nAlso lets think about the crusades during the middle ages. The people pushing for war there again were the leaders. The poor working class soldier didn't care if he went to fight in the middle east, he was just trying to earn enough to feed himself. If the leader was assassinated, then the invasion would have been stopped. &gt; Countries don't go to war against peaceful ancap societies.\n\n Theocracies might.  &gt; Standing militaries.\n\nI like to say that if [you are hammer, everything looks like a nail.](http://en.wikipedia.org/wiki/Law_of_the_instrument) I think we can turn it around and say if you have a standing army, every problem can be solved by a war.  Aadmon23's links from the sidebar list several threads and resources on roads:\n\nhttp://www.reddit.com/r/Anarcho_Capitalism/comments/zbujt/anyone_got_the_full_set_of_intro_to_liberty/c63ad2x\n\nJust scroll down a bit and they're right there.  Roads should be built and funded by local property owners, mostly businesses. I figure a road owner would simply have to get payments from local business owners, if they don't they could cut off connection to those businesses with a wall. Long transport, like highways, offer the potential for advertisement with billboards and access to roads (like how road owners provide access to businesses). \n\nAs for intervention, do what you want. Intervening in atrocities is a just and noble cause. Just don't use tax dollars or conscripted soldiers. The market offers plenty of international charity work, but I'm not sure if it could muster the sort of military intervention you seem to want. \n\nWe don't have an opposition to a standing military. A military doesn't need to be incredibly large, there are plenty of countries with relatively small armies that are doing fine. My personal prescription is that funding of national defense is a conditional requirement for rights recognition, meaning the courts refuse services for those who do not contribute to national defense in some manner.  Ok, but would these courts or this military be privately owned?\n Ok, but would these courts or this military be privately owned?\n Ok, but would these courts or this military be privately owned?\n I find a country where all entities taking over government functions being \"for-profit\" corporations as a very scary world. Courts would be impartial because they are driven by profit? Isn't this (and other An Cap) justifications based on an almost god-like view of the market as perfect. For profit courts-- scary thought.  I find a country where all entities taking over government functions being \"for-profit\" corporations as a very scary world. Courts would be impartial because they are driven by profit? Isn't this (and other An Cap) justifications based on an almost god-like view of the market as perfect. For profit courts-- scary thought.  So therefore, a minarchist point of view?\n Me personally? I'm a \"moderate\" in the American ideological spectrum-- or a full throated \"statist\" from an An Cap point of view. I don't deny that the state has inherent inefficiencies in performing its duties. However, I don't hold the view that profit-driven entities will perform every state-run function in a better/more efficient manner. \n\nThe world doesn't always work the way it does in economic models or game theory.  Me personally? I'm a \"moderate\" in the American ideological spectrum-- or a full throated \"statist\" from an An Cap point of view. I don't deny that the state has inherent inefficiencies in performing its duties. However, I don't hold the view that profit-driven entities will perform every state-run function in a better/more efficient manner. \n\nThe world doesn't always work the way it does in economic models or game theory.  Me personally? I'm a \"moderate\" in the American ideological spectrum-- or a full throated \"statist\" from an An Cap point of view. I don't deny that the state has inherent inefficiencies in performing its duties. However, I don't hold the view that profit-driven entities will perform every state-run function in a better/more efficient manner. \n\nThe world doesn't always work the way it does in economic models or game theory.  &gt;However, I don't hold the view that profit-driven entities will perform every state-run function in a better/more efficient manner.\n\nI think you would find that many, if not most, anarcho-libertarians don't hold this view either.\n\nIt's unfortunate that, in the minds of so many people, there exists this false dichotomy of the state and the profit-seeking corporation. It  ignores the innumerable social organizations that don't fall into either of those categories. My point is more directed towards the main functions of government, namely courts. I've heard many An Capers assert that Courts will need to be \"objective/impartial\" because if they arent people won't go to them / they will lose money.  Roads should be built and funded by local property owners, mostly businesses. I figure a road owner would simply have to get payments from local business owners, if they don't they could cut off connection to those businesses with a wall. Long transport, like highways, offer the potential for advertisement with billboards and access to roads (like how road owners provide access to businesses). \n\nAs for intervention, do what you want. Intervening in atrocities is a just and noble cause. Just don't use tax dollars or conscripted soldiers. The market offers plenty of international charity work, but I'm not sure if it could muster the sort of military intervention you seem to want. \n\nWe don't have an opposition to a standing military. A military doesn't need to be incredibly large, there are plenty of countries with relatively small armies that are doing fine. My personal prescription is that funding of national defense is a conditional requirement for rights recognition, meaning the courts refuse services for those who do not contribute to national defense in some manner.  Could the company coalition that builds the roads refuse to allow their competitors to use the road? This is my issue with An Cap: if certain entities gain enough power/resources then they can make it impossible for competitors to rise up.   &gt;Non-interventionism. How far does non-interventionism go? \n\nNon-interventionism, as it's referred to in libertarian circles, isn't related to individuals.  It's a term used to describe a stance a government takes with regards to the affairs of other nations.  It doesn't apply to anarcho-capitalism because there would simply be no state to get involved in the first place.  Whether you intervene in situations where your neighbor is beating his wife is really not an issue covered by a policy of non-intervention.  Also, when someone breaks the non-aggression principle, they're essentially saying that they accept violence being used against them via proxy by committing that aggressive action.  Nobody can stop you from stepping in to defend that person.\n\n&gt;In this modern age, I believe that if we became a purely libertarian nation with no standing military, there are plenty of non-libertarian nations that would wield a much stronger and better organized force against what our free-market could muster up. Should the nation hope and pray that private force is enough to hold, say, the Chinese or Russians (if they so chose to invade us) at bay?\n\nIs there some particular evidence that suggests that government organized armies perform better than private armies ever could?  Most of the time US soldiers are vastly under-equipped, under-staffed, over-worked, and you can be put in prison or executed for refusing to follow an order, even if following that order means committing an atrocity.  There's absolutely no reason that I'm aware of to assume this type of \"top-down\" command structure is actually beneficial to the efficacy of our soldiers at all.  In fact, if we're being logical, we should assume that decentralized command would be far more efficient since we see that trend pretty much everywhere else where the debate is between centralization and decentralization. I understand the point, but I still don't see how a private army would be a force comparable to a national military funded by leeching off tax money. Would there be enough people interested in the country as a whole to employ themselves in this private army? It seems more likely to me that people would worry about matters closer to home and providing for the defense of their local situation, which would systematically fall at the hands of an organized invasion involving air support, artillery, fleets of ships and squadrons of tanks.\n\nEDIT: Punctuation.  I don't have much time to respond, but for roads do see Block's book on the matter: http://mises.org/books/roads_web.pdf   &gt;The only system where I cannot see this being the case is the building of roads public venues for transportation. How would this look in a purely libertarian world?\n\nBasically what you've said amounts to, \"I don't know how roads would be produced in a free market, therefore governments do a better job of providing roads.\" This is clearly a non-sequitur. Essentially you've asked a question here (how do market roads work?), but *a question is not an argument*. However, your ignorance of how market roads could/would work is certainly a legitimate cause for suspending judgment. In addition to standard arguments for why markets allocate resources more effectively, I would couple that with some theories about market roads that can be found [here](http://www.youtube.com/watch?v=MseBlo-Sno0), [here](http://mises.org/document/4084/) and [here](http://www.youtube.com/watch?v=k_Qiq4442zY).\n\n&gt;How far does non-interventionism go?\n\nI would encourage you to abandon notions of \"foreign nations\", or \"countries\" altogether. Anarcho-capitalism avoids collectivizations like that and focuses on individuals as individuals. We need only answer the question, then, when an individual is justified in intervening in the affairs of another individual. You're talking to a moral nihilist here, so the question doesn't really make sense to me. However, we could try to predict what *would* happen anyways. I think if you had anarcho-capitalism, i.e. a polycentric law system, the law would be favorable to those who choose to intervene provided that it was to prevent or stop ongoing aggression. For example, if a woman is being kidnapped, and you go over there and punch the kidnapper in the face, I don't think you will be legally punished.\n\n&gt;Should the free market allow for entire private militaries that are potentially just as corruptible and dangerous as a government one?\n\nSure, any army private or public is potentially corruptible to the highest degree - but so what? What matters is what is more *likely*, not what is potentially or *logically* possible. There's *some* small potential that everyone in the world will kill themselves tomorrow, but obviously that's not a very useful thing to think about.\n\nI would make a couple points though. Firstly, a private army as a private entity would not be able to externalize the cost of war onto a 3rd party. In the case of the state, the state externalizes the cost of war onto the tax-payer. Private armies would have to pay for their own wars, and since war is so ridiculously expensive, I don't think you'd see many of them fighting.\n\nSecondly, private armies would be subject to market regulation that governments are not. Since these armies would be sustained by the voluntary pay of customers, as opposed to the parasitic tax revenue of a state, and since an army has an insane degree of liability, such institutions wouldn't exist without having gone through an extremely critical consumer review process. To put it simply, private armies don't just pop up out of the ground out of nowhere. The only way a private army would exist is if people voluntary pay for it, and people aren't going to pay for an army unless they have some pretty damn good reasons to believe that the army will \"behave\".\n\nLastly, just like all sectors of the market, profits and losses will reallocate resources from unproductive entrepreneurs to productive ones. Armies which aren't serving their purpose, or are rumored to (perhaps) be secretly planning an attack on the people, or cannot guarantee that they will behave sufficiently will go bankrupt and cease to exist.\n\nTo summarize, for these reasons I think private armies would be far fewer, far more regulated, and far less corrupt. State armies in contrast are, well, completely savage according to all of history.\n\nYour last bullet note can be answered by my previous remarks.\n\nIf you want to know how we can be free without a state, watch Hoppe ([part 1](http://www.youtube.com/watch?v=kREs5PfTnnk), [part 2](http://www.youtube.com/watch?v=TBER0noHGC8)), or read [this book](http://www.amazon.com/The-Market-Liberty-Morris-Tannehill/dp/1610162455/ref=sr_1_cc_1?s=aps&amp;ie=UTF8&amp;qid=1359616722&amp;sr=1-1-catcorr&amp;keywords=tannehill+market). I surely have some reading to do as far as the roads situation there, a few people have beat you to the punch there. Thanks for the input though.\n\nBecause I don't feel like re-articulating it, I'll copy what I responded to another Redditor from this thread:\n\n&gt; I understand the point, but I still don't see how a private army would be a force comparable to a national military funded by leeching off tax money. Would there be enough people interested in the country as a whole to employ themselves in this private army? It seems more likely to me that people would worry about matters closer to home and providing for the defense of their local situation, which would systematically fall at the hands of an organized invasion involving air support, artillery, fleets of ships and squadrons of tanks.\n\nWould Ancapistan not just fall to the might of another military super-power interested in taking advantage of the lack of unified force to seize our resources?\n\nEDIT: Quoting   &gt; Non-interventionism.\n\nI would point you to some resources why generally interventions dont leed to the outcome you want.\n\nhttp://www.amazon.com/After-War-Political-Exporting-Democracy/dp/0804754403\n\nOn a private bases it might be good sometimes to go into countrys and try to help out. But you have to know that that is what you are doing, you helping out a groupe of people, you are probebly not chaning the long run political and economic prospective of people.\n\n&gt; Standing militaries.\n\nHow about this, one big bomb. Who would attack?\n\nOther then that, buying things is always cheaper in AnCap land. The only reason for a attack would be some irrational hate or something, while it is often seam to be irrational hate it more often is actually some political game.\n\nNext up, if you trade with people it seams very lickly that they will not attack you, specially since all the buissnessman will lobby for the goverment not to do so. &gt;Next up, if you trade with people it seams very lickly that they will not attack you, specially since all the buissnessman will lobby for the goverment not to do so.\n\nUnless they decide they would better control your resources better than you. Historically war is *mostly* fought on the basis of religion and resources, two very valid reasons an irrational yet powerful nation would be interested in invading.  Good title!\n\nRoads: I know you've already been pointed here but for the sake of completeness, this is useful: http://mises.org/books/roads_web.pdf\n\n&gt; Non-interventionism. How far does non-interventionism go? If it truly stands to not intervene 100% of the time, then I cannot support it.\n\nThe point is that _the state_ should not intervene in foreign conflicts (which is a colloray of the state not existing ;)). Any such involvement by the state necessarily means taxation to fund it, which means expropriating funds, under threat of force, from people who would have preferred to use their resoutrces differently.\n\nOn the other hand, if there's a 'unit' 'taskforce' etc that is funded voluntarily, that seeks to defend those who are victims of aggression somewhere, I don't believe (rothbardian) ancaps can have a principled opposition to that--assuming that no innocents were going to be aggressed against in the process.\n\n&gt; Should the free market allow for entire private militaries that are potentially just as corruptible and dangerous as a government one?\n\nI'm not sure i follow the question. But an important reason that a tax-funded entity might be expected to be more corruptible than a private one (under freed market conditions), is that a privately funded entity cannot go bankrupt. So a scandal will still damage certain people in that entity, but it will not (usually) mean the end of said entity.\n\nIn addition, the tax funded entity often has little no direct market competition (eg. police or military), so it has very little incentive to provide credible assurances of _the lack of corruption_. Providing such assurances (eg. inviting 'hostile' inspectors to regularly review the details of their firm), to the extent that they're credible, makes it more difficult to be corrupt.\n\n&gt; In this modern age, I believe that if we became a purely libertarian nation with no standing military, there are plenty of non-libertarian nations that would wield a much stronger and better organized force against what our free-market could muster up. Should the nation hope and pray that private force is enough to hold, say, the Chinese or Russians (if they so chose to invade us) at bay?\n\nChaos Theory by Bob Murphy does (imo) a good job of explaining how insurance firms using dominant assurance contracts could solve this problem, and provide a defensive military along entirely voluntary lines http://mises.org/document/3088 Awesome, looks like I'm set on literature for a while!\n\n The corruption question was poorly phrased. I was more referring to the idea that, once a private military gains wealth and manpower, what's to stop it from forcibly taking property and land from those around him? In an ancap society, isn't the immoral man with the bigger gun going to subjugate the moral man with less power?\n\nThanks for your input.  Regarding national defense, there's a lot of material out there that I think has been linked to you, but here's here's two things off the top of my head that I found convincing:\n\n1. Usually in a military invasion, the invading force takes over an already existing government apparatus. This means that it coopts and gains from an already existing obedience to a government authority. There is no such thing in an anarchist situation. All persons are sovereign. An invading state basically has to force every single person at gunpoint in order to rule the territory. And remember that a government does not rule purely by force; it rules through the *perception* of power by the population. Government bureaucrats are vastly outnumbered by the citizens they \"rule\". Anarchist territory is basically one big guerrilla warfare swamp.\n\n2. You will still have professional defense firms with the sole purpose of defending their clients. These firms can focus strictly on defensive measures while states are prone to warmongering. They'll also use their funds more efficiently than states, and be more willing to do things that states won't do in an effort to actually minimize or neutralize a threat; since the state first and foremost wants to preserve it's own power and existence. This would most notably be recognizing other states as being more aggressive entities. E.g. the firm could work to undermine the relevant population's support of it and reduce its power, fund resistance groups, place bounties on the head of such states (they'd have a lot of money) etc. #1 brought to light a lot of points I've never considered. If you're not playing the game as a nation, the opposition would have to win thousands of mini wars.\n\nBut is China not prepared to fight in this way? Yeah and the government has a vested interest in making it seem like there's just this one big fight that needs to be won.\n\nBtw here's two Youtube users that you might be interested in:\n[This](http://www.youtube.com/lengthyounarther) guy has some videos on wars and national defense. [Larken Rose] (http://www.youtube.com/user/LarkenRose/videos?sort=p&amp;view=0&amp;flow=grid) talks alot about the myth of government power. [Another](http://www.youtube.com/watch?v=xrKKyV6ynAs) good video with him. And you're probably familiar with [Stefan Molyneux](http://www.youtube.com/user/stefbot).\n\n&gt; But is China not prepared to fight in this way?\n\nI guess you could have a major superpower just dumping money and resources into an attempted takeover. But if they're so adamant I guess don't know how a State will solve it.  ROADS - The next time you see a road crew building or repairing a road, take a look at the name on the trucks. In nearly every case, it's a private company doing the construction. This tells us that when roads need to be built or maintained, private companies are more than up to the task. Payment for roads could come from many sources, from direct-pay tolls (EZ pass or similar) to subscriptions, advertising, etc. \n\nOur world is the by-product of an overly subsidized road network that separated suburban residential neighborhoods from the urban job centers. This disconnection would not have occurred without this subsidy. By moving people away form where they work, you incentivize car ownership and road use, particularly the interstate highway system. These subsidies create massive market distortions which in turn leads to bizarre phenomena. How else to explain a bottle of water, shipped all the way from middle of the Pacific Ocean, selling in a Chicago grocery store for less than $2?\n\nThe main point about roads in a free society, however, is that there would likely be fewer of them. Roads are heavily subsidized by non/infrequent drivers. Further, car drivers pay a disproportionately large proportion compared to trucking companies who cause the vast majority of damage to the roads. Where roads are paid for by the actual users, in proportion to the amount of damage they cause, road networks will shrink to their optimal level. \n\nINTERVENTION - Nothing in a free society would prevent someone from volunteering to fight in a foreign conflict. There just won't be tax revenue to subsidize it.\n\nSTANDING ARMY - Free trade creates the conditions for mutual dependencies which safeguard localities from invasion. Consider the multitude of small and micronations. How many have a formal military, beyond a small paramilitary police force? In fact, some have no military at all (Costa Rica for example). Yet these nations are surrounded by nations which do. What prevents them from being overrun/conquered/annexed?\n\nIn many cases, these small nations are tax havens, giving the ruling class in those neighboring states a safe place to stash their wealth. In other cases, the small nation is an important center of tourism, finance or manufacturing, providing valuable goods and services which can be traded for protection. Also, as has been mentioned before, assassination politics can be a very powerful deterrent to invasion or aggression. Finally, a well armed population makes invasion/occupation a much more complicated endeavor than if the population was disarmed. So an ancap society would blur the line between commercial and residential areas? I could see that. \n\nThe thing I still have issues with is applying anarcho-capitalism to the realities of our current situation. Sure, all of this sounds good if we were to start Ancapistan on Mars, but it can't be done now. We're past the point of getting there. There are too many holes the state would leave if it were abolished.\n\nWorks well in theory, not possible in America in reality. &gt; ...it can't be done now. We're past the point of getting there. There are too many holes the state would leave if it were abolished.\n\nThis is an interesting view point. I'm interested to hear about what holes you see the state leaving behind if it were abolished. Do you have a couple of examples that come to mind? Well I think the most obvious one would be defense. I'm beginning to understand the concept of private defense firms, but right now, since we have a massive and powerful state provided military, there is a very small demand for private organizations. With the demand for defense remaining the same, a complete cut-off from the supply (national military) would leave a hole that would take time to fill in with the free market.\n\nAlso, ancaps usually argue that the free market would provide private inspection organizations as a way of earning the trust of potential customers. It would be good for business. This is almost entirely a government run function right now. I know a lot of people that I talk to say they would be extremely uncomfortable with the idea of unregulated/uninspected food and health products. While \"Ancapistan\" would have an efficient private service, the abolition of the state would also leave that hole.\n\nI suppose another good example would be firefighting and paramedic services. State organized. A hole that can be filled with the free market, but again, not immediately. \n\nAs you've stated, our infrastructure has been created by the state and is efficient (relatively) for a state run system. Not as much for an ancap system. Right now we have a circle piece that goes through a circle hole. Introducing ancap would be trying to fit a square piece in a circle hole.  Sidebar is useful:\n\n[Full set of Intro Liberty Packages](http://www.reddit.com/r/Anarcho_Capitalism/comments/zbujt/anyone_got_the_full_set_of_intro_to_liberty/c63ad2x)\n\n\n**Roads Package:**\n\nhttp://www.reddit.com/r/Anarcho_Capitalism/comments/zbujt/anyone_got_the_full_set_of_intro_to_liberty/c6dm69o\n\n\n**War/Defense:**\n\nhttp://www.reddit.com/r/Anarcho_Capitalism/comments/zbujt/anyone_got_the_full_set_of_intro_to_liberty/c63flr5   Another point on militaries.  Defense could be privately funded.  I suggest you read [Chaos Theory](http://mises.org/document/3088/Chaos-Theory).  I found it to be a very helpful explination of how a free people would fund their own defense.  [(Who would build the) roads, bridges, tunnels?](http://3.bp.blogspot.com/-rYNbwEd4fD4/Txz6RROJRuI/AAAAAAAAANg/2ipSkKI0uQw/s1600/Businessman_Holding_Gun_To_Head_MON098143.jpg)  &gt;Roads, bridges, tunnels\n\nShit... got us!",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17lhub/anarchocapitalists_these_are_the_things_that_are/"
  }, {
    "id" : 22,
    "title" : "UK watchdog determines that high fuel prices are not caused by price fixing but by high taxes",
    "snippet" : "   No shit Sherlock. I had to laugh my arse off when i read this on the BBC News site the other day.\n\n&gt;\"The Office of Fair Trading decides soon whether to launch an investigation into fuel prices, hopefully tackling the fuel industry's treatment of drivers, consumers and businesses.\"\n\nA litre of petrol is 132.9p, this breaks down as 47.8p is the actual price of the fuel, add 5p for the retailer, so the actual cost to the consumer without tax would be 52.8p. Now that amount is taxed which adds 57.95p to it and it's now 110.75p. This is then taxed further at 20% (VAT) bring it up to the 132.9p.\n\nThey have the cheek to tax the fuel tax and the OFT was going to look at the fuel industry? I guess QUANGO's don't want to bite the hand that feeds them and look at the real problem. The industry can make oil rigs, survey for oil, drill holes all over the world, ship it around the globe for refining etc. and would only charge 52p for that, i'm amazed they can do it for that price, i bet the raw cost of getting petrol is much much lower than that even. If I remember correctly, crude oil is also taxed before it's refined.\n\nOil has one of the lowest returns per volume of any commodity. I'm curious how expensive petrol a litre would be if all the taxes you don't see were deducted from the costs. Tax on equipment, land, fuel to transport the fuel around the globe etc.\n\nFuel prices push up the price of everything as well since products have to be transported. Food in particular, food prices have doubled for me in 5 years, i look at how much i pay for it now, and what that used to get me in 2007 and it's sickening. No shit Sherlock. I had to laugh my arse off when i read this on the BBC News site the other day.\n\n&gt;\"The Office of Fair Trading decides soon whether to launch an investigation into fuel prices, hopefully tackling the fuel industry's treatment of drivers, consumers and businesses.\"\n\nA litre of petrol is 132.9p, this breaks down as 47.8p is the actual price of the fuel, add 5p for the retailer, so the actual cost to the consumer without tax would be 52.8p. Now that amount is taxed which adds 57.95p to it and it's now 110.75p. This is then taxed further at 20% (VAT) bring it up to the 132.9p.\n\nThey have the cheek to tax the fuel tax and the OFT was going to look at the fuel industry? I guess QUANGO's don't want to bite the hand that feeds them and look at the real problem. The industry can make oil rigs, survey for oil, drill holes all over the world, ship it around the globe for refining etc. and would only charge 52p for that, i'm amazed they can do it for that price, i bet the raw cost of getting petrol is much much lower than that even. In tx i pay $3.15 a gal with taxes, and i hate paying that much. 132.9p per litre works out to about $8 per US gallon.  statists gonna state  Taxation *is* price fixing. Was that the point? Taxation *is* price fixing. Was that the point? ",
    "url" : "http://www.telegraph.co.uk/motoring/news/9836448/Ministers-to-blame-for-high-fuel-prices-says-competition-watchdog.html"
  }, {
    "id" : 23,
    "title" : "An Overview of the post-Hurricane Sandy Black Market in Gasoline. Astonishing.",
    "snippet" : "  ",
    "url" : "http://petercearle.com/writing-research/sandy-gasoline-black-market/"
  }, {
    "id" : 24,
    "title" : "Morningland Dairy raided and another family business destroyed",
    "snippet" : "  ",
    "url" : "http://www.youtube.com/watch?feature=player_embedded&amp;v=di_7aBLVn3Q"
  }, {
    "id" : 25,
    "title" : "What would you predict would happen if gvmt reverse-redistributed? Subsidize profits and tax losses.",
    "snippet" : "Of course, I'm not saying this would be just, or that it's even preferable. But I'm just wondering what consequences there would be in this exact opposite policy.  \n  \nSo, for example:\n\n*For each financial year, every dollar of profit or income will be awarded with a subsequent 2%.\n\n*For each financial year, every dollar of losses will be taxed 2%.  \n  \nOr something similar. I guess the obvious is that everybody would become more risk averse, and sub-optimally so.      ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17mlqk/what_would_you_predict_would_happen_if_gvmt/"
  }, {
    "id" : 26,
    "title" : "Why people are not idiotic.",
    "snippet" : "Jacob Spinney's refutation that Libertarianism is idiotic was recerntly discussed [here](http://www.reddit.com/r/Anarcho_Capitalism/comments/17jh1k/why_libertarianism_is_not_idiotic_xpost/). I'd like to expand the conversation and discuss one of the points that Dusty made which is that people are idiots and they are stupid. Besides the point that government in no way is necessarily prevented from having people of sub-par intelligence, and arguably more so due to hiring and firing practices, let's just say it's a given most people aren't all that bright. \n\nObviously since idiocy means below average intelligence let's argue on the assumption that most people are simply capable of performing routine tasks in a mostly unsupervised fashion and have a below average judgement. \n\nEven in the cases of the above people are *still* able to work voluntarily together and achieve their ends. You can visit a weekend flea market in a poverty-stricken area and still see people bartering over price and determining what products best suit their needs. They are still forced to live with the true realities of scarce resources and the demands of their own physical beings so they must manage to find and maintain shelter and provide food for themselves. People did this for tens of *thousands* of years before the emergence of modern history and under much harsher conditions.\n\nBut people aren't idiots. Even if many people don't have the best verbal or writing skills they still possess a shrewdness that allows them to come to agreements on contracts purchase items that suit their needs and get jobs that requires they operate at a certain level of independence.\n\n\nI've interacted with people from the aforementioned flea markets to billionaires who were the top of their fields and the one thing that always seemed to be consistent was not what people consider the tell-tale signs of intelligence like eloquence and the ability to recite facts but rather the ability to discern the value of a given situation. To me that is the heart and soul of economics the iterated discernment of value within the given environmental parameters. A continuous cost/benefit analysis that people perform naturally optimally or sub-optimally. \n\nWhether people care about high literature, science, math or even show good judgement in other areas of their lives is not entirely relevant though not to say as individuals we shouldn't encourage a broad array of interests and learning but that is another topic.  It's tempting for eloquent people to condemn people without their verbal skills as \"stupid.\" To generalize, most libertarians are in that eloquent category. I know that I came across libertarian thought in my (arguably megalomaniacal) quest to fortify my intellect and to improve my writing.\n\nThat's our narrow field. But if you put your average libertarian up against the average electrician, the libertarian would appear to be \"electricity-stupid,\" with, at best, only a sparse theoretical knowledge of how to wire a home. Similarly, if you put that electrician next to a computer programmer, the electrician would have little knowledge about how software works.\n\nSaying that people are \"stupid\" in general is just wrong, as you point out. Intelligence is domain-bound, and people tend to adapt effectively to their surroundings and the opportunities available to them to exploit. As Mises wrote, human action is purposeful. People try to better their lot using the methods that they think will work. It's tempting for eloquent people to condemn people without their verbal skills as \"stupid.\" To generalize, most libertarians are in that eloquent category. I know that I came across libertarian thought in my (arguably megalomaniacal) quest to fortify my intellect and to improve my writing.\n\nThat's our narrow field. But if you put your average libertarian up against the average electrician, the libertarian would appear to be \"electricity-stupid,\" with, at best, only a sparse theoretical knowledge of how to wire a home. Similarly, if you put that electrician next to a computer programmer, the electrician would have little knowledge about how software works.\n\nSaying that people are \"stupid\" in general is just wrong, as you point out. Intelligence is domain-bound, and people tend to adapt effectively to their surroundings and the opportunities available to them to exploit. As Mises wrote, human action is purposeful. People try to better their lot using the methods that they think will work. Knowledge is domain-bound. Intelligence is not. But you will always tend to seem more intelligent if you can speak or write well, regardless of what skills you have as an electrician. Whether this is meaningful strikes me as one of those philosophical exercises on which no one's made any headway in thousands of years. You can certainly be a good person and still be thick as a brick. I do think it's a meaningful observation, because of the tendency of verbally talented people to condemn the verbally clumsy as 'stupid.' I'd include the younger, more arrogant version of myself in that category.\n\nI've seen both libertarians say that their cause is hopeless due to the stupidity of humanity and statists say that freedom is unworkable due to the obvious 'dumbness' of the majority.\n\nI suppose it comes down to how you define intelligence. I don't find IQ tests to be meaningful measures of useful brainpower. I'm sure Paul Krugman has a high IQ, for example, but he's a rather destructive fellow. It's tempting for eloquent people to condemn people without their verbal skills as \"stupid.\" To generalize, most libertarians are in that eloquent category. I know that I came across libertarian thought in my (arguably megalomaniacal) quest to fortify my intellect and to improve my writing.\n\nThat's our narrow field. But if you put your average libertarian up against the average electrician, the libertarian would appear to be \"electricity-stupid,\" with, at best, only a sparse theoretical knowledge of how to wire a home. Similarly, if you put that electrician next to a computer programmer, the electrician would have little knowledge about how software works.\n\nSaying that people are \"stupid\" in general is just wrong, as you point out. Intelligence is domain-bound, and people tend to adapt effectively to their surroundings and the opportunities available to them to exploit. As Mises wrote, human action is purposeful. People try to better their lot using the methods that they think will work.  They are utilizing the strength of heuristic knowledge - the knowledge that comes from trial and error, rather than from academic investigation of scientific theories.\n\nSimilar to how evolution proceeds to create competitive species without requiring teleological design, heuristic knowledge proceeds by trying many different approaches and eliminating the ones that do not work. What is left are only the strategies that produce the desired outcome. There is no need to explain *why* those strategies work; it is enough to see that they do work. And heuristics is something I use to identify the needs of my clients from associate to executive level. Great way of summing it up.  Have you read any of Nassim Taleb's work? He gives a great presentation of these ideas in Antifragile.  Even though 50% of people are below average, the majority of them are close to average. And our average isn't that bad, it's maintained a pretty decent civilization thus far.  but it's also scaled on the absolute knowledge scale. So over time the average person is smarter than it's predecessor.   I focus on IQ, the measure of intelligence. The intelligence of humans hasn't changed all that much for thousands of years, if we look at skull measurement and other indirect measures of intelligence.  [IQ scores have risen](https://en.wikipedia.org/wiki/Flynn_effect), but the question is: why? The best theory I've seen is that children mature earlier than they used to. \n\nThe rise in IQ scores doesn't seem to correspond to a rise in real intelligence.  No dude, we're way way way way smarter than we used to be. Most people were mentally retarded before 1900, by today's standards. Wait, do you have any sort of proof for that claim? I don't see that being possible. No dude, we're way way way way smarter than we used to be. Most people were mentally retarded before 1900, by today's standards. The best theory I've seen is that children mature earlier than they used to. \n\nThe rise in IQ scores doesn't seem to correspond to a rise in real intelligence.  I focus on IQ, the measure of intelligence. The intelligence of humans hasn't changed all that much for thousands of years, if we look at skull measurement and other indirect measures of intelligence.  but IQ will rise... due to the increase in knowledge. People know more now than we did then... Knowledge is not IQ.  I know but they are directly related. Knowledge is not IQ.  but IQ will rise... due to the increase in knowledge. People know more now than we did then... That's a bizarre claim. People also rely more on tools to \"outsource\" their memories which can have various impacts on intelligence. People will not necessarily become more globally (not worldwide but various types of intelligence) intelligent but in fact might be lead to specialize and thus impede other areas of intelligence. Even though 50% of people are below average, the majority of them are close to average. And our average isn't that bad, it's maintained a pretty decent civilization thus far.   People are remarkably intelligent if you allow them to be. The problem is the lack of metric as to what \"intelligence\" is and the rational ignorance that comes with living with a government. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17kqz6/why_people_are_not_idiotic/"
  }, {
    "id" : 27,
    "title" : "Keynes for Kids. This is a treasure trove. (x-post r/austrian_economics)",
    "snippet" : "  Not sure... If serious... [Apparently it is.](http://jonwhitestudio.com/#keynesforkids) &gt;Discredited Economic Theory:\n&gt;Real Business Cycle Theory\n\n&gt;Okay, okay, we'll concede reality for a minute: If markets are all-knowing, then how come we do have slumps sometimes? A-ha! Easy! According to R.B.C.T., it's simply because, enh, you're just not adjusting to the slump fast enough. And yes, I really do mean you, Mister Working-to-Middle-Class Wage Laborer. See, in the eyes of R.B.C.T., \"cycles are due not to temporary deviations from an optimal level of output, but to fluctuations in the level of potential output itself\" (Skidelsky, 2009). In other words, you should really fluctuate (lower) your standards in this new climate, pal. Accountants should become taxi drivers! Cartoonists should become chimney sweeps! And quickly! Anyone who's unemployed is just doing it by choice, because they like naps. (Oh, and government should back off.)\n\nAre you sure?\n\n&gt;Say's Law\n\n&gt;The most prehistoric — and stubbornly persistent — of them all. Named for French economist Jean-Baptiste Say, the Law assumes that money supply will always, perfectly, equal money demand. Of course, the implications are hilarious. There can never actually be any unemployment! Stuff for sale will always have a willing buyer — because people would never want to hoard money, right? And government intervention would never actually be needed! Heck, it'll only get in the way!\n\nThese seem more like intentionally and hilariously bad representations of Austrian/Classical economics. He's got a [twitter account](https://twitter.com/jonwhitebriefly) with FDR as his background. Ultimate troll?\nLike this guy: http://www.facebook.com/DeepThoughtsByBenBernanke?fref=ts\n\nExcept far more subtle. Love that site! But no, I think we got the real deal here. I mean, look at that strawman description of Say's law. That's not satire, that's keynesian ignorance.  Frightening.  Really? I thought it was hilarious.\n\nI like that the even made a game out of digging for bottles of money. And a paper doll game. I swear our culture is becoming Chuckie Cheese, from the PSA's right on down to Krugman's platinum token. All we need now is a fed chairman who can score some tickets from skeeball and our lives will forever be blessed. &gt;I swear our culture is becoming Chuckie Cheese...\n\n[I wish.](http://www.youtube.com/watch?v=tiXQu0Yqr9o)  I was taking the quiz, and I think it's broken, because it's saying all my answers are wrong ;)\n\nBut anyway, what's this thing on the quiz where they claim private spending isn't happening *anywhere*? That's just stupid and a straw man. I scored 0 out of 5 economic fallacies. How did you all do? Once I realized that they're looking for the wrong answer, I got 4/5 :P It was the last one, right? Although I'm sure we have a very different understanding of demand than people who reject Say's law.",
    "url" : "http://keynesforkids.com/"
  }, {
    "id" : 28,
    "title" : "Would you kill if ordered to?",
    "snippet" : "  The thing one should remember about Milgram's experiment is, almost everyone states that they would not kill people if ordered to do so. Most people really, truly believe they wouldn't do what people on average do in Milgram's experiment. So just puffing out your chest and stating there's no way you'd do this - well, that's the average reaction to the question. And the average reaction to being in the experiment is carrying out a simulated murder.  I'm not sure AnCaps, voluntarists, or other anarchists or anti-statists are \"the average\" when it comes to reaction to authority. Let's not forget that many people *did* refuse (all or most of them male). &gt;Charles Sheridan and Richard King hypothesized that some of Milgram's subjects may have suspected that the victim was faking, so they repeated the experiment with a real victim: a \"cute, fluffy puppy\" who was given real, albeit harmless, electric shocks. They found similar findings to Milgram: half of the male subjects and all of the females obeyed to the end. Many subjects showed high levels of distress during the experiment and some openly wept. In addition, Sheridan and King found that the duration for which the shock button was pressed decreased as the shocks got higher, meaning that for higher shock levels, subjects showed more hesitance towards delivering the shocks.[[31](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-31)][[32](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-32)][[33](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-33)]\n\n &gt;all of the females obeyed to the end\n\nWhy aren't there more female libertarians, they ask? &gt;all of the females obeyed to the end\n\nWhy aren't there more female libertarians, they ask? &gt;all of the females obeyed to the end\n\nWhy aren't there more female libertarians, they ask? Are women trusting of authority by nature or nurture? &gt;Charles Sheridan and Richard King hypothesized that some of Milgram's subjects may have suspected that the victim was faking, so they repeated the experiment with a real victim: a \"cute, fluffy puppy\" who was given real, albeit harmless, electric shocks. They found similar findings to Milgram: half of the male subjects and all of the females obeyed to the end. Many subjects showed high levels of distress during the experiment and some openly wept. In addition, Sheridan and King found that the duration for which the shock button was pressed decreased as the shocks got higher, meaning that for higher shock levels, subjects showed more hesitance towards delivering the shocks.[[31](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-31)][[32](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-32)][[33](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-33)]\n\n &gt;Charles Sheridan and Richard King hypothesized that some of Milgram's subjects may have suspected that the victim was faking, so they repeated the experiment with a real victim: a \"cute, fluffy puppy\" who was given real, albeit harmless, electric shocks. They found similar findings to Milgram: half of the male subjects and all of the females obeyed to the end. Many subjects showed high levels of distress during the experiment and some openly wept. In addition, Sheridan and King found that the duration for which the shock button was pressed decreased as the shocks got higher, meaning that for higher shock levels, subjects showed more hesitance towards delivering the shocks.[[31](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-31)][[32](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-32)][[33](http://en.wikipedia.org/wiki/Milgram_experiment#cite_note-33)]\n\n I'm not sure AnCaps, voluntarists, or other anarchists or anti-statists are \"the average\" when it comes to reaction to authority. Let's not forget that many people *did* refuse (all or most of them male). I don't disagree, but I think it's potentially dangerous to regard yourself as immune to this kind of situation... because that means you might not be on the alert for it. Not that this specific situation is common (thankfully), but illegitimate authority has a lot of forms. \n\nInterestingly, Milgram didn't think the experiment would give the results it did. He originally planned it as a way of showing that Americans couldn't do what the Nazis did - the boots on the ground of the Holocaust were mostly just following orders. Milgram figured Americans were intrinsically too anti-authoritarian to do such a thing.  did he try this on Americans? these people in the video were british... The original experiment was run in the States.  It depends what the consequence of refusal was.  &gt;[The influence is ideological...](http://www.youtube.com/watch?feature=player_embedded&amp;v=IzTuz0mNlwU#t=235s)\n\nIt seems ideology can get people to do scary things. If you can justify trampling on the rights of others for your idea of the \"greater good\", than certainly. I wonder how many people have died at the hands of people who think the ends justify the means. Millions and millions. I might be undershooting by quite a lot here.  I couldn't stop rolling my eyes throught this whole video.\n\nIts not the volts that kill you, its the amps. 10 milliamps is \"safe\", 100milliamps is lethal, and 15amps is what comes out of a standard wall socket.\n\nMany tasers can go up to 50,000 volts. Usually no less then 1,000 volts. The apms on tasers can vary, and police misuse them. Thats why so many people die to tasers.\n\nThis is electricity 101. You miss the point of the experiment (or the original, by Milgram), as well as some of the details.\n\nOne of the details is that the shocks were \"lethal\" because the learner supposedly had a heart condition. In the original experiment he fakes a heart attack.\n\nThe point, though, was to contrive a situation where the true subject _did not know_ what was really going on. They could have been administering fictional bee stings, as long as the true subject thinks the punishment could be harmful. The experiment was to see if the true subject would follow orders up to and past what they were led to believe was harmful.\n\nIronically, the experiment happened to see how people justify their actions by leaning on orthogonal knowledge. I presume a 50,000 volt, 10-milliamp shock from a taser has never killed anyone with preexisting conditions? You miss the point of the experiment (or the original, by Milgram), as well as some of the details.\n\nOne of the details is that the shocks were \"lethal\" because the learner supposedly had a heart condition. In the original experiment he fakes a heart attack.\n\nThe point, though, was to contrive a situation where the true subject _did not know_ what was really going on. They could have been administering fictional bee stings, as long as the true subject thinks the punishment could be harmful. The experiment was to see if the true subject would follow orders up to and past what they were led to believe was harmful.\n\nIronically, the experiment happened to see how people justify their actions by leaning on orthogonal knowledge. I presume a 50,000 volt, 10-milliamp shock from a taser has never killed anyone with preexisting conditions?  Not from merely an order, no. Correct; in Milgram's experiments they changed a number of variables, including the distance of the \"lab coat man\" from the true subject. First in the same room, then an adjacent room, then further way in the same building, then across town.\n\nThe further away the authority figure was, the less likely the subject was to complete the experiment. It wasn't just the order on its own. Well, that wasn't even the sense in which I was saying that.  God damnit I want to be a part of an experiment like this! How does one get themselves involved in experiments enough that you could hit an experiment such as this?    ",
    "url" : "http://www.youtube.com/watch?v=BcvSNg0HZwk"
  }, {
    "id" : 29,
    "title" : "Revolution via copypasta? 3d printing and liberty. ",
    "url" : "https://www.youtube.com/watch?v=6I5sd-pNQ8w"
  }, {
    "id" : 30,
    "title" : "One of the more interesting minarchist objections I've seen (though, it's still slightly misguided)",
    "snippet" : "  I think it's funny that he uses the example of the Wright Brothers needing to understand the principles (formal conscious ideas) of aerodynamics to build their airplane. Well, actually they had no formal aerodynamic training, so they were just tinkering and trying out whatever they thought might work, then pruned away the things they didn't like.\n\nThis is essentially how a polycentric legal system would arise in ancapistan. There would be no need for steadfast moral principles, since the libertarian ethics seem to align naturally with emergent systems for satisfying individual preferences. Michael seems to be stuck in a rut trying to \"spread the gospel\" so to speak about libertarianism, and believes that if people don't intentionally follow libertarian ethics, they will end up behaving in a non-libertarian way. This is a really *expensive* strategy to change an entire society. It's the equivalent of picking up 1000 dominoes one by one and laying them on their side, rather than just knocking down the first domino and watching them all fall.\n\nIt's the difference between believing that libertarian ethics must be imposed in a top-down manner, and realizing that libertarian ethics will *emerge* once the superstition of the state is left behind. Michael is still interested in trying to \"change human nature so we don't want to commit violence anymore\". *sigh* Yeah, his counter-arguments were obviously flawed, but the part of it that I found more forceful was his objection that a pseudo-government is all that the State is being replaced with, and it's possible for an individual's personal values to become in conflict with a critical number of those who can apply overwhelming force in a spontaneous society.\n\nI like it only because it forces the deontological ancaps to come to grips with arguing that it'd be sunshine and lollipops for all.  1st he says that if you hire out people to defend you then you have just created a government. Only this is crap because government is not voluntary. The he says people make contracts like 'constitutions' and this is true. ONLY I did not sing the contract and so if the two people on this island sign a contract well thats one thing. But if a thousand people on the island didn't how can they be bound to it morally?  What about if everybody on the island signed the contract and then a generation passed and their kids grew up and would have plenty of people on the island who didn't sign any contract.  I don't see how a contract can include even one person who did not sign it. The first child born on that island could not morally be bound by the contract till he or she decided to sign it.  You mean, it could leave if it didn't like it there or sign the contract? 1st he says that if you hire out people to defend you then you have just created a government. Only this is crap because government is not voluntary. The he says people make contracts like 'constitutions' and this is true. ONLY I did not sing the contract and so if the two people on this island sign a contract well thats one thing. But if a thousand people on the island didn't how can they be bound to it morally?  Neither did the anti-propertarians 'sign the contract' that property will be enforced, but it will be. Neither did I sign a contract saying that I will not use/loot their houses and possessions (property lol), yet they full expect that. You must think I have pity on the anti-propertarians.\n\nI'm only saying no one has the moral high ground. 1st he says that if you hire out people to defend you then you have just created a government. Only this is crap because government is not voluntary. The he says people make contracts like 'constitutions' and this is true. ONLY I did not sing the contract and so if the two people on this island sign a contract well thats one thing. But if a thousand people on the island didn't how can they be bound to it morally?  A government is the system by which a state or community is governed...Government can be voluntary if you want it to be... It can be voluntary. The rules I work under are voluntary because I signed on under them and can quit at any time.  What we are talking about are laws that I never agreed to live under and must obey or be killed  Lol \"5% government\". In other words \"I see the logic of anarchism, but I'm too emotionally crippled to let go of the mantra taught to me all my life\". I think that is mostly the fact that if we live by a set of rules that are going to be enforced by a common arbitrator, it's equal to saying that you have government.  It depends on how you define \"we\". If you define it by the group of people who have expressed consent, then 1) I have no problem with this, and 2) I don't think this meets the common definition of \"government\". If you define it by the group of people who live within an arbitrarily delineated territory, then 1) I have a problem with this, and 2) I think this meets the common definition of \"government\". I define government as the first description that you stated. once government starts making rules that does not affect it... that's when we start having problems where legislators do whatever. Do you think that the term \"stateless government\" makes sense? No. There is no way to become stateless unless you never have any human interaction. Do you believe that a society which has no rulers is possible? It is... but the way that we are going where we are becoming more and more specialized in our fields of research and work, I don't think that it's a possibility. What is it about specialization that will create a ruler? Do you believe that a society which has no rulers is possible? No.\n\nBut, I don't think, in a stateless system, the benefits are quite as concentrated, but the penalties for going against the critical force appliers are still somewhat harsh. Who are the critical force appliers? What are the penalties and how are they harsh? Who in this scenario is a \"ruler\" and why?  ",
    "url" : "http://www.youtube.com/watch?v=OXGenSJabOs&amp;t=6m16s"
  }, {
    "id" : 31,
    "title" : "How would factions not arise?",
    "snippet" : "Let's say that an anarcho-capitalist society is set up, and there are a number of people that disagree with not having government in their lives.  So, they form their own government and see the need to expand onto those that are living anarchy.  How would this not occur and what would people do to prevent that?  An anarcho-capitalist society will never be \"set-up\". It will simply evolve as markets outpace states in the provision of various services and capture new territories (physical or virtual) before states can or want to.\n\nPeople may want to form a state, but at that point they will not have the means to. The market system will be too robust. States could only exist marginally if at all.\n\nToday (in the U.S.), you couldn't just convince people to form a feudal system or a tribe ruled by a king. People know it's a stupid idea that will only benefit a small amount of people and cost everyone involved a great deal of economic hardship. They are too enmeshed in the pseudo-market system we already have, and to some extent, understand its benefits.   The free people would have to be armed. Not necessarily as well as the statists but enough to fight if needed. And the free people's \"nation\" would have to seem legitimate in the worlds eyes to some extent. Also if a part of an ancap community wants to set up a government that is their own choice. \n\nHonestly imo there is no way to know what will happen if a modern ancap state comes into being since one never has. Not to say we shouldn't try but I don't think their is any real way to know it will work or not since there is no evidence.  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17m1af/how_would_factions_not_arise/"
  }, {
    "id" : 32,
    "title" : "Doug Casey interviews Peter Schiff - YouTube",
    "snippet" : "      [deleted] Jesus, that website is horrible.   ",
    "url" : "http://www.youtube.com/watch?v=kEDmj3qocag"
  }, {
    "id" : 33,
    "title" : "Analysis of the Watchmen graphic novel",
    "snippet" : "I really like the quote [\"Who watches the watchmen?\"](http://en.wikipedia.org/wiki/Watchmen#Themes). Despite differences in the author's original intent, I still think Watchmen does a pretty good job of showing the failures of government and regulation. Excuse me while I nerd out a little.  Also, I have not read the full thing in quite awhile, but I have gone back and scanned a few key pages and used wikipedia to help keep things straight.  Please note and forgive any errors I may have made in this analysis, I will try to correct it!\n\nEdit: Sorry, maybe I should have noted spoilers in the title as well.  In any case:\n\n **SPOILERS THROUGHOUT**\n\n---- \n\n Great art is open to interpretation, even alongside the author's intentions.  You can take away from it what you bring to it, what you read into it says more about the audience than the creator.  It's not surprising that I think the comic book is about anti-authoritarianism and is very anti-superhero, although I take a more anarchistic view than perhaps the author intended.\n\nFor this reason I was a little miffed about the result of the recent film adaptation, although it was still a beautiful looking film.  Perhaps because of this I think it is not as readily open to interpretation: in my mind the artwork of the comic which is now twenty-something years old is grittier and dirtier than the film's portrayal.  The violence in the comic is graphic and extremely disturbing (at least when I read it), and you're left with a very dark ending, not a happy vibrant one.\n\n----\n\n***Main Storyline***\n\nOne of the central themes in the comic is that the superheroes are again and again shown to have weak human sides. They have problems like normal people that their super powers do not/can not address, rather they tend to distort and amplify their problems to effect everyone around them.\n\nThe comedian is murdered despite having great insight and being very well equipped and trained (and he was a murdering rapist who ends up with no friends and cries in front of one of his old enemies). Doctor Manhattan cannot be destroyed, but because of this is alienated from everyone he knows and in the end cannot relate to humans at all (also a murderer). Nite Owl is shown more as an aging man rather than an effective crime solving detective such as Batman (at one point he stands by watching The Comedian attack protesting civilians when he clearly has problems with it, but does nothing). Rorschach is basically a schizophrenic who suffers from PTSD and perhaps some other mental problems, although at least in the end he comes to the conclusion that Adrian must be stopped and is the only fairly consistent watchman (in the end he says \"never compromise\", and he even tells Doctor Manhattan that \"one more body... makes little difference\").\n\nOzymandias is the ideal utilitarian, he coldly calculates that the death of half a city will bring about a \"greater good\" to stop the warmongering among the nations (eerily analogous to the attack on the twin towers I suppose, we've seen how that turned out).  He is unwavering up until the point where his plan is done, then asks Doctor Manhattan whether or not he did the right thing, a truly mad man.  Needless to say he's a monster and the main \"villain\" of the comic.  See also the \"Tales of the Black Freighter\" below.\n\nIn the end the watchmen fail to stop Ozymandias from executing his plan, even though they do eventually uncover it; too little too late. Even Doctor Manhattan, one of the most powerful characters in the comic, doesn't stop Ozymandias and is so inhuman as to consider his plan of the \"greater good\" by concealing Ozymandias' plans to be reasonable.  Thus he kills Rorschach in cold blood rather than allowing him the possibility of spreading the truth.\n\nSilk Spectre throughout has relationship problems with Doctor Manhattan, her mother and father (she finds out that her father was the Comedian), and eventually ends up with Nite Owl. I will submit that this is a fairly weak portrayal and a distorted view of women roles, as most of her problems deal with relationships, but in my opinion she comes out the best out of everyone, which isn't saying much.  She ends the comic still with Nite Owl and makes amends with her mother, but the assumption is that they both will go back to their watchmen roles in some way and keep quiet about the truth.  Truly disgusting, they appear to have learned very little from the incident and proceed almost as if nothing happened.  I don't find this to be sympathetic in the slightest, they are being complicit in Ozymandias' plan by not revealing the truth.\n\nThe problems that the watchmen face is that their enemy turns out to be *one of them*. They are all manipulated by Ozymandias who for the \"greater good\" massacres a city.  They are essentially powerless against his superior intellect. The watchmen who were supposed to look out for the world failed to watch out for one of their own.  Once the plan is executed, out of all the watchmen only Rorschach wants to reveal the truth and is then killed.\n\nThe final conceit of the comic is that the ending does indeed result in at least the temporary ceasefire to major military conflicts, and a unification against a manufactured alien threat. I don't doubt however that following the \"attack\", governments once again resume their warmongering ways eventually, especially when no further aliens attack. The very end of the comic leads you to believe that the truth uncovered by the watchmen in Rorschach's journal is delegated to some crappy newspaper editorial, never to truly see the light of day.\n\n----\n\n***Tales of the Black Freighter***\n\n If you've never read the Watchmen comic, there's a character in the story who reads a comic called \"Tales of the Black Freighter\", which is about a man who turns into a monster.  According to wikipedia it reflects Ozymandias' (and Rorschach's and Doctor Manhattan's) character as a decent into madness.\n\nThere are however some important distinctions.  In this comic within a comic, the story \"Marooned\" shows a mariner who survives a pirate attack, builds a raft out of the bodies of his fellow shipmates, and arrives back at his home town to save it from the pirates, only to attack a couple and his own wife.  Under his own delusions he turns into a murdering pirate himself, and when he realizes this he joins the pirates.\n\nIn Watchmen this realization *does not happen*.  For those you apply this interpretation to, whether it is Ozymandias, Rorschach, Doctor Manhattan or any other character, they do not really discover and confront their own delusions in this way.  They do not acknowledge that they are themselves monsters and do not turn themselves in as criminals and murderers.\n\nIn \"Marooned\" I got the distinct feeling that the mariner understood what he had done, and had willingly exiled himself as a pirate.  None of the characters in watchmen voice and confront their own demons, rather they question others endlessly, self-justify, ignore it, or run from it (Doctor Manhattan leaves the planet).\n\nLike many humans they are not introspective, and as ordinary citizens in this world we would all be the worse for it.\n\n----\n\n***TL;DR*** Giving certain individuals more power, even with the best of intentions, doesn't solve anything, rather it makes things worse.\n\nWatchmen, for me at least, ends in a very bleak way and left me with a terrible taste in my mouth.  I mostly hated it the first time I read it and don't want to read it again in full; now when I go back and scan through it I can see many of these themes which *really* ask the hard question about what we would do if superheroes truly existed.\n\nIt might be terrible if real superheroes were just people with super powers because their atrocities would be magnified, just as giving government institutions (who are after all just made up of people) more power to \"watch over us\" magnifies government atrocities.  &gt;...although I take a more anarchistic view than perhaps the author intended.\n\nAlan Moore is an anarchist, he wrote V for Vendetta.\n\n&gt;The very end of the comic leads you to believe that the truth uncovered by the watchmen in Rorschach's journal is delegated to some crappy newspaper editorial, never to truly see the light of day.\n\nI got the impression that this was how it *would* see the light of day. Rorschach sent it to them on purpose. Exactly, thus revealing the grand plot and rendering the whole plan useless. I held a more cynical view: the way the characters were talking about it, it seemed to me as if no one would have read the publication.  It struck me as one of those sensationalist newspapers like the paparazzi with crazy news stories about how celebrities did something crazy and life moved on, same as before. I held a more cynical view: the way the characters were talking about it, it seemed to me as if no one would have read the publication.  It struck me as one of those sensationalist newspapers like the paparazzi with crazy news stories about how celebrities did something crazy and life moved on, same as before. I held a more cynical view: the way the characters were talking about it, it seemed to me as if no one would have read the publication.  It struck me as one of those sensationalist newspapers like the paparazzi with crazy news stories about how celebrities did something crazy and life moved on, same as before.  Excellent analysis. I enjoyed reading it.  I have been looking at all art (TV, books, movies) in a new light after becoming AnCap.  I am watching Star Trek TNG right now, finding it very interesting as far anarcho-capitalism and voluntarism is concerned.\n\nI like the descriptions of the heroes you put, and then in parenthesis the cold truth of what they really were.  I think that is something people usually forgive heroes for, even if it is on a smaller scale.  When saving 5 lives, 1 was killed, which would be typical in many usual superhero stories.   I think then Ozymandias, doing it planet wide, puts things in perspective.  \n  As an interesting aside, Rorschach was Moore's caricature of a libertarian/Objectivist with a black and white view of the world. He intended that character to be disliked, but the fans love him. As an interesting aside, Rorschach was Moore's caricature of a libertarian/Objectivist with a black and white view of the world. He intended that character to be disliked, but the fans love him.     Keeping in mind that its been quite a while since I read the book, and the movie is more fresh in my head, I always thought Rorschach was the hero of the piece. He was a very black-and-white type of dude, but heroes should be. Right and wrong. Good and evil. He wasn't interested in changing people, or saving the world. He was all about justice/vengeance, however you want to look at it. He didn't really seem to be as into the \"Watchmen\" role as the other heroes. Rorschach wanted to hurt criminals. That's all.\n\nWhen presented with the scenario Ozymandias created, he chose death over keeping the secret. He knew what had been done was unjust, and no amount of rationalization from the other \"heroes\" was going to change his mind. Not to say the guy wasn't troubled. If I recall, he lumps homosexuals into a list with pedophiles. Clearly not a very just position to take. However, when the time came to make a decision, he was the only one that made the right one.    Heh. \"We are not 15 year olds. Here's my analysis of a comic book.\" *One of Time Magazine's Top 100 Novels of all time. Heh. \"We are not 15 year olds. Here's my analysis of a comic book.\"",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17katb/analysis_of_the_watchmen_graphic_novel/"
  }, {
    "id" : 34,
    "title" : "Interesting article about pollution, that gives the impression that enforcing property rights would solve it.",
    "url" : "http://grist.org/coal/2011-09-30-coal-is-enemy-of-human-race-mainstream-economics-edition/"
  }, {
    "id" : 35,
    "title" : "Stefan Molyneux on \"the gays\"",
    "snippet" : "  and? Why the \"WTF?\"? Because \"homosexuality is the result of child molestation\" is a really dumb view that is not supported by the scientific literature, unless you're going to conservative Christian magazines for your \"science.\" &gt; \"homosexuality is the result of child molestation\"\n\nAt what point in the video does he say this? I'm presuming it's a quote. &gt; \"homosexuality is the result of child molestation\"\n\nAt what point in the video does he say this? I'm presuming it's a quote. Because \"homosexuality is the result of child molestation\" is a really dumb view that is not supported by the scientific literature, unless you're going to conservative Christian magazines for your \"science.\" Good thing he doesn't say it's science, he says it's just his experience and what he's noted. In fact, he says it is specifically not scientific. Why say it at all, then? If, in my experience, all ethnic Jews are idiots, is that something I should bring up and preach about on my radio show?  Why is this getting downvoted? I don't really see a connection to politics/anarcho-capitalism, so it seems a little out of place here. Where else would you suggest that we post criticisms of particular anarcho-capitalist figures? Where else would you suggest that we post criticisms of particular anarcho-capitalist figures? I don't really see a connection to politics/anarcho-capitalism, so it seems a little out of place here. You didn't listen to the video (audio with a Molyneux photo). Molyneux doesn't discuss politics. He's talking about his personal experiences with gay people (all anecdotal).  I don't understand what you're trying to tell me.\n\nI did listen to the video. I agree that Stef doesn't discuss politics in the video. I agree that he's talking about anecdotal personal experience with \"the gays\". And I don't see how this connects to the political ideas of anarcho-capitalism, so I consider this submission out of place on this subreddit. Why is this getting downvoted? Why is this getting downvoted? Because the pro-Moly individuals in here can't stand to see him criticized.  Because the pro-Moly individuals in here can't stand to see him criticized.  0/10 troll harder. Not trying to troll at all.   Lesbian couples do have more violent relationships than heterosexual ones.\n\n I can't imagine why two members of a demographic that is subjected to routine verbal and physical abuse by members of the general population would possibly have a higher incidence of domestic violence. That's wrong. Men are the victims of violence at two to three times the rates of women in every single category except rape.\n\nWhen it comes to rape, men are victims at about the same rate as women. I can't imagine why two members of a demographic that is subjected to routine verbal and physical abuse by members of the general population would possibly have a higher incidence of domestic violence. So why are gay men in more stable relationships with less violence than  any other demographic? Gender roles. Most homosexual males adopt, to some extent, traditional female gender roles in society, and lesbians the male gender roles. Lesbian couples do have more violent relationships than heterosexual ones.\n\n source? source? It is hard to find meaningful data because for decades domestic violence research which ran counter to the feminist agenda was suppressed (feminists ran and still run most sociology departments at universities). For example, see [this page](http://www.dvmen.org/dv-22.htm):\n\n - Lesbian partners are the most violent of all intimate relationships.\n - Men and women are equally violent in domestic relationships with 25-30% of intimate partner violence being exclusively female on male, 50% mutual combat (it usually takes two to tangle), and the remaining 20-25% exclusively male on female violence making it the least of the problem.\n\n",
    "url" : "https://www.youtube.com/watch?v=yQa_NAwDQ9Y"
  }, {
    "id" : 36,
    "title" : "Free Market provides a needed service.  Media uses the example as a negative.",
    "snippet" : "Whenever I find free WiFi (including McDonalds, Starbucks, Panera, etc.), I'm grateful.  Even though I am not poor.  But apparently the stigma of McD's is cause to cry about how unfair the world is...and that the state should take money by force from some and give to others.  Sorry.  Why can't this be a good example of private business filling a need?    My grandmother lives near a McDonalds (well... up the street a half-mile), so I put up an old satellite dish and aimed it toward their wifi signal.  Now she gets free net.  Allahu akbar. My grandmother lives near a McDonalds (well... up the street a half-mile), so I put up an old satellite dish and aimed it toward their wifi signal.  Now she gets free net.  Allahu akbar.  &gt; Whenever I find free WiFi (including McDonalds, Starbucks, Panera, etc.), I'm grateful.\n\n\nThere is no free, you just don't pay extra, but its included in the price of a sold product/service.\n\n\nFree market even caters for the free loaders, is the right term.  The expense of offering free WiFi at a place like McDonalds is actually extremely small...  and it is also an advertising expense much like the signs in the windows.  Not sure what you are trying to say. &gt; The expense of offering free WiFi at a place like McDonalds is actually extremely small... and it is also an advertising expense much like the signs in the windows. \n\n...its included in the price of a sold product/service, all of those things. Right, but to be concerned that the advertising/promotional budget is increasing the price of the goods is sort of humorous and belies an understanding of business. &gt; The expense of offering free WiFi at a place like McDonalds is actually extremely small... and it is also an advertising expense much like the signs in the windows. \n\n...its included in the price of a sold product/service, all of those things. &gt; Whenever I find free WiFi (including McDonalds, Starbucks, Panera, etc.), I'm grateful.\n\n\nThere is no free, you just don't pay extra, but its included in the price of a sold product/service.\n\n\nFree market even caters for the free loaders, is the right term.  I'm sitting in my car outside McDonald's using their WiFi and haven't made a McD's purchase in years.  That is free...for me, so \"free\" is the correct term in this personalized example.\n\nYes, of course it is included in the COGS.  I'm sitting in my car outside McDonald's using their WiFi and haven't made a McD's purchase in years.  That is free...for me, so \"free\" is the correct term in this personalized example.\n\nYes, of course it is included in the COGS.  I'm sitting in my car outside McDonald's using their WiFi and haven't made a McD's purchase in years.  That is free...for me, so \"free\" is the correct term in this personalized example.\n\nYes, of course it is included in the COGS.  I wouldn't tell a cop you're doing that... Depending on where you live you could get arrested for such things. It turns out stealing bandwidth is illegal this country. Some would even say it's an act of aggression... I wouldn't tell a cop you're doing that... Depending on where you live you could get arrested for such things. It turns out stealing bandwidth is illegal this country. Some would even say it's an act of aggression... You recommend that I not tell a cop that I'm using McDonald's free WiFi?  Who's the \"media\" here? What's the \"negative\"? Beyond Super Size Me, I mean. ^This.\n\nI really didn't understand what this post is about.  Do you think the cops would break down the door at a McDonalds if someone used their Wi-Fi to do something naughty?\n\nhttp://kschang.hubpages.com/hub/6-Reasons-Why-You-Should-Secure-Your-Wi-Fi-Network ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17k776/free_market_provides_a_needed_service_media_uses/"
  }, {
    "id" : 37,
    "title" : "Anyone On r/Anarchism Started Their Own Business? [x-post from r/Anarchism]",
    "snippet" : "  This'll speed up the reading:\n\nI *want* to, but capitalism is too hard\n\nI *want* to, but I disagree with the idea of money\n\nI *want* to, but capitalism bad!\n\n\"Small business isn't capitalism\" After that we have a ~~permanent starbucks resident~~ Freelancer, then a joke, but then a legit business, selling co-op based board games and tshirts and stuff.\n\nPipe dream bio-robotics, then a *hope* to start a garden/ green energy. Then a freelancer.\n\nHere's a good one: hiring a freelancer isn't wage slavery. But apparently if you hire more than one AND provide infrastructure for them to work, it is. \n\nAfter that it's all \"i want to\" \"If I did\" and \"I've thought about it\" I liked...\n\n&gt;A:  Why would you want a theatre collective to be nonprofit?\n\n&gt;B:  Because I don't want to make money providing entertainment\n\nDifferent world-view for sure.\n\nGood reminder that those inter-subreddit arguments aren't going to get anywhere with most folks.  We exist on completely different planes in mind-space.\n This'll speed up the reading:\n\nI *want* to, but capitalism is too hard\n\nI *want* to, but I disagree with the idea of money\n\nI *want* to, but capitalism bad!\n\n\"Small business isn't capitalism\" After that we have a ~~permanent starbucks resident~~ Freelancer, then a joke, but then a legit business, selling co-op based board games and tshirts and stuff.\n\nPipe dream bio-robotics, then a *hope* to start a garden/ green energy. Then a freelancer.\n\nHere's a good one: hiring a freelancer isn't wage slavery. But apparently if you hire more than one AND provide infrastructure for them to work, it is. \n\nAfter that it's all \"i want to\" \"If I did\" and \"I've thought about it\" And and and... FUCK HIERARCHY!!!  This'll speed up the reading:\n\nI *want* to, but capitalism is too hard\n\nI *want* to, but I disagree with the idea of money\n\nI *want* to, but capitalism bad!\n\n\"Small business isn't capitalism\" After that we have a ~~permanent starbucks resident~~ Freelancer, then a joke, but then a legit business, selling co-op based board games and tshirts and stuff.\n\nPipe dream bio-robotics, then a *hope* to start a garden/ green energy. Then a freelancer.\n\nHere's a good one: hiring a freelancer isn't wage slavery. But apparently if you hire more than one AND provide infrastructure for them to work, it is. \n\nAfter that it's all \"i want to\" \"If I did\" and \"I've thought about it\" I don't see the need to circlejerk to /r/Anarchism's threads; *especially* given that I've seen numerous threads in my 11 months on this subreddit whining about the very circlejerking that goes on in /r/Anarchism. Cry about it without doing it, or do it without crying about it. Don't do both.\n\nI don't condone the ad hominem that goes on towards /r/Anarchism (while I do agree with the ideological grounds for anti-Capitalism), but circlejerking to it doesn't help your case. Someone posted the thread, so we might as well comment on it. My main complaint would be with Great_PlainsApe, who is either trolling, fishing for jerking, or just didn't realize exactly how at odds that thread and this subreddit are. Actually I was hoping that someone from this subreddit would have some business experience and would like to comment in their thread. Well, I do credit your optimism, but that sub will just scoff, downvote, and move on the second they get a glimpse of yellow or hear discussion about earning money that doesn't come with a reflexive *CAPITALISM BAD* Someone posted the thread, so we might as well comment on it. My main complaint would be with Great_PlainsApe, who is either trolling, fishing for jerking, or just didn't realize exactly how at odds that thread and this subreddit are. ",
    "url" : "http://www.reddit.com/r/Anarchism/comments/17k1lk/anyone_on_ranarchism_started_their_own_business/"
  }, {
    "id" : 38,
    "title" : "US economy economy contracts for the first time since '09",
    "url" : "http://www.nbcnews.com/business/economywatch/us-economys-contraction-just-brief-pause-1B8174851"
  }, {
    "id" : 39,
    "title" : "Two Questions: One regarding fruit, and one regarding foreign genocide",
    "snippet" : "My friends and I were talking about customs and border police. I jokingly mentioned that fruit is a threat to national security. But after thinking about it, without borders and I guess the State, couldn't fruit with foreign viruses contaminate the crops of a geographical region?\n\nMy second question is about foreign genocide. All over the world, genocide and other atrocities are taking place. Doesn't a State allow individuals to easily try to help these people who are being massacred by their own States?\n\nI'm just playing devil's advocate, by the way.   &gt; Doesn't a State allow individuals to easily try to help these people who are being massacred by their own States?\n\n I had trouble understanding what you were going for, did you mean:\n\n\"Doesn't a state allow individuals to easily try to help these people who are being massacred in a _neighboring_ state?\"\n\n I mean, if I was Al Assad, maybe I wouldn't want to allow other people in my state to help the ones getting kibbled in my same state, because I'd be doing the kibbling.\n\n Are you talking about military intervention? Or a charity like the Red Cross setting up refugee camps? Military intervention. I don't believe in it, but a teacher made this point and I felt that it was something I didn't have the answer to. The core problem with military intervention, even when the surface condition seems so clear cut (vast and incredible human suffering), is that we don't seem to have the hang of it, and maybe never will. Almost every time intervention has been tried it created an unstable result that tended to devolve into another, sometimes extended, period of agony.\n\nBrits carving out entire countries with a pencil and a map, the CIA toppling anything that makes a phone call to Moscow. Nasser, Noriega, Pinochet, Saddam Hussein. Laughable democracies in Iraq and Afghanistan. Even in the Arab Spring, the rise of forces like the Muslim Brotherhood can be traced back to seeds planted by well-intentioned British, French, and Americans, sometimes from a century past.\n\nIn spite of the shattering human cost that I know is implied, I think these forest fires need to burn out. I think the most we should do is send MSF and the Red Cross. Scratching some itches only makes them worse.\n\n If in \"ancapistan\" a bunch of people voluntarily paid their security company to go fight a genocidal dictator, would this be legitimate?  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/17ljcg/two_questions_one_regarding_fruit_and_one/"
  }, {
    "id" : 40,
    "title" : "Retroactive tax",
    "snippet" : " ",
    "url" : "http://techcrunch.com/2013/01/30/california-starts-sending-big-bills-to-startup-investors-for-120-million-in-new-retroactive-taxes/"
  }, {
    "id" : 41,
    "title" : "Missouri State Govt Trashes 15 tons of \"raw milk cheese\" as public safety concern.",
    "snippet" : "  ",
    "url" : "http://reason.com/24-7/2013/01/28/missouri-trashes-30000-pounds-of-raw-mil"
  }, {
    "id" : 42,
    "title" : "The tepid mainstream “defenses” of Aaron Swartz",
    "url" : "http://c4sif.org/2013/01/the-tepid-mainstream-defenses-of-aaron-swartz/"
  }, {
    "id" : 43,
    "title" : "Why Libertarianism Is Not Idiotic [x-post r/libertarian]",
    "snippet" : "  I really like the point-by-point reductio ad absurdum. There are many problems in the world. Giving someone a magic costume and a magic title of \"government\" doesn't solve any of them. What statist thinks that having a government magically makes everything alright? Have you seen the number of people who think the wrong party being in power is disastrous? They obviously don't think that the state is automatically a magical solution! And that's only *some* of the statists who are unaffected by such an argument!\n\nIncidentally, have you seen the number of libertarians who think that the government *does* magically make everything go badly?\n\nI think it's much more correct to say that statists think that having the right person in power will do a lot of good, not that it will necessarily completely solve any problems at all. Ask them about the difference between electing someone to use force in a state-sanctioned election or electing someone to use force in an unsanctioned election. Larken Rose is great at highlighting this inconsistency:\n\nhttp://www.youtube.com/watch?v=ngpsJKQR_ZE  [\"Who watches the watchmen?\"](http://en.wikipedia.org/wiki/Watchmen).\n\nI'm in the process of writing about why this comic is one of my favorites, even though I have opposing views to the original intentions of the author.  Short answer: no one watches the watchmen and they are incapable of doing it themselves.\n\nWhen it comes to the real world, it's much the same.  There are (usually) no government regulators who regulate other \"regulators\", with exceptions for internal investigations, and those are rarely effective at stopping things before they happen.  Additionally more regulation breeds corruption, not the opposite.  Having \"so much regulation that corporations couldn't get their money near our politicians\" is a pretty laughable ideal. &gt;Having \"so much regulation that corporations couldn't get their money near our politicians\" is a pretty laughable ideal.\n\nRemember, it's not about what works, but what *feels good,* man.   I'm not sure I understand his response to the issue of BP's safety procedures. While the Government set an inadequate baseline in terms of safety regulations to follow, what was stopping BP from going above and beyond that?\n\nAside from functioning as a proper \"gotcha!\" moment, I'm uncertain if the response provided accurately represents what the free market would/could/does do to prevent that sort of occurrence. \n\nAm I safe to assume the mechanisms which would have acted on BP to follow better practices were rendered ineffective through governmental intervention in the marketplace? Would someone be willing to give me their take on it?\n I'm not sure I understand his response to the issue of BP's safety procedures. While the Government set an inadequate baseline in terms of safety regulations to follow, what was stopping BP from going above and beyond that?\n\nAside from functioning as a proper \"gotcha!\" moment, I'm uncertain if the response provided accurately represents what the free market would/could/does do to prevent that sort of occurrence. \n\nAm I safe to assume the mechanisms which would have acted on BP to follow better practices were rendered ineffective through governmental intervention in the marketplace? Would someone be willing to give me their take on it?\n  Pretty good video overall, but I still disagree with the take that corporations can only exist through the government.  It's worth noting that BP did benefit massively from state-granted limits on their liability, which was different from the typical \"limited liability\" enjoyed by LLCs. Even if, in ancapistan, BP had a limited liability arrangement among their shareholders, they still would have had to pay massively more money to the victims of the spill. Yes, but the special treatment that BP received is not the limited liability that people generally speak of, which is shareholder limited liability. BP, GE, and lots of other companies manage to work out deals with the government directly or indirectly (via the lawmaking process), but the idea of a shareholder being liable only for their stake in corporation, *unless personally liable for the tort*^1 is easily recreated through contract and the removal of vicarious liability/respondeat superior, which are major problems. \n\n1) It's even more simple to limit liabilities on debt contracts, since the second party involved would agree that they could not go after shareholders personal property.  Yes, I agree. I remember well the thread we had about LLCs where you set me straight regarding LL. Thanks for that, by the way!\n\nI just wanted to point out that the \"limited liability\" that BP enjoyed, and that was mentioned in the video, is the sort that we would not see arise in ancapistan. Glad to help, this is one of the areas that I think libertarians often misdirect their views. \n\nThe problem with the video is he throws 'limited liability' around without reference to what he means. This becomes problematic because he might, and others have, attacked corporations for their limited liability when they don't actually have what the attackers claim. Being that this is an area I am interested in, I like to clear it up.\n\nAlso, strictly speaking, I'd be careful with your use of LLC. It's also worth noting now that the vast majority of states (maybe all) recognize Limited Liability Partnerships, albeit to vary degrees of limited liability. The LLC itself, where the \"C\" stands for \"company\" is an entity in its own, separate from what many corporations are.  Pretty good video overall, but I still disagree with the take that corporations can only exist through the government.  ",
    "url" : "http://www.youtube.com/watch?v=oMk2c-R1nnE"
  }, {
    "id" : 44,
    "title" : "Turnpike companies faced some serious problems and prevailed",
    "snippet" : "  &gt;The organizational advantages of turnpike companies relative to government road not only generated more road mileage, but also higher quality roads... ",
    "url" : "http://eh.net/encyclopedia/article/klein.majewski.turnpikes"
  }, {
    "id" : 45,
    "title" : "Anarcho-Capitalism needs a \"Cosmos\"",
    "snippet" : "   Why don't we do a version of it ourselves, as a community? People can make and submit videos, and I'm sure there's someone on here that has some video production skills.  This was my thinking.  The closest thing I've seen to this is Fringe Elements \"100 Epiphanies\" video.  Stefan Molyneux has also done some good introductory videos to anarchocapitalism, but we need something that's not so dramatically anti-state.\n\nWe need something that even a statist can watch and enjoy, and it gets under their skin and keeps chipping away at their assumptions about taxation, regulations, and government. Focus on the benefits of AnCap.  And not so much on the anti-state hostility.  I like it.\n\nWould you even want to mention Anarcho Capitalism, or voluntarism, or libertarian as the ideology?  Or just focus on the principles, their opportunities and limitations.\n\nWe could probably take some lessons from shows like Mythbusters too. This was my thinking.  The closest thing I've seen to this is Fringe Elements \"100 Epiphanies\" video.  Stefan Molyneux has also done some good introductory videos to anarchocapitalism, but we need something that's not so dramatically anti-state.\n\nWe need something that even a statist can watch and enjoy, and it gets under their skin and keeps chipping away at their assumptions about taxation, regulations, and government. In fact, I would almost argue that we use a little creative sarcasm, or tongue-in-cheek hilarity. People, especially young people, won't to watch videos like \"classical conceptions of liberty in a society of free-markets.\" Rather, they'd be more interested in something like, \"Politicians: A Love Story\" (a video talking about \"patriotism\" and nationalism) and \"Equality, Ya Got that Right!\" (a video talking about the lunacy of the idea that minority groups need state-issued \"rights\" (positive rights), but then point out we're already supposed to have the right to do what we want (negative liberty) Why don't we do a version of it ourselves, as a community? People can make and submit videos, and I'm sure there's someone on here that has some video production skills.   A 13 part inspirational series explaining history and economics through the lens of Austrian theory.  Each part will be narrated by someone who can capture both the horrific nature of the State and the optimistic future of those who free themselves of the superstition. A 13 part inspirational series explaining history and economics through the lens of Austrian theory.  Each part will be narrated by someone who can capture both the horrific nature of the State and the optimistic future of those who free themselves of the superstition. &gt;A 13 part inspirational series explaining history and economics through the lens of Austrian theory.\n\nNot all anarcho-capitalists agree with Austrian economics. A 13 part inspirational series explaining history and economics through the lens of Austrian theory.  Each part will be narrated by someone who can capture both the horrific nature of the State and the optimistic future of those who free themselves of the superstition. Off the top of my head I can't think of an Ancap scholar who has the voice necessary. I did enjoy Jeff Riggenbach's narration of The Libertarian Tradition audio series though.  I think Tom Woods is nice to listen to. He's probably the most charismatic AnCap. His voice is good, I agree.  David Friedman's voice isn't bad, either.  We need people who are emotive (Jeff Riggenbach is like a robot, even though he does have a sweet voice).\n\nWe need voices that inspire and motivate. On the other hand, I find that Murray Rothbard sounds alarmingly similar to Jay Leno. That isn't necessarily a good thing. On the other hand, I find that Murray Rothbard sounds alarmingly similar to Jay Leno. That isn't necessarily a good thing. His voice is good, I agree.  David Friedman's voice isn't bad, either.  We need people who are emotive (Jeff Riggenbach is like a robot, even though he does have a sweet voice).\n\nWe need voices that inspire and motivate. &gt;David Friedman's voice isn't bad, either.\n\nGood to hear I'm not the only one who likes it. His voice is good, I agree.  David Friedman's voice isn't bad, either.  We need people who are emotive (Jeff Riggenbach is like a robot, even though he does have a sweet voice).\n\nWe need voices that inspire and motivate. His voice is good, I agree.  David Friedman's voice isn't bad, either.  We need people who are emotive (Jeff Riggenbach is like a robot, even though he does have a sweet voice).\n\nWe need voices that inspire and motivate. &gt;even though he does have a sweet voice\n\nHah, not exactly the qualifier I would've used.  I think his voice is better described as articulate, lending itself very well to intricate content. It's pretty sweet when you hear it in Porter Robinson's song \"The State\". Off the top of my head I can't think of an Ancap scholar who has the voice necessary. I did enjoy Jeff Riggenbach's narration of The Libertarian Tradition audio series though.  I'd love to see Jeff Tucker do it. I agree.   Carl Sagan was a poet that was able to celebrate the wonder of the universe. \n\nTucker, while... maybe not \"poetic\" definitely has a distinct language to the way he speaks.  And is constantly celebrating the wonder of the free market. He's definitely got the same attitude of 'wonder', at least. Off the top of my head I can't think of an Ancap scholar who has the voice necessary. I did enjoy Jeff Riggenbach's narration of The Libertarian Tradition audio series though.  Off the top of my head I can't think of an Ancap scholar who has the voice necessary. I did enjoy Jeff Riggenbach's narration of The Libertarian Tradition audio series though.  David Gordon from start to finish.  hahaha\n\nbut seriously I love that guy Me too, I scroll through his Mises Daily archive all the time when I'm bored. Great writer, amazing thinker, and uhh... technically a speaker.  hahaha\n\nbut seriously I love that guy Off the top of my head I can't think of an Ancap scholar who has the voice necessary. I did enjoy Jeff Riggenbach's narration of The Libertarian Tradition audio series though.  I think [Ben Stone](http://www.badquaker.com/) would be a great candidate. I can listen to hours of his podcasts an not get tired of his voice. That's something really rare for me.\n\nEDIT: Just realized what this whole thing was about and see that a well-known person should be a narrator. Off the top of my head I can't think of an Ancap scholar who has the voice necessary. I did enjoy Jeff Riggenbach's narration of The Libertarian Tradition audio series though.   Molyneux is close to finishing his documentary. Probably the closest thing we'll have for a while. what is it about? Why your parents abused you and why you won't just accept and admit it.  what is it about? I've heard him mention it a few times in his videos but never exactly what it's about, although I could have missed it.\n\nWith a little searching I found this: http://www.youtube.com/watch?v=ZVIFtjXP-j4 \nSo I'm assuming this is the one he's still working on, as I think he said it should be done in the next couple months.   If there was evidence of an audience willing to buy it, they'd already be making it.  The onus is on us to make ourselves known. If there was evidence of an audience willing to buy it, they'd already be making it.  The onus is on us to make ourselves known. If there was evidence of an audience willing to buy it, they'd already be making it.  The onus is on us to make ourselves known. I don't know why you are getting down voted for suggesting this idea?  Did cosmos ever really effect anybody's mindset? Seems like a program designed to preach atheism / science to the choir.  Or maybe even a popular film about a group of Anarchist that's doesn't look like he's from SLC Punk.  Or isn't beating people up like in Fight Club.  \n\nSome PhD'd, Bow tie wearing mother fuckers, agoristing the shit out of their small to medium sized businesses.   Why confine ourselves to a TV series? Why not a video game?   ",
    "url" : "http://en.wikipedia.org/wiki/Cosmos:_A_Space-Time_Odyssey"
  }, {
    "id" : 46,
    "title" : "The Citadel: A Separatist community within the United States borders based on Thomas Jefferson's Rightful Liberty",
    "snippet" : "    \"If it ain't perfect utopian anarchy, I'm not impressed!\"\n\n-shortsighted ancap redditor What is your take on this particular charter city? On charter cities in general?\n\nI think charter cities are excellent, but no proposed charter city would be Ancapistan. China has had wild success with its charter cities (Shenzhen is the most prominent).\n\nI have not read too much into the Citadel, but it looks like a nut-job is behind it. I think this charter city has a few nutjobs behind it. It is explicitly nationalistic and paleo-conservative. I'm assuming fundies will make up most of the population. That being said, it seems supportive of free-markets and proprietarianism. Further, it aims to be a privately owned and operated city. Essentially, this is what David Friedman is talking about when he discusses how anarcho-capitalism will not necessarily produce explicitly secular/libertarian laws.\n\nI think charter cities in general are an excellent idea. They remind me of the formation of semi-autonomous towns in the medieval period, the origin of modern capitalism. They could make great case studies for private law and laissez-faire economics.",
    "url" : "http://www.iiicitadel.com/"
  }, {
    "id" : 47,
    "title" : "Trying to show the violence and logic gaps in a statist warmonger.  Join in if you have any input.",
    "url" : "http://www.reddit.com/r/WTF/comments/17l25y/new_guy_in_the_unit_does_a_12_mile_ruck_march/c86ie83?context=3"
  }, {
    "id" : 48,
    "title" : "The Roads - YouTube",
    "snippet" : "  Many will watch this video and say, \"See?  They need more money!  They need better ramps.\" Many will watch this video and say, \"See?  They need more money!  They need better ramps.\"  This is typical. \n\nIf the workers actually fixed the roads then they would find themselves with a lack of work. People would eventually find that the majority of equipment and employees were redundant and they would insist that the department be downsized. The downsized department would have it's budget slashed and supervisors and bureaucrats would be laid off also. \n\nSo therefore by not doing work they are helping to justify their further employment. The people will see that the roads are still a disaster and the politicians would insist that the employees are very hard workers, but that due to the increased amount of use of the roads by the people that the workers can't keep up. They will raise taxes and increase funding for the department.  Employees with seniority will be promoted to supervisors. With the increased amount of funding and resources available this will create many more lucrative opportunities for the profiting from theft of tax funded resources. \n\nBy the monopoly of the state combined with compulsory funding model of taxation has created a perverse set of incentives that punish productivity and rewards corruption. You will see this pattern in all state governments.\n\nOf course we should be all grateful for this... Right on the money. If roads were maintained entirely by private means, road crews would grow their revenue and staff by doing good work efficiently, thereby winning more customers.    growing up in Rhode Island, I always figured this behavior of road crews was normal and accepted. surprised there's an investigation. I'm from Minnesota but I went to WPI from 2000-2004. Three words:\n\nThe Big Dig. The Big Dig expanded in time and budget every single year...**and** reduced scope (what was to be actually delivered) every single year.  It was the best of all government construction projects.  \n\n* Blue Sky budget?  check\n* Below code materials? check\n* Perpetual maintenance? check\n* Eminent Domain? check\n* Constantly pushed finish date? check\n* Photo Ops? check\n* Tunnels and parks named after politicians? check\n* Massive $$$$$ to unions? check I think The Big Dig was probably the single greatest influence on my anti-government views.\n\ncan read all the ancap literature in the world, but it will never have that visceral effect of watching that fucking nightmare unfold.      You misspelled that, come on now.",
    "url" : "http://www.youtube.com/watch?v=bvFWQYiR-DM"
  }, {
    "id" : 49,
    "title" : "Free Market Helping Languages: Learning Spanish With Duolingo Can Be More Effective Than College Classes Or Rosetta Stone  |  TechCrunch",
    "snippet" : "   Ok so the study might be biased but I wanted to share this anyway, because Duolingo is awesome and completely free.   No Ruuski D': Russian would be awesome. Such a beautiful, badass language. No Ruuski D': or esperanto ): For Esperanto you've got Lernu.net, it is incredibly helpful and clear.\n\nTo be fair, a platform like that of Duolingo wouldn't be very useful for Esperanto. Grammar is so simple everything could be learn in maybe three lessons, and everything else would be just simple vocabulary memorization. And pronunciation is almost completely standardized in Esperanto, so. Not a whole lot to practice. Yup. Ĉu vi estas Esperanto parolanto? It's hard to find AnCaps who are Esperantists... or should I say: Esperantists who are AnCaps. Most of them go more with the hippie culture, on both the good parts and bad parts of it...\n\n  It'd be awesome if there was some Eastern languages like Chinese or Japanese on this list..\n\n I was disappointed too. Damn racist Duolingo. Hates Asians. I'd imagine that text rendering may play a role as well. It'd be awesome if there was some Eastern languages like Chinese or Japanese on this list..\n\n     Polska? Check out http://www.livemocha.com and http://www.italki.com  ",
    "url" : "http://techcrunch.com/2013/01/17/study-learning-spanish-with-duolingo-can-be-more-effective-than-college-classes-or-rosetta-stone/"
  } ],
  "processing-time-source" : 91,
  "processing-result.title" : "anarcho_capitalism11_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/anarcho_capitalism11_reddit.xml"
  }
}