{
  "processing-time-total" : 1982,
  "clusters" : [ {
    "id" : 0,
    "size" : 10,
    "score" : 45.850675033465855,
    "phrases" : [ "Really Getting" ],
    "documents" : [ 2, 10, 12, 23, 26, 29, 40, 42, 45, 47 ],
    "attributes" : {
      "score" : 45.850675033465855
    }
  }, {
    "id" : 1,
    "size" : 8,
    "score" : 127.0399227043508,
    "phrases" : [ "Enforce Property Rights" ],
    "documents" : [ 2, 6, 33, 37, 40, 42, 45, 48 ],
    "attributes" : {
      "score" : 127.0399227043508
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 87.1411696414595,
    "phrases" : [ "Age of Majority" ],
    "documents" : [ 2, 6, 37, 40, 45 ],
    "attributes" : {
      "score" : 87.1411696414595
    }
  }, {
    "id" : 3,
    "size" : 4,
    "score" : 57.313407185752745,
    "phrases" : [ "Gun Control" ],
    "documents" : [ 2, 31, 35, 40 ],
    "attributes" : {
      "score" : 57.313407185752745
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 57.040243236255385,
    "phrases" : [ "National Security" ],
    "documents" : [ 10, 39, 40, 47 ],
    "attributes" : {
      "score" : 57.040243236255385
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 90.06467835469103,
    "phrases" : [ "People are so Poor that there Just" ],
    "documents" : [ 3, 10, 37, 40 ],
    "attributes" : {
      "score" : 90.06467835469103
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 63.00096534949247,
    "phrases" : [ "Place" ],
    "documents" : [ 10, 36, 40, 42 ],
    "attributes" : {
      "score" : 63.00096534949247
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 48.88043292529948,
    "phrases" : [ "Poverty" ],
    "documents" : [ 3, 4, 40, 45 ],
    "attributes" : {
      "score" : 48.88043292529948
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 64.40297225594897,
    "phrases" : [ "Build the Roads" ],
    "documents" : [ 2, 40, 45 ],
    "attributes" : {
      "score" : 64.40297225594897
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 65.26964507248435,
    "phrases" : [ "Child" ],
    "documents" : [ 2, 6, 49 ],
    "attributes" : {
      "score" : 65.26964507248435
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 62.41942965465113,
    "phrases" : [ "Conspiracy" ],
    "documents" : [ 11, 38, 46 ],
    "attributes" : {
      "score" : 62.41942965465113
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 53.42387296059904,
    "phrases" : [ "Critic" ],
    "documents" : [ 42, 44, 45 ],
    "attributes" : {
      "score" : 53.42387296059904
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 53.814745385539105,
    "phrases" : [ "Encouraging" ],
    "documents" : [ 8, 29, 40 ],
    "attributes" : {
      "score" : 53.814745385539105
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 39.151133049726106,
    "phrases" : [ "Enjoy" ],
    "documents" : [ 5, 18, 42 ],
    "attributes" : {
      "score" : 39.151133049726106
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 105.12595088515224,
    "phrases" : [ "Stefan Molyneux" ],
    "documents" : [ 16, 17, 20 ],
    "attributes" : {
      "score" : 105.12595088515224
    }
  }, {
    "id" : 15,
    "size" : 3,
    "score" : 53.10477087052673,
    "phrases" : [ "Violate the NAP" ],
    "documents" : [ 6, 24, 40 ],
    "attributes" : {
      "score" : 53.10477087052673
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 51.093435636087435,
    "phrases" : [ "Bank Account" ],
    "documents" : [ 3, 47 ],
    "attributes" : {
      "score" : 51.093435636087435
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 73.36716200861584,
    "phrases" : [ "School or have a Job" ],
    "documents" : [ 2, 13 ],
    "attributes" : {
      "score" : 73.36716200861584
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 62.95076688177891,
    "phrases" : [ "Thomas Sowell" ],
    "documents" : [ 5, 32 ],
    "attributes" : {
      "score" : 62.95076688177891
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 107.07763902358538,
    "phrases" : [ "Tribal Days" ],
    "documents" : [ 12, 40 ],
    "attributes" : {
      "score" : 107.07763902358538
    }
  }, {
    "id" : 20,
    "size" : 16,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 1, 7, 9, 14, 15, 19, 21, 22, 25, 27, 28, 30, 34, 41, 43 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1919,
  "documents" : [ {
    "id" : 0,
    "title" : "Defense Distributed's new 3D printed AR Lower - 600+ rounds!",
    "snippet" : "  Dumb question from someone who doesn't understand gun technology very well:\n\nWhy is the \"lower\" so important compared to the bullets themselves?  What if governments just banned the sale of bullets to citizens and shut down the factories that weren't servicing the military/police directly?  Are there already enough bullets in circulation that it doesn't matter?  Do bullets stay \"fresh\" forever? Dumb question from someone who doesn't understand gun technology very well:\n\nWhy is the \"lower\" so important compared to the bullets themselves?  What if governments just banned the sale of bullets to citizens and shut down the factories that weren't servicing the military/police directly?  Are there already enough bullets in circulation that it doesn't matter?  Do bullets stay \"fresh\" forever? To add to what qbg said, the lower is the part with the serial number and what you'd have to get a background check for. You cannot sell homemade lowers, but you can use them. Also a bullet ban is less likely than an 'Assault weapons ban'\n &gt;You cannot sell homemade lowers, but you can use them.\n\nI hate to be a grump, but I like to see people (especially my fellow ancaps) using precise language. You *can* sell homemade lowers. The problem is that a sociopath with a gun will get very upset with you if you do so, and will threaten you, bludgeon you, and cage you in response. You *can*, but you *may not*. It is a metaphysical possibility, but it is a socially risky endeavor.   As soon as we get a good home 3D steel printer it's gonna get interesting, you can print smgs. You might not even need that. A barrel is just a fancy pipe. If you don't require rifling, you could go to the hardware store and pick something up. A barrel is much more then just a pipe. The type of metal it is made of is very important. When a bullet travels through a barrel a considerable amount of heat energy is produced and released into the metal. If the metal can't get rid of the heat quick enough because you went out and used plumbing pipes it can buckle and explode due to stress. \n\nTLDR: Don't use a piece of random metal pipe as a barrel unless you want to break your gun and pick metal from your body.  A barrel is much more then just a pipe. The type of metal it is made of is very important. When a bullet travels through a barrel a considerable amount of heat energy is produced and released into the metal. If the metal can't get rid of the heat quick enough because you went out and used plumbing pipes it can buckle and explode due to stress. \n\nTLDR: Don't use a piece of random metal pipe as a barrel unless you want to break your gun and pick metal from your body.  A barrel is much more then just a pipe. The type of metal it is made of is very important. When a bullet travels through a barrel a considerable amount of heat energy is produced and released into the metal. If the metal can't get rid of the heat quick enough because you went out and used plumbing pipes it can buckle and explode due to stress. \n\nTLDR: Don't use a piece of random metal pipe as a barrel unless you want to break your gun and pick metal from your body.  You might not even need that. A barrel is just a fancy pipe. If you don't require rifling, you could go to the hardware store and pick something up. You might not even need that. A barrel is just a fancy pipe. If you don't require rifling, you could go to the hardware store and pick something up. You might not even need that. A barrel is just a fancy pipe. If you don't require rifling, you could go to the hardware store and pick something up.  These videos are works of art.",
    "url" : "https://www.youtube.com/watch?feature=player_embedded&amp;v=tAW72Y_XPF4"
  }, {
    "id" : 1,
    "title" : "The Hobbit, LOTR and Anarchism",
    "snippet" : "  There's a lot of non-voluntaryist stuff in LOTR as well. Tolkien despised industrialization of England, and the way the Ents treat Saruman's machinery seems a lot more luddite than capitalist. Saruman was a crony-capitalist. Those damn Ainur handouts! There's a lot of non-voluntaryist stuff in LOTR as well. Tolkien despised industrialization of England, and the way the Ents treat Saruman's machinery seems a lot more luddite than capitalist. There's a lot of non-voluntaryist stuff in LOTR as well. Tolkien despised industrialization of England, and the way the Ents treat Saruman's machinery seems a lot more luddite than capitalist. Voluntaryism isn't industrialization or capital or machinery or capitalism. I'm not a voluntaryist and even I can tell you that. Stop conflating it with capitalism. One is an ethical position and one is an economic system. I did spend a lot of time thinking of what word to put there besides \"capitalism\". I believe leaving people to their own devices which voluntaryism and capitalism advocate will naturally lead to creating machines which will do more work than a human. It is true they're not the same thing, but one definitely begets the other. There's a lot of non-voluntaryist stuff in LOTR as well. Tolkien despised industrialization of England, and the way the Ents treat Saruman's machinery seems a lot more luddite than capitalist. There's a lot of non-voluntaryist stuff in LOTR as well. Tolkien despised industrialization of England, and the way the Ents treat Saruman's machinery seems a lot more luddite than capitalist.  I was under the impression that Mr. Tolkien was an anarcho-monarchist, so I would assume that is the general bias written into the world of the Lord of the Rings and the Silmarillion.\n\nhttp://www.e-reading.by/bookreader.php/139008/Tolkien_-_The_Letters_of_J.R.R.Tolkien.pdf\n\nRefer to letter #53 for the source of my understanding of his \"anarcho-monarchism\". An excerpt from the letter is briefly mentioned in the beginning of the video.\n\n\"Anarcho-monarchism\" by what I can gather (anarcho-monarchists are even more scarce than anarcho-capitalists) is essentially a sort of right-anarchism that purports that statelessness is best, but monarchy is second-best and much better than democracy. I've gathered this by reading the blog on anarcho-monarchist.com for about ten minutes, you all might be able to get a better understanding of it.\n\nhttp://www.firstthings.com/onthesquare/2010/11/anarcho-monarchism This page also explains it somewhat.\n\n I was under the impression that Mr. Tolkien was an anarcho-monarchist, so I would assume that is the general bias written into the world of the Lord of the Rings and the Silmarillion.\n\nhttp://www.e-reading.by/bookreader.php/139008/Tolkien_-_The_Letters_of_J.R.R.Tolkien.pdf\n\nRefer to letter #53 for the source of my understanding of his \"anarcho-monarchism\". An excerpt from the letter is briefly mentioned in the beginning of the video.\n\n\"Anarcho-monarchism\" by what I can gather (anarcho-monarchists are even more scarce than anarcho-capitalists) is essentially a sort of right-anarchism that purports that statelessness is best, but monarchy is second-best and much better than democracy. I've gathered this by reading the blog on anarcho-monarchist.com for about ten minutes, you all might be able to get a better understanding of it.\n\nhttp://www.firstthings.com/onthesquare/2010/11/anarcho-monarchism This page also explains it somewhat.\n\n I was under the impression that Mr. Tolkien was an anarcho-monarchist, so I would assume that is the general bias written into the world of the Lord of the Rings and the Silmarillion.\n\nhttp://www.e-reading.by/bookreader.php/139008/Tolkien_-_The_Letters_of_J.R.R.Tolkien.pdf\n\nRefer to letter #53 for the source of my understanding of his \"anarcho-monarchism\". An excerpt from the letter is briefly mentioned in the beginning of the video.\n\n\"Anarcho-monarchism\" by what I can gather (anarcho-monarchists are even more scarce than anarcho-capitalists) is essentially a sort of right-anarchism that purports that statelessness is best, but monarchy is second-best and much better than democracy. I've gathered this by reading the blog on anarcho-monarchist.com for about ten minutes, you all might be able to get a better understanding of it.\n\nhttp://www.firstthings.com/onthesquare/2010/11/anarcho-monarchism This page also explains it somewhat.\n\n Isn't a voluntary monarchy possible?   The LoTr books are not anarchist at all. Gandalf and the elf leaders (Galadriel, Elrond) are all selfless ideal leaders. The elves never abuse their considerable advantages (access to magic, superior weapons, light weight nourishing bread, and more). It is heavily implied Gandalf will be as well. The books set up a full Good/Evil dynamic that makes warfare justified and celebrated. \n\nA book that promotes anarchy would show all authority figures as heavily flawed. There would be no selfless gaurdians of the world (the Valar and the elves). And there would not be \"evil\" races who deserve destruction. Applying the morality that makes sense in the Lord of the Rings to the Real world gets you disasterous statism. \n\nThis si not meant as a critique of the Lord of the Rings. It si a beautiful work. But it is not a source for political insight.  The LoTr books are not anarchist at all. Gandalf and the elf leaders (Galadriel, Elrond) are all selfless ideal leaders. The elves never abuse their considerable advantages (access to magic, superior weapons, light weight nourishing bread, and more). It is heavily implied Gandalf will be as well. The books set up a full Good/Evil dynamic that makes warfare justified and celebrated. \n\nA book that promotes anarchy would show all authority figures as heavily flawed. There would be no selfless gaurdians of the world (the Valar and the elves). And there would not be \"evil\" races who deserve destruction. Applying the morality that makes sense in the Lord of the Rings to the Real world gets you disasterous statism. \n\nThis si not meant as a critique of the Lord of the Rings. It si a beautiful work. But it is not a source for political insight.  ",
    "url" : "http://www.youtube.com/watch?v=jfxdlWje5nk"
  }, {
    "id" : 2,
    "title" : "Can we have a honest discussion about why anarcho capitalism is so unpopular among vast parts of the population?",
    "snippet" : "It's probably no secret that we voluntaryists don't get a lot of love from most people. On the latter of political ideologies we are probably at bottom of the barrel and even communists and Nazis probably outstrip us. I was thinking about why this is and I'd like to hear everybody opinion about why we are doing so bad in the popularity contest of political ideologies. Preferably I'd like to have an honest discussion that doesn't involve arguments involving \"child abuse\" or the word \"sheeple\". \n  \"Hi. I'd like to sell you an ideology that will undermine your government. It'll defund the education system that you likely revere in the same tones that a devout Catholic reveres the Vatican. It'll throw millions of government workers into unemployment.\n\nI'd also like to radically change how infrastructure is funded and managed. The towns and cities that you live in will go into upheaval. Oh yeah, those offensive wars that you love? We're not going to be fighting them anymore. Sorry!\n\nOn one hand, your taxes will be almost zero. That sounds great to you, I'm sure,  if you're in the middle class and don't work in a crony industry. Which makes about... very few of you. Ha. On the other hand, all those great bennies that you've become so fond and reliant on? That's going to stop, too.\"\n\nThe perceived costs, along with the actual costs, of giving up the current system voluntarily are too high for most people to switch allegiances. Anything resembling ancapism is anathema to democracy. \n\nYou're a blasphemer who's shocked by the hatred he inspires. You're profaning the name of the statist god. Every statement you make insults the name of Ra within earshot of the Pharaoh's minions. Of course they're going to get pissed off at you. \n\nI disagree that ancaps are less popular than the Nazis. Nazi movements are becoming popular in Europe again these days, but in the US, there are no Nazis to speak of. Now, five years ago? Yeah, there were almost no ancaps. Now, there are many, many, many multiples of people who are at least familiar with the label than there were in just 2008.\n\nYou're not going to succeed if you think that you need to win a democratic election to achieve the power that you seek. And let's not be mealy-mouthed about it: it's about achieving the power to control your own property, and to retain your rights to your body.\n\nThe demos isn't going to forsake that partial claim on you willingly. \"Hey, demos, can you please let me keep more of my property,\" is a lose-lose proposition for said demos - unless you can make it more expensive for the demos to continue to make claims on you than it's worth.\n\nThat's how to win: develop a large enough contingent of hard core people who are just too expensive to continue ruling over in the common fashion. Give the state a good reason for kicking you out and ceding you some of its territory. The alternative of trying to persuade the entire US demos (much less the world) that it should change its ways is extremely expensive - it'd cost more money than you could probably marshal in one generation. \"Hi. I'd like to sell you an ideology that will undermine your government. It'll defund the education system that you likely revere in the same tones that a devout Catholic reveres the Vatican. It'll throw millions of government workers into unemployment.\n\nI'd also like to radically change how infrastructure is funded and managed. The towns and cities that you live in will go into upheaval. Oh yeah, those offensive wars that you love? We're not going to be fighting them anymore. Sorry!\n\nOn one hand, your taxes will be almost zero. That sounds great to you, I'm sure,  if you're in the middle class and don't work in a crony industry. Which makes about... very few of you. Ha. On the other hand, all those great bennies that you've become so fond and reliant on? That's going to stop, too.\"\n\nThe perceived costs, along with the actual costs, of giving up the current system voluntarily are too high for most people to switch allegiances. Anything resembling ancapism is anathema to democracy. \n\nYou're a blasphemer who's shocked by the hatred he inspires. You're profaning the name of the statist god. Every statement you make insults the name of Ra within earshot of the Pharaoh's minions. Of course they're going to get pissed off at you. \n\nI disagree that ancaps are less popular than the Nazis. Nazi movements are becoming popular in Europe again these days, but in the US, there are no Nazis to speak of. Now, five years ago? Yeah, there were almost no ancaps. Now, there are many, many, many multiples of people who are at least familiar with the label than there were in just 2008.\n\nYou're not going to succeed if you think that you need to win a democratic election to achieve the power that you seek. And let's not be mealy-mouthed about it: it's about achieving the power to control your own property, and to retain your rights to your body.\n\nThe demos isn't going to forsake that partial claim on you willingly. \"Hey, demos, can you please let me keep more of my property,\" is a lose-lose proposition for said demos - unless you can make it more expensive for the demos to continue to make claims on you than it's worth.\n\nThat's how to win: develop a large enough contingent of hard core people who are just too expensive to continue ruling over in the common fashion. Give the state a good reason for kicking you out and ceding you some of its territory. The alternative of trying to persuade the entire US demos (much less the world) that it should change its ways is extremely expensive - it'd cost more money than you could probably marshal in one generation. \"Hi. I'd like to sell you an ideology that will undermine your government. It'll defund the education system that you likely revere in the same tones that a devout Catholic reveres the Vatican. It'll throw millions of government workers into unemployment.\n\nI'd also like to radically change how infrastructure is funded and managed. The towns and cities that you live in will go into upheaval. Oh yeah, those offensive wars that you love? We're not going to be fighting them anymore. Sorry!\n\nOn one hand, your taxes will be almost zero. That sounds great to you, I'm sure,  if you're in the middle class and don't work in a crony industry. Which makes about... very few of you. Ha. On the other hand, all those great bennies that you've become so fond and reliant on? That's going to stop, too.\"\n\nThe perceived costs, along with the actual costs, of giving up the current system voluntarily are too high for most people to switch allegiances. Anything resembling ancapism is anathema to democracy. \n\nYou're a blasphemer who's shocked by the hatred he inspires. You're profaning the name of the statist god. Every statement you make insults the name of Ra within earshot of the Pharaoh's minions. Of course they're going to get pissed off at you. \n\nI disagree that ancaps are less popular than the Nazis. Nazi movements are becoming popular in Europe again these days, but in the US, there are no Nazis to speak of. Now, five years ago? Yeah, there were almost no ancaps. Now, there are many, many, many multiples of people who are at least familiar with the label than there were in just 2008.\n\nYou're not going to succeed if you think that you need to win a democratic election to achieve the power that you seek. And let's not be mealy-mouthed about it: it's about achieving the power to control your own property, and to retain your rights to your body.\n\nThe demos isn't going to forsake that partial claim on you willingly. \"Hey, demos, can you please let me keep more of my property,\" is a lose-lose proposition for said demos - unless you can make it more expensive for the demos to continue to make claims on you than it's worth.\n\nThat's how to win: develop a large enough contingent of hard core people who are just too expensive to continue ruling over in the common fashion. Give the state a good reason for kicking you out and ceding you some of its territory. The alternative of trying to persuade the entire US demos (much less the world) that it should change its ways is extremely expensive - it'd cost more money than you could probably marshal in one generation.  I would say 90%+ have never even heard of it. To start off, that's why. You can't believe in something you don't know exists. Most people are either democrats, republicans, independents, and run-of-the-mill statists as they were taught to be in public school.  Here's my experience, because I honestly think we're gaining traction:\n\nIRL, I've explained voluntarism to a few people. I've used the tactic of first describing voluntarism as being 'against violence.' I let this sink in a bit, because most people on the Right/Left thought that *their* position was against violence. Then, the next question almost inevitably is, \"well, how do we provide X?\" And then I delve into all the other arguments that we've all seen on here a dozen times. But I always bring it back to, \"...And I don't think we need violence to provide X.\" This has kept most people interested for much longer, and has made them question their views.\n\nHowever, here are some reasons why I don't think people like voluntarism:\n\n* There's no figure head. We're all individualists for the most part, and when you have no \"leader,\" or several minor \"major\" figures (Molynuex, Rothbard, Kokesh, etc.) then there's not really someone to 'rally' around. This is a good thing for us, but human nature over the past several hundred years has bound us to look up to a leader to get shit done, and thus is bad for people who are trying to get in to what voluntarism is about.\n\n* People dismiss certain people, such as Molyneux, as a 'cultist,' because a handful of kids denounced their parents that one time. Never mind that Obama is responsible for killing hundreds of parent's children who he sent to war. This is what happens when you don't have a budget for Public Relations .\n\n* We're too 'online.' Even anarchists have Food Not Bombs and to a lesser extent OWS. There's also lots of Anarchist Bookstores/Cafe's. Each of us should work on *one* community thing we can do to spread awareness on a very regular basis. I'm sure we're diverse and spread out enough to get something going. Imagine what would happen to corrupt politicians if every country's capital throughout the world had a group of film makers similar to the [Ridley Report](http://ridleyreport.podomatic.com/) or Adam vs. The Man? We could start our own independent news organization that has coverage in almost every major metropolitan area. Of course, this will take a lot of time, and most of us (it seems) have the unfortunate attribute of being capable of maintaining full time jobs, to the detriment of our free time to work on political projects.\n\n* More /r/agorism. I am biased since I'm a mod over there, but I think this is the best way to spread our beliefs/system. Go on craigslist next time you want to buy something (furniture, bike, etc.). Trade with gold/silver instead of cash. Strike up a conversation. &gt;Imagine what would happen to corrupt politicians if every state capital (...) We could start our own independent news organization that has coverage in almost every major metropolitan area.\n\nI'd suggest you also think beyond the borders coercively imposed on you. Your post didn't mention the USA, but between the lines I think you have a mostly US-centric view. We who are outside are also subject to state violence - worse, in many, many cases than the one you're subject to. I'd say our thought and discourse should be as border-free as the world we'd like to see. My apologies. I'll edit!\n\nDo you agree with the other things i mention?  It's because the sheeple were abused as children.\n\nFuck. I tried.   I think that part of the problem is that to many people \"anarchy\" means \"without law\", just as much as it can mean \"without rulers\".  When people think of \"anarchy\", they think of movies like \"mad max thunderdome\", and \"water world\", they think of all the gun fight wild west movies.    That is why anarcho capitalists should refer to themselves as anarchists and then explain to people the various views they have. It has to happen on a personal level. So I tell people I'm an anarchist, and they clearly can see that I'm a nice person, I have a good sense of humor, I don't advocate violence against innocent people, I do believe in laws and I am interested in economics and not \"chaos\" then \"archy\" will be associated with me and people like me more often. We shouldn't be afraid to open a window to our extreme views for people to absorb. That doesn't mean you have to preach to people and get into heated debates all the time. But ancaps shouldn't be afraid to speak up against the government, the police, the media, the economic ignorance of countless millions of people and so forth. Most people I know and meet think I'm a pretty good guy even though I'm not very social around people I do not know. Yet for some reason, even though I tell people I don't believe in government, they still talk to me and sometimes enguage me in conversations about politics and economics. The reality is, when you tell people how extreme you are, instead of running the opposite direction, they just treat you like anyone else and your extremism probably just makes them shake their head and at worst it makes them avoid having political and economic discussions with you. And at the best, they open themselves up to different views and often times they will realize that you make good points but that doesn't mean they are going to jump onto the bandwagon. Only time, and plenty of being screwed by the government will bring anyone with an ounce of hope around to your views.  I rather just call myself \"very\" libertarian, but I see what you're saying. I rather just call myself \"very\" libertarian, but I see what you're saying.    General lack of (decent) exposure... if our ideas are talked about at all they're usually given a negative sentiment. I think that has a major impact on how knowledgeable people are.\n\nAlso, a lot of our ideas tend to take more time to explain than people's attention spans can normally withstand.\n\nMy personal views really boil down to bad marketing. But, we're a relatively young movement, so we can always improve our advertising techniques. General lack of (decent) exposure... if our ideas are talked about at all they're usually given a negative sentiment. I think that has a major impact on how knowledgeable people are.\n\nAlso, a lot of our ideas tend to take more time to explain than people's attention spans can normally withstand.\n\nMy personal views really boil down to bad marketing. But, we're a relatively young movement, so we can always improve our advertising techniques.   The complete inability to compromise with people believing otherwise leaves AnCap to a small group of people who find this sort of purity appealing. It's pretty typical for extreme fringe political ideologies: a bunch of people thinking they found the ultimate truth waiting for everybody else to get it (and if they don't get it they must be sheeple or brainwashed / abused) or the big revolution / collapse to change things.  The complete inability to compromise with people believing otherwise leaves AnCap to a small group of people who find this sort of purity appealing. It's pretty typical for extreme fringe political ideologies: a bunch of people thinking they found the ultimate truth waiting for everybody else to get it (and if they don't get it they must be sheeple or brainwashed / abused) or the big revolution / collapse to change things.  I honestly think that we're on our way to an ancap society.  I think that, at some point in the next hundred or so years, the market will just out compete the government.  No violent revolution or collapse is necessary, just more capital goods and free markets. I honestly think that we're on our way to an ancap society.  I think that, at some point in the next hundred or so years, the market will just out compete the government.  No violent revolution or collapse is necessary, just more capital goods and free markets. The complete inability to compromise with people believing otherwise leaves AnCap to a small group of people who find this sort of purity appealing. It's pretty typical for extreme fringe political ideologies: a bunch of people thinking they found the ultimate truth waiting for everybody else to get it (and if they don't get it they must be sheeple or brainwashed / abused) or the big revolution / collapse to change things.   Well, just listen to what people say themselves but dissect the underlying meaning. \"Who will build the roads\" means \"I don't have faith that other humans will sufficiently act in cooperation with one another without force.\" \"Warlords will take over\" means \"I believe too many people are inherently evil, and force is required to stop them.\"  \n\nWe're too cold and calculating. It's too easy to equate \"I think X is good\" to \"I should force everyone to do X\". Libertarians score the worst (or best) on the \"is sacrificing 1 person to save 100 moral?\" test. \n\nThis also provides no perceived benefits. When you say \"live owes you nothing, you get what you earn\", you're taking away everyone's entitlements. Sure, communism and Nazism are violent, *but they promise benefits to the followers* not so with Ancapism. \n\nAlso we're working against years of statist indoctrination, there I said it. I interpret \"Warlords will take over\" to mean \"I don't trust myself to be good without force -- other people must be like me and should be suppressed with force\" Well, I was trying to put it in the most understanding way possible... It's good to see statists as convertible ignorant people rather than stubborn imbeciles (as difficult as that may seem.) ;) I interpret \"Warlords will take over\" to mean \"I don't trust myself to be good without force -- other people must be like me and should be suppressed with force\"  Try telling a young teenager that with hard work, a person can take care of oneself. So you don't need mom and dad to fund your education and put food on the table, or to set behavior boundaries, or to subsidize your transportation. \n\nThe teenager thinks, \"Oh my god I don't have any real world skills, life is so complicated, people won't take me seriously,\" etc. \n\nI see some parallels with the emotional reactions people give me when I talk about ancapism. Better stick with mom and dad.\n\nedit: A teenager also might be quite likely to ignore parents' indebtedness   No offense to you guys but the term \"Anarcho-Capitalist\" is looked down upon by left anarchists. Voluntarist on the other hand is a better word. I know you mean no offence, and none taken, but... so what? What do we care if left-anarchists like the term or not? I mean, there are basically just two possible options: either they'll want to use force against our property, and we're on opposing sides, or they won't, and we're on the same side (however uncomfortably). It's up to them to decide.\n\nEdit: goddammit everybody, this is supposed to be a subreddit with a high level of intellectual discussion. Downvoting someone instead of questioning them isn't conducive to that.   Oh, that's easy. Anarcho-capitalism is based in large part on everyone taking responsibility for every aspect of their lives. If there's one thing people hate, it's responsibility. Honestly, I'm with them. I have a limited amount of energy to spend on things. The more I spend worrying about things like contracts, bills, and other financial issues, the less I have left over for things I actually care about. I, for one, would much rather have all that stuff taken care of for me, so I'm free to focus on my own interests. It's not laziness, it's prioritization. Yeah, but the idea is that there would be fewer bills to pay. If such a thing is a genuine concern, then there might be a market for professional financial advisers. These people would cater to particular areas, particular financial situations, so that there clientele would be more homogeneous in demands. People would essentially pay a (monthly?) fee to have their finances handled professionally. I'm pretty sure people do this now anyway. I don't think that's necessarily true. Right now, you pay taxes, and that covers police, fire, infrastructure, etc etc. Under an anarcho-capitalist system, you'd potentially have to pay for each of those things separately, even if they cost less than they do now in total. That means you'll have to go through on every single item and figure out which service you want to pick, and you'll have to read the entire contract for every single one, since there won't be laws against hiding something nasty on page 17. \n\nOf course, there probably will be companies that offer package deals on services like that. In fact, it would probably be efficient for companies to organize themselves by geography, so every resource in a certain area is overseen by a certain company or group of companies. Gee, that sounds kind of familiar... Nah. It would not be *profitable* for companies (in the internet age) to force themselves to keep to a monopoly in a certain geographical area, especially if the wide variety of services are each (as you said) provided by a different firm (they don't have to be).\n\nHow long would a company remain profitable if they hid nasty things in their contracts? The brevity and format of contracts will tend to homogenize based on their general type. Domestic utilities can be expected to have predictable and sensible formats. It's more profitable to gain customers through being easy to deal with, than being difficult and antagonistic. I don't think that's necessarily true. Right now, you pay taxes, and that covers police, fire, infrastructure, etc etc. Under an anarcho-capitalist system, you'd potentially have to pay for each of those things separately, even if they cost less than they do now in total. That means you'll have to go through on every single item and figure out which service you want to pick, and you'll have to read the entire contract for every single one, since there won't be laws against hiding something nasty on page 17. \n\nOf course, there probably will be companies that offer package deals on services like that. In fact, it would probably be efficient for companies to organize themselves by geography, so every resource in a certain area is overseen by a certain company or group of companies. Gee, that sounds kind of familiar... I don't think that's necessarily true. Right now, you pay taxes, and that covers police, fire, infrastructure, etc etc. Under an anarcho-capitalist system, you'd potentially have to pay for each of those things separately, even if they cost less than they do now in total. That means you'll have to go through on every single item and figure out which service you want to pick, and you'll have to read the entire contract for every single one, since there won't be laws against hiding something nasty on page 17. \n\nOf course, there probably will be companies that offer package deals on services like that. In fact, it would probably be efficient for companies to organize themselves by geography, so every resource in a certain area is overseen by a certain company or group of companies. Gee, that sounds kind of familiar...",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/19873e/can_we_have_a_honest_discussion_about_why_anarcho/"
  }, {
    "id" : 3,
    "title" : "Capitalism In No Way Created Poverty, It Inherited It",
    "snippet" : "  Capitalism created wealth, which made poverty embarassing. Very well put.\n\nGrowing up in a farming community in the Mid-Atlantic States I heard from a number of people that they \"grew up poor but didn't know it\".  Sure, they may have worn hand me down clothes that their mother sewed originally for their oldest sibling, but they didn't go hungry, they weren't dying of exposure and they had a supply of books, education and hard work to go around to occupy their time and drive off ennui.\n\nOur statist, interventionalist monetary policies will eventually lead to a collapse scenario where the ultra-wealthy will find that numbers in a bank account do not purchase food from a farmer that doesn't want to sell it.  Immediately the productive will become more valuable to society than the bankers and the career academics and politicians.  I think if your doomsday scenario unfolds that you will find the wealthy to be much more resourceful than you expect them to be.  pretty good article. turns out, ayn rand was right some of the time What did you just say?! Have you not read The book of Rand chapter 3 verse 7? \"And lo, I Ayn Rand am always objectively right, because I made objectivism and I speak for the objective reality\".   So-called impoverished people in America now frequently eat more calories than the wealthiest of our Founding Fathers.  The \"poor\" ride around in subsidized public transportation and live in tenements with heat and air conditioning and clean water and a refrigerator.  More luxuries than our Founding Fathers could have DREAMED of!  And yet, we're told that they're in 'poverty' and need so many more of their \"needs\" (hah!) met by extortion money.  Hah! So-called impoverished people in America now frequently eat more calories than the wealthiest of our Founding Fathers.  The \"poor\" ride around in subsidized public transportation and live in tenements with heat and air conditioning and clean water and a refrigerator.  More luxuries than our Founding Fathers could have DREAMED of!  And yet, we're told that they're in 'poverty' and need so many more of their \"needs\" (hah!) met by extortion money.  Hah!  ",
    "url" : "http://www.forbes.com/sites/objectivist/2013/02/25/capitalism-in-no-way-created-poverty-it-inherited-it/"
  }, {
    "id" : 4,
    "title" : "\"Without a strong government, the populace lived in poverty and despair.\"",
    "snippet" : " ",
    "url" : "http://i.imgur.com/wOAOiFV.jpg"
  }, {
    "id" : 5,
    "title" : "Did you come to Libertarianism and Anarcho_Capitalism from the left or the right?",
    "snippet" : "As far as I can recall, I've always been socially left wing in that I believed that people should be free to do whatever they like with their own lives - it's none of the government or anyone's business what they want to do. My position on this has changed little, but has perhaps become stronger and more consistent.\n\nMy views on fiscal policy however, I would have described as centrist and perhaps a little left. I had little understanding of economics and the free market - I saw no alternative to the government providing things like education and healthcare, otherwise who could afford it right? I actually favoured increases in taxes - not because I wanted to tax the rich and have a more egalitarian society but because I wanted higher standards of services. Better healthcare, better education, better police and better roads would all be possible through higher taxation and I was happy to pay extra to achieve this.  This position has obviously changed heavily following my transition to libertarianism and anarcho-capitalism, a big swing to the right as the freedom and strength of a truly free market became apparent.\n\nThis means is that I came from the left, a move towards free markets through learning about economics. What I'm interested to hear is how many of you came from the opposite direction? Someone who believed in the power of the free market but also believed that the government has a responsibility to control personal lives and ensure that traditional values are maintained.\n\nSo where did you come from? The left or the right? I'm willing to bet that not many have been an ancap since birth!   I turned left on Jeffery, went straight a bit then I took a right on Marshall Drive. Which I then turned into a book store, and bought Human Action while maintaining a westwardly 40 degree motion. \n\nI am must be a statist though, cuz I drove on government roads....  I grew up in a conservative household, but when conservative meant something VERY different than what it means now.  My father was a reader of Barry Goldwater and Milton Friedman, for instance.  He was a big Reagan supporter, and pretty religious, so most would call him Republican, though he was pretty open about stuff like gay marriage.  So I grew up more or less Republican.  I had several \"left\" views (like my father, I was fine with gay marriage, supported legalizing weed, and didn't think religion should be forced on people), but was definitely more right than left.  One of my major \"right-wing\" views was I very much supported war.  I had a naive view of America as the universal \"good guys,\" believed that the world was full of evil people that wanted to harm America, and that the only reason we hadn't destroyed them all yet was hippie liberal protesters.  I was also, for similar reasons, a huge supporter of the police - I wanted stiffer punishments for crimes (besides drugs), more cops, and so on.  I had bought into the propaganda, in other words, of enemies foreign and domestic against which our only defense was a massive military/police state.\n\nThen during the Bush administration, I started to look more closely at things.  My views were still largely the same, but I didn't believe the current crop of Republicans were any good.  Bush was obviously an idiot, and while I enjoyed Jon Stewart's mocking of the guys in charge, I didn't agree with any of his oft-proposed \"solutions.\"  I felt like I wasn't represented - at this point, I still only thought you were a Republican or a Democrat, and that was it.\n\nI had a subscription to the Wall Street Journal, which I read regularly.  Then one day, in the op-ed section, was a letter to the editor from Don Bordreaux.  To this day, I don't remember exactly which letter it was - only that he was ON POINT, and I'd felt like I finally found someone I agreed with.  Furthermore, in the comments on WSJOnline, he was getting blasted - many of the \"conservatives\" on there highly disagreed, which only made me more curious.  I saw a link to his blog - Cafe Hayek - and started reading regularly, devouring the backlog as well.  From him, I followed links to Bryan Caplan (my personal favorite) and many others.  I found other people who I could talk to - and one showed me Reddit!  From there, I read voraciously, everything I could.  Hayek, Bastiat, Friedman, Rothbard, Mises, and then newer writers like Caplan, Brennan, Huemer, and many, many more.\n\nLibertarianism gave way to anarcho-capitalism (naturally, as I read more and learned more this was inevitable), and so here I am. Ooh fun, story time. Grew up in a conservative household holding to most of those beliefs, but was always strongly against the death penalty (but for some reason was still pro-war). In high school I took an econ class taught by an extremely liberal statist. However, she did one thing right when one day she showed a John Stossel video. That grabbed my attention and I went home and watched all his other videos. Went to the library and grabbed books by Thomas Sowell and Steven Landsburg, and between the three of them discovered libertarianism. The next year I decided to major in economics in college and somehow managed to have all libertarian professors who taught me about the Austrian school. I also had one professor show me how difficult it was to reconcile a belief in the teachings of Jesus and the actions of the state, and that pretty much completed my journey to where I am today.  I grew up in a conservative household, but when conservative meant something VERY different than what it means now.  My father was a reader of Barry Goldwater and Milton Friedman, for instance.  He was a big Reagan supporter, and pretty religious, so most would call him Republican, though he was pretty open about stuff like gay marriage.  So I grew up more or less Republican.  I had several \"left\" views (like my father, I was fine with gay marriage, supported legalizing weed, and didn't think religion should be forced on people), but was definitely more right than left.  One of my major \"right-wing\" views was I very much supported war.  I had a naive view of America as the universal \"good guys,\" believed that the world was full of evil people that wanted to harm America, and that the only reason we hadn't destroyed them all yet was hippie liberal protesters.  I was also, for similar reasons, a huge supporter of the police - I wanted stiffer punishments for crimes (besides drugs), more cops, and so on.  I had bought into the propaganda, in other words, of enemies foreign and domestic against which our only defense was a massive military/police state.\n\nThen during the Bush administration, I started to look more closely at things.  My views were still largely the same, but I didn't believe the current crop of Republicans were any good.  Bush was obviously an idiot, and while I enjoyed Jon Stewart's mocking of the guys in charge, I didn't agree with any of his oft-proposed \"solutions.\"  I felt like I wasn't represented - at this point, I still only thought you were a Republican or a Democrat, and that was it.\n\nI had a subscription to the Wall Street Journal, which I read regularly.  Then one day, in the op-ed section, was a letter to the editor from Don Bordreaux.  To this day, I don't remember exactly which letter it was - only that he was ON POINT, and I'd felt like I finally found someone I agreed with.  Furthermore, in the comments on WSJOnline, he was getting blasted - many of the \"conservatives\" on there highly disagreed, which only made me more curious.  I saw a link to his blog - Cafe Hayek - and started reading regularly, devouring the backlog as well.  From him, I followed links to Bryan Caplan (my personal favorite) and many others.  I found other people who I could talk to - and one showed me Reddit!  From there, I read voraciously, everything I could.  Hayek, Bastiat, Friedman, Rothbard, Mises, and then newer writers like Caplan, Brennan, Huemer, and many, many more.\n\nLibertarianism gave way to anarcho-capitalism (naturally, as I read more and learned more this was inevitable), and so here I am. So what changed your position on war? Was it declining adherence to flag waving nationalism?                  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/198274/did_you_come_to_libertarianism_and_anarcho/"
  }, {
    "id" : 6,
    "title" : "How do you think age related legal issues would be handled in an AnCap world?",
    "snippet" : "I imagine some would be easy to solve, like age to get a driver's license (licenses from companies that issue them to incompetent drivers would not be accepted, or roads would have an age requirement for safety), but some are tougher.  Examples would be things like drinking/drug use age, statutory rape, legitimacy of contracts, etc.  Do you think stores that sell drugs and alcohol would have incentive to refuse service to minors on their own?  And I know many you probably agree that 17 or 18 year olds should be allowed to buy them, but certainly it would be wrong to sell drugs to a 10 year old, no?\n\nI think the other two examples might be a little easier, since time can be taken to figure out whether the people involved were able to make sound judgements.  But they're still challenging.  Would court precedent determine the age that one can consent to sex or sign a contract?  Would it be a case by case basis?\n\nI think all three would be better solved with a market though, since our current ages for these things are pretty much arbitrary.\n\nAlso, if anyone can think of other examples and how they might be solved, feel free to share them  For those that believe DROs will dominate all legal aspect of life, different DROs would set the \"age of majority\" (i.e. when you become an adult) for various activities. I imagine most DROs would set various ages, or even biological markers, for various activities. Sex with similarly-aged individuals might start at puberty. Sex with individuals of a drastically different age might be in a window (e.g., today's 16 to 24 laws). In contrast, beer and wine might be sold to 16 year olds, hard alcohol to 18 year olds, and heroin to 21 year olds.\n\nFor a different view, Rothbard asserts that a person becomes an adult as soon as s/he leaves his/her parent's dwelling and become self-sufficient. I have a problem with this reasoning because a young individual could become \"self-sufficient\" by becoming a sexual partner of an older person. Therefore, one is self-sufficient and thus able to choose whether s/he can have sex becomes circular. &gt;For those that believe DROs will dominate all legal aspect of life, different DROs would set the \"age of majority\" (i.e. when you become an adult) for various activities.\n\nWhich DRO's age of majority would be used, the Alcohol/drug seller's or the child's parents'?  If different DROs enforce different ages, how would sellers know which age to use?  What incentive would DROs have to enforce an age at all?\n\nI think for extreme cases, such as selling to a 10 year old, it would be easier because other people would notice that the buyer is way too young and report the seller or take their business elsewhere.  But I think later it would be more up to parents to make sure their kids aren't drinking/doing drugs.\n\n&gt;For a different view, Rothbard asserts that a person becomes an adult as soon as s/he leaves his/her parent's dwelling and become self-sufficient. I have a problem with this reasoning because a young individual could become \"self-sufficient\" by becoming a sexual partner of an older person.\n\nNot only that, but I don't think you should necessarily have to be self sufficient in order to have sex or buy drugs or alcohol.  Just because someone could live on their own doesn't necessarily mean they will, or that it's financially feasible.  If someone is 20 and can't find a job, they shouldn't be stopped from fucking or drinking. &gt; Which DRO's age of majority would be used, the Alcohol/drug seller's or the child's parents'? If different DROs enforce different ages, how would sellers know which age to use?\n\nMost likely the buyer's DRO. I assume most DROs will give their customers a form of ID. It is in the interest of the seller to check the ID of the buyer because a buyer's DRO could impose litigation costs on the seller.\n\n&gt; What incentive would DROs have to enforce an age at all?\n\nBecause its customers want an age of consent. Part of the bundle of the DROs services could be that minors covered by the DROs policies would not be allowed to use drugs. The DRO would prevent parents or strangers from giving heroin to 10 year olds. I know I would pay for such a policy; I assume most others would, too.\n\nAround 14 to 22 years old is a gray area for things like drugs and alcohol (if these substances will be allowed at all). I assume different DROs would have different ways of setting the age of majority, and different policies for parents who give their kids such substances. For my personal preference, I would not care if a parent gave his/her 10 year old child a few sips of wine at dinner or a glass of champagne at a wedding. But, I would not allow a parent to give his/her 10 year old child meth.\n\nAfter sufficient trial and error, different DROs would solve these issues of age in different ways. Either way, kids today get drugs despite the government's war on drugs.\n\n&gt; Not only that, but I don't think you should necessarily have to be self sufficient in order to have sex or buy drugs or alcohol. Just because someone could live on their own doesn't necessarily mean they will, or that it's financially feasible. If someone is 20 and can't find a job, they shouldn't be stopped from fucking or drinking.\n\nThe Rothbardian view is that a property owner can decide who does what on his/her property, so long as it does not violate the NAP. Therefore, the property owners (parents) could dictate the child's behavior. If the child doesn't like the rules, s/he can leave.\n\nIn your hypothetical, a 20 year old would be allowed to drink and/or have sex, but s/he could be kicked out from his/her parent's residence.\n\nRothbard is actually quite severe in how little duty parents owe to their children. If I recall correctly, parents owe zero duty to their children. Therefore, a family could kick out its newborn.  I think the best answer is the most annoying--lots of experimentation would need to occur before \"best practices\" could occur.\n\nPersonally, I lean towards the idea that kids are \"rights-bearers\", but not \"rights-users\".  Parents hold their \"rights\" in \"trust\", until a child asserts his claim to an individual right.  Thus, adulthood would not happen all at once, but would rather occur gradually, starting earlier than one might expect, perhaps going longer for \"full-privileges\", with a lot of variation, to reflect what I suspect is a lot of individual variation in individual maturity rates.\n\nhttp://intentionalworldview.com/Deontology+%28Right+and+Wrong+Action%29#Conceptualizing_agency-ownership_and_property_rights_for_children: I like the theory.\n\nAs a practical matter, what happens when a parent finds his/her child having sex at age 13? Does it matter how old the partner is? I don't know.  See my first sentence above about annoying experimentation  being required.  In an effort to not blow off your question, I have a couple thoughts.  First, I've come to the conclusion that modern day people are infantilized to a rather large extent.  Our ancestors were taking on responsibilities at age 13 and younger that would astound us today.  That said, I think our ancestors had most of that responsibility forced on them without proper preparation and with little real choice.  So, my \"answer\" is that I think a free society would prepare children much faster and better to assume responsibility, but give parents and children the choice to tailor their assumptions of responsibility to meet their demonstrated levels of maturity.\n\nTo \"answer\" your specific question, I think it depends.  I've known kids that were very mature at age 13.  I don't think sex is necessarily \"bad\", especially if the parent made an effort to prepare the child for all the baggage that comes with it.  I'd imagine that the wider the age gap between participants, the more skepticism and investigation would be applied to the older of the two.  Plus, in my conception, discussions about sex should start early, and the child would have a strong enough relationship with their parent to say they're ready, and ask for tools like birth control, and relationship advice.  If the kid's not asking for those things, to me that makes it more likely they weren't ready. I think the best answer is the most annoying--lots of experimentation would need to occur before \"best practices\" could occur.\n\nPersonally, I lean towards the idea that kids are \"rights-bearers\", but not \"rights-users\".  Parents hold their \"rights\" in \"trust\", until a child asserts his claim to an individual right.  Thus, adulthood would not happen all at once, but would rather occur gradually, starting earlier than one might expect, perhaps going longer for \"full-privileges\", with a lot of variation, to reflect what I suspect is a lot of individual variation in individual maturity rates.\n\nhttp://intentionalworldview.com/Deontology+%28Right+and+Wrong+Action%29#Conceptualizing_agency-ownership_and_property_rights_for_children:",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/19893j/how_do_you_think_age_related_legal_issues_would/"
  }, {
    "id" : 7,
    "title" : "5bn government scheme finds jobs for just 20 people",
    "snippet" : " ",
    "url" : "http://metro.co.uk/2013/02/22/5bn-scheme-finds-jobs-for-just-20-people-3509323/"
  }, {
    "id" : 8,
    "title" : "Free State project says future is encouraging",
    "url" : "http://www.nashuatelegraph.com/news/994856-469/movement-starts-slowly-but-future-encouraging.html"
  }, {
    "id" : 9,
    "title" : "Countdown to the Apocalypse: The Sequester Now Just Days Away",
    "url" : "http://www.youtube.com/watch?v=6ZrdOw-FjeI"
  }, {
    "id" : 10,
    "title" : "If we are going to believe in outcomes, then lets just believe in ponies and fairies, okay?",
    "snippet" : "Just venting a little annoyance I have with statists.  They believe in national security, or feeding the poor, or educating the kids, or worker collectives, saving the environment, or free health care for the sick.  Well, these beliefs are outcome based beliefs, not philosophy based beliefs.  If we want to believe in an outcome, then why not just believe in ponies and fairies?  That's a nice sounding belief, right?  I mean, what could possibly be bad about fairies and ponies?   They're always happy, never get sick or die, pretty colors, are always fun and happy.   I mean, if we want to have an outcome based belief, why should we believe in all this other crap.   Lets just believe in something nice like ponies and fairies!   I mean, fuck man, don't you want people to live happy pretty lives, don't you care about all those people who are suffering and even dying because they don't live in the land of ponies and fairies?\n\nAnyhow, the whole idea of behind adhering to philosophy and principles instead of an outcomes is that people are extremely diverse, and situations extremely unique.  There are billions of people in this world, and each one has different desires and perspectives.   If one's core philosophy is sound, then one not need worry about the outcome because by definition that outcome will be good as well no matter what situation comes up.  In a free society there will be as many different outcomes as there are people, and those outcomes will make the best of the real world, instead of some fantasy one.   That really what ststisim is, it's an outcome based  fantasy,  but they just don't want to take it all the way to ponyvile.   I guess they have that movie in their head of what they want the real world to be like, and if they just wish it hard enough it will so.    \n  i believe in ponies. they're a type of small horse and definitely exist  &gt; If we want to believe in an outcome, then why not just believe in ponies and fairies?\n\nYou're strawmaning. These beliefs aren't outcome based beliefs, they're predictive outcome based belifs. The lost value in trying to make fairies exist subtracted from the value of fairies existing multiplied by the probability of fairies existing due to our action is the value of trying to make fairies exist.\n\nHow is the idea of a free society being diverse not an outcome based belief? How is it any different from saying that in a socialist society everyone will be healthy? I believe that communities who subscribe to the NAP will be better fed, healthier, and happier. If I didn't believe this, I wouldn't be an AnCap. Is that somehow flawed? Should I do things even though I believe that they will make the world a worse place for myself and the people around me?\n\nEveryone has a movie in their head about what they want the world to be like. We decide what to do based on what we predict will happen. There's no reason to say that someone's philosophy is flawed just because they want to make the world a better place. All you have to do is show them how AnCap societies have better outcomes than statist ones, which isn't hard. &gt;How is the idea of a free society being diverse not an outcome based belief? \n\nBecause, people are still free to all choose to be the same if they want.\n\n&gt;I believe that communities who subscribe to the NAP will be better fed, healthier, and happier.\n\nDo you?   Maybe new cultural norms will  occur where people are proud to be sick all the time, proud to skimp on food and nutrition, want to mope around and look sad and sorry.   Would you want to take a gun to their head and make them eat healthy food, make them go to the doctor, make them laugh and be happy?\n\nWhile I agree that Ancap societies tend to have better outcomes because people are free to choose them.   Philosophically, it's not an outcome based belief system.    &gt; If we want to believe in an outcome, then why not just believe in ponies and fairies?\n\nYou're strawmaning. These beliefs aren't outcome based beliefs, they're predictive outcome based belifs. The lost value in trying to make fairies exist subtracted from the value of fairies existing multiplied by the probability of fairies existing due to our action is the value of trying to make fairies exist.\n\nHow is the idea of a free society being diverse not an outcome based belief? How is it any different from saying that in a socialist society everyone will be healthy? I believe that communities who subscribe to the NAP will be better fed, healthier, and happier. If I didn't believe this, I wouldn't be an AnCap. Is that somehow flawed? Should I do things even though I believe that they will make the world a worse place for myself and the people around me?\n\nEveryone has a movie in their head about what they want the world to be like. We decide what to do based on what we predict will happen. There's no reason to say that someone's philosophy is flawed just because they want to make the world a better place. All you have to do is show them how AnCap societies have better outcomes than statist ones, which isn't hard. &gt; If we want to believe in an outcome, then why not just believe in ponies and fairies?\n\nYou're strawmaning. These beliefs aren't outcome based beliefs, they're predictive outcome based belifs. The lost value in trying to make fairies exist subtracted from the value of fairies existing multiplied by the probability of fairies existing due to our action is the value of trying to make fairies exist.\n\nHow is the idea of a free society being diverse not an outcome based belief? How is it any different from saying that in a socialist society everyone will be healthy? I believe that communities who subscribe to the NAP will be better fed, healthier, and happier. If I didn't believe this, I wouldn't be an AnCap. Is that somehow flawed? Should I do things even though I believe that they will make the world a worse place for myself and the people around me?\n\nEveryone has a movie in their head about what they want the world to be like. We decide what to do based on what we predict will happen. There's no reason to say that someone's philosophy is flawed just because they want to make the world a better place. All you have to do is show them how AnCap societies have better outcomes than statist ones, which isn't hard.  You've correctly identified the essential difference between statists and libertarians. It's also one of the more long-standing ethical dilemmas.\n\nHowever, their belief isn't in magic. Take healthcare:\n\n\"Right now, poor people in this country don't get (enough) healthcare to be healthy or productive. Let's give them healthcare. It's only fair that people be healthy so long as society can provide.\"\n\nThat belief is founded in both a modicum of truth (people are unhealthy, the state can provide healthcare) and also a separate philosophy (fairness is important, people should have equal opportunity to participate in the meritocracy, they see the social contract as valid, etc.) It doesn't do us any justice to misrepresent their belief system as one founded in magic. Well, thinking that the state will solve all these problems, and that everything will be fine, just sounds like magic to me.   You know, most statists say the exact same thing, except replace \"state\" with \"market.\" It's worth taking the time to understand other people's philosophy, if only to strengthen your own. With the difference, the free market isn't a promise to solve any problems, just a promise for people to be free.   If freedom is all you want, why not just move to the middle of the woods or a deserted island somewhere? If there's no one around to coerce you, you're free by definition, right? If you choose to live in a society, then clearly you care about more than just freedom, or at least more than freedom by your definition. If I had any success, the state would come in to tax me or interfere with regulations. So you'd be okay with living alone in the middle of the woods as long as the state stayed out of your business, then? Bear in mind that things like technology require a society. Well, thinking that the state will solve all these problems, and that everything will be fine, just sounds like magic to me.      They just want to feel cared for like  grown children, in a communist home, and the father is the ruler as Chris rock said. \n\nSome are too cooked, majority are beneficiary's, and the rest are too busy to fight subsidised existence. \n\n\nThe statists are predictable, but are you too? If you just get bothered by a virus of millennia. you are not living your principals, the ones that truly shines the light against statists, by being success in your own turms   There is a philosophy:\n\nThe good of the many out weigh the good of the few\n\nThe problem is they use that to curtail individual rights and that fucks over everyone. I think their philosophy is more like: from each according to ability, to each according to their needs. Or something like that.  There is a philosophy:\n\nThe good of the many out weigh the good of the few\n\nThe problem is they use that to curtail individual rights and that fucks over everyone.  I was just thinking about how I want to start a political party that promises to give everyone a pony.  We'd talk about everyone's equine rights.  It's everyone's dream.\n\nNever mind the need to feed, clean, and exersize the animals. Now everyone has one and you have to do these things.  There's a huge upsurge in animal abuse cases so lots more criminals in prison.  If you don't have your pony with you at all times you get fined more police work.  A sudden uptick in graffiti as the Pony Inspection Agency(PIA) gets created; which is colloquially referred to at the PITA.  It sounded nice, but in the end is just an albatross around everyone's necks.\n\nAfter thinking about this more I'm slightly depressed at how close to an actual political party platform this really is.     I don't think I've ever ran across the term \"philosophy based beliefs\" before... Could you clarify what a \"philosophy based belief\" is and maybe give an example?  Let me turn that argument around on you. We believe that outcomes are more important that philosophy. It's not worth sacrificing people's happiness or quality of life for the sake of ideological purity. \n\nOr, at least, some of us believe that.\n\n[](/rdcry \"What's wrong with ponies?\") Then fine, why not believe in fairies and ponies? If you can show that the cost of creating fairies and ponies and providing them to everyone will be outweighed by the benefit of doing so, then I'm all for it. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/196zoa/if_we_are_going_to_believe_in_outcomes_then_lets/"
  }, {
    "id" : 11,
    "title" : "Conspiracy Theorem",
    "snippet" : "  I don't know man, I have a friend who's really into a whole new level of conspiracy; mixing bible prophecies and the Illuminati. I really try hard avoid the conversation. :(    My approach is one of general skepticism of anything that comes out of the mouth of a government agent. Why only a government agent?  Anyone in *any* organization has an agenda. I haven't caught other organizations lying to me.  Other organizations don't steal from me.  Other organizations don't threaten me with force if I don't bow to their every whim.  Other organizations don't kill brown people in foreign countries in my name.  Other organizations didn't indoctrinate me for 12 years, forcing me to spend the last half of my life undoing said indoctrination.  If another organization did any of the above, I'd grant them automatic skepticism as well. You can blame your parents for putting you in public school. They steal from you because you let them. They kill other people because you let them. The blame is as easy to give out as it is to give to yourself for letting it happen...",
    "url" : "http://www.everything-voluntary.com/2013/02/conspiracy-theorem.html"
  }, {
    "id" : 12,
    "title" : "Where do you stand in consequentialist vs deontological debate?",
    "snippet" : "I have noticed a huge influx of younger consequentialists on Facebook, although it is likely influenced by my personal feed. A few particular conversations are actually confrontational and I noticed some consq.'s referring to morality itself as a form of statism.\n\nJust an informal survey. Where you do you stand? Is it possible to embrace aspects of both? I lean pretty heavily toward the consequentialist side but feel no animosity or negativity about NAP/Golden Rule or other principled type approaches.  You can support the NAP on consequentialist grounds - that is - it's not objectively binding, but probably a really good idea for letting people reach their ends.\n\nThe truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nConsequentialism on the other hand, means absolutely nothing on its own. Anyone can say that they do things because it \"leads to the best results.\" It's pretty much a tautology with human action. To say that such a theory is prescriptive (as a moral theory must be) is to say that there is no purpose to morality.\n\nOf course, you could just be an egotist nihilist like myself. It avoids all this herping and derping over NAP this and morality that. &gt;The truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nSo does consequentialism.  They assume some sort of ends as \"the good\".  The debate is simply over whether it is the means or the ends that are good/bad.\n\nAnd you don't get out of it by being an egotist nihilist.  Action itself presupposes morality.  You must presuppose that you should be able to act - that there is no moral prohibition on action.  This requires certain moral truths - namely, self-ownership and so forth. &gt;The truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nSo does consequentialism.  They assume some sort of ends as \"the good\".  The debate is simply over whether it is the means or the ends that are good/bad.\n\nAnd you don't get out of it by being an egotist nihilist.  Action itself presupposes morality.  You must presuppose that you should be able to act - that there is no moral prohibition on action.  This requires certain moral truths - namely, self-ownership and so forth. &gt; Action itself presupposes morality. \n\nWhat do you mean by morality? &gt;The truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nSo does consequentialism.  They assume some sort of ends as \"the good\".  The debate is simply over whether it is the means or the ends that are good/bad.\n\nAnd you don't get out of it by being an egotist nihilist.  Action itself presupposes morality.  You must presuppose that you should be able to act - that there is no moral prohibition on action.  This requires certain moral truths - namely, self-ownership and so forth. &gt; And you don't get out of it by being an egotist nihilist. Action itself presupposes morality. You must presuppose that you should be able to act - that there is no moral prohibition on action. This requires certain moral truths - namely, self-ownership and so forth.\n\nI'd love to read a proof of action necessarily implying action judgement. If I act, I am presupposing that I should.  That it is morally permissible.  (This is simple to do if there are no moral prohibitions at all, of course.)  But in doing so, I am acknowledging that I am a self-owner, and that by virtue of my ability to be one, I should be one.\n\nIf I were to presuppose that I should not be a self-owner, then I cannot act, as all action necessarily requires my choice.  But if I, as an actor, should be a self-owner and am right in acting as one, then this must also apply to anyone else who can act purposefully - all other human beings and sentient life in general.  As this is the case, then I am caught in a performative contradiction if I act to negate another's self-ownership.\n\nThus, action - even under the assumption of no moral prohibition - necessitates self-ownership and leads to rational moral prohibitions. &gt; If I act, I am presupposing that I should.\n\nHume's law dictates you cannot take an objective reality (your action) and create a subjective consequent (your should). Reality does not have a preference, and subjectivity cannot be defined.\n\nYou can do is-ought when both sides of the coin are objective, and when both sides of the coin are subjective, but not when there's a mix. You are misapplying Hume's law.  If I act, this is an objective fact.  And yet, there are subjective consequents - that I prefer this action to some other action, for instance.  Or that I think this action is acceptable action in a moral sense.\n\nI'd note here that I am not declaring an \"is-ought\".  I am declaring only that one *thinks* they ought to do it, and that this logically means they are accepting certain premises.  It is the fact that these premises must be accepted *to act at all* that imply they must be a universally accepted premise, and that one is caught in a contradiction if they both act (affirming the premise) and attempt to negate it as part of the action. Then you're misapplying the word \"should\". Your actions may necessitate realistic goals, but you can't use realistic actions (objective reality) to create a moral framework (metaphysical concept). That's an is-ought error. I'm not misapplying the word should.  I am declaring that action necessitates a *subjective morality*, but that subjective morality *must be shared by all actors*, so might as well be objective (as morality is a concept intricately attached to action).\n\nI'd also note that the \"is-ought\" gap is not really a hard truth.  Hume couldn't do it, but there is no real argument as to why it is actually *impossible*, rather than just difficult and unlikely.  You can say there is an is-ought error all you like, but I have pointed out how I have crossed this boundary logically, and you will not convince me unless you can tell me how I can act in some manner while also - in that exact moment - presupposing it is morally forbidden and something I don't prefer.  I'm extremely interested, because this requires you also demolish the economic concept of demonstrated preference, and your tag declares you a Rothbardian.\n\nJust remember, I'm not saying \"X is, therefore ought X\" - I'm saying that one cannot simultaneously do X and believe \"ought not X\". &gt; I'm extremely interested, because this requires you also demolish the economic concept of demonstrated preference, and your tag declares you a Rothbardian.\n\nDemonstrated preference is subjective preference makes people feel as though they ought to fulfill subjective goals important to them. Deontology is subjective by design because it's about duty, a subjective to subjective system. I'm not misapplying the word should.  I am declaring that action necessitates a *subjective morality*, but that subjective morality *must be shared by all actors*, so might as well be objective (as morality is a concept intricately attached to action).\n\nI'd also note that the \"is-ought\" gap is not really a hard truth.  Hume couldn't do it, but there is no real argument as to why it is actually *impossible*, rather than just difficult and unlikely.  You can say there is an is-ought error all you like, but I have pointed out how I have crossed this boundary logically, and you will not convince me unless you can tell me how I can act in some manner while also - in that exact moment - presupposing it is morally forbidden and something I don't prefer.  I'm extremely interested, because this requires you also demolish the economic concept of demonstrated preference, and your tag declares you a Rothbardian.\n\nJust remember, I'm not saying \"X is, therefore ought X\" - I'm saying that one cannot simultaneously do X and believe \"ought not X\". &gt; I am declaring that action necessitates a subjective morality, but that subjective morality must be shared by all actors, so might as well be objective (as morality is a concept intricately attached to action).\n\nOkay, so you've proven that aggression and what not can lead to objective contradiction. How does that prove a moral framework? Hume waits. I'm not misapplying the word should.  I am declaring that action necessitates a *subjective morality*, but that subjective morality *must be shared by all actors*, so might as well be objective (as morality is a concept intricately attached to action).\n\nI'd also note that the \"is-ought\" gap is not really a hard truth.  Hume couldn't do it, but there is no real argument as to why it is actually *impossible*, rather than just difficult and unlikely.  You can say there is an is-ought error all you like, but I have pointed out how I have crossed this boundary logically, and you will not convince me unless you can tell me how I can act in some manner while also - in that exact moment - presupposing it is morally forbidden and something I don't prefer.  I'm extremely interested, because this requires you also demolish the economic concept of demonstrated preference, and your tag declares you a Rothbardian.\n\nJust remember, I'm not saying \"X is, therefore ought X\" - I'm saying that one cannot simultaneously do X and believe \"ought not X\". Wait, have you disproven Hume's Law? I think since natural law has been considered dead because of Hume for 100 years, the onus is more on you to overturn it and say why it doesn't apply to your framework. You can support the NAP on consequentialist grounds - that is - it's not objectively binding, but probably a really good idea for letting people reach their ends.\n\nThe truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nConsequentialism on the other hand, means absolutely nothing on its own. Anyone can say that they do things because it \"leads to the best results.\" It's pretty much a tautology with human action. To say that such a theory is prescriptive (as a moral theory must be) is to say that there is no purpose to morality.\n\nOf course, you could just be an egotist nihilist like myself. It avoids all this herping and derping over NAP this and morality that. &gt; The truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nDeontology is only an argument that duty is the primary agent of choice. A bad deontologist ancap would say \"your duty is X\", but a good one recognizes capitalism is a system of revealed preference and says \"you can choose who you want to have duties to and what duties you want to have.\" This is why the Rothbardian Bob Murphy wrote Chaos Theory and expounded on free choice in market law when beginning and concluding contracts.\n\nEDIT: Accidentally a \"to\". But that falls into the second category of useless prescriptive theories of ethics. Is legal theory useless? Legal!=Moral.\n\nA legal system is merely the framework of how we resolve disputes and establish property norms. Bob has done a great job of showing how differing values can still function coherently in a framework of polycentric law.\n\nHowever, that's not what an ethical theory is, which would claim that one set of values is superior to others. Legality and morality can cross paths. What you should mean to say is that legality is not always morality and vice versa.\n\nLegal theory is a system of duties, and yes it can have differing values, but it still an agreement to work with and answer to a final arbitration if necessary because you want to fulfill the duties on the contract so the other person fulfills their duties.\n\nLegal theory is necessarily deontological in nature. Legal theory is a system of truces, not duties, IMO. Duty implies some extra impetus. You can support the NAP on consequentialist grounds - that is - it's not objectively binding, but probably a really good idea for letting people reach their ends.\n\nThe truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nConsequentialism on the other hand, means absolutely nothing on its own. Anyone can say that they do things because it \"leads to the best results.\" It's pretty much a tautology with human action. To say that such a theory is prescriptive (as a moral theory must be) is to say that there is no purpose to morality.\n\nOf course, you could just be an egotist nihilist like myself. It avoids all this herping and derping over NAP this and morality that. &gt;The truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nYes, this is the main problem. Anarcho-capitalism doesn't do much good for tyrants. I think anarcho-capitalism doesn't do much good for most people, given their emotional attachment to the State, power structures, feel-good policy, etc.\n\nWhen you understand the true motivations behind why statists hold their beliefs, you come to realize that we're fighting the mob, not some elite power class. &gt;The truth is, there are no deontological approaches that are sound arguments. I want there to be, but in the end they assume some set of values as \"the good.\"\n\nYes, this is the main problem. Anarcho-capitalism doesn't do much good for tyrants. What then, is the alternative?\n\nI feel Consequentialism is the other side of the same coin - that one must accept some moral system for an action to be good, bad, or even preferable.  I think that the arguments are both necessary, as they convince different types of people. I was originally brought over by the NAP/morality argument, but I've been drifting away from it since. Both types are perfectly fine, and we all end up wanting the same thing, so what's the harm? I think that the arguments are both necessary, as they convince different types of people. I was originally brought over by the NAP/morality argument, but I've been drifting away from it since. Both types are perfectly fine, and we all end up wanting the same thing, so what's the harm?  I'm a deontological consequentialist :) Also the other way around... I think... I'm a deontological consequentialist :)  Neither, egoist. I think there are legitimate objections to egotism, but it's the closest we're gonna get to a perfect philosophy. I started out disliking egoism, but the more I think about philosophy, the more I realize that a sensical moral philosophy somehow will touch on egoism. I mean, even Rawls's theory appears to me to be an egoistic one. I started out disliking egoism, but the more I think about philosophy, the more I realize that a sensical moral philosophy somehow will touch on egoism. I mean, even Rawls's theory appears to me to be an egoistic one.  I'm a deontologist, but I definitely use utilitarianism to supplement my arguments.\n\nFor instance, I want everyone to be able to choose their leaders, and that works because self-segregation and self-production (in terms of propertarian ownership) as a whole lead to incentives to do better and create better things. &gt;utilitarianism\n\nI think the trend within the ancap movement has been to associate Utilitarianism with *objective value*-based consequentialism (which is a pretty laughable philosophy) and Consequentialism with no modifiers with the subjective, egoistic [Austrian kind](http://www.youtube.com/watch?v=c3fZzbMf86E), though it often also refers to material productivity, but only because that constitutes a great deal of what people subjectively want, but, unlike Utilitarianism, this brand of consequentialism doesn't pretend everyone need or should share that value. I chose my words carefully. Utilitarianism is a philosophy that says the greatest good is the primary agent for a choice between actions. Consequentialism is a philosophy that says the ends are the primary agent for a choice between actions. &gt;utilitarianism\n\nI think the trend within the ancap movement has been to associate Utilitarianism with *objective value*-based consequentialism (which is a pretty laughable philosophy) and Consequentialism with no modifiers with the subjective, egoistic [Austrian kind](http://www.youtube.com/watch?v=c3fZzbMf86E), though it often also refers to material productivity, but only because that constitutes a great deal of what people subjectively want, but, unlike Utilitarianism, this brand of consequentialism doesn't pretend everyone need or should share that value. Why is \"objective value-based\" consequentialism laughable? \n\nHuman life is important, not just because everybody agree, but because people who don't tend to not stick around.  &gt; Human life is important, not just because everybody agree, but because people who don't tend to not stick around.\n\nThat's a bold claim. Is there proof for that? People usually argue for the state because of the Hobbesian view that people will war with each other otherwise. That's not exactly a human-positive worldview. First of all we need to acknowledge that \"people will war with each other otherwise\" is a actually a half-decent argument. Why?\n\nWe have no large scale-data of people living without the state and the best we can do is tribal days, which were not exactly pretty. This argument alone is a large portion of why libertarians outnumber ancaps. Of course, you can say that the state itself is the reason we don't have any good data on this, which is true, but not convincing. \n\nSecond of all, i don't like the notion of \"proof\". To me \"proof\" is reserved for math and math-based disciplines. In hard sciences, there are theories, in evolution, there are \"process\" and \"probabilistic outcomes\".\n\nAnd lastly, \"human life is important\" is something i hope i don't need to qualify. Genetics of people who don't value their own lives tends to not stick around evolutionarily.  First of all we need to acknowledge that \"people will war with each other otherwise\" is a actually a half-decent argument. Why?\n\nWe have no large scale-data of people living without the state and the best we can do is tribal days, which were not exactly pretty. This argument alone is a large portion of why libertarians outnumber ancaps. Of course, you can say that the state itself is the reason we don't have any good data on this, which is true, but not convincing. \n\nSecond of all, i don't like the notion of \"proof\". To me \"proof\" is reserved for math and math-based disciplines. In hard sciences, there are theories, in evolution, there are \"process\" and \"probabilistic outcomes\".\n\nAnd lastly, \"human life is important\" is something i hope i don't need to qualify. Genetics of people who don't value their own lives tends to not stick around evolutionarily.  &gt; Second of all, i don't like the notion of \"proof\". To me \"proof\" is reserved for math and math-based disciplines. In hard sciences, there are theories, in evolution, there are \"process\" and \"probabilistic outcomes\".\n\nUsually I use \"proof\" in a legal sense: The Reasonable Man Standard. \"Would a reasonable, rational man believe that?\"\n\n&gt; Genetics of people who don't value their own lives tends to not stick around evolutionarily.\n\nNow, genetics *is* a science, so I'd like scientific proof of that. &gt;Genetics of people who don't value their own lives tends to not stick around evolutionarily.\n&gt;&gt;Now, genetics is a science, so I'd like scientific proof of that.\n\nWell, that's just common sense.  I imagine most of the evolutionary biology field agrees on that. It's not universally agreed that self-destructive behavior leads to species self-destruction.\n\nChickens will eat each other alive if they see one another bleeding, and cannibalism has existed in humans and still does in some remote regions of Oceania. Well, unless I read him wrong, I think all he said was the genes of the people prematurely killed off tend to leave the pool, not necessarily that the species goes away. &gt; Human life is important, not just because everybody agree, but because people who don't tend to not stick around.\n\nThat's a bold claim. Is there proof for that? People usually argue for the state because of the Hobbesian view that people will war with each other otherwise. That's not exactly a human-positive worldview. Why is \"objective value-based\" consequentialism laughable? \n\nHuman life is important, not just because everybody agree, but because people who don't tend to not stick around.            I'm human, so I end up being influenced by many perspectives. I don't really like such divisions, it seems too bigoted.      I'm a moral nihilist, so, consequentialist. Does not consequentialism reflect a moral preference it what it seeks as ideal goals? Thus, every desired system is a result of moral preferences?\n\nI'm moral nihilist as well, but I'm kinda stuck at the \"now what?\" stage. &gt; Does not consequentialism reflect a moral preference it what it seeks as ideal goals? \n\nIf I was a good criminal or I had political connections or had a government job, I probably wouldn't be a voluntarist.  I don't think there's anything inherently wrong with killing people or stealing from people (one just has to face the consequences of doing so).  For my own ends, I think voluntarist/ancap/free-market/private-property solutions are the most productive and that non-violent solutions lead to the greatest prosperity - I would prefer to live in a society that respected these things as opposed to one that did not. I'm a moral nihilist, so, consequentialist.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/1976xb/where_do_you_stand_in_consequentialist_vs/"
  }, {
    "id" : 13,
    "title" : "I'm having a kid. Should I, or should I not get him/her a social security number?",
    "snippet" : "I've read a few articles here and there on the subject but never any follow up. What are the benefits or issues they will run into later or that i will run into until they are old enough to be on their own? I do not think it right to enter someone into a contract they can not fully understand and as i understand it someone born here can get a ssn later in life if they so choose. What are your thoughts?  you can choose?    Get the SSN. It's not like not having one will do anything to protect your kid or yourself should the government set its gaze of death upon ye.\n\nPeople have this infatuation that the government is out to get them. It isn't. It's just a sea of bureaucratic goop that occasionally fucks over someone at random. Your best chance of being passed over is being socially 'normal'. People, especially in positions of authority, find 'different' to be unnerving. Occasionally?  o_O   I remember a while back I heard something about this on Adam Vs the Man. A lady was on talking about the exact same situation and choice. I think she found some loop hole where the kid could choose at 18. I'll try and find the video. In the mean time does anyone else know what I am referencing? It's no loophole. SSN isn't required and you don't have to get one. Life is just challenging without one - unfortunately.  \n\nI lived near a religious pseudo cult in which none of the kids had SSN's. Not sure how but they were still able to attend school. This was in a rural area in Washington. The way they explained it is that they were religiously forbidden to enter any kind of contract with the government. Where I lived a lot of stuff is done under the table.\n\nHe will have to choose when it comes time for him to get a driver's license.\n\nI would say don't get him one now. We have no way of knowing what will happen in this country. Not to be an alarmist, but FEMA camps and 8 inch drones give me the willies. You listen to too much Alex Jones. Having an SSN is less of an identification than not having one, which raises eyebrows. Best to blend in. \n\nI lived near a religious pseudo cult in which none of the kids had SSN's. Not sure how but they were still able to attend school. This was in a rural area in Washington. The way they explained it is that they were religiously forbidden to enter any kind of contract with the government. Where I lived a lot of stuff is done under the table.\n\nHe will have to choose when it comes time for him to get a driver's license.\n\nI would say don't get him one now. We have no way of knowing what will happen in this country. Not to be an alarmist, but FEMA camps and 8 inch drones give me the willies.     Uh, do you want your kid to ever go to school or have a job? Uh, do you want your kid to ever go to school or have a job? ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/197ked/im_having_a_kid_should_i_or_should_i_not_get/"
  }, {
    "id" : 14,
    "title" : "Facilitating Communication | by LifeIsHowItIs",
    "url" : "http://www.youtube.com/watch?v=RgBoOjChCUw"
  }, {
    "id" : 15,
    "title" : "Bill Gross: Federal Reserve to Continue QE to At Least 2014, Currency Wars A Danger To Bond Market",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=c4I8alZH7P0"
  }, {
    "id" : 16,
    "title" : "Stefan Molyneux is a plagiarist and a fraud",
    "snippet" : "Plagiarism: The practice of taking someone else's work or ideas and passing them off as one's own\n\nA. Stefan Molyneux has written various books on philosophy and psychology.\n\nB.  In his book *Universally Preferable Behavior*, he took parts of the ideas of Hoppe, Rand, Locke, and Rothbard.\n\nC. There are no citations or footnotes in any of these books.\n\nD.  Molyneux has claimed to be the originator of these ideas.\n\nE. Molyneux is familiar with the works of the aforementioned authors, thus ruling out any parallel thinking.\n\nF. Molyneux gains income from book sales and speeches as well as donations.\n\nFrom premises A through E, we can see that what Molyneux has done fits exactly the definition of plagiarism.\n\nSince he gains income through the distribution of these ideas and he falsely claims to be the originator of these ideas, he is engaging in fraudulent advertisement.     I don't think he's even worth mentioning, it's not like anyone actually thinks he's a scholar or anything.  I don't think he's even worth mentioning, it's not like anyone actually thinks he's a scholar or anything.  I would agree if not so many people thought so highly of him.  I'm not a huge fan, but he's contributing. He doesn't believe in State information control via \"IP\" and I don't either, so by living it, I don't really see a problem. I don't care what he claims and profits from, though I haven't seen what you say, at any rate I am really more concerned with the ideas. Molyneux has converted some people to anarcho-capitalism. And sometimes he assembles information into a decent package. I welcome all this. IP has nothing to do with it.  It is fraud in physical property. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/198nei/stefan_molyneux_is_a_plagiarist_and_a_fraud/"
  }, {
    "id" : 17,
    "title" : "Stefan Molyneux of Freedomain Radio Co-Hosts Free Talk Live",
    "snippet" : "  Free Talk Live is an excellent radio show hosted by voluntaryists which appears on over 110 radio shows.  It can only get better with Stefan Molyneux, arguably one of the best anarcho-capitalist thinkers of all time as a host. Free Talk Live is an excellent radio show hosted by voluntaryists which appears on over 110 radio shows.  It can only get better with Stefan Molyneux, arguably one of the best anarcho-capitalist thinkers of all time as a host. &gt;Stefan Molyneux, arguably one of the best anarcho-capitalist thinkers of all time \n\nHa!\n Lulz. Has the guy contributed *anything* to our philosophy? It's like calling Glenn Beck a conservative \"thinker.\"   Uhhhh Libertarian parenting? He originated none of it.  And you could say the same thing about Rothbard, now can't you? Being original is not the point. Rothbard has nothing to do with parenting.  Rothbard contributed a lot to Austrian theory: updating Mises and critiquing welfare economics just to name a few.  A lot of his stuff is borrowed, but he is not a plagiarist like Molyneux. &gt;plagiarist\n\n*facepalm* Pretending you invented ideas and passing them off as your own when you took them from other people is plagiarism. I'm confused about the facepalm.  Pretending you invented ideas and passing them off as your own when you took them from other people is plagiarism. I'm confused about the facepalm.  &gt;plagiarist\n\n*facepalm* Same offer goes to you.  If you can show me one source or footnote in Molyneux's books, I will retract my statement and buy you reddit gold. Rothbard has nothing to do with parenting.  Rothbard contributed a lot to Austrian theory: updating Mises and critiquing welfare economics just to name a few.  A lot of his stuff is borrowed, but he is not a plagiarist like Molyneux. Plagiarist?? Have you learned nothing?? Free Talk Live is an excellent radio show hosted by voluntaryists which appears on over 110 radio shows.  It can only get better with Stefan Molyneux, arguably one of the best anarcho-capitalist thinkers of all time as a host. &gt;Stefan Molyneux, ~~arguably one of~~ the ~~best~~ *worst* \"anarcho-capitalist\" \"thinker\" of all time as a host. In my opinion claiming he's the worst is just as ridiculous as claiming he's the best. Indeed. Nobody even called him \"the best\", it was \"one of the best\" which could be top 5, 500, 5000, etc. People are so quick to look for a reason to attack others... Indeed. Nobody even called him \"the best\", it was \"one of the best\" which could be top 5, 500, 5000, etc. People are so quick to look for a reason to attack others... &gt;Nobody even called him \"the best\", it was \"one of the best\" which could be top 5, 500, 5000, etc.\n\nWell, in that case either the description was pointless, or describing something or someone as \"one of the best\" has lost its meaning. Or perhaps there is no measure other than opinion of whose method of presenting the message is preferable to who and you're just being childish.   \"Stephanie Murphy\" made me imagine what Bob would look like as a female... Or just bob in a dress. But we can only dream.",
    "url" : "http://www.youtube.com/watch?v=jXlTqKRk30g"
  }, {
    "id" : 18,
    "title" : "Murray Rothbard: Involuntary Servitude - Taxation, I'm sure most of us are grossly familiar with the work, but I do enjoy revisiting these snippets.",
    "url" : "http://www.youtube.com/watch?v=upLHwXxgW30"
  }, {
    "id" : 19,
    "title" : "Anarchy, State, and Gun Ownership - Why market solutions to security should make sense even to liberals",
    "snippet" : " ",
    "url" : "https://mises.org/daily/6363/Anarchy-State-and-Gun-Ownership"
  }, {
    "id" : 20,
    "title" : "Extending on the Reason.TV link, for those of you who want a more in depth look at psychopathy and criminality, check out this video. And for those who doubt Stefan Molyneux's claim that we can scan kids for inclinations of psychopathy - it looks like we really can.",
    "snippet" : "  ",
    "url" : "https://www.youtube.com/watch?v=mzUsaXfSQDY"
  }, {
    "id" : 21,
    "title" : "If you're not subscribed to Cathy yet, what's wrong with you?",
    "snippet" : "          And then she interviews [this guy](http://youtu.be/aezw8vsXsbE).\nLet's wrap libertarians into a neat, pretty little package...     She's comparing 18th Century French debtor laws with modern day drug laws? Seems weird to me. I mean, in a way they are similar, but it just seems a weird comparison to me. I don't know. ",
    "url" : "http://www.youtube.com/watch?v=aqHa2gSOK1Q"
  }, {
    "id" : 22,
    "title" : "Soviet national anthem (with english subs)",
    "snippet" : " ",
    "url" : "https://www.youtube.com/watch?v=0yDrtNEr_5M"
  }, {
    "id" : 23,
    "title" : "How should we act in real political world?",
    "snippet" : "So, I have recently discovered, that the more I have drifted towards anarcho-capitalism, the less able I am at political discussions. No, really. For 99% of the people, my arguments about politics always end in the same position - me trying to explain why the state is evil at everything it does. \n\nAnyways, what I have to face, is that the government and its programs are going to stay for a long time. And as such, I should be able to cope with these situation and still work for my ideals.\n\nHowever, simply trying to reduce the government step by step is probably not the best solution. It hardly works as a middle step between public and private, as a reduced government still has to do everything, it now just has less money to do whatever it's doing, making the quality go down even further.\n\nWhat I have thought, is that some government programs are less evil or I could even say positive. I think that I should support more government investments into science, education and at least to the creation of a socio-economic net. It is easier (in my opinion) to relocate money within the current system, to make it better, than just start slashing government programs. \n\nMost of the people I have talked to, have said, that they wouldn't want to increase taxes to get more investments where they think is necessary, but want to take it from other parts, that they do not consider as important. So it seems possible to simply better the system, by prioritizing investments better than currently.\n\nSo to ask this subreddit, what are the government programs that should be getting more money and which should get less (in a real political situation)?        I'd say there's just about nothing that is government funded that would get funding in a Stateless world. The roads are included in this (think about the metro car systems that existed in most cities 125 years ago). It is the ultimate summation of what people *don't* want in the world.  Defence? Courts? Firemen? Education? Health care? (Roads?) Ports? Airports? Air traffic control? Retirement? Overseas aid? Oil drilling? All of these are funded by governments today (no, the American government isn't the only one in the world - I know that might sound surprising) - do you honestly think nothing like this would be funded under anarchy? A stateless society is a hypothetical world, so we can only compare and contrast our \"what ifs\" here. Let's accept that first before we take things too seriously.\n\n\nPerhaps what I am imagining in a Stateless world that you are not is the absolute opulence, ease of living, living standard, and availability of goods and services at natural costs that would exist in a world where the realization that childhood trauma leads to nasty adulthood coercions like governments would lead people, on a massive scale, to voluntary relationships. A world so enlightened is practically unfathomable but were it to exist, yes...fuck tons of what government does now would be absolutely obsolete. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/1975o3/how_should_we_act_in_real_political_world/"
  }, {
    "id" : 24,
    "title" : "Is CC-BY too restrictive and a form of IP?",
    "snippet" : "Here is the specification:\n\nhttp://creativecommons.org/licenses/by/3.0/\n\nDoes requiring the user to give you attribution violate the NAP?   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/197dvy/is_ccby_too_restrictive_and_a_form_of_ip/"
  }, {
    "id" : 25,
    "title" : "An anarcho-capitalist society is essentially a form of neocameralism.  Do you agree?",
    "snippet" : "Why can we not embrace that humanity is Hobbesian, and therefore some sovereign is necessary?\n\nWhy not create a sovereignty with exit rights free of territorial monopoly?      ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/197ts4/an_anarchocapitalist_society_is_essentially_a/"
  }, {
    "id" : 26,
    "title" : "Posts on r/socialism. Gets 50 personal downvotes.",
    "snippet" : "  I can't understand why socialists get hung up on the issue of absentee ownership. It seems like a trivial and unimportant issue to me. It'll work itself out in the free marker of a private system of law. I can't understand why socialists get hung up on the issue of absentee ownership. It seems like a trivial and unimportant issue to me. It'll work itself out in the free marker of a private system of law.  You go over there to stir up trouble and act like a dick, for what purpose?\n\nJust avoid those people, and stop making us look bad. Idiot.  Unfortunately, /r/socialism isn't very good at considering ideas it doesn't already agree with. With that said, it looks to me like most of the posts you were heavily downvoted on were one-liners that didn't really respond to the post in question. Personally, I think you deserve some points just for being willing to go over there and hear what the other side has to say, but you should be willing to engage.  So? What did you expect?\nI don't know what your goal is with posting this is in r/Anarcho_Capitalism, but people might think you're trying to call a vote brigade. ",
    "url" : "http://www.reddit.com/r/socialism/comments/194o1p/please_make_the_case_against_absentee_ownership/"
  }, {
    "id" : 27,
    "title" : "Remedial Economics and the Minimum Wage, A Guide for Presidents: \"It's ironic that President Obama would choose a speech about job creation to push for the one policy that is guaranteed to destroy thousands of jobs.\"",
    "url" : "http://blog.skepticallibertarian.com/2013/02/25/remedial-economics-and-the-minimum-wage-for-presidents/"
  }, {
    "id" : 28,
    "title" : "The Private Market At Work: DefDist Printed AR Lower - Part III",
    "url" : "http://www.youtube.com/watch?v=tAW72Y_XPF4"
  }, {
    "id" : 29,
    "title" : "Discussion on House of Cards",
    "snippet" : "Has anyone else here watched House of Cards on Netflix?\n\nhttp://movies.netflix.com/WiMovie/House_of_Cards/70178217\n\nI guess there are two main points to discuss here. The first is less political.\n\nI think it's great that Netflix is being more proactive with original programming. Whether you like the show or not, it's very well produced and is very engaging. The fact that we can have shows this great that don't go through the dinosaur model of broadcast TV is encouraging.\n\nAnyway, onto the political side. I find myself liking and hating the show at the same time. I like it because I feel it's a very realistic portrayal of how Washington actually works. It's all about preserving your power and getting more of it, not serving the public good, if such a thing even exists. The characters are great, especially Underwood (Spacey).\n\nHowever, seeing such a clear portrayal frustrates me. It just reminds me of why I hate the State over and over and sometimes depresses me as I'm watching it. With Underwood, I love his deviousness; but then almost immediately I get turned off because it reminds me of the real politicians. I definitely feel like it's one of those shows where you don't like the main character, or really anyone else in the show for that matter, similar to Breaking Bad.\n\nI'm not exactly sure what kind of affect this show would have on a normal citizen who thinks of themselves as either a democrat or republican. Would they brush it off as mere entertainment? Would they make excuses like \"they're all scumbags except for my guy?\" Would it open their eyes at all, even just a tinsy winsy bit? I'm not sure.\n\nWhat are your thoughts?  Frank underwood just defines government corruption so well... \n\n\"I don't give a hoot about natural gas, but I have 67 deputy whips and they all need cash to win races. SanCorp helps me purchase loyalty and in return they expect mine. It's degrading, I know, but when the tit's that big everybody gets in line.\" Rep Underwood  I have been meaning to do a review of the series for ancap, glad someone brought it up before I had a chance.  I don't know how realistic the political lobbying aspect is... but it's not difficult to imagine the corruption and pressure and manipulation to exist.  I just fear confirmation bias here, and don't know firsthand.\n\nI didn't like or dislike the show... I do feel that it was overhyped.  I felt like I had to keep watching because it was bound to get better.  I won't say it was an absolute waste of time, but it wasn't anything like watching Breaking Bad for me.   I'll admit it's not my favorite show ever. It does feel like it meanders a bit in a couple episodes. However the second half of season one is very potent and engaging. If you've got other stuff to watch (and who doesn't) then I wouldn't blame you for skipping it, but if not, then I'd finish it.  Haha, my cousin and I were just talking about this. We both hate the premise, but love the show. The writer either has an amazing imagination or fantastic knowledge of inner political workings. Anyway, I do like it. I'm sure, regardless of how much is actually true, that there's a lot of this type of shit going on.\n\nJust about to watch the season finale.    &gt; I definitely feel like it's one of those shows where you don't like the main character, or really anyone else in the show for that matter, similar to Breaking Bad.\n\nYou don't like Walt? &gt; I definitely feel like it's one of those shows where you don't like the main character, or really anyone else in the show for that matter, similar to Breaking Bad.\n\nYou don't like Walt?  I pretty much agree with you on almost all points.\n\nI think it's very well produced.  This is TV history.  I actually cancelled cable a while ago.  Netflix is my main source of tv entertainment.  Being able to get original content from them is nothing short of amazing.  I love what they're doing.\n\nAs for the politics, I agree again.  I love it because it's eye opening to the masses.  It shows the corruption and how things really work (or how I assume they work).  I think it has an anti-state feel especially when Spacey talks directly to the camera, revealing his true motives.  You want to hate all politicians.  This is a good thing.\n\nI'm past being frustrated by the government though.  They have no boundaries.  Nothing they do can surprise me anymore.  Having accepted that, a show that spotlights the corruption does nothing but entertain me.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/196988/discussion_on_house_of_cards/"
  }, {
    "id" : 30,
    "title" : "Afra Raymond: Three myths about corruption",
    "url" : "http://www.youtube.com/watch?v=yq3TQoMjXTw&amp;feature=youtube_gdata"
  }, {
    "id" : 31,
    "title" : "Reading \"The Chaos Theory\" by Robert Murphey and I have a question..",
    "snippet" : "It is about gun control. In this book, Mr. Murphey says that an arbitrary agency needs to take an account of all your guns to set a premium. As awesome as this sounds for a gun control plan, I have one example that I would like to have cleared up.\n\nI am Mr. Smith. I hold a shotgun under my floorboards. Mr. Doe over there really made me mad one night, so I got my shotgun from my floorboards and killed him. No witnesses. No evidence (I know this is very unlikely, but for example's sake). I put the shotgun back in my floorboards. Nobody will ever find out, and hell! Since I wasn't caught the first time maybe I'll do it a few times more! \n\nHow would this case be solved in the gun control argument? If premiums go up if you own a gun, you are more likely going to hide it so you don't have to pay so much, such as Mr. Smith in my example. In a truly voluntary society, one wouldn't in their right mind tear up a person's house in the search for something that will only negatively affect the client.\n\nThanks in advance to anybody that chooses to respond. :)  &gt;How would this case be solved in the gun control argument? \n\nIt wouldn't.  Ancapistan would still require evidence, witnesses, etc, when trying to convict someone of murder.\n\n&gt;In a truly voluntary society, one wouldn't in their right mind tear up a person's house in the search for something that will only negatively affect the client.\n\nTrue, in your scenario.  What if the client's gun is stolen?  He obviously can't make a claim for stolen goods.  What if his home was invaded by an armed thief and he was injured?  Now, an insurance company could deny his claim because he had an unreported gun with no evidence of training.  What if an insurance company required a gun on your premises in order to lower your premiums for self-defense insurance?  Now, the client has an incentive to report his gun ownership.\n\nEvery individual would have to weigh the costs of the premium, against the benefit of whatever is being insured for.  Chances are that everyone will own guns. Mr. Doe will probably have a shotgun, aswell. There is a famous study called \"More Guns, Less Crime\" you might want to look up.\n\nhttp://en.wikipedia.org/wiki/More_Guns,_Less_Crime\n\nAlso, Even though you stated there is no evidence, there will always be evidence and private detectives will catch the master-mind murders.\n\nThe \"master-mind murderers\" problem is not specific to AnCap. Chances are that everyone will own guns. Mr. Doe will probably have a shotgun, aswell. There is a famous study called \"More Guns, Less Crime\" you might want to look up.\n\nhttp://en.wikipedia.org/wiki/More_Guns,_Less_Crime\n\nAlso, Even though you stated there is no evidence, there will always be evidence and private detectives will catch the master-mind murders.\n\nThe \"master-mind murderers\" problem is not specific to AnCap.   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/196f4u/reading_the_chaos_theory_by_robert_murphey_and_i/"
  }, {
    "id" : 32,
    "title" : "Thomas Sowell on why Iran must be stopped from obtaining nuclear weapons.",
    "snippet" : "  Oh Thomas....you were so smart during the Milton Friedman era, and you have gone more towards the way of the neo-con. His economics is still great. He's just a war hawk  &gt;\"You can't deter suicidal people.  You either stop them or you don't stop them.\"\n\nDat False Dichotomy.  ",
    "url" : "http://www.youtube.com/watch?v=2Q3eccScG9A"
  }, {
    "id" : 33,
    "title" : "Questioning property rights",
    "snippet" : "Question for you better read Anarcho-caps out there:\nI self-identify as an anarcho-capitalist (at least that is where I believe I fall under given my beliefs). As any person should do I have tried my hardest to find a contradiction in the anarcho-capitalist philosophy. While not explicit to the fundamental beliefs of anarcho-caps, it seems implied that we as a society should honor current property claims. It seems like something is very wrong when a country can be opened up to \"free trade\" and then all of the country's land (more generally assets) be sold to foreigners (corporations, investors, ect.). Can one still be considered an anrcho-cap, if they do not believe in honoring current property claims. Perhaps even stating that land and its natural resources should belong to its inhabitants. Disclaimer: I am not stating there is a way to enact this in practice.  &gt;Can one still be considered an anrcho-cap, if they do not believe in honoring current property claims. \n\nSure.  You need to decide what constitutes a \"valid\" property claim (homesteaded, embordered, in use, defended, etc).  I think it likely that a lot of current property claims would not be considered valid in ancapistan. &gt; a lot of current property claims would not be considered valid in ancapistan.\n\nLike \"intellectual property\" claims. Not necessarily.  If the majority of the market for DRO's is clamoring for IP laws, and they're willing to pay for that enforcement, then those participants will be subject to that law. They still wouldn't be able to enforce it against anyone who hasn't agreed to their imaginary \"rights\" over his property, so the model wouldn't be viable. The \"intellectual property\" paradigm relies on universal enforcement by a superior authority, under threat of force. In ancapistan, that means breaking the NAP, and would therefore be unenforceable in any form resembling the status quo. They still wouldn't be able to enforce it against anyone who hasn't agreed to their imaginary \"rights\" over his property, so the model wouldn't be viable. The \"intellectual property\" paradigm relies on universal enforcement by a superior authority, under threat of force. In ancapistan, that means breaking the NAP, and would therefore be unenforceable in any form resembling the status quo. It's aggression if IP is a right.\n\nAre there \"noise rights\"?\n\nCould noise rights be enforced in Ancapistan? Sorry for repeating myself, but check out Machinery of Freedom, its laid out quite elegantly there.\n\nhttp://www.daviddfriedman.com/ They still wouldn't be able to enforce it against anyone who hasn't agreed to their imaginary \"rights\" over his property, so the model wouldn't be viable. The \"intellectual property\" paradigm relies on universal enforcement by a superior authority, under threat of force. In ancapistan, that means breaking the NAP, and would therefore be unenforceable in any form resembling the status quo. &gt; a lot of current property claims would not be considered valid in ancapistan.\n\nLike \"intellectual property\" claims.     ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/196gea/questioning_property_rights/"
  }, {
    "id" : 34,
    "title" : "Does the use of FRNs legitimize the state?",
    "snippet" : "I personally think that FRNs do legitimize the state, but I'm in the middle of a lecture so I'll expand on that later. What do my fellow ancap redditors think?   ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/19750g/does_the_use_of_frns_legitimize_the_state/"
  }, {
    "id" : 35,
    "title" : "Columbine Survivor Pens Bold Open Letter To Obama Rejecting Gun Control: 'Whose Side Are You On?' [X-Post from r/Politics]",
    "snippet" : " ",
    "url" : "http://libertycrier.com/u-s-constitution/columbine-survivor-pens-bold-open-letter-to-obama-rejecting-gun-controlwhose-side-are-you-on/"
  }, {
    "id" : 36,
    "title" : "I &lt;3 Jeffrey Tucker",
    "snippet" : "  /r/libertarianmeme\n\nPlease keep this place free of such contentless posting.   ",
    "url" : "https://sphotos-b.xx.fbcdn.net/hphotos-ash3/559993_514114091965614_282567314_n.jpg"
  }, {
    "id" : 37,
    "title" : "The state knows its true nature. TIL Louis XIV of France had \"ULTIMA RATIO REGUM\" inscribed on all his canons, meaning \"the last argument of kings\".",
    "snippet" : "  Of course it knows its nature. Kings of many different ages and cultures proudly boasted of their brute force. It is only ever democratic states that go to such lengths to obfuscate their coercive nature. Being democratic, this works because the majority of people are stupid, cowardly and weak-willed.\n\nMonarchism has always traditionally acknowledged and embraced the coercion necessary for a state. The argument is never one of \"it's for your own good\", that's a post-Enlightenment ideal most highly embraced by the French and American revolutions. The argument for monarchism both among aspiring monarchs and the common rabble was mostly one of resignation: \"if not him, somebody else will\". This is a problem of social innovation, no other political system has ever proven itself secure in the long term. Anarcho-capitalism must yet prove itself.       no it doesnt, it should clearly be \"the only argument of kings\" no it doesnt, it should clearly be \"the only argument of kings\" no it doesnt, it should clearly be \"the only argument of kings\"  I too read load screens on total war games.  Any system of property rights is based on brute power. Enforcing property norms requires force, but it's certainly possible for two individuals to mutually agree to respect such norms voluntarily. Enforcing property norms requires force, but it's certainly possible for two individuals to mutually agree to respect such norms voluntarily. Even among two people, having a continuous mutual agreement on ownership without any disputes is difficult. Even among two people, having a continuous mutual agreement on ownership without any disputes is difficult. Even among two people, having a continuous mutual agreement on ownership without any disputes is difficult. Could that not be said of any agreement between two people? Even among two people, having a continuous mutual agreement on ownership without any disputes is difficult. Enforcing property norms requires force, but it's certainly possible for two individuals to mutually agree to respect such norms voluntarily. It's also possible for you voluntarily agree with an IRS agent that you will give him money. No, it's not. what about immigrants? They know what they're getting into Submission is not consent. those arent mutually exlusive. If you dont believe me, you're not watching the right kind of porn. He didn't even say they were  Not that I long for monarchy or anything but I find this phrase oddly reassuring because it implicitly admits  that there might be actual arguments that could conceivably made against the institution. I feel like nowadays the state is kind of caught in it's own propaganda and therefore beholden to absolutely pointless and counter-productive sentimentality. \nFor example, wars fought for resources and tax base are bad enough but what's even worse are these humanitarian quagmires that the people have to pay for but don't even get anything out of. What I am saying is, had Louis XIV conquered Iraq you'd bet that he'd done it for the oil there. Same with a lot of other things such as marriage, welfare and economic policy. The self-interested state pursues these topics because they'll lead to stability and wealth, requirements to retain and increase power.\nWelfare: just enough so \"the poor\" won't rise up\nMarriage: subsidizing couples who increase the tax base, also social safety net\nEconomic policy: business and trade = taxes = power\n\nContrast this to the absolute cluster fuck of today policies where the state runs itself into the ground in the name of big concepts like liberty, justice and equality while actually allowing none of it. \n\nWhat I am saying is, if there have to be states then I'd prefer they not be kidding themselves about their true nature. In other words, you'd rather deal with the big hulking guy you know *would* beat you if you spoke up rather than the the suave, slick guy whose friends will take you in a dark room and beat you while no one is looking.  ",
    "url" : "http://en.wikipedia.org/wiki/Canon_de_24_de_Valli%C3%A8re"
  }, {
    "id" : 38,
    "title" : "Free Mark Scmidter! Jury Nullification Activist jailed!",
    "snippet" : "  I wonder what he was charged with? Conspiracy to educate, in the 3rd degree. 3rd degree is less serious than 1st degree.  what are his gps coords? robot liberators (computer guided, armored heavy equipment) can be deployed to break down the walls and release him.",
    "url" : "https://www.youtube.com/watch?v=y1-Aj4n9iGU&amp;feature=youtube_gdata_player"
  }, {
    "id" : 39,
    "title" : "Why massive national security leaks are good for us",
    "snippet" : " ",
    "url" : "http://www.aljazeera.com/indepth/opinion/2013/02/201322315561328240.html"
  }, {
    "id" : 40,
    "title" : "I did a lot of research into AnCap and I came to the conclusion that I am absolutely opposed to it. How can an AnCap society ever be realized if there are people like me who are dead set against it?  ",
    "snippet" : "Not sure If I have to extra mention it: but this is an honest question. I identified myself as a libertarian for quite some time and in that time I did my research on AnCap. I read Rothbard and Mises and listened to Freedom Radio and for some time I was really convinced to have found my political home base. \n\nHowever, after I did volunteer for a NGO in Africa I started to have massive doubts, that eventually lead me to abandon the entire libertarian political philosophy. Today I identify myself as a \"progressive\" and I am opposed to most libertarian ideas concerning the economy (altough I'd call myself a social libertarian as well). Now, in the way to an AnCap society, how would you overcome people like me? Myself and people like me would always work to strive to get some sort democratic government installed. \n\nWouldn't that be an inherent threat of any anarchistic society? People bounding together to form new sorts of governments. Are there any obvious solution for that problem that wouldn't ultimately lead to warfare between people who believe the government is justified and necessary and people who don't?  You're mistaken about what anarcho-capitalism is on a very fundamental level if you phrase this in ways like \"how would you overcome people like me\".\n\nIf you and your fellow democracy advocates want to live in such a system, go nuts.  All an-caps want is a space where we aren't subject to those laws.   Look from what I understand OP went to Africa and saw poor people, and it melt his heart so he came back and now he agrees that he needs to enter your property, take 30% of your income using force and throw you in jail if you disagree in order to help that poor family in Africa.\n\nIts nothing but out of pure compassion he would be now willing to use force against a heartless cruel person like you. He's so compassionate! Throwing people into prison and squashing them under the boot of the state is for the good of everyone! One thing I recently figured out about left-liberals who use \"compassion\" arguments. IF you understand their argument properly and apply \"compassion\" in a proper consistent manner, you can totally show how incompassionate ~~you~~ they are.\n\nTake for instance every single time a left-liberal tells me that I need to buy American goods or immigration should be curbed because otherwise it would be disasterous for that poor American man with a family to feed and a mortgage to pay. The argument is simple, if the compassion of my heart really motivates me, then why should I care more about that first world unemployed guy over the third world workers whose goods I am buying. I must care more for the poor chinese people over relatively richer American people.\n\nOnly a nationalist can make an argument for buying costly American goods over cheaper foreign goods. Left-liberals can't. This is how I troll r/socialism all day. They argue capitalism is bad because it is violent, then finally admit socialism is violent and that the NAP is false...\n\nThe entire argument for socialism rests on resentment of some having more than others. It's a great big whine of \"That's unfair!\" I am convinced that it is a sense of entitlement and poor moral development that brings people to socialism/communism. This is how I troll r/socialism all day. They argue capitalism is bad because it is violent, then finally admit socialism is violent and that the NAP is false...\n\nThe entire argument for socialism rests on resentment of some having more than others. It's a great big whine of \"That's unfair!\" Socialism is basically Nietzsche's [slave morality](http://en.wikipedia.org/wiki/Master%E2%80%93slave_morality); he even said as much himself. Look from what I understand OP went to Africa and saw poor people, and it melt his heart so he came back and now he agrees that he needs to enter your property, take 30% of your income using force and throw you in jail if you disagree in order to help that poor family in Africa.\n\nIts nothing but out of pure compassion he would be now willing to use force against a heartless cruel person like you. If you care about poor people, you should oppose the state.\n\n[Poverty Rate Before the War on Poverty](http://i.imgur.com/hT0bZzX.jpg)\n\n[Most Forced Government \"Charity\" Goes to The Government](http://mises.org/journals/jls/21_2/21_2_1.pdf) To me, that 1st chart makes it look like the government somewhat stabilized poverty ~~and appears like it's doing what it says it planned to do~~ instead of getting rid of it... Why would you want to stabilize the poverty rate when it is *declining* ?  lol...Thank God the government stepped in and stabilized that declining poverty rate!   Why would you want to stabilize the poverty rate when it is *declining* ?  I don't know. Why did the government try to \"solve poverty\" instead of letting the existing solutions handling the problem where clearly working? I happen to think that, in part, the government needs the poor to validate its existence and remain relevant. I seem to remember a video where Molyneux went over that issue before...one of his Powerpoint chart-venture presentations if I remember correctly. (Side note: If he's going to continue making those things, he needs to learn to use Powerpoint properly. You don't write down everything you're going to say in the bullet point and just read from it. You make a concise statement on the page and expand on it.) &gt;I happen to think that, in part, the government needs the poor to validate its existence and remain relevant.\n\nOk, yeah, I see what you are saying now. It is possible, but at the same time it is hard to imagine that the planners actually knew enough about economics to predict the effect. Unless there were some evil Austrians who knew what would happen and wanted more poor people. I think the official story is more likely though. Government planners probably had good intentions. \n\nEdit: I see why your post confused me a bit. Where did the government say they planned to stabilize poverty? Wasn't their stated intention to eliminate poverty? Look from what I understand OP went to Africa and saw poor people, and it melt his heart so he came back and now he agrees that he needs to enter your property, take 30% of your income using force and throw you in jail if you disagree in order to help that poor family in Africa.\n\nIts nothing but out of pure compassion he would be now willing to use force against a heartless cruel person like you. That is an excellent straw man argument you make. &gt;That is an excellent straw man argument you make.\n\nThat implies he's refuting an argument the opponent didn't make.  The inferences made above seem consistent with the OP's dismissal of anarchism.  In fact, the OP wrote in a later comment:\n\n&gt;I understand they need of coercion as an element to sustain a state and I am not opposed to it &gt; I understand they need of coercion as an element to sustain a state and I am not opposed to it\n\nThat's probably the scariest thing I've read in this thread so far...holy bejeezus. &gt;That's probably the scariest thing I've read in this thread so far...holy bejeezus.\n\nWhy? Are you content to let someone who's got an extremely infectious disease wander around or can we quarantine them? How about a serial rapist? We are coercing those unhappy individuals when we isolate them from continuing to inflict harm on their fellows. Where, exactly, is the line in the sand? Your argument seems to imply that those issues are handled well under the current system when they are certainly not. In your example, those people are already recognized as threats and if they continue with their behavior or do not work to fix their harmful issues, they are committing aggression towards others. However, the idea that we need a tax-funded state to keep those that are harmful away from those that do no harm is a non sequitur. So..in the ancapiverse, who is going to pay for incarceration/treatment of serial rapists and disease carriers? The companies that are voluntarily given money for the service or volunteer/non-profit services. The people that they treat or incarcerate, or whatever is the chosen method of dealing with said people, could work through that company to pay back the expenses the business used in dealing with them. Now that's just one proposed solution and I'm sure there are quite a few others that don't require a government. Look from what I understand OP went to Africa and saw poor people, and it melt his heart so he came back and now he agrees that he needs to enter your property, take 30% of your income using force and throw you in jail if you disagree in order to help that poor family in Africa.\n\nIts nothing but out of pure compassion he would be now willing to use force against a heartless cruel person like you. You're mistaken about what anarcho-capitalism is on a very fundamental level if you phrase this in ways like \"how would you overcome people like me\".\n\nIf you and your fellow democracy advocates want to live in such a system, go nuts.  All an-caps want is a space where we aren't subject to those laws.   The conflict will come (as most conflict comes) when the non-ancaps and the ancaps want the same resources.\n\nThis argument of \"you can form any society you like as long as you respect ours\" always ignores the fact that there will be people in both camps who want to occupy the same space.\n\nI think the only chance of you getting to fairly evaluate your philosophy would be seasteading or off world colonies. And even then you'll have to deal with those born into your societies who don't subscribe to the ideology. Wait, so the only way we can try to live the way we want to live is literally to find a different planet?  That's pretty damn harsh, don't ya think?  The Earth isn't *that* full.  Simple: We will out-compete you. Market systems will out-compete state systems as they have been doing for centuries. Fair enough. Obviously I think it would happen the other way around.  Okay. My underlying point is that anarcho-capitalism does not necessarily depend on ethical homogeneity. I prefer the consequentialist arguments for why it will happen and why it will remain robust.\n\nJust remember that your progressive state would by definition require confiscation of property, especially land. I think in the process of establishing your state, you'd understand the ethical arguments against it. It wouldn't be until the state has been established for some time that the subjects would exhibit the classic Stockholm syndrome that blurs the question of legitimacy. No offence but I understand they need of coercion as an element to sustain a state and I am not opposed to it because I think it's the only feasible way to organize a society in an relative egalitarian and fair way. I'd love for it to be otherwise but I don't see an alternative to it. There is no \"Stockholm syndrome\" involved, but an insight that every alternative would be worse- But how can you reconcile the state system's fundamental asymmetry of rights with fairness and egalitarianism?\n\nWouldn't individuals and groups leverage this asymmetry in an unfair and anti-egalitarian way? I do realize the asymmetrical balance of power in state system, that often can lead to very anti-egalitarian and unfair policies, I just think there isn't much alternative to it. Like Churchill said: Democracy is the worst form of government except all those other forms that have been tried from time to time. [deleted] I would just like to say that not all ancaps would use force and violence against him. Just the ones that justify it through self defense.  It depends on the severity of their force.  If they knock on my door and talk to me about joining a social program that they're helping to organize, I politely decline and bid them a good day.\n\nIf they start stealing my property and they're armed, I will do my best to protect my family and my possessions.  e.g. I will shoot them.  Twice. But how can you reconcile the state system's fundamental asymmetry of rights with fairness and egalitarianism?\n\nWouldn't individuals and groups leverage this asymmetry in an unfair and anti-egalitarian way? Government or no government, there is a need for enforcement of commonly accepted rules and customs. You're just going to end up with private goons recruited by someone with more resources than you, taking your property. No offence but I understand they need of coercion as an element to sustain a state and I am not opposed to it because I think it's the only feasible way to organize a society in an relative egalitarian and fair way. I'd love for it to be otherwise but I don't see an alternative to it. There is no \"Stockholm syndrome\" involved, but an insight that every alternative would be worse- No offence but I understand they need of coercion as an element to sustain a state and I am not opposed to it because I think it's the only feasible way to organize a society in an relative egalitarian and fair way. I'd love for it to be otherwise but I don't see an alternative to it. There is no \"Stockholm syndrome\" involved, but an insight that every alternative would be worse- No offence but I understand they need of coercion as an element to sustain a state and I am not opposed to it because I think it's the only feasible way to organize a society in an relative egalitarian and fair way. I'd love for it to be otherwise but I don't see an alternative to it. There is no \"Stockholm syndrome\" involved, but an insight that every alternative would be worse- No offence but I understand they need of coercion as an element to sustain a state and I am not opposed to it because I think it's the only feasible way to organize a society in an relative egalitarian and fair way. I'd love for it to be otherwise but I don't see an alternative to it. There is no \"Stockholm syndrome\" involved, but an insight that every alternative would be worse- No offence but I understand they need of coercion as an element to sustain a state and I am not opposed to it because I think it's the only feasible way to organize a society in an relative egalitarian and fair way. I'd love for it to be otherwise but I don't see an alternative to it. There is no \"Stockholm syndrome\" involved, but an insight that every alternative would be worse- No offence but I understand they need of coercion as an element to sustain a state and I am not opposed to it because I think it's the only feasible way to organize a society in an relative egalitarian and fair way. I'd love for it to be otherwise but I don't see an alternative to it. There is no \"Stockholm syndrome\" involved, but an insight that every alternative would be worse- Fair enough. Obviously I think it would happen the other way around.   &gt;Now, in the way to an AnCap society, how would you overcome people like me? \n\nI would do absolutely nothing to try to overcome you.  That should be completely obvious.  Since it isn't, I question your claim to understand ancap philosophy.\n\n&gt;Myself and people like me would always work to strive to get some sort democratic government installed. \n\nColor me skeptical.  I think people like progressives are aggressive for reasons.  Those underlying reasons can be addressed without ever \"overcoming\" someone.\n\n&gt;Wouldn't that be an inherent threat of any anarchistic society?\n\nNo.  One of the underlying ideas of anarchic society is that competition needs to be allowed to occur so that better ideas of governance can be allowed to emerge.\n\n&gt;Are there any obvious solution for that problem that wouldn't ultimately lead to warfare between people who believe the government is justified and necessary and people who don't?\n\nThere's only ever three choices--fight, negotiate, or disassociate. &gt; I would do absolutely nothing to try to overcome you. That should be completely obvious. Since it isn't, I question your claim to understand ancap philosophy.\n\nHe wants to install a government that controls what you do. You wouldn't try to stop him from doing this? No.  This exists now, right?  The idea is to live free in an unfree world.\n\nKeep going with the gotchas.\n\nFeel free to have the last word. So you have no interest in fighting the current government, either? You're fine with its existence? Or You have no interest in promoting ancap ideals? Im not really sure what you're saying.  So you have no interest in fighting the current government, either? You're fine with its existence? Or You have no interest in promoting ancap ideals? Im not really sure what you're saying.   So, you're saying that you are planning to go to war against us because we have a different philosophy than you and you think you're the good guy? No, the contrary. I am wondering how an AnCap society can be sustainable when there are always people who would want to live under a government.  What you have stated here is totally possible in an AnCap society.  People who want to **voluntarily** live under a government would be free to do so.  By the same token, they would be free not to as well.\n\nIn an AnCap society, there is no need to \"overcome\" anyone. But in order to create a government people inevitably would have to violate the NAP as its standing in direct confrontation to their notion of property rights and legitimacy of a centralized monopoly of force. People believing in majority decisions wouldn't recognize the one guy in their area who wouldn't want to join the new formed state because they wouldn't recognize his idea of rights and his claim of property. At this point conflict would be inevitably.   There could be a \"government\" controlled area, where those that live there do so because they want government and enact one voluntarily.  Those that don't would be able to go live in an area where AnCap ideals exist to their ideals.  Those that live in the AnCap \"non-government\" space would be able to go to the government zone if they like, and vice-verse.  \n\nDifferent governing/non-governing zones would compete for citizenry, and the result would be life that is best for citizens.\n\nWhy do you insist on government as violating NAP if the citizenry desire it?  The foundation of NAP is that interactions are to be non-coerced and voluntary.  One can voluntarily decide to live in an area where coercion is the means of policy as long as that policy is achieved through voluntary means.  As long as one would be free to not live in this \"coercion zone\", then it is still AnCap and following NAP. But in order to create a government people inevitably would have to violate the NAP as its standing in direct confrontation to their notion of property rights and legitimacy of a centralized monopoly of force. People believing in majority decisions wouldn't recognize the one guy in their area who wouldn't want to join the new formed state because they wouldn't recognize his idea of rights and his claim of property. At this point conflict would be inevitably.   No, the contrary. I am wondering how an AnCap society can be sustainable when there are always people who would want to live under a government.  \"Wanna live under a govt\" and \"wanna impose a govt on others\" are two different things. Technically you're saying that you wanna impose your govt on others.\n\nIf everybody under a govt was voluntarily living it then its not a govt it's a non-profit private defense organization with diversified business in justice, road building and runs a big charity. No, the contrary. I am wondering how an AnCap society can be sustainable when there are always people who would want to live under a government.  No, the contrary. I am wondering how an AnCap society can be sustainable when there are always people who would want to live under a government.  No, the contrary. I am wondering how an AnCap society can be sustainable when there are always people who would want to live under a government.    It's an issue of HOW we want to live in an ancap society.  An ancap society will never be realized by overthrowing an existing democratic government, for exactly the reasons you describe - too many people simply WANT a government right now.  It's the same reason \"The Church\" was a major ruling power in one form or another for thousands of years - not enough people didn't want to live without religion yet.  And just as that changed with small steps, so will this.\n\nI imagine it will start either with something like Blueseed (seasteading on artificial cities) or Charter Cities.  Basically, places where there IS no native population, so the only people that go there to start are those that WANT an ancap society.  As those places become more successful, more people will want to go to them.  So more seasteads will be made, or more charter cities built.  I highly doubt ANY existing government will actually change to ancap - they'll just gradually (maybe over the course of 20 generations or more, I have no idea) fade away, like the concept of rule by Divine Right did.\n\nIn so far as each generation is more liberty-minded than the last, it doesn't matter that YOU want government - because you'll eventually die of old age.  And there will be fewer and fewer of you, and eventually too few to matter.  And if those few of you left want to band together and have your own little government-controlled city, no one will stop you.  But the majority will do without.\n\nAgain, I doubt this will be realized in my lifetime.  But I have a great deal of faith that it will be realized, someday.\n\n(For elaboration on many of these topics, please read The Problem of Political Authority, by Michael Huemer.)   I'm curious to know more about your NGO experience in Africa and how that led to your doubts on libertarian political philosophy.   I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  Compare apples to apples. Contrasting a chaotic anarchist society with a relatively peaceful statist society is not a fair comparison. \n\nTo illustrate:\n\nAnarchist society X is more peaceful than statist society China under Mao, or modern day Burma, Nazi Germany, Soviet Russia under Stalin, Cambodia under Pol Pot, North Korea, etc. Therefore, anarchy&gt;statism. \n\nThis is the logic people are using when they contrast poor and war-torn anarchist countries (which is almost always a result of *government*), with relatively peaceful statist societies. The comparison does not make sense.\n\nYes, if you compare anarchist Somalia with the U.S.A, the U.S.A is a more peaceful place to live. But *it does not follow* from this that government is more peaceful than anarchism. What needs to be compared is anarchist America with statist America. IMO, given the amount of capital accumulation, culture, social and moral norms, a stateless America would be far more prosperous and peaceful than it currently is.\n\nComparing the most successful governments (U.S.A) to the least successful stateless societies (Somalia, etc.) doesn't really tell us anything more than comparing anarchic Ireland to government in Nazi Germany...\n\n[This](http://www.youtube.com/watch?v=8g5OtzAbZ0M) video with Peter Leeson does a great job at explaining the problem with comparing terrible anarchist African countries with relatively peaceful statist societies.\n\n\n\nMore on this subject:\n\n[But Wouldn't Warlords Take Over?](http://mises.org/daily/1855)\n\n[Anarchy In Somalia](http://mises.org/daily/5418/Anarchy-in-Somalia)\n\n[Pete Leeson on his Journey to Anarchism and Its Application to Somalia and](http://www.youtube.com/watch?v=uNroxDWDP8w&amp;feature=player_embedded) &lt; short vid\n\n[Somalia: Failed State, Economic Success?](http://www.fee.org/the_freeman/detail/somalia-failed-state-economic-success/#axzz2LqyEu0aW)\n\n[Somali Anarchy Is More Orderly than Somali Government](http://www.independent.org/newsroom/article.asp?id=1880)\n I am not comparing an brutal anarchistic society with a peaceful statist one, I took a look at the problems and saw that they were made worse by the mechanics of the free market. Basically, I witnessed what all people opposed to libertarianism told me before: the vacuum the failing government left was filled with private institutions, monopolies risen and competition was crushed by the big player by force, the poor were left to die (literally) and the rich didn't bother much with charity.  I am not comparing an brutal anarchistic society with a peaceful statist one, I took a look at the problems and saw that they were made worse by the mechanics of the free market. Basically, I witnessed what all people opposed to libertarianism told me before: the vacuum the failing government left was filled with private institutions, monopolies risen and competition was crushed by the big player by force, the poor were left to die (literally) and the rich didn't bother much with charity.  &gt;I took a look at the problems and saw that they were made worse by the mechanics of the free market. \n\nNigeria ranks among the lowest in free market indexes[[1](http://www.freetheworld.com/2012/EFW2012-complete.pdf)][[2](http://www.heritage.org/index/country/nigeria)].   Acquiring and maintaining rights to real property is difficult, and regulation stifles entrepreneurship. How do you attribute that things were made worse by something that is not available (i.e. a free market)?  Nigeria as whole might score pretty low, the area I was in was pretty much without any government.  I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  Your original post indicates a problem with all of libertarian philosophy, but why should your experience in Nigeria lead you to turn against it when what you experienced was unlibertarian? Britain colonized Nigeria, took its lands and gave them to companies. Land ownership is concentrated into a small core favored by state action. There is no law there. Neither property nor person is safe there. Independent attempts by the poor to improve themselves are attacked. Why would a place where chaos is law, where the national situation is the inheritance of decades of imperial abuse and oppression, where the proportions of land ownership are clearly born of colonization, call your attraction to libertarianism into question?\n\nI would call the situation you witnessed, wherein oppression is cemented via privatization, thoroughly unlibertarian. One would also have to say that africa was full of slavery and lots of small time kings and tribes waring against each other all the time. Its not like it was all fun and cool and then the english came and make everything bad. Yet again, a society wherein property is not secure is not libertarian Your original post indicates a problem with all of libertarian philosophy, but why should your experience in Nigeria lead you to turn against it when what you experienced was unlibertarian? Britain colonized Nigeria, took its lands and gave them to companies. Land ownership is concentrated into a small core favored by state action. There is no law there. Neither property nor person is safe there. Independent attempts by the poor to improve themselves are attacked. Why would a place where chaos is law, where the national situation is the inheritance of decades of imperial abuse and oppression, where the proportions of land ownership are clearly born of colonization, call your attraction to libertarianism into question?\n\nI would call the situation you witnessed, wherein oppression is cemented via privatization, thoroughly unlibertarian. The situation is obviously complex but in the part of Nigeria I was (it's far of the Nigerian Delta and there is no oil to find there) international cooperation and the government have little interest in doing anything there. The area I was working at was abandoned by government for decades now and within that vacuum private forced had risen to fill in the gap. You have a point in subscribing some of the problems to the inheritance of colonization (especially some of the more nasty tribal conflicts there) but the existing problems were made worse by the mechanics that are inherent for a really free market. Libertarian theory says, that free market competition would provide an incentive for security companies to provide their services to the poor at lower price that is compensated due to positive external effects a lowered crime rate would have, but in reality it was more profitable to shield those who were able to afford the premiums in SUVs and gated communities, and squeeze the last bit of those who couldn't. Theoretically a monopoly like that  shouldn't be possible in a free market, yet I saw a cartel of a few companies working together and crushing every form of competition via the use of brutal force.  I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  As a development economist in training and someone with family ties to Nigeria... WAT?!\n\nNigeria is a textbook example of cronyism and crude socialist policies. The private security companies there get away with what they do because they are insulated from the consequences by the state. Nigeria is a PERFECT example of how the state can fuck things up.\n\nWhat area were you in that was in an \"anarchistic state?\" I mean really, this comment makes me doubt your entire story. If it's true, I think you totally misinterpreted what you saw. I was north east of Enagu way off all the oil and gas fields. The area didn't have any value for the (corrupt) government or international cooperation and there was exactly one police man in an area of hundreds of kilometres. The state was de facto non-existence there. So there's a monopoly on force held by the government and those it licenses (private security). Again, that's a failure of government. Were you in Benue State or farther NE? I'm having trouble figuring out where there might be a space with that little law enforcement.\n\nWho did the private security work for? No, there was no monopoly of force held by the government nor did the government gave out licenses. I was between Enugu and Makardi, close to the Kashimbla reserve (no clue how it's written properly). There was one police station with one police man and that was the only government presence in the area. The monopoly on force was neither held be the government nor did the even bother to employ private securities companies instead. The only international companies operating in the are were mostly Chinese companies and a few American ones. I am not sure what they did there, but of what I've heard it was mostly concerning with waste disposal. The private security companies worked directly for them and the very small higher class. The rest was divided among the gangs who were working directly or indirectly with the security companies. \nThe government didn't have any or much involvement in the activities of those companies.  I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  &gt;that was a de facto anarchistic state and it disproved basically all libertarians ideals I had\n\nlol, so much fail. I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  But how did this experience make you abandon the philosophical principles of libertarianism? If you don't think that anarchy will work, why aren't you a minarchist, instead of a progressive? &gt;If you don't think that anarchy will work\n\nYou know, even so, saying the modern human species cannot sustain anarcho-capitalism *does not lead to* saying *therefore* anarcho-capitalism is not desirable.\n\nThese are two completely different avenues of inquiry.  It's also one of the last obstacles for most minarchist libertarians before they become ancaps.\n\nIt's like saying dogs, ducks, or some form of alien fail anarcho-capitalism and that's anarcho-capitalism's fault.  All we're really doing is evaluating a political framework in abstraction.\n\nWe're predicting that if political nihilism was widely held, anarcho-capitalism would emerge, but, because of the modern nature of humans, of their psychological, tribalistic delusions and self-denial, monopoly states are allowed to exist and prey on the body politic.\n\nThere's a difference between being realistic and *actively advocating for* your own enslavement. &gt;You know, even so, saying the modern human species cannot sustain anarcho-capitalism does not lead to saying therefore anarcho-capitalism is not desirable.\n\nFor me that the most important part. If a political system will inevitably lead to more suffering in the world, I reject it.  But how did this experience make you abandon the philosophical principles of libertarianism? If you don't think that anarchy will work, why aren't you a minarchist, instead of a progressive? I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  I was working in a part of Nigeria that was a de facto anarchistic state and it disproved basically all libertarians ideals I had. For example: The private security companies were mostly working for the few international companies who were around in that area, all of them specialized into burring the waste of the oil fields in the north, and a small population of the local  rich folks. For the greatest share of impoverished people security wasn't affordable and if it was it always came in form of a criminal organisation that extorted them at their will. The market there not only failed horrible to provide most people with even the basics of living, every attempt of making things better was also crushed by the big players there. International security companies providing security for the rich and outlandish firms and the mob and gangs extorting the rest had ganged together to build a monopoly on force replacing the state and the people there couldn't do nothing to change that. I remember a case were people tried to form a local militia just to find the house of the leader burned down the next week. Shit like that was common practice there.  Why do you think the part of Nigeria that was a de facto anarchistic state and not a failing state.  How do you know the state did not prevent alternative solutions?   The [CIA World Factbook](https://www.cia.gov/library/publications/the-world-factbook/geos/ni.html) describes Nigeria as a federal republic with universal suffrage.  The Nigerian government is famous for its corruption. It seems the government gave the foreign companies permission to operate there, and behave like they are.  If local minorities where to disrupt the relationship between the government and the foreign companies it seems the governmental would have little incentive to protect the locals. This seems more like a failure of a monopolist system than the alternative. How did you attribute the failure to lack of government? Because I was there and I was connected with the government. They pretty much told me how they had no control over the area nor did they care for it. I know AnCaps like to blame it all on the government, but there were not involved in this case.  You seems to imply, the Nigerian Government would have allowed a competing court system to operate in that area.  It seems the government knew these foreign companies were being abusive and intentionally withdrew protection from people that it had a monopoly over.  This does not mean they would allow alternative institutions to form.   I agree many problems are not caused by government, yet the government often makes private solutions unavailable.  Also these foreign companies are likely acting as agents of, or are owned by, the foreign governments.  They are not examples for private actors. There were private courts in the area and disputs were often settled. I am really getting tired of all the AnCaps who can't imagine a situation were a free market would create such a situation and look for every loophole to blame it on the government.    u realize africa has very authoritarian governments right? Authoritarian means nothing when you don't have the power to back it up. And most African governments lack that power. The OP was specifically talking about an area with a power vacuum filled by private security firms.\n In Nigeria, the power private security firms have is because their employing companies (mostly Shell) have enough power in the government to insulate them from consequences. It's a textbook example of *government* failure. Nigeria is not only Shell land. Shell is only bothered with the oil fields in the west, the offshore platforms and the pipeline. There are vast areas of Nigeria who are of no interest for Shell hence why you won't find them there.  Right, but Shell hires the majority of all the private security in the entire country. Shell wasn't active in the area I was. At least not that I am aware.  In Nigeria, the power private security firms have is because their employing companies (mostly Shell) have enough power in the government to insulate them from consequences. It's a textbook example of *government* failure. Authoritarian means nothing when you don't have the power to back it up. And most African governments lack that power. The OP was specifically talking about an area with a power vacuum filled by private security firms.\n guns are authority and where they are, they are they are misused completely openly What?\n   You would be welcome in an ancap society and be free to live in a (voluntary) centrally planned commune. Unfortunately though, ancaps are not welcome in your ideal society, and under your beliefs deserve to be kidnapped, possibly beaten and locked in a cage unless they submit to your central authority. This doesn't really work.  You can't say an ancap system is compatible with a fully communistic one.  Communists believe humanity should have access to your land, which you are keeping from them.\n\nTo the extent they go by your property arrangements by homesteading their own squared off commune, they are really being propertarians, not communists.\n\nIn either case, communists don't deserve serious mention.  That economic system is only good at one thing: mass starvation. It works up to and until the point they attack someone. Well, obviously.  It's like saying property is peaceful up until the point someone tries to violate it and it must be physically enforced. Well just because they hold an incompatible belief about property doesn't mean they are required by their belief to attack someone else.  This is interesting, because at the International Students for Liberty Conference we had Magatte Wade, from Senegal, tell us the story of how she went from being an environmentalist progressive to being a libertarian African entrepreneur. This is interesting, because at the International Students for Liberty Conference we had Magatte Wade, from Senegal, tell us the story of how she went from being an environmentalist progressive to being a libertarian African entrepreneur. I wont deny that there is a lot of government corruption in Africa and I can see how only being exposed to that can turn you into a libertarian. I have seen the other side of the coin though.   World is anarchistic right now. There is no one world government. Imagine that ancaps would want to secede from your government with their land and make their own \"country\" with their own rules just like americans did some 200 years ago. If they would be organized and in sufficient number you would not be able to stop them just like england could not stop americans. Ancaps would not interfere into the lives of people that would choose to stay with your progressive government. If you won't allow to secede then expect revolution some time in the future (just like civil war), because people for some reason want to fight for what they understand is freedom.\n\nI wonder what you have seen in Africa that made you progressive? From what I understand is happening there you should be even more libertarian after trip there. Being progressive, as I understand, means forcing other people to help people you think need help. How is that benevolent? What about perverse incentives this creates? World is anarchistic right now. There is no one world government. Imagine that ancaps would want to secede from your government with their land and make their own \"country\" with their own rules just like americans did some 200 years ago. If they would be organized and in sufficient number you would not be able to stop them just like england could not stop americans. Ancaps would not interfere into the lives of people that would choose to stay with your progressive government. If you won't allow to secede then expect revolution some time in the future (just like civil war), because people for some reason want to fight for what they understand is freedom.\n\nI wonder what you have seen in Africa that made you progressive? From what I understand is happening there you should be even more libertarian after trip there. Being progressive, as I understand, means forcing other people to help people you think need help. How is that benevolent? What about perverse incentives this creates? That's a good point but I was more talking about how that anarchistic country could exist with a significant minority of people striving for a government within the country. I can't imagine a scenario were you would get an absolute minority together for everything. Usually people are divided in many concurrent majorities.    The problem isn't the existence of people wanting to live under a state in a state-less region. It is instead the willingness of those people to beat and murder their non-compliant neighbors. In a stateless society, you could convince a large number of people to follow rules handed down by a body of legislators, but as soon as you start assigning punishment for non-compliance, you have inaugurated war against peaceful people. \n\nI didn't experience what you experienced in Africa, but I'm willing to bet that the lapses of social order and safety have more to do with the technology level of the region you inhabited, as well as a number of other causal factors, not simply the lack of a central crime syndicate (read: state).  &gt;more to do with the technology level of the region you inhabited\n\nNot at all actually; the Africans are capable of feeding themselves at their current technological level.  The problem is they're disincentivized to and their gov'ts have grown into parasites of incredible size thanks to the UN and the US.\n\nHumans have been able to feed themselves for centuries; when you see mass starvation, look to politics as the cause.  I think everyone else has answered your question already, so let me ask you one. Surely you recognize the violence that stands behind everything the state orders people to do. So how in your mind do you reconcile the violence? \n\nI'm not trying to trick you, I'm honestly curious. I can't really ask regular statists, because they argue that there is no violence associated to what the state does, so it will be nice to move past this point and examine what your thought process is regarding the balancing of good versus evil. He'd just say something to the effect of noble violence against the well-off to help the less well-off.\n\nThat a monopoly should care to behave this way is beyond naive, not even getting into the anti-economics of redistributionism. He'd just say something to the effect of noble violence against the well-off to help the less well-off.\n\nThat a monopoly should care to behave this way is beyond naive, not even getting into the anti-economics of redistributionism. Impressive mind-reading! Likely a strawman though.\n\nI'm not him, but my response would be that based on my education and experience, I believe that your way would lead to more violence and lower mean happiness. Thus I sanction the violence of a (minarchist) state. Should you guys prove me wrong and build a happier less violent society, I'll happily accept your evidence and come round to your way of thinking.\n   &gt;However, after I did volunteer for a NGO in Africa I started to have massive doubts... and I am opposed to most libertarian ideas concerning the economy (altough I'd call myself a social libertarian as well)\n\nSo, you were a libertarian out of a bleeding heart; to what degree should I believe you understand or cared to understand its economics?\n\n&gt;Now, in the way to an AnCap society, how would you overcome people like me?\n\nWell, it would depend on what you did specifically.  You would be overpowered for what you physically did, just like any other criminal, whether you hated libertarianism or just wanted to perform the action for its own sake.  If you stole, you'd be treated like a thief; if you murdered, you would be treated like a murderer.\n\n&gt;Myself and people like me would always work to strive to get some sort democratic government installed.\n\nIf you're more meaning just violating private property, you'd be dealt with like a squatter or petty thief and be neutralized.  If you escalated force, you'd be killed or severely hurt.\n\n&gt;Wouldn't that be an inherent threat of any anarchistic society? People bounding together to form new sorts of governments.\n\nOf course.\n\n&gt;Are there any obvious solution for that problem that wouldn't ultimately lead to warfare between people who believe the government is justified and necessary and people who don't?\n\nWell, let's just say if an anarcho-capitalist system ever did finally emerge, it would be so dramatically more productive than your gov't system that your society would generally try to avoid violating what the ancaps held as worthy of defense.  Even if you felt like you were morally righteous, people generally like being alive, too. &gt;So, you were a libertarian out of a bleeding heart; to what degree should I believe you understand or cared to understand its economics?\n\nI find this argument rich coming from someone who has subscribed to an ideology that most economists view as laughable.    Well, in an anarcho capitalist society, the best part is that you can just get a bunch of like minded people and form your own community somewhere else! Because ancaps recognize property rights, your nation will be respected so long as you leave us alone! :)    You really do not understand an-cap. Are far as practical policies we are essentially just advocating radical de-centralization. We want to end this idea that the whole world needs to live under one \"ideal\" system. The current thinking goes that an-caps will somehow (this is very hard since people are extrmely opposed to people living differently from them) get control of a small area. Maybe a an island or sea stead. \n\nWe obviously believe that life in that area will improve rapidly and others will want to come (See Hong Kong). If people want to live under a dictatorship or a communist party they should be able to. But we should support all efforts to let people live under the government systems they want. This is moral in of itself and also the only effective method to truly determine what is effective. \n\nIf ancap fails economically we will stop being ancaps or we will accept the economic failures (I would trade much freedom for wealth if this was the choice but I do not beleive that is how the world works. )         I doubt your story. Over the internet, the mean IQ is apparently around 150, 60% of people are professional academics or scientists, and hardened ''''''''realists'''''''' experienced three lifetimes of trial compared to the average person. Interesting how all this works out. Even if we assumed sampling bias, clearly all the dick measuring internet retards do belies their micropeens. People with sufficient accomplishment and merit usually don't have to make shit up to give themselves some aura of authority.\n\nMy skepticism on your bona fides set aside for now, let's double-take this bit right here.\n\n&gt;However, after I did volunteer for a NGO in Africa I started to have massive doubts, that eventually lead me to abandon the entire libertarian political philosophy.\n\nOne would think you would see the opposite. Assuming, of course, that this experience is honest and actual. Most of the places in Africa that are exceptionally shitty are those which receive the most foreign aid. How could this be? These are, after all, progressive governments throwing dosh around at these African governments. Shouldn't *something* get better? To me, the answer is obvious. The incentive is for these sub-Saharan African governments which receive large amounts of foreign aid to do as little in the way of 'public services' as possible, fund large militias and armies capable of shitting on any half-assed uprising, and then purchase a lot of foreign shit and doling out goods and funds only to people they like. It's nepotism and abuse wrapped up in a neat little chaotic package. And they don't care about bumfuck village seventy kilometers away from the capital city, because that village doesn't have any necessary traffic running through it - traffic that would take quality domestic or foreign goods straight to the government so they can bask in their largess. But hey, at least the farmers don't get taxed a whole lot! Of course, part of the reason for that is that these people are so poor that there just isn't much to tax, and to get anywhere, they do have to pay off the myriad grubbing hands of the kleptocracy anyway. \n\nWhat they need is not sympathy. What they need is not foreign aid money squandered on some shit stain state. What they need is not KONY 2012. What they need is not foreign military intervention. They need sound institutions so that they can accumulate wealth internally by both domestic capital accumulation and foreign investment. They need people to give them money with serious strings attached, strings like profit margins and quotas to get them motivated. If in some of these places, they need new European colonial states to form, then they would be better off with those colonial states. That is, assuming of course that this is what you progressive shitdicks actually desire for these people is a greater standard of living and not some melanin-saturated poster children to show how fucking paternalistic and charitable you are.\n\nAs far as Ancapistan or other stateless societies go, there are simple solutions. You and your ilk allow us to do as we would like, and we do likewise. Or you can interfere, and science willing we build some momentum and destroy you. If secession is not actively resisted and we earn our own little slice of the pie, what do you lose? A few thousand dissidents, maybe a little bit of capital that would have mostly been squandered anyway? Think about what people like you would gain: products from Ancapistan, a tax shelter, a potential safe haven if your precious home state decided they no longer desired you, and a vacation spot where you can do recreational drugs and see a wholly different way of life before you return to your cubicle and your state economic controls. You don't have to like the idea, you just have to throw your hands in the air and realize that you are not the puppeteer of the Norns. You don't control the lives of millions of other people in any substantial way. If you think you do, that's folly. That's the rest of the unwashed masses echoing what the hegemony wants you to think. The blind lead the blind, and politicians are gifted with sight of their rectums and maybe the ugly belly of the leviathan and not a fuck of a lot else. Most of these politicians have no great insight, aside from their intuition or cultivated art of manipulation; most of them have no real talents to satisfy the genuine values of other people, aside from cleverly spun lies that even upstanding citizens shit on with their actions. Who tries to pay as much in taxes as possible? Who is it that earns more for State and Country? Who volunteers their time to grease the gears of the bureaucracies without pay? Some would say it's Peter Noone, but the real answer is fuck all. No one. No one fucking does that, and yet everyone joins the self-congratulatory circle jerk called democracy.\n\n\"We are the state!\" No, you're the ideological and material base of the state - collectively. Individually, you mean nothing. Your insignificance is bewildering. \"Democracy for the people!\" Like I said, the blind lead the blind. You think you're going somewhere profound, but you wouldn't appreciate grace if it cock slapped you across the forehead. \n\nBasically, people like me tell you to go fuck yourself. If you tried to get your friends and local state together to invade any upstart Ancapistan, you deserve whatever horrible shit might land in your lap.  I doubt your story. Over the internet, the mean IQ is apparently around 150, 60% of people are professional academics or scientists, and hardened ''''''''realists'''''''' experienced three lifetimes of trial compared to the average person. Interesting how all this works out. Even if we assumed sampling bias, clearly all the dick measuring internet retards do belies their micropeens. People with sufficient accomplishment and merit usually don't have to make shit up to give themselves some aura of authority.\n\nMy skepticism on your bona fides set aside for now, let's double-take this bit right here.\n\n&gt;However, after I did volunteer for a NGO in Africa I started to have massive doubts, that eventually lead me to abandon the entire libertarian political philosophy.\n\nOne would think you would see the opposite. Assuming, of course, that this experience is honest and actual. Most of the places in Africa that are exceptionally shitty are those which receive the most foreign aid. How could this be? These are, after all, progressive governments throwing dosh around at these African governments. Shouldn't *something* get better? To me, the answer is obvious. The incentive is for these sub-Saharan African governments which receive large amounts of foreign aid to do as little in the way of 'public services' as possible, fund large militias and armies capable of shitting on any half-assed uprising, and then purchase a lot of foreign shit and doling out goods and funds only to people they like. It's nepotism and abuse wrapped up in a neat little chaotic package. And they don't care about bumfuck village seventy kilometers away from the capital city, because that village doesn't have any necessary traffic running through it - traffic that would take quality domestic or foreign goods straight to the government so they can bask in their largess. But hey, at least the farmers don't get taxed a whole lot! Of course, part of the reason for that is that these people are so poor that there just isn't much to tax, and to get anywhere, they do have to pay off the myriad grubbing hands of the kleptocracy anyway. \n\nWhat they need is not sympathy. What they need is not foreign aid money squandered on some shit stain state. What they need is not KONY 2012. What they need is not foreign military intervention. They need sound institutions so that they can accumulate wealth internally by both domestic capital accumulation and foreign investment. They need people to give them money with serious strings attached, strings like profit margins and quotas to get them motivated. If in some of these places, they need new European colonial states to form, then they would be better off with those colonial states. That is, assuming of course that this is what you progressive shitdicks actually desire for these people is a greater standard of living and not some melanin-saturated poster children to show how fucking paternalistic and charitable you are.\n\nAs far as Ancapistan or other stateless societies go, there are simple solutions. You and your ilk allow us to do as we would like, and we do likewise. Or you can interfere, and science willing we build some momentum and destroy you. If secession is not actively resisted and we earn our own little slice of the pie, what do you lose? A few thousand dissidents, maybe a little bit of capital that would have mostly been squandered anyway? Think about what people like you would gain: products from Ancapistan, a tax shelter, a potential safe haven if your precious home state decided they no longer desired you, and a vacation spot where you can do recreational drugs and see a wholly different way of life before you return to your cubicle and your state economic controls. You don't have to like the idea, you just have to throw your hands in the air and realize that you are not the puppeteer of the Norns. You don't control the lives of millions of other people in any substantial way. If you think you do, that's folly. That's the rest of the unwashed masses echoing what the hegemony wants you to think. The blind lead the blind, and politicians are gifted with sight of their rectums and maybe the ugly belly of the leviathan and not a fuck of a lot else. Most of these politicians have no great insight, aside from their intuition or cultivated art of manipulation; most of them have no real talents to satisfy the genuine values of other people, aside from cleverly spun lies that even upstanding citizens shit on with their actions. Who tries to pay as much in taxes as possible? Who is it that earns more for State and Country? Who volunteers their time to grease the gears of the bureaucracies without pay? Some would say it's Peter Noone, but the real answer is fuck all. No one. No one fucking does that, and yet everyone joins the self-congratulatory circle jerk called democracy.\n\n\"We are the state!\" No, you're the ideological and material base of the state - collectively. Individually, you mean nothing. Your insignificance is bewildering. \"Democracy for the people!\" Like I said, the blind lead the blind. You think you're going somewhere profound, but you wouldn't appreciate grace if it cock slapped you across the forehead. \n\nBasically, people like me tell you to go fuck yourself. If you tried to get your friends and local state together to invade any upstart Ancapistan, you deserve whatever horrible shit might land in your lap.  No offence but you post is filled with presuppositions that just didn't resemble my experience in Africa.        I would like to start out by saying I am not an AnCap. However I have a significant amount of similar views and I believe as an end goal most of it is correct. \n\n I believe in Voluntarism and Free Markets and I deeply sympathize with **some** mutualism ideas.\n\n\n&gt;However, after I did volunteer for a NGO in Africa I started to have massive doubts\n\nI lived in Africa for half of my life. I could understand being extremely disheartened by it. But the chaos and \"anarchy\" you see there has nothing to do with lack of government.\n\n\n\n.\n\n\n It has nothing to do with an unregulated economy. It has nothing to do with the lack of government official and police that **could** provide protection. In most places it has nothing to do with lack of resources. \n\n.\n \n\nIn fact the opposite of all these things is true. Most of Africa is the epitome of bad government corruption. It exemplifies a harsh and greedy government.  It is, and has been, exploited by governments and dictators since the time of imperialism. Contrary to popular belief many parts of African societies were quite advanced prior to the conquest of African lands. The systems and instability currently seen in Africa can be attributed in most cases to military and government intervention.\n\n\n.\n\n When military power such as the British finally left Africa it was in a desperate and volatile state. The outcome was predictable. Power vacuums arose and violent leaders filled into the artificially created spots that their predecessors had carved out over time.\n\n.\n\n.\n \n\nTo say that in an ideal situation that there will always be a need and a vacuum for such power is to make the same mistake of those who opposed the abolition of the monarchies. \n\n.\n\n.\n\n\nMany of the current dictators in Africa are not even wise enough to maximize the money they can steal from the country. I lived in the Democratic Republic of the Congo for a while. It was a country abounding with natural resources. It could have been a rich and prosperous country if the dictator had just enough sense to maximize his wealth; instead he killed the goose that laid the golden egg. If there was a diamond mine he would not tax it or take a portion of what was mined. No, he would just take the whole mine. Since he did not know how to operate a mine after a few month the immediately available resource available in that mine would be used up and he would move on to the next profitable vendor. \n\n.\n\n\nThese governments have enough police and military personnel to protect the people from violence and crime but instead use it to rob or control them. \n\n.\n\nLastly the tribe wars are also the indirect fault of the government.  When the lands were conquered by the Dutch or British or Portuguese they did not conquer a country, they conquered an area. The area they conquered often included the peoples of multiple warring kingdoms or tribes.  While those or other oppressive governments hold power the people remained in non less violent resentment.  Once these governments are weakened centuries of hate and resentment is unleashed. \n\nA non-astute survey of this situation would seem to indicate that the problem is the people not the government.  To be sure there is much blame that can be attributed to these people. However the warring tribes that existed before were not forced to interact and largely just stayed away from each other, because human nature is prone to self-preservation. The arbitrary government borders encompassed these people and forced them into a situation where self-preservation could mean preemptive strikes,  since the other group may think the same. The forced  assimilation  did not allow for  peaceful resolution that happens all the time in societies, where they are given time and space away from each other and only must come back together in voluntary association\n\n.\n\n&gt;Today I identify myself as a \"progressive\" and I am opposed to most libertarian ideas concerning the economy\n\n\nIf you are so opposed to the idea of capitalism there are more economic ideas that do not involve the **government**  coercing people to make decisions it deems good.  \n\n[Participatory_economics](http://en.wikipedia.org/wiki/Participatory_economics) \n\n[Libertarian socialism](http://en.wikipedia.org/wiki/Libertarian_socialism)\n\n[Georgism ](http://en.wikipedia.org/wiki/Georgism)\n\nMutualism\n\nhttp://en.wikipedia.org/wiki/Mutualism_(economic_theory)\n\n.\n\n\n&gt; Wouldn't that be an inherent threat of any anarchistic society? People bounding together to form new sorts of governments. Are there any obvious solution for that problem that wouldn't ultimately lead to warfare between people who believe the government is justified and necessary and people who don't?\n\n.\n\n\n\nAbsolutely absurd.  In fact the situation I feel is ideal is having small minarchist governments. An extremely limited government would allow some people who wish to be involved in said government to be, and those that do not wish to not be. \n\n For example the Amish live in relative anarchy; although less and less as our government becomes more intrusive economically and socially. Not ironically it is the economic regulations that are currently becoming the most intrusive for the Amish.  [Amish raw milk farmer raided.]( http://reason.com/blog/2011/05/16/raw-milk-raid-on-amish-farmer) With the affordable care act the Amish will be required to buy insurance or pay fines even though most of them do not believe in medical care. \n\n\nThe point being that if it is possible for a **good** government to arise  from a AnCap society: is would simply leave those that wished to continue in anarchy alone.  Like I said I feel this is an ideal situation. \n\nSome people may form cities with a small government, but no one is forced to live there. In fact the government could be very oppressive and it would not matter since those in it could just leave. You could go to the next town over which did not have a government in the current sense of the word. \n\nPerhaps one city tries out being structured as a collective and another has no economic goal; none of these things are bad when you do not have centralized government controlling these things. If communism works: let someone make it work. If it does not work then then people will not gravitate towards it. If a city or community tries to cling to communism after it no longer works; those who voluntary moved there to try it can go to a laissez faire town if they wish.\n\n\n\n.\n\n\n&gt; I read Rothbard and Mises and listened to Freedom Radio and for some time I was really convinced to have found my political home base.\n\n.\n\nLastly maybe this is your problem. This is about diverse a plethora of ideas as those allowed in Russia during the Soviet Union. This is not to citizen them. I think all of those with are great sources: but they all say almost exactly the same things. What about the ideas of classical liberals: Thomas Paine, John Locke ,Thomas Jefferson? Or the later ideas of : Henry George, George Orwell, Alexis de Tocqueville, John Emerich Edward Dalberg-Acton, 1st Baron Acton? What about the early anarchists in America and Germany? Or modern libertarians Ron Paul, and Adam Kokesh, Karl Hess. \n Participatory economics:\n\n&gt;One of the primary propositions of parecon is that all persons should have a say in decisions proportionate to the degree to which they are affected by them. This decision-making principle is often referred to as self-management. In parecon, it constitutes a replacement for the mainstream economic conception of economic freedom.\n\nDoes this mean I have to get permission from everyone that looks at my house to change the color of my house?  Do I hold an online vote for what color my house should be and invite everyone that could be affected? I am just giving some alternatives. I am not saying participatory economics is  perfect for all situation. I am certainly not suggesting that it would be a good system if it was forced.  A good example of participatory economics is Co-Ops as a business model. Obviously you could apply this in a non voluntary way; but equally so you could ably it in a voluntary manner. \n\n&gt;Does this mean I have to get permission from everyone that looks at my house to change the color of my house?\n\nIt depends: are you living in a community in voluntary association that has agreed to that level of minute decision making. Even if your have; you are the person most proportionally effected by how the house is painted. So unless people in the community are outraged about how you painted your house: then you could probably paint it however you wanted. If however you painted it with scene of violent rape then the community would probably be able to overrule your \"vote\". \n\n&gt; Do I hold an online vote for what color my house should be and invite everyone that could be affected?\n\nThat is absurd, I don't know why anyone would want to do that. I mean if that is the way you are applying it, why not vote on everything. No one wants to take up that much time. Maybe the people who live in the house would do this but the rest of the community would not be involved. \n\nI mean I could claim that I am effected by what my coworker eats, but unless he is eating something that literally sick from being nauseous that would be an irrelevant claim. \n\nAnyways this is kind what what most reasonable people do informally in their business and personal life.   That all seems very vague.  It seems the vagueness would encourage much conflict over people thinking that should be involved in decisions that effect them moderately but they feel strongly on.  Like what there co-worker eats.  Property rights seem clarify  who gets to decide what.   Do you honestly think Africa needs more government? Africa is poor specifically because they have corrupt, bureaucratic, and downright evil governments. To be fair, it was poor befor they had that, and it was poor when europeans made goverments there much more stable.    people like you would be shot on sight in ancapistan. Trust me.",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/19565b/i_did_a_lot_of_research_into_ancap_and_i_came_to/"
  }, {
    "id" : 41,
    "title" : "Three Ingredients for Murder: Neuroscientist James Fallon on psychopaths and libertarians",
    "snippet" : "  Stefan should have this guy on his show. This is very relevant to his work.  Reminds me of [this](http://www.plosone.org/article/info:doi/10.1371/journal.pone.0042366) article about libertarian psychology and ethics. That's a great article, thank you! The problem with research like this, though, is that by self-identifying as a libertarian, one is already accepting some level of social isolation and scorn from people around you (that has been my experience anyway). The group they call libertarians is a group that has already demonstrated a willingness to disregard social pressures to conform.   I think the main problem with murderers and violent criminals is impulse control, not a \"loss of ethics.\"\n\nYou can be a moral nihilist and be more peaceful than all the morally self-righteous crusaders out there.\n\nAbuse can also magnify the person's problems, but I don't suspect it's either a sufficient or necessary condition to be a murder.  I think the singular necessary condition really is impulse control.  But, I guess this is also assuming the person later regrets it.\n\nIt's kind of funny how the people who go into psychology, psychiatry, and neuroscience are disproportionately 'abnormal' for lack of a better term.  They kind of do it out of self-therapy.  That CO shooter was a grad student in neuroscience.  This remark shouldn't taken as rigorous though, of course. &gt;I think the main problem with murderers and violent criminals is impulse control, not a \"loss of ethics.\"\n\n\"Impulse control\" carries a baked-in assumption about what impulses one ought to control, which is just a proxy for ethics. I think the main problem with murderers and violent criminals is impulse control, not a \"loss of ethics.\"\n\nYou can be a moral nihilist and be more peaceful than all the morally self-righteous crusaders out there.\n\nAbuse can also magnify the person's problems, but I don't suspect it's either a sufficient or necessary condition to be a murder.  I think the singular necessary condition really is impulse control.  But, I guess this is also assuming the person later regrets it.\n\nIt's kind of funny how the people who go into psychology, psychiatry, and neuroscience are disproportionately 'abnormal' for lack of a better term.  They kind of do it out of self-therapy.  That CO shooter was a grad student in neuroscience.  This remark shouldn't taken as rigorous though, of course. I think the main problem with murderers and violent criminals is impulse control, not a \"loss of ethics.\"\n\nYou can be a moral nihilist and be more peaceful than all the morally self-righteous crusaders out there.\n\nAbuse can also magnify the person's problems, but I don't suspect it's either a sufficient or necessary condition to be a murder.  I think the singular necessary condition really is impulse control.  But, I guess this is also assuming the person later regrets it.\n\nIt's kind of funny how the people who go into psychology, psychiatry, and neuroscience are disproportionately 'abnormal' for lack of a better term.  They kind of do it out of self-therapy.  That CO shooter was a grad student in neuroscience.  This remark shouldn't taken as rigorous though, of course.   This guy had a TED talk.  Hmm I'll have to find it and check it out. Seems like a really cool guy.  It adds a lot to his argument when he says he has the brain pattern of those psychopaths in this family. Check out Horizons documentary Are You Good or Evil? He's in that explaining it in more detail  ",
    "url" : "http://www.youtube.com/watch?v=Vx8RxRn6dWU"
  }, {
    "id" : 42,
    "title" : "Utilitarians?",
    "snippet" : "Are there any ancaps who are purely utilitarian who don't go after the philosophical baggage (Rothbard's natural law theory, voluntarism, etc.) and just hold to ancapism as being a more efficient way of doing things, and don't believe that the state is literally Hitler? (Tall order, I know)\n\nI'm a classical liberal and I support limited, constitutional government (very limited government with a strictly enforced constitution, i. e., something that doesn't really exist), but I can definitely see a positive role for privatized production of security and infrastructure. I don't think I'm going to be end up an ancap because of my intensely conservative instincts but I'm open to the idea on utilitarian grounds, just not deontological ones (complicated religious and philosophical beliefs, sue me). Are there any ancaps that argue from a purely utilitarian perspective? I'm interested. I know David Friedman is considered a utilitarian.\n\nEDIT: Conservative as in religious, social, cultural, and intellectual. (That said, I don't support using the government to enforce morality that doesn't directly apply to persons and property because that's dangerous.)  I don't seek out or adhere to labels, but I support norms similar to AnCap-ism &amp; don't take the \"morality\" approach.\n\nI find the \"objective morality\" approaches to be lacking and illogical.  This doesn't deny or object to some sense of morality/ethics, just the idea of a monolithic objective form of ethics.  I also see a major chunk of *(what is commonly referred to as)* philosophy as pointless *(I'll explain some other time)*.\n\nI prefer to view propositions for norms in the context of values.  I see non-government (or panarchy) with strong property &amp; anti-violence norms as highly beneficial to many things I value, such as wealth, wellbeing, autonomy, economics/productivity, mutual relationships, non-harm, keeping wealth I produce, etc.\n\n*relevant: http://jamescarlin.wikidot.com/objective-statements*\n\n I don't seek out or adhere to labels, but I support norms similar to AnCap-ism &amp; don't take the \"morality\" approach.\n\nI find the \"objective morality\" approaches to be lacking and illogical.  This doesn't deny or object to some sense of morality/ethics, just the idea of a monolithic objective form of ethics.  I also see a major chunk of *(what is commonly referred to as)* philosophy as pointless *(I'll explain some other time)*.\n\nI prefer to view propositions for norms in the context of values.  I see non-government (or panarchy) with strong property &amp; anti-violence norms as highly beneficial to many things I value, such as wealth, wellbeing, autonomy, economics/productivity, mutual relationships, non-harm, keeping wealth I produce, etc.\n\n*relevant: http://jamescarlin.wikidot.com/objective-statements*\n\n Going on from there, the problem with the label \"utilitarian\" is that most describe utilitarianism as solely dealing with the net happiness of society. When weighing the costs and benefits, I believe that there are more things to consider than total happiness, and I believe David Friedman shared this critique of utilitarianism, and does not consider himself a one. What else should be considered other than happiness? This question was actually the central focus of Brave New World.  It created the idea of a horrific distopian world in which the vast majority of people truly were happy.  Laborers were genetically engineered to be stupid and were given pavlovian training as children to make them enjoy factory work.  Meanwhile, the higher classes were kept subdued with a constant stream of drugs and sex.  They lived shallow lives, and they died young.  But, they were almost all content.  And of course, any and all subversive thought on art, philosophy, or religion was banned.  \n\nIf your goal is simply to maximize happiness, there are a number of ways to go about accomplishing that.  The question is, do the ends justify the means, and is there something more to the human experience than simply pleasure?   This question was actually the central focus of Brave New World.  It created the idea of a horrific distopian world in which the vast majority of people truly were happy.  Laborers were genetically engineered to be stupid and were given pavlovian training as children to make them enjoy factory work.  Meanwhile, the higher classes were kept subdued with a constant stream of drugs and sex.  They lived shallow lives, and they died young.  But, they were almost all content.  And of course, any and all subversive thought on art, philosophy, or religion was banned.  \n\nIf your goal is simply to maximize happiness, there are a number of ways to go about accomplishing that.  The question is, do the ends justify the means, and is there something more to the human experience than simply pleasure?   &gt;than simply pleasure\n\nThis isn't what they're talking about.  They've made the definition so wide that it catches anything you feel you want or should do.\n\nBy creating value-judgments like \"shallow lives,\" you're expressing your own values.\n\nThat's fine; follow them toward your happiness.  There is no incompatibility here. As long as the people are thoroughly drugged and brainwashed, they won't want to do anything other than take their drugs and go their orgies.  There's no such thing as an existential crisis when the state programs everyone's mind.  If brainwashing everyone would lead to a truly content and happy populace, then is that something we should pursue?  Going on from there, the problem with the label \"utilitarian\" is that most describe utilitarianism as solely dealing with the net happiness of society. When weighing the costs and benefits, I believe that there are more things to consider than total happiness, and I believe David Friedman shared this critique of utilitarianism, and does not consider himself a one. I have written my own critique of what I call \"utilitarian consequentialism.\"\n\nhttp://jamescarlin.wikidot.com/utilitarian-consequentialism I don't seek out or adhere to labels, but I support norms similar to AnCap-ism &amp; don't take the \"morality\" approach.\n\nI find the \"objective morality\" approaches to be lacking and illogical.  This doesn't deny or object to some sense of morality/ethics, just the idea of a monolithic objective form of ethics.  I also see a major chunk of *(what is commonly referred to as)* philosophy as pointless *(I'll explain some other time)*.\n\nI prefer to view propositions for norms in the context of values.  I see non-government (or panarchy) with strong property &amp; anti-violence norms as highly beneficial to many things I value, such as wealth, wellbeing, autonomy, economics/productivity, mutual relationships, non-harm, keeping wealth I produce, etc.\n\n*relevant: http://jamescarlin.wikidot.com/objective-statements*\n\n  There are those of us who are moral nihilists and support ancap from what might be considered a consequentialist position. I wouldn't call it utilitarian, because utilitarianism is something completely removed from the concept of subjective value.\n\nAny economic argument for the abolition of the State is consequential. You should check out David Friedman's work, as well as the work of Bob Murphy, Rothbard and others who demonstrate how the State fails to provide what people claim it exists to provide - law, security, and protection of private property rights.\n\nOn another relevant note: the question of constitutional government is not whether you can craft a good constitution, but what you do when the constitution is not obeyed. Ancapism is the conclusion that no such single system is stable. The only force capable of restraining an entity that oversteps its lawful bounds is the market - the choice of consumers. I don't see why moral nihilists can't be deontologists. I am. I don't see why moral nihilists can't be deontologists. I am.  &gt;Are there any ancaps who are purely utilitarian who don't go after the philosophical baggage (Rothbard's natural law theory, voluntarism, etc.) and just hold to ancapism as being a more efficient way of doing things, and don't believe that the state is literally Hitler? (Tall order, I know)\n\nYeah, I'd say about half the regulars here are consequentialists (in the Austrian nihilist/egoist sense), though 80+% of the fresh newcomers are probably die hard Rothbardians through and through.  I will say, though, that I'm not completely happy with moral nihilism; I think my position can better be described as moral skepticism.  I have most, if not all, of Rothbard's natural rights ethics as a personal preference; I'm just being humble in not claiming I can prove it.  Is/ought is a bitch.\n\n&gt;I don't think I'm going to be end up an ancap because of my intensely conservative instincts\n\nHow do you mean conservative?  Social conservative or the conservatives' lionization of the human struggle against adversity and the will to build order and peace through war?\n\nIn either case, the problem minarchists have in making the transition to anarcho-capitalism is in realizing that it's not so much about realism as it is about ceasing to actively advocate for the untenable position of a monopoler.\n\n&gt;I'm interested. I know David Friedman is considered a utilitarian.\n\nMises was a strict moral nihilist, as was Hazlitt and a number of other modern Austrians (fairly sure Hlsmann is, too).  Mises and most, if not all the Austrians, had/have the personal preferences of maximum freedom and productivity for humanity, but they recognize these things can't be objectively proven and that economic science is forever silent on the question.\n\nTake for example, Bob Murphy, a Christian ancap who is still probably willing to accede to moral nihilism as the fundamentally ultimate philosophy of ethics backstop.  (He also has a [wickedly dry sense of humor](http://i.imgur.com/cx7C9Yg.jpg?1) as a bonus.) \"Mises was a strict moral nihilist\"\n\nWas he? Or did he feel it was not his place to speak on it? &gt;Or did he feel it was not his place to speak on it?\n\nWell, how do you mean that exactly?\n\nDo you mean moral skepticism, abstaining from judgment?\n\nI mean, in this sense, I'm a moral skeptic.  It's kind of like being an agnostic as opposed to being an atheist. No I mean that he simply wasn't dealing with morality or ethics in his work. It's like claiming a nuclear physicist is a Nihilist because he never argues about morality. It's simply not his concern.\n\nI think he was telling us HOW to do it. The WHY is up to us. Well, he dealt with ethics insofar as he was saying science, including economic science, has nothing to say on it.\n\nBut, *Human Action* did engage in a decent philosophical tour de force, which included in admitting there wasn't any objective proof for any one ethic. I think he was more a perspectivist or a kind of Nietzschean, but I see your point. &gt;or a kind of Nietzschean, but I see your point.\n\nHeh, you're an upstanding, amusing chap.  :DDDD\n\nNietzsche was about as nihilistic as one can get. &gt;Are there any ancaps who are purely utilitarian who don't go after the philosophical baggage (Rothbard's natural law theory, voluntarism, etc.) and just hold to ancapism as being a more efficient way of doing things, and don't believe that the state is literally Hitler? (Tall order, I know)\n\nYeah, I'd say about half the regulars here are consequentialists (in the Austrian nihilist/egoist sense), though 80+% of the fresh newcomers are probably die hard Rothbardians through and through.  I will say, though, that I'm not completely happy with moral nihilism; I think my position can better be described as moral skepticism.  I have most, if not all, of Rothbard's natural rights ethics as a personal preference; I'm just being humble in not claiming I can prove it.  Is/ought is a bitch.\n\n&gt;I don't think I'm going to be end up an ancap because of my intensely conservative instincts\n\nHow do you mean conservative?  Social conservative or the conservatives' lionization of the human struggle against adversity and the will to build order and peace through war?\n\nIn either case, the problem minarchists have in making the transition to anarcho-capitalism is in realizing that it's not so much about realism as it is about ceasing to actively advocate for the untenable position of a monopoler.\n\n&gt;I'm interested. I know David Friedman is considered a utilitarian.\n\nMises was a strict moral nihilist, as was Hazlitt and a number of other modern Austrians (fairly sure Hlsmann is, too).  Mises and most, if not all the Austrians, had/have the personal preferences of maximum freedom and productivity for humanity, but they recognize these things can't be objectively proven and that economic science is forever silent on the question.\n\nTake for example, Bob Murphy, a Christian ancap who is still probably willing to accede to moral nihilism as the fundamentally ultimate philosophy of ethics backstop.  (He also has a [wickedly dry sense of humor](http://i.imgur.com/cx7C9Yg.jpg?1) as a bonus.)   I don't think thats possible really. If someone believes that a non-violent and non-coercive society is more efficient, I can't imagine they wouldn't question why that is. \n\nIt's like saying you enjoy eating fried chicken, but you won't examine that the meat came from an animal. It's inescapable to make this association, so you'll never encounter a vegetarian that has never examined the ethical grounds for meat eating. Sure they might be a vegetarian because they believe it's healthier, but surely a small part of them also recognizes the ethics about it as well. So it might be interesting to find a vegetarian that says he couldn't care less about animals, he just chooses not to eat them.\n\nSo surely there are ancaps that approached this philosophy from an economics standpoint, but they're always going to be aware of the ethics. I came from a fiscal conservative standpoint into being an ancap and then quickly switched my views to be primarily ethical. In fact I would say I'm much more tolerant of inefficient/non-ulititarian positions now than I previously was. I mean who cares if something is efficient, just as long as it doesn't hurt someone else is all that I care now. &gt; It's like saying you enjoy eating fried chicken, but you won't examine that the meat came from an animal. It's inescapable to make this association,\n\n\nA chicken is caged physically, humans are caged mentally.  I don't think thats possible really. If someone believes that a non-violent and non-coercive society is more efficient, I can't imagine they wouldn't question why that is. \n\nIt's like saying you enjoy eating fried chicken, but you won't examine that the meat came from an animal. It's inescapable to make this association, so you'll never encounter a vegetarian that has never examined the ethical grounds for meat eating. Sure they might be a vegetarian because they believe it's healthier, but surely a small part of them also recognizes the ethics about it as well. So it might be interesting to find a vegetarian that says he couldn't care less about animals, he just chooses not to eat them.\n\nSo surely there are ancaps that approached this philosophy from an economics standpoint, but they're always going to be aware of the ethics. I came from a fiscal conservative standpoint into being an ancap and then quickly switched my views to be primarily ethical. In fact I would say I'm much more tolerant of inefficient/non-ulititarian positions now than I previously was. I mean who cares if something is efficient, just as long as it doesn't hurt someone else is all that I care now. I don't think thats possible really. If someone believes that a non-violent and non-coercive society is more efficient, I can't imagine they wouldn't question why that is. \n\nIt's like saying you enjoy eating fried chicken, but you won't examine that the meat came from an animal. It's inescapable to make this association, so you'll never encounter a vegetarian that has never examined the ethical grounds for meat eating. Sure they might be a vegetarian because they believe it's healthier, but surely a small part of them also recognizes the ethics about it as well. So it might be interesting to find a vegetarian that says he couldn't care less about animals, he just chooses not to eat them.\n\nSo surely there are ancaps that approached this philosophy from an economics standpoint, but they're always going to be aware of the ethics. I came from a fiscal conservative standpoint into being an ancap and then quickly switched my views to be primarily ethical. In fact I would say I'm much more tolerant of inefficient/non-ulititarian positions now than I previously was. I mean who cares if something is efficient, just as long as it doesn't hurt someone else is all that I care now. &gt; It's like saying you enjoy eating fried chicken, but you won't examine that the meat came from an animal. It's inescapable to make this association, so you'll never encounter a vegetarian that has never examined the ethical grounds for meat eating. Sure they might be a vegetarian because they believe it's healthier, but surely a small part of them also recognizes the ethics about it as well. So it might be interesting to find a vegetarian that says he couldn't care less about animals, he just chooses not to eat them.\n\nThat's an absolutely shit argument. You're appealing to the beliefs of others that you cannot possibly know. &gt; It's like saying you enjoy eating fried chicken, but you won't examine that the meat came from an animal. It's inescapable to make this association, so you'll never encounter a vegetarian that has never examined the ethical grounds for meat eating. Sure they might be a vegetarian because they believe it's healthier, but surely a small part of them also recognizes the ethics about it as well. So it might be interesting to find a vegetarian that says he couldn't care less about animals, he just chooses not to eat them.\n\nThat's an absolutely shit argument. You're appealing to the beliefs of others that you cannot possibly know. Are you suggesting that there are vegetarians that are as such purely for health reasons and not ethical? I'm not suggesting. I know of several. what was their response to whether they cared about animals or not? Why do you refuse to believe that not everyone follows your self-righteous crusading bullshit? It's not so much that I don't believe they have a different way to approach life. What I dispute is that these thoughts were rejected. Hey if know people that hate animals and yet are vegetarians, clearly then this combination is possible, I still maintain that it isn't common. &gt; Hey if know people that hate animals and yet are vegetarians, clearly then this combination is possible, I still maintain that it isn't common.\n\nYou're so fucking self-righteous. You don't have to be a vegetarian to not hate animals. &gt; Hey if know people that hate animals and yet are vegetarians, clearly then this combination is possible, I still maintain that it isn't common.\n\nYou're so fucking self-righteous. You don't have to be a vegetarian to not hate animals. Why do you refuse to believe that not everyone follows your self-righteous crusading bullshit? Eh, you really just come off as an emo 15 year old when you write something like this. Have I offended you? Not really, no; I would think of it more as a call to action to be the more respectable intellectual you're capable of being.  I think that consequentialism is well-disguised deontology. I'll let Spencer explain why:\n\n--------------------\n\nHence, notwithstanding all the incongruities, we must admit the existence of a Moral\nSense to be both possible and probable.\n\nBut that we possess such a sense, may be best proved by evidence drawn from the lips\nof those who assert that we have it not. Oddly enough Bentham unwittingly derives\nhis initial proposition from an oracle whose existence he denies, and at which he\nsneers when it is appealed to by others. One man, he remarks, speaking of\nShaftesbury, says he has a thing made on purpose to tell him what is right and what\nis wrong; and that it is called a moral sense: and then he goes to work at his ease, and\nsays such and such a thing is right, and such and such a thing is wrong. Why?\nbecause my moral sense tells me it is. Now that Bentham should have no other\nauthority for his own maxim than this same moral sense, is somewhat unfortunate for\nhim. Yet, on putting that maxim into critical hands, we shall soon discover such to be\nthe fact. Let us do this.\n\nAnd so you think, says the patrician, that the object of our rule should be the\ngreatest happiness to the greatest number.\n\nSuch is our opinion, answers the petitioning plebeian.\n\nWell now, let us see what your principle involves. Suppose men to be, as they very\ncommonly are, at variance in their desires on some given point; and suppose that\nthose forming the larger party will receive a certain amount of happiness each, from\nthe adoption of one course, whilst those forming the smaller party will receive the\nsame amount of happiness each, from the adoption of the opposite course: then if\ngreatest happiness is to be our guide, it must follow, must it not, that the larger party\nought to have their way?\n\nCertainly.\n\nThat is to say, if youthe people, are a hundred, whilst we are ninety-nine, your\nhappiness must be preferred, should our wishes clash, and should the individual\namounts of gratification at stake on the two sides be equal.\n\nExactly; our axiom involves that.\n\nSo then it seems, that as, in such a case, you decide between the two parties by\nnumerical majority, you assume that the happiness of a member of the one party, is\nequally important with that of a member of the other.\n\nOf course.\n\nWherefore, if reduced to its simplest form, your doctrine turns out to be the\nassertion, that all men have equal claims to happiness; or, applying it personallythat\nyou have as good a right to happiness as I have.\n\nNo doubt I have.\n\nAnd pray, sir, who told you that you have as good a right to happiness as I have?\n\nWho told me?I am sure of it; I know it; I feel it; I\n\nNay, nay, that will not do. Give me your authority. Tell me who told you thishow\nyou got at itwhence you derived it.\n\nWhereupon, after some shuffling, our petitioner is forced to confess, that he has no\nother authority but his own feelingthat he has simply an innate perception of the\nfact; or, in other words, that his moral sense tells him so.\n\nWhether it rightly tells him so, need not now be considered. All that demands present\nnotice is the fact, that when cross-examined, even the disciples of Bentham have no\nalternative but to fall back upon an intuition of this much derided moral sense, for the\nfoundation of their own system.  Yeah, me. How do you feel about deontological/voluntarist ancap?  There is no principle in the world which you must follow if it does not give you better outcomes.\n\nSimilarly, something cannot be a principle if the outcome of the principle determines the principle, because principles are formed to know which thing to do which will benefit you.\n\nTake for example if some one says \"I follow the principle of honesty, no matter what the consequences are, therefore I am a deontological honest individual\", then the question comes in, why did you chose to follow the principle of honesty to start with if the outcomes didn't matter? Clearly you think following the principle of honesty gives you a better outcome in every circumstance, otherwise how did you chose to be honest? Why not follow the principle of dishonesty every single time, or steal everything by principle.\n\nSimilarly if someone says \"I am only principally honest because it benefits me, therefore I am a consequentialist honest person\", then the question arises how do you know that in EVERY situation honesty would give you a better outcome, all you have done is seen a pattern and predicted that if in most situations honesty results in a better outcome then in future too honesty would be a better thing to do. Otherwise you are NOT looking at the outcome of every situation in order to follow a principle.\n\nWhat this means is that there is no real or true utilitarians, nor there can be true natural rights libertarians. Rights don't mean anything if they don't benefit things in general, similarly, utility of things which hasn't happened yet cannot be established before doing them. &gt;utility of things which hasn't happened yet cannot be established before doing them\n\nIt sounds like what you're saying -- and the solution to your conundrum -- is that people must have built-in values.\n\nIs this correct? Nope, I am just pointing out that a utilitarian ethicists is like saying \"My winning strategy is to only buy winning lottery tickets\". \n\nThe whole point of having an 'ethic' is to figure out which thing is the right thing to do, without knowing the final utility of things, because the only true way the final utility of things can be calculated is by doing the action itself.   lengthyounarther on YouTube (and very occasionally here) has said that he cares much more about Utilitarian arguments, both from their Utility in convincing others, and the fact that he just plain doesn't expect some Libertarian Natural Law to be the necessary or even likely form of Common Law arrived at in a market. lengthyounarther on YouTube (and very occasionally here) has said that he cares much more about Utilitarian arguments, both from their Utility in convincing others, and the fact that he just plain doesn't expect some Libertarian Natural Law to be the necessary or even likely form of Common Law arrived at in a market.   Utilitarianism denies the fundamental realization at the core of libertarianism and Anarcho Capitalism. That you are a free entity. Utilitarians attempt to quantify human value when there is no intrinsic value, only human desire. For instance-- Why value efficiency? Why not the environment? Why not music?\n\n\nBut yes, it is the most efficient way to do things. &gt;Utilitarians attempt to quantify human value when there is no intrinsic value, only human desire. For instance-- Why value efficiency? Why not the environment? Why not music?\n\nHi, while your analysis is partially-right so long as you're objecting to *objective* consequentialism (Utilitarianism), what arguments have you against [*subjective* consequentialism](http://www.youtube.com/watch?v=c3fZzbMf86E) (Austrian economics / morally nihilistic consequentialism / egoism)? It's a bit of a quibble more than anything-- I think Molyneux is somewhat inconsistent in how he regards the Utilitarian argument, but I think he is in a rough place rhetorically. I do find that utilitarian arguments can be convincing on a personal level, nothing more.\n\nNo real objections, but I would say I'm psuedo Hegelian/Nietzschean in that although we can't really define the zeitgeist or Mises \"invisible hand\"-- a collective expression of will as a kind of hyper object operates in the form of a society. A society's will has value as an extension of my own will and to the extent that I operate and belong in that society. Unleash the Ubermensch! Yeah, I am, too, interested in seeing where this thing called conscious life is heading. Was that linked video yours? Funny I had actually watched it earlier in the week.   I think I am mostly an Egoist but I'm still AnCap",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/195e2w/utilitarians/"
  }, {
    "id" : 43,
    "title" : "Pete Eyre discusses CopBlock and police accountability at the 2013 NH Liberty Forum",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=KrVebdeSPpk"
  }, {
    "id" : 44,
    "title" : "Krugman and a Critic on the Minimum Wage, David Henderson | EconLog",
    "snippet" : " ",
    "url" : "http://econlog.econlib.org/archives/2013/02/krugman_and_a_c.html"
  }, {
    "id" : 45,
    "title" : "Tom Woods on Roads",
    "snippet" : "  Clear, Concise, Rational, Hilarious....  I think this might be the most finely crafted \"what about the roads?\" response ever produced. No, because instead of giving a good answer, it just ridicules whoever asked. It's like answering \"from the super market\" when someone asks where milk is coming from. It is true, but it does not address the concern behind the question. No, because instead of giving a good answer, it just ridicules whoever asked. It's like answering \"from the super market\" when someone asks where milk is coming from. It is true, but it does not address the concern behind the question. No, because instead of giving a good answer, it just ridicules whoever asked. It's like answering \"from the super market\" when someone asks where milk is coming from. It is true, but it does not address the concern behind the question.  [Who will build the roads?](http://imgur.com/XpWZu) That's a completely different approach: making a moral argument (\"even if there were no roads in a free society, that would be better than taxation\") rather than a practical argument (\"if there is value in roads, and there obviously is, there will be incentive for enterprising people and organizations to build them\"). I prefer the practical argument. it might be a moral argument (only) if in 1866, world production of cotton came to a standstill and never began a again. That's a completely different approach: making a moral argument (\"even if there were no roads in a free society, that would be better than taxation\") rather than a practical argument (\"if there is value in roads, and there obviously is, there will be incentive for enterprising people and organizations to build them\"). I prefer the practical argument.  I'm gonna ~~is~~ *use* this for the rest of my life.\n\nI blame early hours and a hangover I'm gonna ~~is~~ *use* this for the rest of my life.\n\nI blame early hours and a hangover I'm gonna ~~is~~ *use* this for the rest of my life.\n\nI blame early hours and a hangover  I may be wrong but has anyone actually made that argument though? It feels like a straw-man we all collectively agreed to attack for ever.\n \nMost people I have talked to do not think we cannot privatise most things, but rather that is would be incredibly dangerous to.\n\neg. \"Without a welfare state crime (because of poverty) would spiral to the levels of Victorian Britain\" or \"PMC's can be bought out / corrupted and if there isn't a state army to defend us -insert slippery slope here- you get Liberia.\" I may be wrong but has anyone actually made that argument though? It feels like a straw-man we all collectively agreed to attack for ever.\n \nMost people I have talked to do not think we cannot privatise most things, but rather that is would be incredibly dangerous to.\n\neg. \"Without a welfare state crime (because of poverty) would spiral to the levels of Victorian Britain\" or \"PMC's can be bought out / corrupted and if there isn't a state army to defend us -insert slippery slope here- you get Liberia.\" I may be wrong but has anyone actually made that argument though? It feels like a straw-man we all collectively agreed to attack for ever.\n \nMost people I have talked to do not think we cannot privatise most things, but rather that is would be incredibly dangerous to.\n\neg. \"Without a welfare state crime (because of poverty) would spiral to the levels of Victorian Britain\" or \"PMC's can be bought out / corrupted and if there isn't a state army to defend us -insert slippery slope here- you get Liberia.\"  I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  At about 4:50 Elizabeth Warren tells Jon Stewart that without the government no one is going to build roads or bridges and we will have \"no future\":\nhttp://www.thedailyshow.com/watch/tue-january-24-2012/exclusive---elizabeth-warren-extended-interview-pt--2 I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  I'm all for Tom Woods believe me but on the same coin I have never heard someone actually ask that. Only Libertarians talking about someone asking that.  I ask that of my libertarian friends all the time. I have yet to get a satisfactory answer. And no, this is not a good answer, it is a read herring. Sears may build the road to it's store, if it was on a lone street with no one else, but on a road with 10 stores, who pays for it? What if my office is on the street and all 5 employees ride bikes? Should we pay for fixing the road that we don't damage when a 16 wheeler drives on the same road just as often?\n\nAnd what about residential roads? I have enough trouble convincing my land lord to fix my gutters. I really doubt they'd get around to repairing the pot holes outside of my house any faster than the government. That's saying something because I live in Houston where the average pot hole has a half life of a year. Since you seem sincere, the answer to both questions lies in intial development of an area.  Homeowner associations (HOAs: basically tiny local governments that you can sell out of) hold responsibilities like these.\n\nOften, participation in the HOA is a requirement attached to the deed of property.  If you don't fulfill HOA responsibilities, they can put a lien on your house.  Under AnCap, something like that power of lien would evolve to exist. HOA's work on a small level. But who builds interstates, freeways, and roads between HOA's? Maybe if we had a very large HOA that encompassed all of the HOA's? I think we just reinvented the government.\n\nI am sincere (I speak very rhetorically, so I can see how the above may not seem sincere). I am all for rabid decentralization, but I think some central authority is still necessary. [Private highways](http://en.wikipedia.org/wiki/Private_highway) exist now, but I agree we have not developed the social institutions to widely perceive them as easy, efficient, and desirable.\n\nStrangering points out that infrastructure coordination [need not be linked to serving justice](https://pay.reddit.com/r/Anarcho_Capitalism/comments/1942fq/tom_woods_on_roads/c8krz03). I ask that of my libertarian friends all the time. I have yet to get a satisfactory answer. And no, this is not a good answer, it is a read herring. Sears may build the road to it's store, if it was on a lone street with no one else, but on a road with 10 stores, who pays for it? What if my office is on the street and all 5 employees ride bikes? Should we pay for fixing the road that we don't damage when a 16 wheeler drives on the same road just as often?\n\nAnd what about residential roads? I have enough trouble convincing my land lord to fix my gutters. I really doubt they'd get around to repairing the pot holes outside of my house any faster than the government. That's saying something because I live in Houston where the average pot hole has a half life of a year. I ask that of my libertarian friends all the time. I have yet to get a satisfactory answer. And no, this is not a good answer, it is a read herring. Sears may build the road to it's store, if it was on a lone street with no one else, but on a road with 10 stores, who pays for it? What if my office is on the street and all 5 employees ride bikes? Should we pay for fixing the road that we don't damage when a 16 wheeler drives on the same road just as often?\n\nAnd what about residential roads? I have enough trouble convincing my land lord to fix my gutters. I really doubt they'd get around to repairing the pot holes outside of my house any faster than the government. That's saying something because I live in Houston where the average pot hole has a half life of a year. you realize that the government just pays for companies to lay down the roads right? It's just plain lazy to cast aside a world of solutions to a problem because you might not like them.  Yes I do. My comment (which you're supposedly responding to) only deals with the question of \"who is going to PAY to build the roads?\". It's a classic fox hunt problem: the benefit of having roads is greater than the expense of the road, but getting everyone to pitch in and deciding who is responsible for what portion of the cost is a very complicated problem. Simply saying \"If there was no government, then it is OBVIOUS who would build this road\" is a fallacy (proof by intimidation).\n\nAnother person here responded to my comment with \"home owners associations take care of this problem\", which is an actual solution. I'm not casting aside any solutions you've presented because you haven't proposed any. you've accepted the solution of government paying for it but as you know there are many solutions to the problem of who will build the roads. I'm not going to exert the effort to list any because I've gone that certain path in discussions like this and the person just won't accept them. I just don't care that you believe what you believe.  Then why even bother replying? I'll make it simple. Imagine a government where the state has no power to use force, imprison or tax without justification and by justification I mean use of proportional force in response to aggression. Where the state does not have exclusive power to respond to aggression and the state cannot enforce laws on someone's property without the land owners consent. Now imagine people voluntarily giving this government money to provide services. What you imagined is called a voluntary association. These associations can be created to address community needs including roads. \n\nWhy would people pay for roads you ask, because if you are a business or a worker you want there to be roads to get to work or to get customers coming to your store. There are plenty of incentives to keep roads as open as possible. An area that is hard to access will lose millions in capital due to loss of business traffic. Highway systems are essential for distribution of products, the cost of air travel is more expensive then building a road system. Most people won't give money to associations that won't keep roads open, so these associations would weed themselves out since they have no power to tax. \n\nAs it is now most governments spend less than 5% on roads and the rest on the redistribution of wealth and wars. US spends more blowing up roads and infrastructure in other countries then it does building infrastructure. Then why even bother replying? I ask that of my libertarian friends all the time. I have yet to get a satisfactory answer. And no, this is not a good answer, it is a read herring. Sears may build the road to it's store, if it was on a lone street with no one else, but on a road with 10 stores, who pays for it? What if my office is on the street and all 5 employees ride bikes? Should we pay for fixing the road that we don't damage when a 16 wheeler drives on the same road just as often?\n\nAnd what about residential roads? I have enough trouble convincing my land lord to fix my gutters. I really doubt they'd get around to repairing the pot holes outside of my house any faster than the government. That's saying something because I live in Houston where the average pot hole has a half life of a year. If humans can create something as complex as an iPhone, I think we can figure out a solution to road finance and use-fees. It's really getting to the point that any opposition to AnCap merely reflects on the critic's lack of knowledge of how far more complex the private sector's accomplishments are. I mean:\n\nGovernment didn't create human flight, 2 dudes did.\n\nGovernment didn't create the first major computer company, 2 dudes did.\n\nGovernment didn't create the best search engine for the internet, 2 dudes did.\n\nSo when you encounter a statist are stating on about government's need for solving what are actually simple problems, just respond to them, \"Yeah, well, you know, that's just like your uninformed opinion, man\".  From \"the state must build the roads\" it doesn't follow that \"the state must be our government\".\n\nhttp://strangerousthoughts.wordpress.com/2010/09/12/how-can-roads-be-provided-by-the-market-in-cities/  ***Let's focus on a more modern problem.***\n\nLand roads are old news.\n\nWho will build the roads into space? Who will explore space? Who will create an evaluation of space travel without government? This is all basically one question summed up by the first one.\n\nNeil DeGrasse Tyson says if space exploration is expensive, dangerous, and filled with un-measurable risk, then private enterprise can not create a capital market's evaluation of it.\n\nI [have my own](http://www.youtube.com/watch?v=_vhyXkFhLOg) ancap solution to this, but I'm curious what other ancaps have.\n\nBtw, I love Dr. Tyson, but not while he's making statist arguments. I like the reframing.  The obvious answer is people secure in their basic needs, with the skills and means to contribute, who want adventure and acclaim.  That starts out with peole like the private aristocratic scientists and explorers of the early industrial age, but visionaries hire their help based on technical merit, and offer equity.  We're seeing that now.\n\nTyson is right that sending a man to the moon, or a scientific probe to Saturn, would not have been early priorities, but he misses the gradual incentives for satellites and mining asteroids, and the idea of doing it with robots.\n\n*to the choir:* Relying on aristocrats sounds a little unfair to your average grad student applying for NSF funding, but they have no idea how much of their (and their parents') resources have been wasted in bureaucracy and war.  Any teenager now has the resources to repeat history's groundbreaking chemistry experiments, and education is about to experience an online revolution.  IOW, technology will level the means to get the knowledge to contribute.\n\n*edit:* Many great examples of mostly private funding tacling everything Tyson says is impossible in the [heroic age of Antarctic exploration](http://en.wikipedia.org/wiki/Heroic_Age_of_Antarctic_Exploration). ***Let's focus on a more modern problem.***\n\nLand roads are old news.\n\nWho will build the roads into space? Who will explore space? Who will create an evaluation of space travel without government? This is all basically one question summed up by the first one.\n\nNeil DeGrasse Tyson says if space exploration is expensive, dangerous, and filled with un-measurable risk, then private enterprise can not create a capital market's evaluation of it.\n\nI [have my own](http://www.youtube.com/watch?v=_vhyXkFhLOg) ancap solution to this, but I'm curious what other ancaps have.\n\nBtw, I love Dr. Tyson, but not while he's making statist arguments.      So what is he suggesting to happen in a libertanian world? That the people interested in roads form an organization that builds roads? What would such an organization look like? I could imagine that they would probably agree to take some decisions by majority vote. Also, at some point they might realize that their streets are much less straight than the streets of their non-libertarian neighbour cities because they often can't get land owners to sell at prices they can afford. So they'll introduce a rule that the street-building organization can forcefully take someones land if they give them \"appropriate\" compensation. Et voil: they have built a new government. So what is he suggesting to happen in a libertanian world? That the people interested in roads form an organization that builds roads? What would such an organization look like? I could imagine that they would probably agree to take some decisions by majority vote. Also, at some point they might realize that their streets are much less straight than the streets of their non-libertarian neighbour cities because they often can't get land owners to sell at prices they can afford. So they'll introduce a rule that the street-building organization can forcefully take someones land if they give them \"appropriate\" compensation. Et voil: they have built a new government.  &gt; the question that belongs at the top of every libertarian drinking game\n\nYes. This is the type of drinking game I love. Much better than strip poker in middle school and girls making out in college.\n\n&gt; if we didn't have state coercion, there would be no roads\n\nI know the \"WHAT ABOUT THE ROADS!?\" argument is a cute meme around these parts, but I'm amazed that libertarians and A-C's fail to acknowledge that private road systems already exist in the USA. I've worked on  and driven thousands of miles of private roads.\n\nSeriously. Private road systems exist in this country... Is this lost on libertarians?\n\nAlso, do people here (A-C'ers I assume) think that Tom Woods is actually a non-statist? &gt;Also, do people here (A-C'ers I assume) think that Tom Woods is actually a non-statist?\n\nDo you actually think he is a statist? Why? &gt; the question that belongs at the top of every libertarian drinking game\n\nYes. This is the type of drinking game I love. Much better than strip poker in middle school and girls making out in college.\n\n&gt; if we didn't have state coercion, there would be no roads\n\nI know the \"WHAT ABOUT THE ROADS!?\" argument is a cute meme around these parts, but I'm amazed that libertarians and A-C's fail to acknowledge that private road systems already exist in the USA. I've worked on  and driven thousands of miles of private roads.\n\nSeriously. Private road systems exist in this country... Is this lost on libertarians?\n\nAlso, do people here (A-C'ers I assume) think that Tom Woods is actually a non-statist?",
    "url" : "http://i.imgur.com/w27vISu.jpg"
  }, {
    "id" : 46,
    "title" : "Could anybody add on to my definition of An-Cap philosophy that I posted in r/conspiracy",
    "snippet" : "Here's a [link](http://www.reddit.com/r/conspiracy/comments/1952wy/i_think_most_people_here_in_rconspiracy_would/) I had posted earlier in /r/conspiracy in my attempts to sway them in an-cap beliefs. Since they see a lot of the B.S. in government than most people, I think it would be easier to sway them into accepting this ideology. Thanks!       I went to the comment section of /r/conspiracy once. Sorry, but it's a lost cause. ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/19537y/could_anybody_add_on_to_my_definition_of_ancap/"
  }, {
    "id" : 47,
    "title" : "Bitcoin is **not** anonymous. Please stop spreading this myth.",
    "snippet" : "  Bitcoin isn't perfectly anonymous, but nothing is perfectly anonymous.\n\nFor instance, there are many 'anonymous' accounts on reddit. Contrast this with Facebook where there are very few.\n\nAn 'anonymous' account on reddit isn't really anonymous from any sufficiently financed/motivated attacker. However, it is anonymous enough for shy women to post partial nude pics fo themselves and people to make racist comments/jokes.\n\nFrom an ordinary social level Bitcoin is 'anonymous enough'. \n\nUsing Bitcoin, a college student can receive 'bitcoin tips' for exposing her breasts without fear of repercussion from family/friends/etc. An in-the-closet gay man can give a donation to a gay-rights charity without his wife knowing. And a poker player can play online even if his government thinks it is a sin. \n\nThere are of course activities where Bitcoin isn't 'anonymous enough'. If you sell hardcore drugs, advertise murder-for-hire, or threaten blackmail, then Bitcoin should be used with caution. However, even in these cases it is still *possible* to use Bitcoin and hide ones tracks, it just takes a bit more effort.\n\nHeck, even cold hard 100-dollar bills aren't *perfectly* anonymous.  Unless you wear gloves there is always the possibility of leaving behind fingerprints or DNA.\n\n  Who Am I?\n\n1A4vPd1uZ94ureEocog5spLb8dsSncVCQP You are snakemcgraw, and you are awesome. you'd think that but the address he posted is believed to be linked to alqueda. Who Am I?\n\n1A4vPd1uZ94ureEocog5spLb8dsSncVCQP  This is why tumblers exist. Tumblers send your bitcoins through hundreds of randomly picked bitcoin addresses before getting to your account. Bitcoin is far more secure than dealing with banks or credit cards - the network is entirely unregulated by governments of the world.  Also tor. No point in washing your coins if you are going to signal your IP address to everyone when you make a transaction.  Unless you're connected to thousands of nodes, how can you tell if a node originated a transaction or is merely relating it? https://en.bitcoin.it/wiki/Weaknesses#Packet_sniffing This is why tumblers exist. Tumblers send your bitcoins through hundreds of randomly picked bitcoin addresses before getting to your account. Bitcoin is far more secure than dealing with banks or credit cards - the network is entirely unregulated by governments of the world.  Transactions can be tracked, even if they get broken up, sent, and recombined many times over. You can still see which addresses the coins originated from and where they wound up. That doesn't mean we know who the addresses belong to, just what the addresses are. Use new addresses each time. i think the idea with mixers is that they take the coins you send them and send back different coins that someone else sent them.  This is true, but it might as well be called anonymous when you compare to bank accounts.\n\nYou can create a new bitcoin address with no name, no signatures or anything within seconds from any computer that can access the internet anywhere in the world. Contrast this to a bank account where every single transaction you make is recorded for officials to be able to see, directly linked to your name. Then you e.g. go out and do something stupid using your own IP, and you are fucked. I wouldn't say \"fucked\".  This doesn't affect my view of bitcoin. I'm more worried about the fluctuating value of bitcoins and there sustainability beyond people who simply \"want to get off the dollar\". Also, security is a big issue, and I'm still not confident about bitcoin security, I'm a skeptic. &gt;want to get off the dollar\n\nOr  or Yen etc. etc. \nThe fluctuating value is because it's such a young currency and the economy isn't fully formed yet. I personally don't see it as replacing FIAT, but it could become a very strong alternate world digital currency. Even being fully adopted by some small nations who's currency breaks. \nThe security is pretty damn tight, the encryption is as strong as that used by your Bank or Government. \nThe only week points would be client side... ie, a Virus stealing your wallet file. But if you run a clean PC, and encrypt your wallet, you are pretty safe. My Bitcoins are kept in cold storage on a laptop which doesn't even touch the net. \nWhich part of the security concerns you? I just say \"the dollar\" since the US dollar is the reserve currency of the world; thus, all fiat currencies end up as dollars at some point.\n\nI'll confess, I mainly am not confident in the security because I do not fully understand the system itself, for bitcoin. Rather than risk getting involved this early on, I'm holding off until I get enough $ savings to be able to invest in alternatives. When that time comes I'll investigate bitcoin and other alternatives more seriously. I just say \"the dollar\" since the US dollar is the reserve currency of the world; thus, all fiat currencies end up as dollars at some point.\n\nI'll confess, I mainly am not confident in the security because I do not fully understand the system itself, for bitcoin. Rather than risk getting involved this early on, I'm holding off until I get enough $ savings to be able to invest in alternatives. When that time comes I'll investigate bitcoin and other alternatives more seriously. This doesn't affect my view of bitcoin. I'm more worried about the fluctuating value of bitcoins and there sustainability beyond people who simply \"want to get off the dollar\". Also, security is a big issue, and I'm still not confident about bitcoin security, I'm a skeptic.  A popular misconception about bitcoin is that it is anonymous. While it is possible to achieve a certain degree of anonymity, it requires both technical and legal know-how. \n\nAlso, it may not even matter in a situation where you find yourself accused of something and you cannot provide plausible deniability (\"plausible\" in this context meaning what the jury/judge or whatever thinks about your guilt).\n\nPlease stop spreading this myth, and take appropriate measures when using bitcoin. This is not a rant, and Im not hating on bitcoin. I think bitcoin is fucking genius, and I use it myself. &gt; While it is possible to achieve a certain degree of anonymity, it requires both technical and legal know-how.\n\nAs I understand it, you can achieve untraceable anonymity if you take the appropriate steps. So 'Bitcoin is anonymous' might be misleading, but 'Bitcoin enables anonymous transactions' seems accurate.  Can you point to any reliable source which is perpetuating the idea that bitcoin is anonymous?  I'm a casual hobbyist and I know full well that it's pseudonymous.  I can't imagine it's that widely believed. http://www.reddit.com/r/Anarcho_Capitalism/comments/192r6g/jeffrey_the_friar_tucker_is_getting_excited_about/\n\nI think more people that actually *use* bitcoin are better informed, but even users are prone to believing in this myth.   ",
    "url" : "https://en.bitcoin.it/wiki/Anonymity"
  }, {
    "id" : 48,
    "title" : "Property Rights in Society",
    "snippet" : "Ok there, I think anyone claiming to advocate a free market is in some way assuming an underlying structure of property rights within the society. My question is do you think it's better to have a system with one source of accepted and enforced property rights or a system where multiple organizations exist to enforce property rights? Bare in mind, with one structure there would be one legal framework, however with the other there could be multiple legal systems functioning simultaneously. Would the fact that multiple firms exist to enforce property rights lead to less secure property rights as there would be multiple thought processes existing simultaneously which could conflict?     &gt; My question is do you think it's better to have a system with one source of accepted and enforced property rights or a system where multiple organizations exist to enforce property rights? \n\nWe don't. That's called the state, and if you haven't noticed, most of us here don't like the state.  I wasn't really asking the question to find out if you liked the state or not, that is pretty self evident, but I did want to find out thoughts on the implications for property rights when firms are in enforcement competition.  ",
    "url" : "http://www.reddit.com/r/Anarcho_Capitalism/comments/1951me/property_rights_in_society/"
  }, {
    "id" : 49,
    "title" : "Frances Kendall: Freedom and the Child",
    "url" : "http://www.youtube.com/watch?v=-YDJDVo5jJY&amp;list=FL8H6DNlrAgAkfGYr7saaxYw"
  } ],
  "processing-time-source" : 63,
  "processing-result.title" : "anarcho_capitalism0_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/anarcho_capitalism0_reddit.xml"
  }
}