{
  "processing-time-total" : 888,
  "clusters" : [ {
    "id" : 0,
    "size" : 7,
    "score" : 46.76003574283666,
    "phrases" : [ "Irving Park" ],
    "documents" : [ 0, 4, 10, 19, 31, 37, 39 ],
    "attributes" : {
      "score" : 46.76003574283666
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 44.703784808630566,
    "phrases" : [ "March" ],
    "documents" : [ 1, 8, 15, 28, 31, 32 ],
    "attributes" : {
      "score" : 44.703784808630566
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 29.82711947597287,
    "phrases" : [ "Portage" ],
    "documents" : [ 3, 4, 19, 29, 44 ],
    "attributes" : {
      "score" : 29.82711947597287
    }
  }, {
    "id" : 3,
    "size" : 4,
    "score" : 31.943187501302717,
    "phrases" : [ "Center" ],
    "documents" : [ 4, 27, 28, 39 ],
    "attributes" : {
      "score" : 31.943187501302717
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 75.70170550030191,
    "phrases" : [ "Morning Roundup" ],
    "documents" : [ 5, 26, 33, 43 ],
    "attributes" : {
      "score" : 75.70170550030191
    }
  }, {
    "id" : 5,
    "size" : 3,
    "score" : 28.71326365954054,
    "phrases" : [ "Music" ],
    "documents" : [ 15, 17, 25 ],
    "attributes" : {
      "score" : 28.71326365954054
    }
  }, {
    "id" : 6,
    "size" : 3,
    "score" : 35.69335984915248,
    "phrases" : [ "Reddit" ],
    "documents" : [ 18, 45, 47 ],
    "attributes" : {
      "score" : 35.69335984915248
    }
  }, {
    "id" : 7,
    "size" : 2,
    "score" : 19.66569565011866,
    "phrases" : [ "Area" ],
    "documents" : [ 19, 39 ],
    "attributes" : {
      "score" : 19.66569565011866
    }
  }, {
    "id" : 8,
    "size" : 2,
    "score" : 43.41406419807744,
    "phrases" : [ "City of Chicago" ],
    "documents" : [ 1, 32 ],
    "attributes" : {
      "score" : 43.41406419807744
    }
  }, {
    "id" : 9,
    "size" : 2,
    "score" : 23.665489385994118,
    "phrases" : [ "Far in the Neighborhood" ],
    "documents" : [ 7, 12 ],
    "attributes" : {
      "score" : 23.665489385994118
    }
  }, {
    "id" : 10,
    "size" : 2,
    "score" : 19.425380939106294,
    "phrases" : [ "Forgot" ],
    "documents" : [ 5, 42 ],
    "attributes" : {
      "score" : 19.425380939106294
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 25.791088334996687,
    "phrases" : [ "Hang" ],
    "documents" : [ 21, 38 ],
    "attributes" : {
      "score" : 25.791088334996687
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 32.077239031146206,
    "phrases" : [ "Lady" ],
    "documents" : [ 15, 23 ],
    "attributes" : {
      "score" : 32.077239031146206
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 32.76281820423348,
    "phrases" : [ "Meat" ],
    "documents" : [ 22, 23 ],
    "attributes" : {
      "score" : 32.76281820423348
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 69.88322095818853,
    "phrases" : [ "Morning Report" ],
    "documents" : [ 2, 14 ],
    "attributes" : {
      "score" : 69.88322095818853
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 28.98924865052458,
    "phrases" : [ "Police" ],
    "documents" : [ 3, 20 ],
    "attributes" : {
      "score" : 28.98924865052458
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 38.1174537353734,
    "phrases" : [ "Puff Piece" ],
    "documents" : [ 26, 32 ],
    "attributes" : {
      "score" : 38.1174537353734
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 20.815416395001662,
    "phrases" : [ "Repair" ],
    "documents" : [ 24, 34 ],
    "attributes" : {
      "score" : 20.815416395001662
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 16.594817179393235,
    "phrases" : [ "Sears" ],
    "documents" : [ 11, 24 ],
    "attributes" : {
      "score" : 16.594817179393235
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 34.01070453731517,
    "phrases" : [ "Teacher" ],
    "documents" : [ 9, 42 ],
    "attributes" : {
      "score" : 34.01070453731517
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 26.696608933060123,
    "phrases" : [ "Tuesdays" ],
    "documents" : [ 0, 36 ],
    "attributes" : {
      "score" : 26.696608933060123
    }
  }, {
    "id" : 21,
    "size" : 10,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 6, 13, 16, 30, 35, 40, 41, 46, 48, 49 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 817,
  "documents" : [ {
    "id" : 0,
    "title" : "Winter Story Time - Austin Irving Library - Tuesdays - For Toddlers",
    "snippet" : "Winter Story Time\n\nTuesday 10:30 AM - 11:30 AM\nThis weekly event is designed for toddlers aged 18 months to 3 years old. The program is free and open to all.\nTuesdays - 2/26/13 through 3/19/13 \nAustin-Irving Library\n6100 West Irving Park Road\nFor more information please call 312-744-6222.",
    "url" : "http://www.reddit.com/r/greatNWside/comments/1970zu/winter_story_time_austin_irving_library_tuesdays/"
  }, {
    "id" : 1,
    "title" : "62 Intern Positions for College Students • City of Chicago Jobs",
    "snippet" : "\nThe Office of the City Clerk has 62 intern positions open for College Level Students to assist with the\nSummer 2013 City Sticker Program.\nQualifications:\n- Must be a college level student (freshman, sophomore, junior, senior,\nor graduate level) enrolled in a degree seeking program at a nationally\nor regionally accredited college/institution\n- GPA 2.5 (cumulative) or higher\n- Enrolled in a minimum of 6 credit hours or the equivalency of half-time\n- A City of Chicago Resident\n- Must attach your Spring 2013 Enrollment verification letter and current transcripts at the time of application. Applicants must apply online now through March 8, 2013 at the Department\nof Human Resources CAREERS site listed below.\nFor public internet access, you may go to any Chicago Public Library or to the Department of Human Resources at City Hall,121 N. LaSalle, Room 100.\nIf you need assistance with your application or attaching documents,call the Department of Human Resources at 312-744-4976 or visit City Hall, 121 N. LaSalle, Room 100 Monday through Friday between the hours of 8:30 a.m. to 4:30 p.m.\n\nhttp://www.cityofchicago.org/city/en/depts/dhr/provdrs/emp.html\n\nhttp://www.cityofchicago.org/content/dam/city/depts/dhr/supp_info/Candidate_Experience__v14_3-10.pdf",
    "url" : "http://www.reddit.com/r/greatNWside/comments/1970v9/62_intern_positions_for_college_students_city_of/"
  }, {
    "id" : 2,
    "title" : "Morning report 0225",
    "url" : "http://greatnwside.com/2013/02/25/morning-roundup-0225/"
  }, {
    "id" : 3,
    "title" : "Lost Husky Dog Loose in Portage Park • Police trying to coral it right now 12 noon Feb 25",
    "snippet" : "Cops can't catch it.  ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/197bhe/lost_husky_dog_loose_in_portage_park_police/"
  }, {
    "id" : 4,
    "title" : "Upcoming 16th District CAPS Beat Meetings ",
    "snippet" : "Beat 1624\nBoundaries: Irving Park Rd to Montrose, Cicero to Narragansett\nWednesday February 27 7:00 PM\nLocation: Portage Park Senior Center\n4100 N. Long\n\nBeat 1634\nBoundaries: Belmont Ave to Irving Park Rd, Cicero to Laramie\nThursday February 28 7:00 PM\nLocation: St.Bartholomew Church Krueger Hall\n4949 W. Patterson Ave\n ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/196rip/upcoming_16th_district_caps_beat_meetings/"
  }, {
    "id" : 5,
    "title" : "(Late) morning roundup - forgot my iPad edition",
    "url" : "http://greatnwside.com/2013/02/24/late-morning-roundup-forgot-my-ipad-edition/"
  }, {
    "id" : 6,
    "title" : "Jefferson Park Chamber of Commerce gets New Logo",
    "snippet" : "  I guess my submission of a rubble lot might was overlooked by the judges.   Is it coincidence the alderman's wife has the \"winning submission\"? Hmm. Here's was the original call for entries PDF, with the details of the \"contest\":\n\nhttp://0351964.netsolhost.com/2013_Logo_Contest_Flyer.pdf\n\n Oh I don't need that. I knew about it when the Limestone Inc guy announced the contest on every block. They shoulda excluded connected individuals from taking part. My guess is Jill didn't \"win\". Most likely she said shitcan the contest and she'd do it for free. The whole \"contest\" idea was half-crocked. Also the limestone guy is a gal and she's the prez of the chamber FWIK.\n\n Half crocked is your opinion but you're \"guessing\" she decided for the chamber that she should do it &amp; denied an aspiring artist or advertising student the opportunity for exposure?  Here's was the original call for entries PDF, with the details of the \"contest\":\n\nhttp://0351964.netsolhost.com/2013_Logo_Contest_Flyer.pdf\n\n I see, the odds were stacked against me. Mine was done in Aldus Freehand and the messenger didn't deliver the SyQuest drive in time.  I assume Mega is on the board since they included that Veterans office building eyesore.  Weren't they supposedly running a contest for the logo? I think Jill Arena created the logo, she's an illustrator and designer. So they must have ended up with free illustration. Not sure of the details though. Expect to see it on the lightpoles up there in Jeff Park would be my guess. It's well done, I just dislike that building.  I kinda like the old logo with all the trees. I was once in the social security office way on the top of that building. Great neighborhood view from there.",
    "url" : "https://dl.dropbox.com/u/16556159/jefferson-chamber-logo.jpg"
  }, {
    "id" : 7,
    "title" : "Fried Chicken Places",
    "snippet" : "       See, now this is just wrong.  Fried chicken is fried, American and does not need sauces.  Not any really that I have found so far in the neighborhood but if I go to WalMart I might stop at Church's though there is nothing really great about that and you can pick up Brown's in the pedway, at the Thompson and at Ogilvie. See, now this is just wrong.  Fried chicken is fried, American and does not need sauces.  Not any really that I have found so far in the neighborhood but if I go to WalMart I might stop at Church's though there is nothing really great about that and you can pick up Brown's in the pedway, at the Thompson and at Ogilvie. There is a Brown's at Central and Lawrence too.  And at the gas station at Montrose and Pulaski. Speaking of [GAS STATION FRIED CHICKEN](http://www.roadfood.com/Forums/Gas-Station-chicken-m92651.aspx), there's the Marathon at 4725 N. Elston that has the Krispy Krunchy franchise inside of it. Swear to Allah it's 100% Zabiha Halal too!\n\nhttp://imgur.com/a/xi9Jw#3 You just like all the Ks.",
    "url" : "http://www.suntimes.com/lifestyles/18206228-642/chicken-delight-no-shortage-of-places-to-find-quality-fried-bird.html"
  }, {
    "id" : 8,
    "title" : "Ticket Sales Begin March 1 • Kegs for Kidneys",
    "url" : "http://www.fischmanliquors.com/2013/02/kegs-for-kindeys-raising-glass-raising.html?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+FischmansBrewReview+%28Fischman%27s+Brew+Review%29"
  }, {
    "id" : 9,
    "title" : "Parents, Teachers: CPS Must Address Overcrowding At Northwest Side Schools",
    "url" : "http://www.dnainfo.com/chicago/20130224/dunning/parents-teachers-cps-must-address-overcrowding-at-northwest-side-schools"
  }, {
    "id" : 10,
    "title" : "Body Pulled Out of Chicago River - Irving Park",
    "snippet" : "  The article says it was a man, then a woman, then a man again. Which is it? The article says it was a man, then a woman, then a man again. Which is it? The article says it was a man, then a woman, then a man again. Which is it? The article says it was a man, then a woman, then a man again. Which is it? Maybe it was androgynous or transgender. Pat.",
    "url" : "http://www.dnainfo.com/chicago/20130223/irving-park/body-pulled-out-of-chicago-river"
  }, {
    "id" : 11,
    "title" : "Bad News from Sears",
    "snippet" : "     Since things live forever on the intertubes,  I predict no Sears or Kmart stores left in two years. well based on the date of these articles Sears and Kmart have a year left if your crystal ball (bong) is correct. \n\nSears and Kmart will be around for a while.  Since things live forever on the intertubes,  I predict no Sears or Kmart stores left in two years. Agree 100% - only a matter of time.   Will join the ranks of Montgomery Wards, Goldblatts, etc.etc.etc.\n Perhaps we should preemptively think about how to repurpose the building.",
    "url" : "http://online.wsj.com/article/SB10001424052970203918304577241002723672774.html"
  }, {
    "id" : 12,
    "title" : "Door to door coat collecting",
    "snippet" : "This evening my doorbell rang and someone claiming to be my neighbor was collecting coats.  He didn't look familiar to me and wasn't carrying any old coats.  I'm wondering if it's that same guy who shows up in the neighborhood from time to time, he said his name was Harold.  I live around Belmont and Lockwood.  this the one?\n\nhttp://imgur.com/OtKYAcH That looks just like Eric Estrada? nice ;)     Anna sent me the pic. I also posted on [r/chicago](http://www.reddit.com/r/chicago/comments/194zx1/coat_guy_still_trying_to_scam_people_this_winter/)\n\n55 replies so far.",
    "url" : "http://www.reddit.com/r/greatNWside/comments/1942ht/door_to_door_coat_collecting/"
  }, {
    "id" : 13,
    "title" : "Not a NWside restaurant - but close enough.  Cafe 28 closing this weekend.",
    "snippet" : "  I am very bummed....love this place.     Yes that is a bummer.  I used to live a block away.  But the article in the Trib said if they can get some financing they may stay or relocate. Interesting...didn't see that..  That is good potential good news.  We are going tonight for sure.  We haven't been since they lost liquor license end of last year.  the make your own drink bar sounded like a good idea - obviously not enough to get them over the slump. Interesting...didn't see that..  That is good potential good news.  We are going tonight for sure.  We haven't been since they lost liquor license end of last year.  the make your own drink bar sounded like a good idea - obviously not enough to get them over the slump. Doesn't look like it was revoked?\n\nhttp://www.cityofchicago.org/content/dam/city/depts/bacp/disciplinaractions/liquorlicrevocations02012013.pdf I think what I read a couple months ago - they didn't have the cash to renew and clearly don't have rent $$ now. They tried to make the best of it...if you bring your own tequila or rum - they will sell you the mixing's (virgin) for a mojito or margarita.   Hopefully they will make it but 17 years is a respectable run.  Diners are fickle and there is a lot of competition.  I think that has more to do with things than a heat wave or festivals. now you now sound like my husband who doesn't seem the least bit upset (he and i had our 1st date there!) and said exactly that - 17 years is a long run for restaurant.  which if i am understanding you men.. is code for get over it.  i get it :).   Hopefully they will make it but 17 years is a respectable run.  Diners are fickle and there is a lot of competition.  I think that has more to do with things than a heat wave or festivals. two words:\n\nmr steer",
    "url" : "http://www.dnainfo.com/chicago/20130223/north-center/cafe-28-closing-its-doors-this-weekend"
  }, {
    "id" : 14,
    "title" : "Morning report 0223",
    "snippet" : " ",
    "url" : "http://greatnwside.com/2013/02/23/morning-report-0223/"
  }, {
    "id" : 15,
    "title" : "Our Lady of Victory St. Patrick's Day Dinner - Sat March 2 2013",
    "snippet" : "Our Lady of Victory St. Patrick's Day Dinner\n\nSaturday 6:00 PM\nDinner is served at 7:30 p.m.\n\n\n$35.00 per person includes:\nRay Harrington's Complete Corned Beef &amp; Cabbage Dinner &amp; Dessert\nBeer, Wine &amp; Soft Drinks\nMusic, Entertainment and Dancing! Shannon Rovers and Irish Step Dancers!\n\n\nOur Lady of Victory Parish\nAt the corner of Laramie &amp; Sunnyside\nContact Scott Tompkins:\n773-481-2905 or 773-551-1150\ndapainter@aol.com",
    "url" : "http://www.reddit.com/r/greatNWside/comments/192vqk/our_lady_of_victory_st_patricks_day_dinner_sat/"
  }, {
    "id" : 16,
    "title" : "Check Please reviews Ay Ay Picante Peruvian Restaurant at Montrose and Elston",
    "snippet" : "  could be the kiss of death",
    "url" : "http://checkplease.wttw.com/restaurants/ay-ay-picante"
  }, {
    "id" : 17,
    "title" : "Through the Wire",
    "snippet" : "  I love brass band and second line music. And then there's Irma Thomas. Don't get me started. You should check out local radio from NOLA, streaming at : \n\nHttp://wwoz.org when ever i think of brass, 2 songs come to mind.\n\nhttp://www.youtube.com/watch?v=hZNYMwgHIAg\n\nhttp://www.youtube.com/watch?v=s0dxhSPoBjY I think of:\n\nhttp://www.youtube.com/watch?v=-7Hy7uAb_eU\n\nhttp://www.youtube.com/watch?v=e9RiMwgQP7M http://www.youtube.com/watch?v=DhlPAj38rHc \nthen there is green hornet \nhttp://www.youtube.com/watch?v=jxS7llr8x_4  ",
    "url" : "http://blog.germuska.com/"
  }, {
    "id" : 18,
    "title" : "Free play at Filament Theatre Feb 22-24, 2013",
    "snippet" : "  Tried twice to submit this to Six Corners reddit but it won't let me and I don't have the patience to keep trying, I may read reddit but probably not going to be posting, I don't have that kind of time. email me at\n\nchicagokenji\n@\ngmail.com\n\nlooked at the moderation queue on r/sixcornerschicago, nothing is stuck in it.\n\n\nNot sure your problem or experience, we can talk.\n\nWe wouldn't want to lose you to tech difficulties. First it said I had to wait 9 minutes to post so I tried to repost about 45 minutes later and it still wouldn't let me, something about being new to reddit and not enough upvotes I think. First it said I had to wait 9 minutes to post so I tried to repost about 45 minutes later and it still wouldn't let me, something about being new to reddit and not enough upvotes I think. Tried twice to submit this to Six Corners reddit but it won't let me and I don't have the patience to keep trying, I may read reddit but probably not going to be posting, I don't have that kind of time. Tried twice to submit this to Six Corners reddit but it won't let me and I don't have the patience to keep trying, I may read reddit but probably not going to be posting, I don't have that kind of time. So did they use your stories?  Did it make dad happy?  :)  I'm assuming it will be packed today.  I'm gonna try to go another day. Enjoy! god forbid you'd have to sit next to someone not in a aisle seat? Thank you for understanding. (Actually assumed a \"sell out\" before I could get there closer around 7:30) know whatcha mean, there's something about easy and efficient egress that I too have a hankering for when I'm out and about. Just FYI the show is 90 minutes with no intermission, there are 20 short vignettes so it moves quickly. Just FYI the show is 90 minutes with no intermission, there are 20 short vignettes so it moves quickly. ",
    "url" : "http://www.filamenttheatre.org/crossing-six-corners/"
  }, {
    "id" : 19,
    "title" : "DeRogatis: Congress Theater restoration underway, but it’s got a long way to go",
    "snippet" : "  \"all or parts of the venue have recently been closed by inspectors\" LOL.\n\nInteresting comment by Brendan Diamond about DNA too. Besides this subject, I'm also not impressed with DNAInfo's \"surprisingly gullible and shortsighted reporting\" on other matters either, such as when they gloss over the criminal ties of some when they become \"victims\" of their own gang activity. I'll take the various neighborhood coverage though. No one else is covering local news like they are. Use the pull down for the various neighborhood areas and you get timely news no place else is covering. I navigate that website just fine, thanks. And they don't cover anything of consequence in Albany/Old Irving/Portage/Jefferson/Norwood Parks any better than Nadig does.\n\nIt also appears that Carranza's attempt (with the help of Pa Ricketts' toy, DNAInfo) to get in front of the NEWS posted at the top with a what was essentially a press release has failed. dna and nadig are two different beasts. you only get nadig material once a week on your porch and very little of it has a URL. dna is updated daily and obviously covers the whole city. Living here in Portage it's easy to keep up with Albany, Irving, Belmont Cragin and Hermosa, places that ring us here. Obviously you're a booster of DNA and what passes for \"reporting\" there. That's your perogative. I consider them sub-par at what they do. Carry on....... I dunno about booster, but I see it as a resource. Here's the AM routine:\n\nput coffee on\nopen http://nytimes.com, read front page\ngrab an egg from the fridge, some butter\nheat skillet\nopen http://dnainfo.com, read front page\nplace egg in skillet, cook usually sunnyside up\ndrop bread in toaster\npeel a banana slice onto plate\nplate egg and toast\npour a little OJ or pmoegranate juice\nperuse both nytimes and dna whilst masticating\nget more coffee\n\nthen the day starts Obviously you're a booster of DNA and what passes for \"reporting\" there. That's your perogative. I consider them sub-par at what they do. Carry on....... \"all or parts of the venue have recently been closed by inspectors\" LOL.\n\nInteresting comment by Brendan Diamond about DNA too. Have a look see at the most recent comments on the blog page. A familar name is of the opinion that there should be no oversight of public safety at a privately owned business. Especially this one. I like the username \"MetalMansMacandCheeseMakinMamma\". Likey one of Kenji's aliases \n",
    "url" : "http://www.wbez.org/blogs/jim-derogatis/2013-02/congress-theater-restoration-underway-it%E2%80%99s-got-long-way-go-105685"
  }, {
    "id" : 20,
    "title" : "Police Looking for Man who Groped 10-year-old - Albany Park",
    "snippet" : "  ",
    "url" : "http://www.dnainfo.com/chicago/20130222/albany-park/police-looking-for-man-who-groped-10-year-old"
  }, {
    "id" : 21,
    "title" : "Anyone want to hang out later at PC Here?",
    "snippet" : "  not tonight, going to dunkin for some hot tea now , then going to sleep, did not sleep last night at all.   Better get caffeine free then.  What time you gonna be there? I have an O'hare run at 10:15p. ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/191xe0/anyone_want_to_hang_out_later_at_pc_here/"
  }, {
    "id" : 22,
    "title" : "The meat I got drom Ellengee yesterday and I am cooking today soaked in Woody's.",
    "snippet" : "  Wondering if there would be a gathering at PC Here.  Do you fold yourself on public transportation? Sorry, I do not understand the question. you are a stroller Sorry, I do not understand the question.   Brisket turned out great. cut me a slice",
    "url" : "https://www.facebook.com/photo.php?fbid=10151311137359227&amp;set=a.10150578771509227.379742.561459226&amp;type=1&amp;theater&amp;notif_t=photo_comment"
  }, {
    "id" : 23,
    "title" : "Do you buy meat from a the back of a van?",
    "snippet" : "While at No Chip Queen yesterday, a man walked into the salon and asked if we wanted to buy boxes of meat.  I thought that was the strangest solicitation and never even considered buying meat from the back of a white van -- but others there said they buy all of their meat from another vendor named \"Jesse\".  They raved about restaurant quality, delicious marinades and the convenience of delivery.  Have I been missing something?  Do you buy meat from the back of a van?   Yeah it's common. They stop at ginmills too. Try something simple like a ribeye first to judge his quality. Yeah it's common. They stop at ginmills too. Try something simple like a ribeye first to judge his quality.  I've had a meat van guy come to my front door. He got pissy with me when I told him no. \"Wat'sa matter, buddy, don't you eat meat?! I could see the van parked down the street. It had the name of the company and a picture of various meat products so I felt he was legit. OTH, we occasionally get guys cruising the alley in unmarked cars selling it out of their trunks. As much as I love a good cut of meat, I'm not about to stand over some strange guy's car trunk parked in the alley. But yet you trust some bigass store's styrofoam platter and Saran wrap presentation. At least from the trunk you can put the meat up to your nose and also smell the cooler they are using to carry it around in.  Got word that the meat van is rolling thru today -- I'm lined up to buy a box of steaks.  Woo hooo!! Let us know what cuts you buy and your critique of their product. Exactly - want to hear about it!  I want a meat van to come by my place...   Very common in the city. Usually they say its extra boxes leftover etc. I figure they just buy it cheap and hustle. I've seen small sedans packed with white boxes driving around.\n    \n Alright at least a van could be refrigerated -- but buy from a car trunk?  What's up with that?   Alright at least a van could be refrigerated -- but buy from a car trunk?  What's up with that?   Yup, Ive never bought from them, especially since they do this in the summer heat... However I hear the meats good, prices are decent too. Ill probably roll the dice one of these days.   After reading this thread...I'm almost embarrassed to say that every once in awhile we buy meat from some traveling salesman.  They generally show up on Friday afternoon.  Knock on the door - tell us about all our neighbors buying this way.  Seem to have an official looking van.  Fail. If the van is refrigerated and the meat was good quality, I don't think it's a fail at all!  Aside from someone trying to sell me shrimp out of the trunk of a Buick on 95th and Ashland, I'm embarrassed to say I've just never been exposed to the traveling meat purveyor.  I gotta get out more! :) - it seems like good stuff - no complaints!  That and Costco...my meat buying experiences.  I'm going to send them your way next time....:) I'm going to hunt down this Jesse guy who works Milwaukee Avenue over here.  The ladies at the salon highly recommend him.  I probably wouldn't even open the door if one of these guys showed up unexpectedly at my door.  I'm a Costco freakoid.  The traveling meat van is a bit pricey (despite all the claims of restaurant quality).  I do better @ Costco - but laziness kick in at times and the convenience factor, Friday afternoon, tired and hungry, etc - cave.   I would like to meet Jessie - he might be better!\n I'm going to hunt down this Jesse guy who works Milwaukee Avenue over here.  The ladies at the salon highly recommend him.  I probably wouldn't even open the door if one of these guys showed up unexpectedly at my door.  I'm going to hunt down this Jesse guy who works Milwaukee Avenue over here.  The ladies at the salon highly recommend him.  I probably wouldn't even open the door if one of these guys showed up unexpectedly at my door.  An impromptu run to Deerfield Bakery caused me to miss Jesse this week.  Next time, for sure.",
    "url" : "http://www.reddit.com/r/greatNWside/comments/190v5n/do_you_buy_meat_from_a_the_back_of_a_van/"
  }, {
    "id" : 24,
    "title" : "Wheel repair recommendations NW side",
    "snippet" : "My wife hit a curb and bent the outer rim of my front tire. Anybody have any recommendations? Repair or replace?   Tough to say without pics but not often reparable.   Do you know of an honest wheel guy?  I've never had occasion to require the services of one, but I've found this.\n\nhttp://www.chicagowheelrepair.com/\n\n That's where I took it. $100 and out in under 2 hours. Not how I imagined spending a sick day at work. Thanks, B the E. That's where I took it. $100 and out in under 2 hours. Not how I imagined spending a sick day at work. Thanks, B the E.  i assume the rim job included remounting and rebalance of the wheel and it was done in less then a couple hours, seems like a good deal, if you got a rim from the junkyard and had to remount the tire and rebalance it, it would probably be close to the same price and more time spent going the junkyard route. Rim job?  Is the wheel steel or aluminum? Steel is fixable most of the time. Aluminum Is very risky to fix, so much that not a lot of shops will fix them.  go here in the neighborhood:\n\nhttp://www.yelp.com/biz/majestic-tirestore-rim-and-hub-caps-chicago While they do not repair wheels or straighten bent rims, it is a worthwhile place for used OEM replacement wheels at a decent price or to have a flat fixed. I go elsewhere for everything else. once a rim is bent you'd really want to just replace it, not knock it back into shape then mount a tire on it. Depending on the extent of the damage, they are quite repairable in the hands of a skilled tech with the right equipment. and where would we find one of these guys around here to work on a stock steel rim or an alloy one?\n\nAlso how do you \"bend a rim\" and not do other suspension or steering damage? go here in the neighborhood:\n\nhttp://www.yelp.com/biz/majestic-tirestore-rim-and-hub-caps-chicago I always go to Majestic.  Be prepared that it doesn't have the spit shine of Firestone or Sears, but the prices and service are great. I always go to Majestic.  Be prepared that it doesn't have the spit shine of Firestone or Sears, but the prices and service are great.",
    "url" : "http://www.reddit.com/r/greatNWside/comments/190qg2/wheel_repair_recommendations_nw_side/"
  }, {
    "id" : 25,
    "title" : "Music :: White Mystery",
    "snippet" : " ",
    "url" : "http://www.whitemysteryband.com/music/"
  }, {
    "id" : 26,
    "title" : "Morning roundup, puff piece edition",
    "url" : "http://greatnwside.com/2013/02/22/morning-roundup-puff-piece-edition/"
  }, {
    "id" : 27,
    "title" : "Before there was a Lincoln Village Shopping Center, there were stables. ",
    "snippet" : " ",
    "url" : "http://francesarcher.com/2012/12/they-paved-the-stables-and-put-up-a-parking-lot/"
  }, {
    "id" : 28,
    "title" : "Tributosaurus Performs One-Hit Wonders of the 70s March 8 at Copernicus Center",
    "snippet" : "Scroll down for details\n\nhttp://www.tributosaurus.com/home.cfm",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18yk0u/tributosaurus_performs_onehit_wonders_of_the_70s/"
  }, {
    "id" : 29,
    "title" : "Portage Park Elementary School Gets a Helping Hand",
    "url" : "http://www.dnainfo.com/chicago/20130221/portage-park/portage-park-elementary-school-gets-helping-hand"
  }, {
    "id" : 30,
    "title" : "Fish Fraud",
    "snippet" : "   i guess this was posted just for the \"halibut\" You have sole. i have a \"tun-a' sole\" and i practice what i perch I was gonna say don't perch to the coral, but it sounded crappie. holy mackerel, it is not that bad, it is not like you have a \"big mouth\" or something. \nthe snow is \"smelting\" outside, so things don't look so \"bleak\" since i have to \"trout\" down to the store in a few \"minnows\".\ni have not been \"herring\" what will be going to replace the blockbuster, i guess we \"cod\" start a sugguestion thread by it could be a littel \"roughy\" with everyone wanting coffee shops. it is not my \"tang\" really. Oh, to live the impossible bream.",
    "url" : "http://www.chicagotribune.com/news/local/ct-met-phony-fish-20130221,0,7726323.story"
  }, {
    "id" : 31,
    "title" : "Cook County Commissioner Fritchey @March PPNA Meeting",
    "snippet" : "Cook County Commissioner John Fritchey will give a State of Cook County address at the next PPNA meeting.\nMonday, March 11, 2013 \n7:30 p.m.\n4839 W. Irving Park Rd.",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18yi8g/cook_county_commissioner_fritchey_march_ppna/"
  }, {
    "id" : 32,
    "title" : "Here We Go • An Eddie Carranza Post",
    "snippet" : "Deleterious impact hearing for the Congress Theater happens March 5 2013. Here's the first peep we're hearing from Eddie Carranza in the local news. They've been laying low until now:\n\nhttp://www.dnainfo.com/chicago/20130221/logan-square/congress-theater-owner-wants-restore-it-its-1920s-glory  Wow Jazmine has a fancy new title -- projects manager.  Fitting because the Congress reminds one of the projects.  I like how Eddie compares his security team selling confiscated drugs to a speeding ticket. There was some interesting stuff in the /r/Chicago post about the drug selling at the Congress when it all blew up last month. There was someone in the post mentioning how security gave him and/or a friend a \"pass\" to sell drugs in the theater.\n\nEddie's got a serious uphill battle with the City at this point. This would be one of them.\n\nhttp://www.reddit.com/r/chicago/comments/16orza/congress_theater_eddie_carranza_one_big_load_of/\n\nPay special attention to the hidden comments that \"score below the threshold\". Wow Jazmine has a fancy new title -- projects manager.  Fitting because the Congress reminds one of the projects.  I like how Eddie compares his security team selling confiscated drugs to a speeding ticket. Wow the article was altered to remove the speeding ticket comment and make it seem like he takes the violations more seriously. Since the author (as opposed to \"reporter\") decided to edit out quotes they took from Carranza himself (presumably at his request...a hearing is coming up afterall), I must stop taking that news site seriously. Don't make judgement yet. Victoria the writer said to me she didn't alter the original article. she's asking her editors. Doesn't matter whether it was the author OR the editors. It was altered. I've asked who and why and will post what I find out.  It was kind of a puff piece anyway. Boy was it ever. There was opportunity for a good follow up when the pr person said that at least the bathroom ceilings weren't caving in:  \"what kind of structural work have you done on the theater?\" Because that kind of news would be useful. Painting a few places or swapping out some drywall isn't what I would consider major work - it's cosmetic. But if the cosmetics were delayed all this time because they needed to go in and fix structural things, that would be something I could respect. But that's not what we got in this piece, and it's the second puff piece out of DNAinfo on this subject. I wonder if they require their writers to have journalism degrees. Since the author (as opposed to \"reporter\") decided to edit out quotes they took from Carranza himself (presumably at his request...a hearing is coming up afterall), I must stop taking that news site seriously. He is known for saying provocative things, but maybe he saw how cavalier it looked in print.   Yawn. ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18ycx5/here_we_go_an_eddie_carranza_post/"
  }, {
    "id" : 33,
    "title" : "Morning roundup 0221",
    "url" : "http://greatnwside.com/2013/02/21/morning-0221/"
  }, {
    "id" : 34,
    "title" : "Recommendation for auto shop/brake repair",
    "snippet" : "Looking for the best place on the NW side to fix the brakes/rear end on my Kia Forte without going to the dealer.  Also want somebody who'll give a free estimate, if such a thing exists.  Where on the nw side or where around. Also side note, I have a 2010 kia forte, is your forte a rattle box too? Every fucking bump I lose my sanity a little more. I'm an idiot and never read your name, I assume it's true and you live in Logan square.  I work in the auto industry and hear nothing but good things about Velasquez muffler and brakes on belmont. It's not exactly Logan square but close.  ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18xl5v/recommendation_for_auto_shopbrake_repair/"
  }, {
    "id" : 35,
    "title" : "Paging Tracy Rowan",
    "url" : "http://i.qkme.me/3t2hsu.jpg"
  }, {
    "id" : 36,
    "title" : "Thank You Central Kitchen and Tap",
    "snippet" : "They put out  really nice spread and people stayed til way past 10:30p. it was good to meet everyone. I'm not going to remember a lot of first names though. My guestimate was 50 people showed up last night to the NW side gathering. Here's a few photos:\n\nhttp://db.tt/0HzL9ss5\n\nCentral Kitchen and Tap is the perfect place to hold your gatherings and parties.\n\nhttp://centralkitchenandtap.com/  Do it again! did I meet you last night? You did not, but I live 3 blocks away, just can't do Tuesdays We'll probably do another meet up at PC Here at Six Corners soon, so you know. Obviously not as many people as last night, but Redditors none the less. You did not, but I live 3 blocks away, just can't do Tuesdays Is that Chip &amp; Dale the cartoon chipmunks or Chippendale dancers or Chippendale furniture?",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18w3wx/thank_you_central_kitchen_and_tap/"
  }, {
    "id" : 37,
    "title" : "U.N.I.T.E. Takes on a New Identity, and It's a Real TRIP - Irving Park Neighborhood",
    "snippet" : " ",
    "url" : "http://www.dnainfo.com/chicago/20130220/irving-park/unite-takes-on-new-identity-its-real-trip"
  }, {
    "id" : 38,
    "title" : "Just moved to Edgebrook.  Any advice on places to go for fun?",
    "snippet" : "I'm 25 and just moved to Edgebrook, on the north side of the golf course.  Does anyone have any knowledge of local places to hang out? Good restaurants, or things to see?       ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18xcsl/just_moved_to_edgebrook_any_advice_on_places_to/"
  }, {
    "id" : 39,
    "title" : "Moving... anyone have knowledge of this area?",
    "snippet" : "I'm looking for some insight as to what this part of Irving Park/Independence Park is like, it's the area bounded by N: Montrose, W: Elston, E:Kimball, S: Irving Park.  I'm familiar with, and lived in, Irving Park before but further west on the other side of the expressway and my only ventures over this way are to restaurants and the park.\n\nThe WBEZ gang map says this is prime \"Simon City Royals\" territory and while I take that with a grain of salt (apparently I have spent the last 10 years living in various gang territories without issue) I have a friend who used to live on Kimball there and said it was bad: lots of crime, gunshots, and gang activity.  Walking around at night was a no-no.\n\nThe street the house is on seems nice: well taken care of homes and lawns, no trash, and quiet.  I get the impression that a lot of the people who live there are older with kids or seniors.\n\nAnyone know what it's really like? The plan is to live in the house for a long time and I walk a lot.  Disclaimer: I don't live *exactly* there. I'm north of Montrose, but only one block and I walk down Hamlin to Elston fairly often. The crime really isn't that bad in this area in general. Before I moved to Albany Park, everyone was warning me about gangs. I have never once had to worry about anything here and I have (stupidly) stumbled home drunk at 3 a.m. a few times (which I don't recommend).\n\nAlmost all gang violence is gang-on-gang in this area. Very rarely do non-gang-members get shot. It is kind of quiet in the area, but I love it here. I am planning on moving to the other side of Kimball soon just to be closer to the 'L' but other than that, I have zero issues here.\n\nEDIT: Also, you'd get to live in a place that's in the Albany Park neighborhood and the Irving Park community area. My first time in the area, I got kind of confused about which was which. Awesome, thank you.  I figured it's like most places: there's crime because it's a city and that's just how things are.  My friend's first hand account had me worried on top of the huge orange box of HEY THERE'S A GANG THERE from WBEZ.  Not so much concerned about a random drive by as feeling like I'm trapped in my home from living in a shitty environment, which is how I feel now over in Albany Park. No problem. Hope that helps.\n\nSo you currently live in AP and don't like the environment? Can I ask which side you live on? I'm between Lawrence and Foster, off Kedzie.  My main beef is that it's ridiculously trashy, as in, garbage everywhere on the streets.  My ten minute walk to the brown line is like walking through a landfill and I've watched people leave bottles or trash on the sidewalks.  People don't care about their homes, lawns, cars, businesses, nothing.  It just feels run down and like everyone gave up.  I moved over here thinking I could go for walks like I did in Irving, go to the park by the river, but I just feel depressed looking outside.  The area west to Kimball looks much nicer but between Fransisco and Kedzie it's kind of a shithole. Good to know. My block is hit and miss. I'm off of Central Park near Sunnyside and it's block by block here. I generally don't go north of Lawrence. I'm mostly on Kedzie or Lawrence, or walking to the Brown Line from here. But yeah, the trash can suck sometimes.  I think EB Chris lives over by dere, maybe he will weigh in. I meant Chris from EB.  He says it's much better than it was two years ago.\n\nhttp://www.reddit.com/r/SixCornersChicago/comments/15s8yh/ever_been_banned_from_everyblockcom/\n I'm travelling this week, will write more when I return. Yes, I live in the heart of that area, and have as a single family home owner for 5 years now. Prior I lived as a renter in Logan for 13 years.\n\nI like it for the most part. 2 years ago though, we had some bad problems, mainly confined to 4000 block of Bernard, and 4100 block of Monticello, all gang related.\n\nSCR's are so weak now its a joke. Most active gang is SGD, and they are active, though have now taken more root north of Montrose.\n\nOur area has been very quiet now for a year, honest.\n\nWe have a VERY strong neighborhood group in these boundaries that is purely anti crime, IPCNA, meets monthly.\n\nBeing able to walk to tony's for grcoceries, by gadren supplies at garden center, walk to blue line, home depot and target nearby are god sends.\n\nThe biggest ongoing trouble area is north side of Montrose ans Kimball and cullom corner.\n\nThat help. Please don't hesitate asking anything you can think of, just be patient on my response as I'm travelling. But I am very active in community and caps and can give you the low down. I'm travelling this week, will write more when I return. Yes, I live in the heart of that area, and have as a single family home owner for 5 years now. Prior I lived as a renter in Logan for 13 years.\n\nI like it for the most part. 2 years ago though, we had some bad problems, mainly confined to 4000 block of Bernard, and 4100 block of Monticello, all gang related.\n\nSCR's are so weak now its a joke. Most active gang is SGD, and they are active, though have now taken more root north of Montrose.\n\nOur area has been very quiet now for a year, honest.\n\nWe have a VERY strong neighborhood group in these boundaries that is purely anti crime, IPCNA, meets monthly.\n\nBeing able to walk to tony's for grcoceries, by gadren supplies at garden center, walk to blue line, home depot and target nearby are god sends.\n\nThe biggest ongoing trouble area is north side of Montrose ans Kimball and cullom corner.\n\nThat help. Please don't hesitate asking anything you can think of, just be patient on my response as I'm travelling. But I am very active in community and caps and can give you the low down. ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18wand/moving_anyone_have_knowledge_of_this_area/"
  }, {
    "id" : 40,
    "title" : "Sewer valve plumber recommendation",
    "snippet" : "The demise of EB gobbled up several bookmarked threads, including one where I sought advice on a decent, affordable company to give me a quote on a sewer check valve and/or additional flood control apparatus.\n\nThis thread is an attempt to reconstitute that resource, for my benefit and hopefully others who find their way here. This is a big-time home improvement job that many are no doubt considering.\n\nI'll go first.\n\nI had Xpert Flood Control come out and scope out my sewer. It was mercifully clear of roots and remarkably intact all the way to the street, no cracks or shifts or anything. Hurray! I asked for a quote on a flood control system and they presented me with The Cadillac as I refer to it, a $7600 package with more valves and electric pumps than I could shake a stick at.\n\nI'm looking for a cheaper, simpler option. Just a valve on my sewer line, with an access point in my yard so I can pop it open if it gets stuck. Called REI Plumbing (the only one I could remember from the old EB thread) twice and haven't yet received a return call.\n\nAny suggestions for who to call? ",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18w7tl/sewer_valve_plumber_recommendation/"
  }, {
    "id" : 41,
    "title" : "Chicago Fringe Festival coming to Jeff Park",
    "snippet" : "Just in from TimeOut Chicago, Chicago Fringe Festival is moving from Pilsen to....Jefferson Park.  Yay.  http://timeoutchicago.com/arts-culture/theater/16081496/chicago-fringe-festival-moves-to-jefferson-park",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18wzex/chicago_fringe_festival_coming_to_jeff_park/"
  }, {
    "id" : 42,
    "title" : "Brother of Teen Who Brought Gun to School Threatened Teacher: Prosecutors",
    "snippet" : "  What a coincidence!  He \"finds\" a gun and \"forgets\" he has it shortly after his sibling threatens to kill a teacher.  And if he forgot, why did he try to hand off the bag to mom?",
    "url" : "http://www.dnainfo.com/chicago/20130220/portage-park/brother-of-teen-who-brought-gun-school-threatened-teacher-prosecutors"
  }, {
    "id" : 43,
    "title" : "Morning roundup 0220",
    "snippet" : "  ",
    "url" : "http://greatnwside.com/2013/02/20/morning-roundup-0220/"
  }, {
    "id" : 44,
    "title" : "Kung Fu Triple Feature - Portage Theater - Sat Feb 23",
    "url" : "http://www.portagetheater.com/Events/178/35mm-kung-fu-action-triple-feature/"
  }, {
    "id" : 45,
    "title" : "What is Reddit?",
    "snippet" : "    Kenji, we are skewing the median age.\n\n\"the median U.S. Reddit user is male (72%), 25–34 years of age\" And I'll arm wrestle any of them! I will Greco-Roman wrestle them.  ",
    "url" : "http://en.wikipedia.org/wiki/Reddit"
  }, {
    "id" : 46,
    "title" : "this shit bugs me sometimes",
    "snippet" : "   ",
    "url" : "http://www.reddit.com/r/chicago/comments/18vhvz/whaaaat_is_going_on_at_six_corners_right_now/"
  }, {
    "id" : 47,
    "title" : "Try our Reddit in a daily/weekly/month view - check this out!",
    "url" : "http://www.redditweekly.com/weekly?s=top&amp;subreddit=greatNWside"
  }, {
    "id" : 48,
    "title" : "History of Bribing Aldermen",
    "url" : "http://www.wbez.org/blogs/john-r-schmidt/2013-02/2-19-1894-your-city-council-work-105492"
  }, {
    "id" : 49,
    "title" : "Roberts Square Park Advisory Committee Meeting • Wed Feb 29 7pm",
    "snippet" : "Roberts Square Park Advisory Committee Meeting • Wed Feb 29\n\nJust a reminder that we will be meeting next week on Wednesday, February 20th at 7:00 pm at the Jefferson Park Field House, 4822 N. Long Ave. . An agenda will be handed out beforehand, and there are some exciting updates on the participatory budgeting process!\n\nhttp://facebook.com/RobertsSquareParkAdvisoryCouncil",
    "url" : "http://www.reddit.com/r/greatNWside/comments/18tnti/roberts_square_park_advisory_committee_meeting/"
  } ],
  "processing-time-source" : 71,
  "processing-result.title" : "greatnwside0_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/greatnwside0_reddit.xml"
  }
}