{
  "processing-time-total" : 1353,
  "clusters" : [ {
    "id" : 0,
    "size" : 8,
    "score" : 48.940092924466605,
    "phrases" : [ "Feel Like" ],
    "documents" : [ 8, 13, 17, 29, 42, 45, 46, 49 ],
    "attributes" : {
      "score" : 48.940092924466605
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 53.06284042318788,
    "phrases" : [ "Night" ],
    "documents" : [ 8, 15, 26, 28, 42, 46, 47 ],
    "attributes" : {
      "score" : 53.06284042318788
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 40.0108122521459,
    "phrases" : [ "Telling his Kids" ],
    "documents" : [ 13, 28, 39, 45, 47, 49 ],
    "attributes" : {
      "score" : 40.0108122521459
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 85.92768075225896,
    "phrases" : [ "Robin was Marrying Barney" ],
    "documents" : [ 6, 8, 17, 45, 49 ],
    "attributes" : {
      "score" : 85.92768075225896
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 58.65355415673096,
    "phrases" : [ "Actually Watched HIMYM first and Just" ],
    "documents" : [ 13, 17, 46, 49 ],
    "attributes" : {
      "score" : 58.65355415673096
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 65.69884426349141,
    "phrases" : [ "Good Guy" ],
    "documents" : [ 2, 8, 13, 49 ],
    "attributes" : {
      "score" : 65.69884426349141
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 46.56093543112972,
    "phrases" : [ "Jeanette" ],
    "documents" : [ 17, 21, 29, 42 ],
    "attributes" : {
      "score" : 46.56093543112972
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 39.24504660997276,
    "phrases" : [ "Job" ],
    "documents" : [ 8, 13, 15, 20 ],
    "attributes" : {
      "score" : 39.24504660997276
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 68.92522661687593,
    "phrases" : [ "Right Guys" ],
    "documents" : [ 8, 13, 17, 29 ],
    "attributes" : {
      "score" : 68.92522661687593
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 93.23761264461092,
    "phrases" : [ "Saying that after Season" ],
    "documents" : [ 8, 36, 47, 49 ],
    "attributes" : {
      "score" : 93.23761264461092
    }
  }, {
    "id" : 10,
    "size" : 4,
    "score" : 25.647154500576384,
    "phrases" : [ "Things that has Happened" ],
    "documents" : [ 8, 24, 42, 49 ],
    "attributes" : {
      "score" : 25.647154500576384
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 27.21208854050011,
    "phrases" : [ "CBS" ],
    "documents" : [ 13, 32, 37 ],
    "attributes" : {
      "score" : 27.21208854050011
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 75.28643562332856,
    "phrases" : [ "Desperation Day" ],
    "documents" : [ 5, 11, 30 ],
    "attributes" : {
      "score" : 75.28643562332856
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 52.545333806152435,
    "phrases" : [ "Fact that Ted" ],
    "documents" : [ 6, 8, 45 ],
    "attributes" : {
      "score" : 52.545333806152435
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 51.55911205486694,
    "phrases" : [ "Favorite" ],
    "documents" : [ 31, 41, 42 ],
    "attributes" : {
      "score" : 51.55911205486694
    }
  }, {
    "id" : 15,
    "size" : 3,
    "score" : 22.05483208250462,
    "phrases" : [ "Getting such Hate" ],
    "documents" : [ 13, 45, 46 ],
    "attributes" : {
      "score" : 22.05483208250462
    }
  }, {
    "id" : 16,
    "size" : 3,
    "score" : 53.49272423905617,
    "phrases" : [ "Valentine's Day" ],
    "documents" : [ 4, 10, 11 ],
    "attributes" : {
      "score" : 53.49272423905617
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 40.762883109068085,
    "phrases" : [ "Subreddit" ],
    "documents" : [ 33, 40 ],
    "attributes" : {
      "score" : 40.762883109068085
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 55.92158964997431,
    "phrases" : [ "WOAH WOAH" ],
    "documents" : [ 17, 18 ],
    "attributes" : {
      "score" : 55.92158964997431
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 49.8081848363799,
    "phrases" : [ "X-post" ],
    "documents" : [ 12, 27 ],
    "attributes" : {
      "score" : 49.8081848363799
    }
  }, {
    "id" : 20,
    "size" : 17,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 1, 3, 7, 9, 14, 16, 19, 22, 23, 25, 34, 35, 38, 43, 44, 48 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1259,
  "documents" : [ {
    "id" : 0,
    "title" : "Can't seem to figure out Tune/Music used in \"Bad Crazy\"",
    "snippet" : "I can't seem to figure out what the bit of music that's used each time in the scene(s) from the most recent episode, set in the future where Robin tries to confess to Lilly about what exactly happened when she left her alone with Marvin to retrieve his favourite Binky. I was hoping a more resourceful redditor might be able to help me out perhaps. It's a particularly chirpy/happy sounding piece that's played as they throw the exterior of the apartment before it cuts to one of them saying \"we really should do this more often\".. I've tried all the usual sites and what not but can't seem to find it :(  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18lejc/cant_seem_to_figure_out_tunemusic_used_in_bad/"
  }, {
    "id" : 1,
    "title" : "Hot Dog Buying guy has totally moved up in the world...",
    "snippet" : "  I've known about it, I forget his name, but he is like, the most famous \"Extra\" ever.  He was also on tonight's episode of Big Bang Theory. I've known about it, I forget his name, but he is like, the most famous \"Extra\" ever.  He was also on tonight's episode of Big Bang Theory. http://www.youtube.com/watch?v=IdEBu7ODVk8 I saw this video ages ago and now I can't not see him pop up.. He's in Transformers 3 too and kind of milks it when walking past the camera.. I've known about it, I forget his name, but he is like, the most famous \"Extra\" ever.  He was also on tonight's episode of Big Bang Theory. I've known about it, I forget his name, but he is like, the most famous \"Extra\" ever.  He was also on tonight's episode of Big Bang Theory.   ",
    "url" : "http://imgur.com/pnWBEne"
  }, {
    "id" : 2,
    "title" : "Good guy jynx",
    "snippet" : "  [Jynx?](http://cdn.bulbagarden.net/upload/7/7c/124Jynx.png)",
    "url" : "http://qkme.me/3t03lm"
  }, {
    "id" : 3,
    "title" : "Now I see where the writers get their ideas",
    "snippet" : " ",
    "url" : "http://imgur.com/pRFo5Nb"
  }, {
    "id" : 4,
    "title" : "How will I be spending my valentines day?",
    "url" : "http://i.imgur.com/4LHBTnj.jpg"
  }, {
    "id" : 5,
    "title" : "How I looked when I realized I forgot Desperation Day",
    "snippet" : "  SHIT! I FORGOT DESPERATION DAY!  Saved my day! High V!",
    "url" : "http://4.bp.blogspot.com/-B-l0Q6SAUfo/Trx6KL2RsEI/AAAAAAAAAGE/E3CQ90jAJ8I/s1600/how-i-met-your-mother-20110810050458579.jpg"
  }, {
    "id" : 6,
    "title" : "The whole ring thing from the last episode...",
    "snippet" : "I wasn't so eagle eyed when I watched the episode, but I'm curious as to what everybody thinks of Robin not wearing her engagement ring. I know Robin &amp; Barney do get married, but there's no mention of divorce.\n\nI'm of the mindset that it's nothing to worry about, but perhaps I'm wrong. I'm just sick of the back-and-forth between Robin &amp; Ted. \n\nPROOF: http://i.imgur.com/NDoasID.jpg  In the future, she would be wearing the wedding ring, not the engagement ring.\n\nMost likely this is a production oversite. Is Lily wearing hers in the scene? I believe Lily was wearing her ring in the future. In the 2013 portion of the show you can still see Robin's engagement ring and it is clearly gone when she flashes her hand in the future. 'Flashes' being the operative term here. She is quite clearly supposed to be hiding her hand throughout, meaning that whether the ring is there or not when she accidentally flashes her hand isn't significant, but rather the fact they're hiding it in the first place to create suspense. (Much like they did with Barney in Trilogy Time last season.) That's what confuses me. Why would they make Cobie hide her hand? It was understandable when Neil did it in Trilogy Time (since we knew a lot less on Barney's marriage) but now they've confirmed several times Barney and Robin will get married. I guess they could be doing this because of the people who are not reading spoilers and who could still wonder if they'll go through with the wedding.\nI just hope they're not planning on separating them in the future.\n I assume it's because they want to play up the suspense with the whole \"Wedding day that went horribly wrong\" thing. It makes very little sense at this point, since not only have they confirmed it in interviews that Barney and Robin do get married, but there was also the flashforward of Robin dancing with her father at the wedding. But then, considering there still are people who think Robin may be the Mother, I'm sure there are those who expect the wedding to fall through, too. It's possible that the hiding would be to suggest that the marriage might not last, but I find that very unlikely, considering how much build-up there's been, and the way they've been presenting Barney and Robin as \"the One\" for each other in the past seasons.\n\n(And for the record, she is definitely [hiding her hand on purpose](http://barneyrobin.livejournal.com/980851.html).)  I definitely agree. I'm not questionning if it was done on purpose, since it clearly seemed so to me (even though more natural than the Trilogy Time scene, mainly because of the way Cobie's scene was shot), I just fail to see their reasons. You're probably right about the fact there's still people who want Robin to be the mother and hope there'd be some final twist. I don't know what could possibly cause them to continue encouraging this theory, now that we know so many things about the mother. Things like this scene and Marshall's \"not yet\" are just puzzling me.      ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18kder/the_whole_ring_thing_from_the_last_episode/"
  }, {
    "id" : 7,
    "title" : "Good luck everyone! Hopefully this will be you later tonight !",
    "url" : "http://www.youtube.com/watch?v=67HsIC_UAP8"
  }, {
    "id" : 8,
    "title" : "We all saw it...",
    "snippet" : "  You forgot the most important moment.  \n\n\"You just know she likes it dirty\"  I called it right after watching the first episode when Ted calls her Aunt Robin. Glad it ended up this way.\n\nTo be fair I still want the mom to be Victoria. Always loved her. Early series Victoria, not season 8 Victoria. She'll always be as she was back then to me... I just blame the writers for blemishing her like that. So lame. I like to think of season 8 Victoria as what happens when the \"one\" goes wrong. \n\nLike think about your SO right now. What if you had met a few years earlier or later than you did. Odds are you would have been different people. Would you still have fallen in love? Would things be as good as they are now? \n\nVictoria is that girl for Ted. He met her twice. Once too early and the other too late.  That's a beautiful way to put it.  I like to think of season 8 Victoria as what happens when the \"one\" goes wrong. \n\nLike think about your SO right now. What if you had met a few years earlier or later than you did. Odds are you would have been different people. Would you still have fallen in love? Would things be as good as they are now? \n\nVictoria is that girl for Ted. He met her twice. Once too early and the other too late.  I like to think of season 8 Victoria as what happens when the \"one\" goes wrong. \n\nLike think about your SO right now. What if you had met a few years earlier or later than you did. Odds are you would have been different people. Would you still have fallen in love? Would things be as good as they are now? \n\nVictoria is that girl for Ted. He met her twice. Once too early and the other too late.  I called it right after watching the first episode when Ted calls her Aunt Robin. Glad it ended up this way.\n\nTo be fair I still want the mom to be Victoria. Always loved her. This comment makes me happy. None of my friends that watch the show liked Victoria, but I mean come on they had the \"perfect night\". I also knew she would come back, but not in the way she did. I think I fell in love with Victoria before Ted did. I don't mean to sound pompous or anything. I just wanted it to be her even though I knew it couldn't be. I think she was the backup Mother just in case the series didn't continue to Season 2. Correct. Which always led me to believe that the Mother would never be Carly. She would be someone that was working at the wedding.   You forgot [this moment](http://sites.psu.edu/schneiderrclblog/files/2012/11/fat-barney.jpg).  Why the hell does nobody think this might happen again!? Because it wouldn't make sense story wise considering the whole character development they have gotten and their relationship build up for at least two seasons to be again squashed b/c of that. When i look at the quality of this seasons writing i'd say everything is possible.  Because it wouldn't make sense story wise considering the whole character development they have gotten and their relationship build up for at least two seasons to be again squashed b/c of that. It just seems like despite all that, the core bits of them that led to it are still there. The core being Barney's disinterest in relationships and Robin's fear of commitment? Those two are resolved. \n\nBarney has gotten his abandonment issues in control since knowing his father, and Robin is not afraid of commitment after she gave up the Chicago job for Don. Yeah, Don dumped her but the idea behind that relationship was that Robin could get over her fear of commitment. Why the hell does nobody think this might happen again!? You forgot [this moment](http://sites.psu.edu/schneiderrclblog/files/2012/11/fat-barney.jpg).  You forgot [this moment](http://sites.psu.edu/schneiderrclblog/files/2012/11/fat-barney.jpg).  i don't remember this, what episode?  I didn't see it. I still don't see it. No one seems to remember how HORRIBLE they made each other feel when they were together the first time. \n\nSure, maybe they've grown as people and will work this time, but to me they feel really forced. \n\nI still don't think they'll get married. I could be wrong, but I'll believe it when I see it. http://2.bp.blogspot.com/-s5KLvZmbFfg/T8UdebIMcEI/AAAAAAAABQ4/XaSWcVsnfmM/s200/ryan-pointing-the-office.gif I didn't see it. I still don't see it. No one seems to remember how HORRIBLE they made each other feel when they were together the first time. \n\nSure, maybe they've grown as people and will work this time, but to me they feel really forced. \n\nI still don't think they'll get married. I could be wrong, but I'll believe it when I see it. I didn't see it. I still don't see it. No one seems to remember how HORRIBLE they made each other feel when they were together the first time. \n\nSure, maybe they've grown as people and will work this time, but to me they feel really forced. \n\nI still don't think they'll get married. I could be wrong, but I'll believe it when I see it. Robin's left hand was hidden in every scene from the future in the last episode.  They seemed to make a clear effort not to show a ring or lack thereof. They did the same thing with the flash-forward where Barney, Ted, and Marshall are watching Star Wars.\n\nHonestly, though, as much as I don't think it fits for them to be together, I'd rather let their drama end so we can get back to Ted and the Mother. Seems like Ted has been a supporting character these last seasons, instead of the focus. I'm fine with it, I agree, but I just feel like the producers have some twist up their sleeve.  Maybe they're just future-proofing current episodes, but I feel like that saga may not yet be finished.\n\nI agree about Ted though, I just wish they would do something worthwhile with him.  Lately I'd rather watch Lily or the Barnacle than anything to do with Ted's miserable life. I doubt it. The series will end next season. That's not really enough time to meet a new characters for barney, robin and Ted and have it all wrap up neatly.  They don't all have to end up happy/together!\n\nThere are always hijinx they can play.  I'm still waiting to hear something about a surrogate for Robin or the ol' switcheroo where the voiceover says \"Aunt robin is actually ____....\"  Especially as the series gets deeper into the constant renewal cycle. True. But I would rather the show focus more on Ted now. Let barney and riven be happy. The show doesn't need to be bogged down by going over them again. And I would find it really hard for them to stay friends if things don't work again. I mean things almost didn't work out for them when they first broke up and then barney started being unhappy and blah blah blah. We don't need to see all that again. Besides in the episode \"band or dj?\" It showed the reception. Those usually happen after a marriage. Then something happed and Ted hurts his hand and all that but they do get married. Maybe future Ted will say that many years down the line maybe the divorce or some thing.  Maybe barney and Robin get to the alter and...\n\nPreist: Do you take Robin?\n\nBarney: NO!\n\nRobin: Thank God! I don't either! Still bros?\n\nBarney: Bros! Let's go party at the already paid for reception! Maybe barney and Robin get to the alter and...\n\nPreist: Do you take Robin?\n\nBarney: NO!\n\nRobin: Thank God! I don't either! Still bros?\n\nBarney: Bros! Let's go party at the already paid for reception! Haha that could happen, but I doubt it cause it would piss so many people off. True. But I would rather the show focus more on Ted now. Let barney and riven be happy. The show doesn't need to be bogged down by going over them again. And I would find it really hard for them to stay friends if things don't work again. I mean things almost didn't work out for them when they first broke up and then barney started being unhappy and blah blah blah. We don't need to see all that again. Besides in the episode \"band or dj?\" It showed the reception. Those usually happen after a marriage. Then something happed and Ted hurts his hand and all that but they do get married. Maybe future Ted will say that many years down the line maybe the divorce or some thing.  Robin's left hand was hidden in every scene from the future in the last episode.  They seemed to make a clear effort not to show a ring or lack thereof. I didn't see it. I still don't see it. No one seems to remember how HORRIBLE they made each other feel when they were together the first time. \n\nSure, maybe they've grown as people and will work this time, but to me they feel really forced. \n\nI still don't think they'll get married. I could be wrong, but I'll believe it when I see it. I didn't see it. I still don't see it. No one seems to remember how HORRIBLE they made each other feel when they were together the first time. \n\nSure, maybe they've grown as people and will work this time, but to me they feel really forced. \n\nI still don't think they'll get married. I could be wrong, but I'll believe it when I see it.      What is wrong with barney's hair in that last frame?     Should this not have a spoiler tag?\n\n\n\nEdit: My mistake   Just gonna say it...anyone who says they saw it coming years ago is full of shit.\n\nThey have plugged the whole Ted/Robin thing the entire run of the show. It is only in the 6th season that they started planting these little seeds about Robin and Barney, and even that was only in a couple episodes (Subway Wars and Challenge Accepted).  Did you skipped season 4 and 5 ,seeds were sowed in season 3 actually when they first time hooked up. Did you skipped season 4 and 5 ,seeds were sowed in season 3 actually when they first time hooked up. Just gonna say it...anyone who says they saw it coming years ago is full of shit.\n\nThey have plugged the whole Ted/Robin thing the entire run of the show. It is only in the 6th season that they started planting these little seeds about Robin and Barney, and even that was only in a couple episodes (Subway Wars and Challenge Accepted).  You know what was a really big giveaway that Ted would not wind up with Robin? The fact that Ted refers to Robin as \"Aunt Robin\" at the end of the pilot episode. \n\nI was sure they would end up together for a brief period of time, but eventually they'd break up. I didn't realize the entire show would be about Ted getting over Robin and the series of event that led him to the mother though.\n\nBarney has been planting seeds with Robin since season 1. He treats needy, clingy, stupid woman like garbage. Robin is the first girl he really seemed to respect and romantically like. The rest was just an inference - if you've ever hung out in a decent sized group of guys and gals, usually 2 fall for one another. Given the group comp (Marshall + Lily, Ted + future mosby, and barney/robin) it's not too much of a stretch for us to have seen them getting together. Of course he called her that, doesn't mean the show hasn't plugged it the whole time. \"Aunt Robin\" meant that she'll be that one that dogs him for years (according to how the show has gone). People need to realize (a lot like Lost fans) that there was no overall plan. Even this season they have said they've been stretching for plot because they didn't know how long they'd be going. \n\nBarney and Robin were only planned together from about the 6th season (period in between 5 &amp; 6 perhaps). Its just how it is, if fans want to believe more they can but they're diluting themselves. The two guys behind the show have stated they always knew the major points of the story - who was going to end up together, etc. So the rough outline was there. They just didn't know how much time they would have to tell the story. And sacrifices would have to be made (i.e if the show had shit ratings, Victoria would be the mother from S1). Those are just backups just in case you get cancelled in between, you dont wan't to leave a story REALLY fucked up and undone.\n\nRemember some aspects of the show are loosely based on their lives. Although if I recall correctly, I think that would cover Ted/Marshal + Lily, rather than the whole gang. \n\nOne of the things the directors are big on is putting in clues/foreshadowing events. Now what they imply may or may not happen, but people tend to make predictions based on these clues. And when they come true, it's that \"a-ha!\" moment, and the assumptions turned out to be right. If it goes down like that, they saw it coming. Now of course they're always the people who shoot in the dark and are right by chance, but I feel there's enough circumstantial evidence and hints through S1-8 to justify getting a feeling earlier than S6 barney and robin would wind up together. \n\nA bunch of factors come into play when it comes to writing (pandering to fans, changing major plot points to appease them) but I like to believe the directors when they say they knew from EP1 Barney would wind up with Robin because it makes perfect sense. I agree with you that the timing of it was an unknown variable (how many seasons would they run for, etc) but the event itself was given from day 1. They just admitted in the TVFanatic interview this last November that they didn't decide Barney and Robin would wind up together till the end of season 5. Interviews are inconsistent, but fans want showrunners to be all-knowing. They aren't. Most shows are pitched without a full concept. This is one of them. Ahh what the hell? Did not know that! My apologies then - I read a bunch of interviews with the showrunners from the end of S7 onwards (curious as to when the show was actually ending since it felt like it was dragging on). During Q&amp;A they claimed they knew Robin/Barney from the start. That's the only reason I was harping that point.\n\nOh of course. No point in a fully completed concept - if your ratings are garbage S1, the rest of your story will remain untold lol\n\nDo you happen to still have the source link for that interview? I'd be interested in reading it.  Ahh so they finally emasculated Barney ? \n\nnot shocked. \n Lol character development is now emasculation? no, Character development is awesome. \n\nBut completely changing the character, and having him do a 180 Degree turn from being a philandering ladies man, to a married, well behaved one is at best, jarring. \n\n They were in their mid to late 20s when the first season started, and now it's been 8-9 years in the show. I think after that many years of empty one night stands and gradual ventures into failed relationships, it makes sense for Barney to grow up and evaluate what he really wants out of life. They coaxed it out of him as well - Nora was one the first that made him realize he wouldn't mind settling down (which scared the crap out of him).\n\nYou think anybody ever real wants to be that 80 year old man trying to pick up chicks at a bar? Barney has proved several times that his persona is somewhat a facade right from the beginning. S1 / 2 all he does is shit on the idea of marriage - then he flies out to SF to get Lily back with Marshall (after keeping chicks away from Marshall). \n\nHe's not really well behaved either, he realized what Robin means to him and he's not going to fuck it up being stupid. Half his antics and humor came from chasing women and lying to them. Clearly he can't do that now that he's getting married.\n\nIf he would have changed that drastically from say, S1 to S3, i'd be calling BS as well. But after 8 seasons, I'll chalk it up to character development. Not that it really matters but I think Barney was 30 or 31 in the first season. Totally agree though upvote for you. I always thought he met Ted when they were the same age - 23. The Star Wars trilogy episode was a pretty good indicator of how old they actually are in the series No they definitely aren't the same age. During the hurricane episode Barney says \"I'm older than you.\" Ted says \"yeah?\" \"And taller\" \"no just older\" \"and when you get to reach my age and height...\" And just after sandcastles in the sand Ted asked how I feels to be thirty. True. Wikipedia said that Barney (76) is two years older than Ted (78). First season was 2005 or 2006, which would make them both in their late 20s ",
    "url" : "http://imgur.com/e4LBF4r"
  }, {
    "id" : 9,
    "title" : "An official and exclusive new photo of the cast, sure to bring up a few sweet memories!",
    "snippet" : "  The pineapple! I hope they explain it.  The pineapple! I hope they explain it.  The pineapple! I hope they explain it.    can you link it so it is not through facebook https://www.facebook.com/photo.php?fbid=10151472444112277&amp;set=a.66208372276.69342.7807422276&amp;type=1 copy paste this into your browser instead\n ",
    "url" : "https://www.facebook.com/photo.php?fbid=10151472444112277&amp;set=a.66208372276.69342.7807422276&amp;type=1"
  }, {
    "id" : 10,
    "title" : "Happy Valentine's Day, everyone!",
    "snippet" : " ",
    "url" : "http://www.imdb.com/title/tt0093773/?ref_=sr_1"
  }, {
    "id" : 11,
    "title" : "Best/chronological Barney and Robin episodes?",
    "snippet" : "In light of Valentine's Day today, I want to watch the romance of Barney and Robin unfold all over again. What are the best episodes to watch from the very start that highlight their relationship?  Here are all the ones with significant \"moments\" in them, be they friendly or romantic. \n\n**Season 1:**\nThe Pilot (1x01)\nPurple Giraffe (1x02)\nReturn of the Shirt (1x04)\nThe Slutty Pumpkin (1x06)\nZip, Zip, Zip (1x14)\n\n**Season 2:**\nSlap Bet (2x09)\nHow Lily Stole Christmas (2x11)\n\n**Season 3:**\nWe're Not From Here (3x02)\nSandcastles in the Sand (3x16)\nThe Goat (3x17)\nMiracles (3x20)\n\n**Season 4:**\nDo I Know You? (4x01)\nShelter Island (4x05)\nThe Fight (4x10)\nBenefits (4x12)\nThe Possimpible (4x14)\nThe Stinsons (4x15)\nMurtaugh (4x19)\nMosbius Designs (4x20)\nThe Leap (4x24)\n\n**Season 5:**\nDefinitions (5x01)\nDouble Date (5x02)\nRobin 101  (5x03)\nThe Sexless Innkeeper (5x04)\nDuel Citizenship (5x05)\nBagpipes (5x06)\nThe Rough Patch (5x07)\nThe Playbook (5x08)\nOf Course (5x17)\nTwin Beds (5x21)\n\n**Season 6:**\nSubway Wars (6x04)\nBaby Talk (6x06)\nNatural History (6x08)\nDesperation Day (6x16)\nGarbage Island (6x17)\nThe Exploding Meatball Sub (6x20)\nHopeless (6x21) \nChallenge Accepted (6x24)\n\n**Season 7:**\nThe Best Man (7x01)\nThe Stinson Missile Crisis (7x04)\nDisaster Averted (7x09)\nTick Tick Tick (7x10)\nThe Rebound Girl (7x11)\nSymphony of Illumination (7x12)\nTrilogy Time (7x20)\nThe Magician's Code - Part Two (7x24)\n\n**Season 8:**\nFarhampton (8x01)\nThe Pre-Nup (8x02)\nThe Autumn of Break-Ups (8x05)\nSplitsville (8x06)\nThe Stamp Tramp (8x07)\nTwelve Horny Women (8x08)\nLobster Crawl (8x09)\nThe Over-Correction (8x10)\nThe Final Page - Part Two (8x12)\nBand or DJ? (8x13)\nRing Up (8x14)\nP.S. I Love You (8x15)\n\nEdit: I threw in the Pilot and Purple Giraffe (1x02) for good measure. Also Slutty Pumpkin (1x06). In that episode, Robin refused to dress up/look like an idiot with her boyfriend, but later in The Slutty Pumpkin Returns (7x08), she does so very willingly for Barney. It's cute. Here are all the ones with significant \"moments\" in them, be they friendly or romantic. \n\n**Season 1:**\nThe Pilot (1x01)\nPurple Giraffe (1x02)\nReturn of the Shirt (1x04)\nThe Slutty Pumpkin (1x06)\nZip, Zip, Zip (1x14)\n\n**Season 2:**\nSlap Bet (2x09)\nHow Lily Stole Christmas (2x11)\n\n**Season 3:**\nWe're Not From Here (3x02)\nSandcastles in the Sand (3x16)\nThe Goat (3x17)\nMiracles (3x20)\n\n**Season 4:**\nDo I Know You? (4x01)\nShelter Island (4x05)\nThe Fight (4x10)\nBenefits (4x12)\nThe Possimpible (4x14)\nThe Stinsons (4x15)\nMurtaugh (4x19)\nMosbius Designs (4x20)\nThe Leap (4x24)\n\n**Season 5:**\nDefinitions (5x01)\nDouble Date (5x02)\nRobin 101  (5x03)\nThe Sexless Innkeeper (5x04)\nDuel Citizenship (5x05)\nBagpipes (5x06)\nThe Rough Patch (5x07)\nThe Playbook (5x08)\nOf Course (5x17)\nTwin Beds (5x21)\n\n**Season 6:**\nSubway Wars (6x04)\nBaby Talk (6x06)\nNatural History (6x08)\nDesperation Day (6x16)\nGarbage Island (6x17)\nThe Exploding Meatball Sub (6x20)\nHopeless (6x21) \nChallenge Accepted (6x24)\n\n**Season 7:**\nThe Best Man (7x01)\nThe Stinson Missile Crisis (7x04)\nDisaster Averted (7x09)\nTick Tick Tick (7x10)\nThe Rebound Girl (7x11)\nSymphony of Illumination (7x12)\nTrilogy Time (7x20)\nThe Magician's Code - Part Two (7x24)\n\n**Season 8:**\nFarhampton (8x01)\nThe Pre-Nup (8x02)\nThe Autumn of Break-Ups (8x05)\nSplitsville (8x06)\nThe Stamp Tramp (8x07)\nTwelve Horny Women (8x08)\nLobster Crawl (8x09)\nThe Over-Correction (8x10)\nThe Final Page - Part Two (8x12)\nBand or DJ? (8x13)\nRing Up (8x14)\nP.S. I Love You (8x15)\n\nEdit: I threw in the Pilot and Purple Giraffe (1x02) for good measure. Also Slutty Pumpkin (1x06). In that episode, Robin refused to dress up/look like an idiot with her boyfriend, but later in The Slutty Pumpkin Returns (7x08), she does so very willingly for Barney. It's cute. Here are all the ones with significant \"moments\" in them, be they friendly or romantic. \n\n**Season 1:**\nThe Pilot (1x01)\nPurple Giraffe (1x02)\nReturn of the Shirt (1x04)\nThe Slutty Pumpkin (1x06)\nZip, Zip, Zip (1x14)\n\n**Season 2:**\nSlap Bet (2x09)\nHow Lily Stole Christmas (2x11)\n\n**Season 3:**\nWe're Not From Here (3x02)\nSandcastles in the Sand (3x16)\nThe Goat (3x17)\nMiracles (3x20)\n\n**Season 4:**\nDo I Know You? (4x01)\nShelter Island (4x05)\nThe Fight (4x10)\nBenefits (4x12)\nThe Possimpible (4x14)\nThe Stinsons (4x15)\nMurtaugh (4x19)\nMosbius Designs (4x20)\nThe Leap (4x24)\n\n**Season 5:**\nDefinitions (5x01)\nDouble Date (5x02)\nRobin 101  (5x03)\nThe Sexless Innkeeper (5x04)\nDuel Citizenship (5x05)\nBagpipes (5x06)\nThe Rough Patch (5x07)\nThe Playbook (5x08)\nOf Course (5x17)\nTwin Beds (5x21)\n\n**Season 6:**\nSubway Wars (6x04)\nBaby Talk (6x06)\nNatural History (6x08)\nDesperation Day (6x16)\nGarbage Island (6x17)\nThe Exploding Meatball Sub (6x20)\nHopeless (6x21) \nChallenge Accepted (6x24)\n\n**Season 7:**\nThe Best Man (7x01)\nThe Stinson Missile Crisis (7x04)\nDisaster Averted (7x09)\nTick Tick Tick (7x10)\nThe Rebound Girl (7x11)\nSymphony of Illumination (7x12)\nTrilogy Time (7x20)\nThe Magician's Code - Part Two (7x24)\n\n**Season 8:**\nFarhampton (8x01)\nThe Pre-Nup (8x02)\nThe Autumn of Break-Ups (8x05)\nSplitsville (8x06)\nThe Stamp Tramp (8x07)\nTwelve Horny Women (8x08)\nLobster Crawl (8x09)\nThe Over-Correction (8x10)\nThe Final Page - Part Two (8x12)\nBand or DJ? (8x13)\nRing Up (8x14)\nP.S. I Love You (8x15)\n\nEdit: I threw in the Pilot and Purple Giraffe (1x02) for good measure. Also Slutty Pumpkin (1x06). In that episode, Robin refused to dress up/look like an idiot with her boyfriend, but later in The Slutty Pumpkin Returns (7x08), she does so very willingly for Barney. It's cute. Here are all the ones with significant \"moments\" in them, be they friendly or romantic. \n\n**Season 1:**\nThe Pilot (1x01)\nPurple Giraffe (1x02)\nReturn of the Shirt (1x04)\nThe Slutty Pumpkin (1x06)\nZip, Zip, Zip (1x14)\n\n**Season 2:**\nSlap Bet (2x09)\nHow Lily Stole Christmas (2x11)\n\n**Season 3:**\nWe're Not From Here (3x02)\nSandcastles in the Sand (3x16)\nThe Goat (3x17)\nMiracles (3x20)\n\n**Season 4:**\nDo I Know You? (4x01)\nShelter Island (4x05)\nThe Fight (4x10)\nBenefits (4x12)\nThe Possimpible (4x14)\nThe Stinsons (4x15)\nMurtaugh (4x19)\nMosbius Designs (4x20)\nThe Leap (4x24)\n\n**Season 5:**\nDefinitions (5x01)\nDouble Date (5x02)\nRobin 101  (5x03)\nThe Sexless Innkeeper (5x04)\nDuel Citizenship (5x05)\nBagpipes (5x06)\nThe Rough Patch (5x07)\nThe Playbook (5x08)\nOf Course (5x17)\nTwin Beds (5x21)\n\n**Season 6:**\nSubway Wars (6x04)\nBaby Talk (6x06)\nNatural History (6x08)\nDesperation Day (6x16)\nGarbage Island (6x17)\nThe Exploding Meatball Sub (6x20)\nHopeless (6x21) \nChallenge Accepted (6x24)\n\n**Season 7:**\nThe Best Man (7x01)\nThe Stinson Missile Crisis (7x04)\nDisaster Averted (7x09)\nTick Tick Tick (7x10)\nThe Rebound Girl (7x11)\nSymphony of Illumination (7x12)\nTrilogy Time (7x20)\nThe Magician's Code - Part Two (7x24)\n\n**Season 8:**\nFarhampton (8x01)\nThe Pre-Nup (8x02)\nThe Autumn of Break-Ups (8x05)\nSplitsville (8x06)\nThe Stamp Tramp (8x07)\nTwelve Horny Women (8x08)\nLobster Crawl (8x09)\nThe Over-Correction (8x10)\nThe Final Page - Part Two (8x12)\nBand or DJ? (8x13)\nRing Up (8x14)\nP.S. I Love You (8x15)\n\nEdit: I threw in the Pilot and Purple Giraffe (1x02) for good measure. Also Slutty Pumpkin (1x06). In that episode, Robin refused to dress up/look like an idiot with her boyfriend, but later in The Slutty Pumpkin Returns (7x08), she does so very willingly for Barney. It's cute. Here are all the ones with significant \"moments\" in them, be they friendly or romantic. \n\n**Season 1:**\nThe Pilot (1x01)\nPurple Giraffe (1x02)\nReturn of the Shirt (1x04)\nThe Slutty Pumpkin (1x06)\nZip, Zip, Zip (1x14)\n\n**Season 2:**\nSlap Bet (2x09)\nHow Lily Stole Christmas (2x11)\n\n**Season 3:**\nWe're Not From Here (3x02)\nSandcastles in the Sand (3x16)\nThe Goat (3x17)\nMiracles (3x20)\n\n**Season 4:**\nDo I Know You? (4x01)\nShelter Island (4x05)\nThe Fight (4x10)\nBenefits (4x12)\nThe Possimpible (4x14)\nThe Stinsons (4x15)\nMurtaugh (4x19)\nMosbius Designs (4x20)\nThe Leap (4x24)\n\n**Season 5:**\nDefinitions (5x01)\nDouble Date (5x02)\nRobin 101  (5x03)\nThe Sexless Innkeeper (5x04)\nDuel Citizenship (5x05)\nBagpipes (5x06)\nThe Rough Patch (5x07)\nThe Playbook (5x08)\nOf Course (5x17)\nTwin Beds (5x21)\n\n**Season 6:**\nSubway Wars (6x04)\nBaby Talk (6x06)\nNatural History (6x08)\nDesperation Day (6x16)\nGarbage Island (6x17)\nThe Exploding Meatball Sub (6x20)\nHopeless (6x21) \nChallenge Accepted (6x24)\n\n**Season 7:**\nThe Best Man (7x01)\nThe Stinson Missile Crisis (7x04)\nDisaster Averted (7x09)\nTick Tick Tick (7x10)\nThe Rebound Girl (7x11)\nSymphony of Illumination (7x12)\nTrilogy Time (7x20)\nThe Magician's Code - Part Two (7x24)\n\n**Season 8:**\nFarhampton (8x01)\nThe Pre-Nup (8x02)\nThe Autumn of Break-Ups (8x05)\nSplitsville (8x06)\nThe Stamp Tramp (8x07)\nTwelve Horny Women (8x08)\nLobster Crawl (8x09)\nThe Over-Correction (8x10)\nThe Final Page - Part Two (8x12)\nBand or DJ? (8x13)\nRing Up (8x14)\nP.S. I Love You (8x15)\n\nEdit: I threw in the Pilot and Purple Giraffe (1x02) for good measure. Also Slutty Pumpkin (1x06). In that episode, Robin refused to dress up/look like an idiot with her boyfriend, but later in The Slutty Pumpkin Returns (7x08), she does so very willingly for Barney. It's cute.  I don't know the name.. but definitely the one where they kiss in the hospital.. I think Ted got in an accident? ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18ixxl/bestchronological_barney_and_robin_episodes/"
  }, {
    "id" : 12,
    "title" : "How I feel about tomorrow being single for all 21 years...(x-post from r/gifs)",
    "snippet" : "  21? Try 34. It forces you under the bed with a bag of cocaine and a rifle.         ",
    "url" : "http://i.imgur.com/z56876N.gif"
  }, {
    "id" : 13,
    "title" : "Vote for Senator Mike Tyson 2026",
    "snippet" : "   He has my vote.  OP, this is well done. Send it to his twitter, I guarantee he'll retweet it.   \"You waited 17 years to tell me that my baby was cradled and rocked to sleep by Senator Mike Tyson?\" For a moment, I thought Lilly would be in awe that her child was rocked to sleep by Mike Tyson. Actually, she might have, it was kinda hard to tell For a moment, I thought Lilly would be in awe that her child was rocked to sleep by Mike Tyson. Actually, she might have, it was kinda hard to tell  Old ladies with face tattoos tend not to do well in elections.   Ssssenator mike tysssson     For some reason, I have a hard time seeing a convicted rapist on a sitcom and thinking he's funny. For some reason, I have a hard time seeing a convicted rapist on a sitcom and thinking he's funny. I don't know why you're being down voted.  Honestly, I'm not sure why either. I didn't think not enjoying the antics of a rapist was a particularly controversial or unpopular stance. Apparently /HIMYM has some serious Tyson fans. Guy's seriously changed since the 80's. Sure, it doesn't absolve him from his past misdeeds, but he more than deserves a second shot. I have to disagree. I don't think he has changed all that much. But there's two separate issues here. 1. the issue of deserving a second chance and 2. whether a figure like him belongs on a light-hearted sitcom.\n\n1. What exactly has he done to earn his second chance?\n\nHe beat his wife Robin Givens (most likely, given her allegations and his statements that he has hit women) in the late 80's, raped her, raped an 18 year old in 1991 - went to prison and got out in 1995,  bit a man's ear off, assaulted two motorists in 1998, cheated on his wife Monica Turner throughout their marriage, had various kids in and out of wedlock that he could not provide for, in 2006 and 2007 DUIs and felony drug charges, another fight, at an airport with a photographer, in 2009.\n\nSupposedly he has been sober for 2 years now and started the Mike Tyson Cares Foundation in October of 2012. Of course he is more or less broke and in debt, so I am not sure what exactly the foundation is accomplishing.\n\nI am sure there is a lot I am leaving out. This is just a cursory glance at his wikipedia page and one google search.\n\nSo, does he deserve a second chance? Sure. A third chance? Um, maybe. A fourth chance? Why?\n\nYes, once a man has been punished for his crimes he should be able to rejoin society without being forever shackled to those crimes (for the most part). But that doesn't mean all avenues of employment are or should be open to them. And Tyson, he keeps acting badly, and doesn't really ever act goodly. His views on women are appalling and by all accounts he's pretty much an asshole. His soft and cuddly act is exactly that, an act. He's broke and needs money so he is trying to cash in on his notoriety by playing it for laughs.\n\nYou can choose to forgive the man his crimes and transgressions. But he hasn't really done much to earn that forgiveness.\n\n2 Now a man has a right to earn a living. But it's annoying that Bays and Thomas or whoever at CBS decided that this guy is A. entertaining, B. should be on the show. The first is subjective. The second is more objective.  To the first, I don't find him entertaining. I can't see past the rape and beatings and drugs to the loveable guy underneath. HIMYM has stunt cast before to varying degrees on success. I may not like Katy Perry much as an actress, but she is not morally objectionable. And at least to that extent I can attempt to find her entertaining whereas with Tyson, I can't. To the second, HIMYM is a romantic comedy tv show. I get that his name might boost ratings for an episode, but to cast a wife-beating rapist strikes me as a bad move that detracts from the series as a whole and the episode specifically. When I watch this show I don't really want to see Mike Tyson in it. Should he have been on the show? I don't think so.\n\n Wait, you're upset because Mike Tyson was putting on an \"act\" while acting?\nWhat in the actual fuck? Sorry I didn't make it clear. His newly acquired public persona in which he tries to make out that what he is portraying on screen, is who he is irl. I have to disagree. I don't think he has changed all that much. But there's two separate issues here. 1. the issue of deserving a second chance and 2. whether a figure like him belongs on a light-hearted sitcom.\n\n1. What exactly has he done to earn his second chance?\n\nHe beat his wife Robin Givens (most likely, given her allegations and his statements that he has hit women) in the late 80's, raped her, raped an 18 year old in 1991 - went to prison and got out in 1995,  bit a man's ear off, assaulted two motorists in 1998, cheated on his wife Monica Turner throughout their marriage, had various kids in and out of wedlock that he could not provide for, in 2006 and 2007 DUIs and felony drug charges, another fight, at an airport with a photographer, in 2009.\n\nSupposedly he has been sober for 2 years now and started the Mike Tyson Cares Foundation in October of 2012. Of course he is more or less broke and in debt, so I am not sure what exactly the foundation is accomplishing.\n\nI am sure there is a lot I am leaving out. This is just a cursory glance at his wikipedia page and one google search.\n\nSo, does he deserve a second chance? Sure. A third chance? Um, maybe. A fourth chance? Why?\n\nYes, once a man has been punished for his crimes he should be able to rejoin society without being forever shackled to those crimes (for the most part). But that doesn't mean all avenues of employment are or should be open to them. And Tyson, he keeps acting badly, and doesn't really ever act goodly. His views on women are appalling and by all accounts he's pretty much an asshole. His soft and cuddly act is exactly that, an act. He's broke and needs money so he is trying to cash in on his notoriety by playing it for laughs.\n\nYou can choose to forgive the man his crimes and transgressions. But he hasn't really done much to earn that forgiveness.\n\n2 Now a man has a right to earn a living. But it's annoying that Bays and Thomas or whoever at CBS decided that this guy is A. entertaining, B. should be on the show. The first is subjective. The second is more objective.  To the first, I don't find him entertaining. I can't see past the rape and beatings and drugs to the loveable guy underneath. HIMYM has stunt cast before to varying degrees on success. I may not like Katy Perry much as an actress, but she is not morally objectionable. And at least to that extent I can attempt to find her entertaining whereas with Tyson, I can't. To the second, HIMYM is a romantic comedy tv show. I get that his name might boost ratings for an episode, but to cast a wife-beating rapist strikes me as a bad move that detracts from the series as a whole and the episode specifically. When I watch this show I don't really want to see Mike Tyson in it. Should he have been on the show? I don't think so.\n\n If you want to be mad at the guy for beating and raping women then by all means but being mad at him for acting while its his job to act makes no sense what so ever.\nI dislike Chris Brown for getting in fights not for dancing and singing. \nI dislike Chris brown for being a negative influence on our youth but I understand he's a youth as well and I understand he's pretty darn good at dancing and singing.\nThose are separate things man.\nIs your hate so strong that you can't understand its his job to put on an act?\nWas he a bad person? Yes, but he's changed. Humans can change.\nHas Chris brown changed? Nope but he can dance and sing.\nIs Chris brown a bad person? Yes and I hope he changes because it would be tragic to have Boby and Whitney part two.\nIn conclusion:\nSome humans make mistakes and can be considered immoral because of it. Heck, some of them like being that way. Some change and some don't but regardless, it shouldn't affect your opinion of their work. Should it be brought up? Of course! Yet, I believe a person's work is separate. Mike Tyson was a character on an episode of himym. He was acting. He did a good job of portraying his character. He made some horrible decisions in the past and I hope that stays in the past because he's a halfway decent actor. I understand why it upset you and its a shame you can't forgive him for being dumb and I bet he's sincerely sorry for it. I bet he's apologized. I bet he wishes he never did it. Besides, who of us is without mistakes? We all fuck up.\n\nTl;dr: judge a person and their work separate because we all make mistakes. Nobody is perfect. I think we fundamentally disagree on this one point. I don't believe that a person's art needs to, or necessarily should be, separated from who they are as a person.\n\nI don't go see Roman's Polanski's films for much the same reason. I don't like financially supporting rapists.\n\nAnd when it comes down to it, this disagreement we are having is pretty much at the crux of why I think he should not have been on this show. His presence did not serve the story well, nor was it necessary in any way. It was off putting, upsetting, distracting, and, subjectively, not funny. I'm a male and I find this upsetting enough, but I'm sure that there are plenty of females who watch this show and were even more unhappy to see a man who has raped at least two women pop up on a Romantic Comedy show. \n\nMaybe on a show where his past misdeeds wouldn't be so out of place or off-putting, it would be OK. Like Law and Order SVU, where the fictional criminals are all worse than him.\n\nHis character on the show was him. His character in The Hangover was him. Mike Tyson. He is playing a version of himself, much the way James Vn Der Beek played JVDB on Apartment 23. It's image rehabilitation that I don't buy, nor do I want to buy by supporting a show that would enable him to do this. If he wants to rehabilitate his image, he should actually do something worthwhile with his life. \n\nI work in criminal law and I see people all the time who talk a big game, but really, they don't change. They are not sorry for what they have done. And given the chance, they'll continue to hurt people. And I often see them come back through the system after they have hurt people, again. But I have also seen people make the very real and difficult decision to change their lives for the better. He exhibits none of the traits associated with that. That I can tell. But, like you, I don't know the man personally. Maybe I'm wrong. \n\nBut it's about whether he is or isn't turning his life around. I hope he does. I just don't want to see his face on my tv watching an episode that is supposed to be light-hearted and fun.\n\nAnd Chris Brown - he's exactly what I am talking about - he has not changed at all. It's not hate that fills my heart, it's lack of pity for those who refuse to take responsibility for their actions and then take the necessary steps to get the help they need to never again commit those crimes.\n\nIf Chris Brown had been smart, he'd at least try to fake remorse and responsibility. But that's the problem with abusers, they don't have remorse for their actions, they don't accept responsibility for their actions. No matter how angry they get or how violent and inappropriate their outbursts are, there is always someone else at fault.\n\nI agree with you in pretty much all the details I do believe in second chances, I do believe that people make mistakes, I do believe that people have the power and capacity to change and we need to have a system set up that encourages and enables positive change. \n\nI have also seen men who most abjectly apologize, feel like shit for what they have done, swear to never do it again, and then fail to go to their AA meetings and their domestic violence classes and then they come back in a year or two later and their significant other is in the hospital on life support.\n\nYou talk about the past - I listed criminal conduct that was more or less continuous from the late 80's until a couple years ago. He's apologized? He feels bad? Who gives a fuck about his feelings. I care about the people he's hurt. \n\nAnd now I'm ranting. I'm sorry. That lowers the level of discourse. \n\nTLDR - You don't have to separate the man from his art, nor do I want to financially support a rapist doing image rehab, and ultimately I think it's in poor taste for this show to feature a rapist - rehabilitated or not. Guess you're not an NBA fan either\n\n guess not! Guess you're not an NBA fan either\n\n I think we fundamentally disagree on this one point. I don't believe that a person's art needs to, or necessarily should be, separated from who they are as a person.\n\nI don't go see Roman's Polanski's films for much the same reason. I don't like financially supporting rapists.\n\nAnd when it comes down to it, this disagreement we are having is pretty much at the crux of why I think he should not have been on this show. His presence did not serve the story well, nor was it necessary in any way. It was off putting, upsetting, distracting, and, subjectively, not funny. I'm a male and I find this upsetting enough, but I'm sure that there are plenty of females who watch this show and were even more unhappy to see a man who has raped at least two women pop up on a Romantic Comedy show. \n\nMaybe on a show where his past misdeeds wouldn't be so out of place or off-putting, it would be OK. Like Law and Order SVU, where the fictional criminals are all worse than him.\n\nHis character on the show was him. His character in The Hangover was him. Mike Tyson. He is playing a version of himself, much the way James Vn Der Beek played JVDB on Apartment 23. It's image rehabilitation that I don't buy, nor do I want to buy by supporting a show that would enable him to do this. If he wants to rehabilitate his image, he should actually do something worthwhile with his life. \n\nI work in criminal law and I see people all the time who talk a big game, but really, they don't change. They are not sorry for what they have done. And given the chance, they'll continue to hurt people. And I often see them come back through the system after they have hurt people, again. But I have also seen people make the very real and difficult decision to change their lives for the better. He exhibits none of the traits associated with that. That I can tell. But, like you, I don't know the man personally. Maybe I'm wrong. \n\nBut it's about whether he is or isn't turning his life around. I hope he does. I just don't want to see his face on my tv watching an episode that is supposed to be light-hearted and fun.\n\nAnd Chris Brown - he's exactly what I am talking about - he has not changed at all. It's not hate that fills my heart, it's lack of pity for those who refuse to take responsibility for their actions and then take the necessary steps to get the help they need to never again commit those crimes.\n\nIf Chris Brown had been smart, he'd at least try to fake remorse and responsibility. But that's the problem with abusers, they don't have remorse for their actions, they don't accept responsibility for their actions. No matter how angry they get or how violent and inappropriate their outbursts are, there is always someone else at fault.\n\nI agree with you in pretty much all the details I do believe in second chances, I do believe that people make mistakes, I do believe that people have the power and capacity to change and we need to have a system set up that encourages and enables positive change. \n\nI have also seen men who most abjectly apologize, feel like shit for what they have done, swear to never do it again, and then fail to go to their AA meetings and their domestic violence classes and then they come back in a year or two later and their significant other is in the hospital on life support.\n\nYou talk about the past - I listed criminal conduct that was more or less continuous from the late 80's until a couple years ago. He's apologized? He feels bad? Who gives a fuck about his feelings. I care about the people he's hurt. \n\nAnd now I'm ranting. I'm sorry. That lowers the level of discourse. \n\nTLDR - You don't have to separate the man from his art, nor do I want to financially support a rapist doing image rehab, and ultimately I think it's in poor taste for this show to feature a rapist - rehabilitated or not. I understand your particular distaste towards the act of financially supporting, in any direct or indirect way, someone who has commited violent crimes...\n\nbut your view on art is beyond arrogant and sanctimonious. It's people like you who SERIOUSLY put a stranglehold on art. You say that art can not be seperated from the artist, but that is if to say your moral system is a higher authority than the quality and value of the work of art or its value to society or those who appreciate it. It is simply illogical for you to believe that a work of art must be evaluated on the merits of its creator. \n\nEverything the film industry is now in terms of directing, cinematography, and editing is due to a man with known ties to the KKK. His very techniques are the very foundation of how the vast majority of film and television are structured. As a whole the film industry and community celebrate the work of a racist. \n\nContemporary horror and scifi owe a lot to HP Lovecraft, a man who was probably worse than a \"man of his times\" when it came to racism.\n\nLet's not even touch Thomas Edison...\n\nThe fact is that the merit of art will be passed down and the deeds and misdeeds of the creators will go mostly forgotten or turned into folk mythology. You can go back and play this game with any historical figure of importance, let alone mythological who man created and chose to worship. This has been how we've developed culturally and passed down tradition, information, and new ideas. \n\nYour PERSONAL ideals are noble, but it is just that. It is incredibly arrogant to believe it should dictate art.  Well, I never took quite so strong a stance as you state. You use CANNOT and MUST. I stated that I didn't think who a person is and what their art is need to or necessarily should be separated. You can accuse me of waffling, but I am aware of the point you are trying to make and trying to allow for it in my argument - that sometimes shitty people make things of great beauty - while at the same time trying to make my point that in this case.  \n\nI am curious as to exactly how people like put a serious stranglehold on art. If you could please elaborate on that point. Because I think it's a stretch to say that I am somehow inhibiting art because I choose not to go see The Pianist, or get annoyed when Mike Tyson pops up on a sitcom I like.\n\nI'm not quite sure what your issue is with me making a subjective judgment about what type of art I choose to support. Or how my view is arrogant? I am a consumer. The people making HIMYM are selling a product. I could base my decision to not like it on anything and still be valid as it is subjective. I don't think my ideals should dictate art. I think my dollars should dictate product - that's pretty much a universally agreed upon tenant of capitalism.  \n\nAnd in this case, I posit that Mike Tyson the rapist, playing Mike Tyson the lovable softie, is not entertaining, as I look at him and just see the bad. If you have no issue with that, then good for you. \n\n Well, I never took quite so strong a stance as you state. You use CANNOT and MUST. I stated that I didn't think who a person is and what their art is need to or necessarily should be separated. You can accuse me of waffling, but I am aware of the point you are trying to make and trying to allow for it in my argument - that sometimes shitty people make things of great beauty - while at the same time trying to make my point that in this case.  \n\nI am curious as to exactly how people like put a serious stranglehold on art. If you could please elaborate on that point. Because I think it's a stretch to say that I am somehow inhibiting art because I choose not to go see The Pianist, or get annoyed when Mike Tyson pops up on a sitcom I like.\n\nI'm not quite sure what your issue is with me making a subjective judgment about what type of art I choose to support. Or how my view is arrogant? I am a consumer. The people making HIMYM are selling a product. I could base my decision to not like it on anything and still be valid as it is subjective. I don't think my ideals should dictate art. I think my dollars should dictate product - that's pretty much a universally agreed upon tenant of capitalism.  \n\nAnd in this case, I posit that Mike Tyson the rapist, playing Mike Tyson the lovable softie, is not entertaining, as I look at him and just see the bad. If you have no issue with that, then good for you. \n\n For some reason, I have a hard time seeing a convicted rapist on a sitcom and thinking he's funny. Just saw the episode and came here to say this.\n\nDo I think Tyson can act in comedy, like *The Hangover*? Sure. But I'm still disappointed in the writers of HIMYM.\n\nOur two strong female characters, one incredible mother with a titanium backbone, and one gun-toting kick-ass Canadian, are big Tyson fans?\n\nI'm sorry - I don't see it. Seems to be in huge conflict with their characters. ",
    "url" : "http://i.imgur.com/SOg0rAQ.jpg"
  }, {
    "id" : 14,
    "title" : "My husband got a huge computer monitor last week",
    "snippet" : "  I just realized that they changed it from a clone trooper to a storm trooper at some point, does any body know when/why? I'm fairly certain it was always meant to be a stormtrooper, but the props people screwed up and got a clone trooper instead.  It was then left alone until it was referred to on-screen as a \"stormtrooper,\" at which point I'm sure a lot of *Star Wars* fans called the producers out for it.  Not long after, it was changed to an actual stormtrooper, and none of the characters ever mentioned that it changed.\n\nNote that essentially all of that is speculation on my part. I just realized that they changed it from a clone trooper to a storm trooper at some point, does any body know when/why? I just realized that they changed it from a clone trooper to a storm trooper at some point, does any body know when/why?    I just upgraded from a 23\" LG monitor to a 27\" Samsung today. I know how this feels now. We got a badass over here.",
    "url" : "http://i.imgur.com/vVBzT0Z.jpg"
  }, {
    "id" : 15,
    "title" : "Where did Barney actually go to college?",
    "snippet" : "I watched \"The Drunk Train\" Episode last night (S07E16) and when Barney is trying to figure out how to score with chicks on the drunk train he mentions that he went to MIT as a joke, leading Ted to wonder out loud where Barney actually went to college.\n\nIs it so far fetched that Barney went to MIT? For instance he seems to have an excellent job somewhere in the financial world so he's clearly not stupid. What are people's thoughts on this? Are there any other clues out there?     I think the MIT theory makes sense. He might have studied asian languages or met enough friends at MIT to speak a variety of them, especially based on the Atlantic City episode. Then the businessmen who come to America love him because he not only speaks their language, but represents the perfect American stereotype of what you would expect a cool womanizer to be, plus he buys all sorts of cool things from Skymall. I think the MIT theory makes sense. He might have studied asian languages or met enough friends at MIT to speak a variety of them, especially based on the Atlantic City episode. Then the businessmen who come to America love him because he not only speaks their language, but represents the perfect American stereotype of what you would expect a cool womanizer to be, plus he buys all sorts of cool things from Skymall.  Also, all questions will be answered. It will probably be included in his story about what he actually does for work. I always assumed that they never were going to say what he does.  I always assumed that they never were going to say what he does.  Also, all questions will be answered. It will probably be included in his story about what he actually does for work. But we know Ted never finds out about the Pineapple. And that is really the biggest mystery on the show. That was already answered. He never finds out.  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18ie0x/where_did_barney_actually_go_to_college/"
  }, {
    "id" : 16,
    "title" : "IIIIIIIIT'S MY BIRTHDAY! (For realsies!)",
    "snippet" : "    ",
    "url" : "http://24.media.tumblr.com/863d70bf47ba0f9805296fe31918489a/tumblr_mi7200Z7iD1qck2p0o1_500.gif"
  }, {
    "id" : 17,
    "title" : "Before a man meets the woman he'll marry, he'll make one final horrible mistake",
    "snippet" : "  Except with Barney and Marshall they had met the women they love already  Plus, Barney makes plenty of 'mistakes' after Quinn tl;dr OP is a faggot. Well, that wasn't necessary. Depends on the goal. Maybe our goals differ. Yeah, his goal is civilized discussion, and your goal is the perpetuation of a meme produced by 14 year olds.\n\nI'd hope his goals differed from yours. Hello person no one was talking to who is making assumptions about two people he doesn't actually know anything about. But...\nHe's right about mine. Ends justify the means, eh? Hello person no one was talking to who is making assumptions about two people he doesn't actually know anything about. And you actually know OP is a \"faggot?\" Stop talking to me. tl;dr OP is a faggot. tl;dr OP is a faggot. Except with Barney and Marshall they had met the women they love already  Yup, the only one that actually fits is the one with Ted.   I don't think Quinn was a horrible mistake though. It was quite genuine with them and she wasn't an evil bitch like Jeanette. Can't really compare the two.\n\nAnd isn't that girl that Marshall is with not crazy, but he was crazy (and Lily was crazy)? Oh no, Chloe was also crazy. She fucked up the apartment \"looking for her keys\" that were right in front of her.  Oh right I forgot about that actually. Okay she was a bit crazy but she wasn't Jeanette crazy. Not in my books anyways. I don't think Quinn was a horrible mistake though. It was quite genuine with them and she wasn't an evil bitch like Jeanette. Can't really compare the two.\n\nAnd isn't that girl that Marshall is with not crazy, but he was crazy (and Lily was crazy)? She tore apart their apartment looking for her keys that were on the table. I'm gonna go with crazy. and now she's married to a terrorist. Ex-terrorist. You guys just think he is a terrorist because Carrie thinks so, right guys? You wouldn't spoil things for someone who just started watching and recognized the crazy chick from HIMYM, RIGHT GUYS?    Don't comment without spoilers if you don't want replies without spoilers. Ex-terrorist. and now she's married to a terrorist. She tore apart their apartment looking for her keys that were on the table. I'm gonna go with crazy. except she just got stood up by some guy she really liked in his living room.... I would go a bit crazy too and fuck up the place. ......Yeah so crazy. Difference is, there is ted's current gf crazy, and crazy because someone just pulled a dick move on you. You only see her that way because its Marshall and the story is told in ted's perspective. \n\nIf it was based on her perspective, she would just have had a really nice date with a guy she liked and is about to get some action on in the living room. Than bam he goes out with his ex-gf and is gone for hours(I think?). She got mad, wrecked the place, just used a obvious dumb excuse, and left. not TOO out of norm for me. Difference is, there is ted's current gf crazy, and crazy because someone just pulled a dick move on you. You only see her that way because its Marshall and the story is told in ted's perspective. \n\nIf it was based on her perspective, she would just have had a really nice date with a guy she liked and is about to get some action on in the living room. Than bam he goes out with his ex-gf and is gone for hours(I think?). She got mad, wrecked the place, just used a obvious dumb excuse, and left. not TOO out of norm for me. So do you often go around breaking things because you're mad? I'm just saying that that's a pretty extreme response. There really aren't any reasons that should make you go around some dudes apartment and trash it. I don't think Quinn was a horrible mistake though. It was quite genuine with them and she wasn't an evil bitch like Jeanette. Can't really compare the two.\n\nAnd isn't that girl that Marshall is with not crazy, but he was crazy (and Lily was crazy)? I don't think Quinn was a horrible mistake though. It was quite genuine with them and she wasn't an evil bitch like Jeanette. Can't really compare the two.\n\nAnd isn't that girl that Marshall is with not crazy, but he was crazy (and Lily was crazy)? She maybe wasn't crazy, but she was deaf*\n\n*see: Swarley I don't think Quinn was a horrible mistake though. It was quite genuine with them and she wasn't an evil bitch like Jeanette. Can't really compare the two.\n\nAnd isn't that girl that Marshall is with not crazy, but he was crazy (and Lily was crazy)? I don't think Quinn was a horrible mistake though. It was quite genuine with them and she wasn't an evil bitch like Jeanette. Can't really compare the two.\n\nAnd isn't that girl that Marshall is with not crazy, but he was crazy (and Lily was crazy)?  Wait, is that Morena Baccarin? I remember that episode but I hadn't seen Firefly yet so I didn't recognize it!\n\nI feel like when I discovered that Barty Crouch was the 10th Doctor, I can't believe I missed it! It is indeed. So many Whedon alumni in this show. Love it! Do you know what episode this screen grab is from?\n\n\nEdit: I remembered how to google, it's this one: http://www.imdb.com/title/tt0875360/ S2E7-Swarley Swarls Barkley Swarhili Swarlos Bob Swarley Mon Swar-laaay It is indeed. So many Whedon alumni in this show. Love it! Wait, is that Morena Baccarin? I remember that episode but I hadn't seen Firefly yet so I didn't recognize it!\n\nI feel like when I discovered that Barty Crouch was the 10th Doctor, I can't believe I missed it! Wait, is that Morena Baccarin? I remember that episode but I hadn't seen Firefly yet so I didn't recognize it!\n\nI feel like when I discovered that Barty Crouch was the 10th Doctor, I can't believe I missed it! Woah, I never would have guessed that. Maybe its just been too long since I've seen Firefly.Totally thought it was Yvonne Strahovski. Aside from them both being gorgeous, I can't think of two women that look less alike...  Wait, but is she a caaaaaaawp? SHE'S NAWT A CAAAAAAWP Is she a caaaaaaawp!??!? I think shes a caaaaaaaaaawp!  I wouldn't say that Quinn was a mistake. The crazy chick whose name I don't know that Marshall went out with? Yeah, that was a huge mistake. But not Quinn. she was a stripper!! and at the beginning she took his money, and it can still be considered a mistake because barney was still in love with robin  she was a stripper!! and at the beginning she took his money, and it can still be considered a mistake because barney was still in love with robin  I wouldn't say that Quinn was a mistake. The crazy chick whose name I don't know that Marshall went out with? Yeah, that was a huge mistake. But not Quinn.  well all 3 of them are 3 different kind of mistakes\n\nted takes the cake though   Crazy aside, Jeanette is damn hot. Meh. Given some of Ted's other ex's she's average in comparison   So I'm the final horrible mistake for several of my exs?.....well shit.....  Sucks when I'm watching an episode and it seems like it's portraying a moment in my life. I'm totally my boyfriends horrible mistake.  ....would it be wrong for me to ask which episode? I'm not sure any. From what I gather though, I think I'm the girl a guy dates and breaks up with 10 times before he meets the girl he really wants.   still think Barney was better with Quinn Why?     God, thank you for creating Becki Newton (Quinn). She is just absolutely b-e-a-utiful. ",
    "url" : "http://imgur.com/a/a0OxQ"
  }, {
    "id" : 18,
    "title" : "S8E17 \"The Ashtray\" Promotional Photos",
    "snippet" : "  Lily's dress is fantastic in those pictures.  WOAH WOAH WOAH! HOLD IT! WHY IS BARNEY WITH TWO HOT WOMAN? HE IS ENGAGED!",
    "url" : "http://www.seat42f.com/how-i-met-your-mother-season-8-episode-17-the-ashtray-photos.html#1"
  }, {
    "id" : 19,
    "title" : "At Least Ted's Not in LA",
    "snippet" : "     I live in Philadelphia and can say this is quite wrong ",
    "url" : "http://www.lesjones.com/www/images/posts/singles2ql8.jpg"
  }, {
    "id" : 20,
    "title" : "Prior to his job at TelAmericorp, Waymond worked for Garrison Cootes",
    "snippet" : "  ",
    "url" : "http://imgur.com/IzIyXlH"
  }, {
    "id" : 21,
    "title" : "Why couldn't Ted see these when he met Jeanette?",
    "snippet" : "    ",
    "url" : "http://www.bitchesbecrazy.net/wp-content/uploads/2011/07/crazy-eyes.png"
  }, {
    "id" : 22,
    "title" : "Dress from \"The Goat\" also used on Buffy",
    "snippet" : "  Nice catch! It's fun to see that there are more Buffy/HIMYM crossovers than just actors/actresses. I was amused watching the Buffy episode where Willow mentioned writing Doogie Howser fanfic. ",
    "url" : "http://imgur.com/a/zTHGT"
  }, {
    "id" : 23,
    "title" : "Daddy's Home",
    "url" : "http://www.youtube.com/watch?v=QSCzIzeW4cA"
  }, {
    "id" : 24,
    "title" : "Alyson Hannigan takes out restraining order against mental patient. Which one of you is it?",
    "snippet" : "    This is actually really disturbing and not at all funny. Kind of confused about why all the comments/OP are acting like it's a joke.  Silver linings I don't see the silver lining here to having yourself and your family threatened and harassed.  We're trying to make light of a serious situation.  Yes I understand that. I find it inappropriate and disturbing.  Well not everyone has the same humor as you. I really can't understand why anyone would think her getting death threats is at all funny. It is a really serious and scary situation.  Death threats arent funny, that doesnt mean jokes around a serious subject can't be.  I think serious things can be funny in the abstract. Not when you are laughing or making light of a specific thing happening to someone.   It's John Hobbs It's John Hobbs Yeah, but what's his *screen name?* ",
    "url" : "http://www.wlos.com/template/inews_wire/wires.national/2dea5e7d-www.wlos.com.shtml"
  }, {
    "id" : 25,
    "title" : "Ohh Baby youuu",
    "snippet" : "  explain? Blah Blah? I still don't get it. Maybe OP can explain?",
    "url" : "http://qkme.me/3szgli"
  }, {
    "id" : 26,
    "title" : "Found this in an arcade I went to last night",
    "snippet" : "  ",
    "url" : "http://imgur.com/cVpU63Y"
  }, {
    "id" : 27,
    "title" : "(x-post from r/ireland) Ted's storm provisions are all Irish products.",
    "snippet" : "   Pretty sure this is my kitchen. ",
    "url" : "http://i.imgur.com/6nvZxqU.jpg"
  }, {
    "id" : 28,
    "title" : "Sometimes I am really not sure..",
    "snippet" : "  In the hunt for the best burger episode, they are actually looking for the best joint in the world. \"I wake up at night, going, 'Get out of my head, burger. Get out!'\" -Regis P. \"I wake up at night, going, 'Get out of my head, burger. Get out!'\" -Regis P. [deleted] Seems familiar to me as well. Considering its a quote from the show. In the hunt for the best burger episode, they are actually looking for the best joint in the world. In the hunt for the best burger episode, they are actually looking for the best joint in the world. Questioned whether you were being serious and that was true and it was a joke. It was an actual hamburger, Robin was incredibly hungry and was complaining and they were at the bar when they started Marshall started talking about it because they were ordering food. Questioned whether you were being serious and that was true and it was a joke. It was an actual hamburger, Robin was incredibly hungry and was complaining and they were at the bar when they started Marshall started talking about it because they were ordering food.  well last nights episode they said subs, so i think they really meant sandwiches, i think they only refer to smoking has hoagies.  well last nights episode they said subs, so i think they really meant sandwiches, i think they only refer to smoking has hoagies.  SPOILER ALERT! are you kidding? he said they got SUBS in an episode.. how in the world is that a spoiler The sub is the mother. The sub is the mother. are you kidding? he said they got SUBS in an episode.. how in the world is that a spoiler I think it was a joke...  Here is what the linked Quickmeme image says in case the site goes down or you can't reach it:\n\n&gt;Title: Sometimes I am really not sure..\n\n&gt;Meme: Futurama Fry\n\n&gt;* NOT SURE IF THEY ARE SMOKING A JOINT\n&gt;* OR IF THEY ARE EATING A SANDWICH\n\n&gt;^[Direct](http://i.qkme.me/3syovy.jpg) ^[Background](http://imgur.com/8WooN) ^[Translate](http://translate.google.com/#auto||NOT+SURE+IF+THEY+ARE+SMOKING+A+JOINT+-+OR+IF+THEY+ARE+EATING+A+SANDWICH)\n\n[**Why?**](http://www.reddit.com/r/qkme_transcriber/comments/o426k/faq_for_the_qkme_transcriber_bot/)  [More Info](http://www.reddit.com/r/qkme_transcriber/)  AMA: [Bot](http://www.reddit.com/r/self/comments/vxeak/hello_i_am_a_bot_who_posts_transcriptions_of/), [Human](http://www.reddit.com/r/InternetAMA/comments/12gog9/i_am_the_creator_of_qkme_transcriber_a_definitely/) Who is downvoting a freaking bot? From previous times this has been asked, the reasoning I've heard is that they find the bot useful, they just don't want it always at the top of the page. The ones who, at least, aren't *complete* dicks. That's not a good reason to downvote. You don't downvote when you like something.  That's not a good reason to downvote. You don't downvote when you like something.  From previous times this has been asked, the reasoning I've heard is that they find the bot useful, they just don't want it always at the top of the page. The ones who, at least, aren't *complete* dicks.     Every time they are actually smoking weed, its blatantly obvious     When were they eating sandwiches during last night's episode?  Barney and Marshall left the apartment to get meatball subs while Jeannette was locked in Ted's room.  They got Meatball subs. That's how I know it wasn't supposed to be weed. If it were, then in S6, Barney would have actually be talking about an exploding joint in the episode \"The Exploding Meatball Sub\".              Are you literally autistic, OP? The gag is always set up well enough that unless you're a complete idiot, you can tell.",
    "url" : "http://www.quickmeme.com/meme/3syovy/"
  }, {
    "id" : 29,
    "title" : "Running Jokes that the Writers should have included in later seasons?",
    "snippet" : "Oh my gosh, am I the only one that thought that the inclusion of the crazy eyes from season 2 could have been used on Jeanett, or the window breaking sound effect that happens when they realize a flaw about someone could have been used on Robin's boyfriend Nick during the episode she realizes he's dumb?... It wouldnt have felt as flimsy as the way that the episodes are now. Plus it would be great for us long time viewers... What do you guys think? Any other moments in HIMYM when they could have brought back an episode theme or running joke?  Swarley. Just one more time. I preferred Swarlz Barkley. I preferred Swarlz Barkley. I preferred Swarlz Barkley. Word. Word. Swarley. Just one more time. Swar-waitforit-ley  Agreed! They could have added those in without explanation and they would have worked for the fans. Not employing the hot/crazy scale for Jeanette was a disappointment.   Barney hasn't said \"suit up\" in a while, and I don't think he's been to lasertag in a while either (unless he took Quinn, I can't remember). Barney hasn't said \"suit up\" in a while, and I don't think he's been to lasertag in a while either (unless he took Quinn, I can't remember).  In the episode last cigarette ever, they said exactly when their last cigarette was. So Lily and Marshall already had their last one, I guess they could have brought it up (The day Lily started trying, The day Marvin was born). Then again, why would you bring up smoking too much on a family show...  A family show about womanizing, cheating on significant others, strippers, recreational drug use and overindulgence of alcohol?  In the episode last cigarette ever, they said exactly when their last cigarette was. So Lily and Marshall already had their last one, I guess they could have brought it up (The day Lily started trying, The day Marvin was born). Then again, why would you bring up smoking too much on a family show...  For Marshall, they did. During the final segment of the...third-to-last episode of last season, when Lily's trying to call them in Atlantic City, there's a short clip of Marshall smoking while he gets rip-roaringly drunk. For Marshall, they did. During the final segment of the...third-to-last episode of last season, when Lily's trying to call them in Atlantic City, there's a short clip of Marshall smoking while he gets rip-roaringly drunk. In the episode last cigarette ever, they said exactly when their last cigarette was. So Lily and Marshall already had their last one, I guess they could have brought it up (The day Lily started trying, The day Marvin was born). Then again, why would you bring up smoking too much on a family show...  In the episode last cigarette ever, they said exactly when their last cigarette was. So Lily and Marshall already had their last one, I guess they could have brought it up (The day Lily started trying, The day Marvin was born). Then again, why would you bring up smoking too much on a family show...    I always liked Robin and Ted's military jokes. It wasn't a major running joke but I found it funny. I always liked Robin and Ted's military jokes. It wasn't a major running joke but I found it funny.   The Pineapple, and I want to know about what happened with Lily being mad and then Barney saves her life and I think there was an ice cream cone involved.  I also want the cockamouse to make another appearance like in the Arcadian   The Pineapple, and I want to know about what happened with Lily being mad and then Barney saves her life and I think there was an ice cream cone involved.  I also want the cockamouse to make another appearance like in the Arcadian   The Pineapple, and I want to know about what happened with Lily being mad and then Barney saves her life and I think there was an ice cream cone involved.  I also want the cockamouse to make another appearance like in the Arcadian   Seriously with the pineapple. You probably want Robin to be the mother too, right? ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18g4yu/running_jokes_that_the_writers_should_have/"
  }, {
    "id" : 30,
    "title" : "Happy Desperation Day!",
    "snippet" : "   ",
    "url" : "http://i.imgur.com/3Th8yob.jpg"
  }, {
    "id" : 31,
    "title" : "It's Barney's favorite day of the year!",
    "url" : "http://www.youtube.com/watch?v=e2gnJwj0vM0"
  }, {
    "id" : 32,
    "title" : "Does Netflix have HIMYM?",
    "snippet" : "I live in the UK and when I used to have Netflix, it was never on there. I was just wondering if it had been put up yet?    I'm in the UK and it has it on mine, however I have an add on installed in chrome so I can watch hulu I'm in the UK and it has it on mine, however I have an add on installed in chrome so I can watch hulu I recently got this extension, however it seems that when you try to watch the new episodes on hulu it redirects you to CBS, which is blocked in the UK.... don't suppose you have any ideas? The extension I have is called media hint. You have to disable Adblock on Hulu to watch things   Canada here. Yes it does.  Canada here. Yes it does.  Canadian Netflix got HIMYM?! When?!  It has through the end of season 7 in the US. I don't know for sure about the UK but it's probably the same.  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18gkzr/does_netflix_have_himym/"
  }, {
    "id" : 33,
    "title" : "What happens to this subreddit when we wait for a new episode",
    "snippet" : "   I'd say a goofy image from a paused episode is more constructive to this subreddit than memes",
    "url" : "http://www.quickmeme.com/meme/3sywz2/"
  }, {
    "id" : 34,
    "title" : "So I was playing IconPopQuiz on my phone when suddenly...",
    "snippet" : " ",
    "url" : "http://i.imgur.com/laGeKsl.png"
  }, {
    "id" : 35,
    "title" : "Pulling.Them.Off.",
    "snippet" : "  Teacup pig, I don't want to be with you........... right now. ",
    "url" : "http://i2.squidoocdn.com/resize/squidoo_images/-1/lens19940957_1352165677--a--.jpg"
  }, {
    "id" : 36,
    "title" : "What episode(s) do you show someone first to get them into the show?",
    "snippet" : "I always show Swarley first to someone who doesn't know much about the show. It was the episode that got me watching. It has the major plot point dealing with Marshall and Lily toward the end, but I don't think it changes watching the first episodes much.     The Playbook. I was lucky enough to have netflix up to season 6 at that point, so I started from the beginning after that and never really stopped watching.   I'd say the first three episodes. They're very well constructed. The first episode aptly introduces us to the characters and their stories, along with the main theme.\n\nThe second episode goes deeper into Robin/Ted territory whilst also being pretty amusing.\n\nThe third episode, Liberty Bell, is one of my all time favourite HIMYM episodes. It's just an excellent Barney/Ted adventure.\n\n I'd say the first three episodes. They're very well constructed. The first episode aptly introduces us to the characters and their stories, along with the main theme.\n\nThe second episode goes deeper into Robin/Ted territory whilst also being pretty amusing.\n\nThe third episode, Liberty Bell, is one of my all time favourite HIMYM episodes. It's just an excellent Barney/Ted adventure.\n\n     season 2 episode 16 \"Stuff\" it is the best episode of the entire show hands down. The first time I watched Barney's play I fell out of my chair laughing. Possibly one of the funniest things I have ever seen.        ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18g2yg/what_episodes_do_you_show_someone_first_to_get/"
  }, {
    "id" : 37,
    "title" : "Thanks for the spoiler CBS...",
    "snippet" : "  1channel.ch next time. if you live on the west coast, it comes out earlier than the 8 PM time here too. plus no commercials I like letting CBS know when I like a show and that if they are able to provide free streaming of the show I'll still tune in even with some commercials. Ad Block extension gets rid of the commercials on the CBS website. I know but it is those same ads that help CBS provide free streaming of the show. I just browse reddit on my phone for two minutes while the ads play. That's true. I will consider unblocking them for specific sites like CBS. Never unblocking the ads on Facebook though.   Not really a spoiler.. I mean mike Tyson could've held the baby AFTER the old black lady..  The thing about it was I didn't notice it until the video cut out half way through the episode.  I had a thought in my mind that it was another person that picked up the baby, but I didn't know who.    Thanks for the spoilers bcr1299... ",
    "url" : "http://imgur.com/l1RJMlX"
  }, {
    "id" : 38,
    "title" : "Doesn't somebody become a bull fighter for a while? or has that already happened? ",
    "snippet" : "How about we make a list of all the bits they've hinted will happen in the future (Bob Saget: \"... but I'll get to that later...\") but havn't been explained yet.    Isn't Marshall's doppelgnger a bull fighter or something? Isn't Marshall's doppelgnger a bull fighter or something?",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18fx5r/doesnt_somebody_become_a_bull_fighter_for_a_while/"
  }, {
    "id" : 39,
    "title" : "Has anyone tried piecing together all the audio from the narrations?",
    "snippet" : "I'm curious to hear how all the narrated parts piece together. I know a popular question is \"Why is Ted telling his kids all this?\", but what if the kids are really only hearing the parts that Bob Saget narrates? Does it still make a complete story?   I would guess its incredibly fragmented story, but it would be a fun scenario. There are episodes where Bob Saget barely has more than two lines and meanwhile the story progresses.   I don't think it would make sense. The episodes that Saget has the introduction line in, he always starts with \"kids...\" and I doubt Ted would constantly address them throughout the story.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18fl52/has_anyone_tried_piecing_together_all_the_audio/"
  }, {
    "id" : 40,
    "title" : "\"What your favourite thing about koalas?\"",
    "snippet" : "   what is this font?  For the love of god between this and the Priestly this subreddit will be nothing but reposts.  Well unless you want to write a vast number of new episodes, we won't have anything new to talk about until the next week's episode.",
    "url" : "http://i.imgur.com/Ci8YMZn.jpg"
  }, {
    "id" : 41,
    "title" : "Besides like the whole \"PS I Love You\" Episode, this may be one of my favorite scenes of the season",
    "snippet" : "  ",
    "url" : "http://www.youtube.com/watch?v=-V5xjfSB53E"
  }, {
    "id" : 42,
    "title" : "Am I the only one? (In regards to Jeanette)",
    "snippet" : "I really appreciate that they are finally going to end the show, I think it's what it deserves at this point; I love HIMYM. But this Jeanette thing to me seems like a killing of time really, and it really annoys me; I understand they're saving the mother for the last season. But instead of dragging the viewer through the mud with this girl can't we just move on? \n\nWhen Lily said that Ted needed this girl, I was in disbelief this is a total change of her character all together for the sake of dragging Jeanette on. I just thought it'd be nice for the last few episodes of the season if they explored other characters more. I just was curious as to whether I was the only person who felt this way.  I'm actually glad she was in there because now it FINALLY feels like they will introduce the mother. Plus absolutely anything is better than Zoe I feel like the red headed step child of this sub, but I actually liked Zooey..  I feel like the red headed step child of this sub, but I actually liked Zooey..  I liked zoey until they did that one last fuck with her character. When they were in that old building spending the night, and they finally talked over what it was that drew her to that building so much, it seemed like she finally got over it. By the end of the night (before they left), she was ready for it to go. And she did love ted. But then they get to that hearing and not only is she back on the gung-ho save the building tear, she's willing to destroy the career of the man she loves and his best friend for it? Please.  I feel like the red headed step child of this sub, but I actually liked Zooey..  Zoey is my favorite Ted girl! Her and season one victoria.. Both relationships had such d'aw beginnings.. The drumroll and the honey story I'm actually glad she was in there because now it FINALLY feels like they will introduce the mother. Plus absolutely anything is better than Zoe Agreed on both accounts Zoey is the worst girlfriend of the series IMO Victoria. I liked Victoria in the first season, not so much this season. Me too. She was awesome season 1 but the writers made her so annoying this last season  Agreed on both accounts Zoey is the worst girlfriend of the series IMO  In my opinion I like this final addition before the mother. This is not only a physical journey of how he met the mother but an internal and emotional journey as well. It was said in the St. Patrick's day episode in season 3 that if he met her then she would of never liked him. This entire story is not only about how he got to the right place at the right time to meet her but how he became the person that he needed to be ready to meet her. Most things that has happened is not only a physical step but an emotional step as well. Janette is a major emotional step for him because this is the pretty much one of the final steps because after this he permanently wants to meet the one and settle down. Beforehand this there was always this feeling that being single is fun like he said in the latest episode but Janette is going to show him that it's no longer fun. It's not dragging their feet but building up to how crazy and life changing she will be to Ted. Once that happens then he is ready to meet her and will.  In my opinion I like this final addition before the mother. This is not only a physical journey of how he met the mother but an internal and emotional journey as well. It was said in the St. Patrick's day episode in season 3 that if he met her then she would of never liked him. This entire story is not only about how he got to the right place at the right time to meet her but how he became the person that he needed to be ready to meet her. Most things that has happened is not only a physical step but an emotional step as well. Janette is a major emotional step for him because this is the pretty much one of the final steps because after this he permanently wants to meet the one and settle down. Beforehand this there was always this feeling that being single is fun like he said in the latest episode but Janette is going to show him that it's no longer fun. It's not dragging their feet but building up to how crazy and life changing she will be to Ted. Once that happens then he is ready to meet her and will.   She is just one last piece in the puzzle of how he met their mother.    I wanted Jeanette to be something more, something like Stella, something like Robin, someone that we would want to be the mother, but know that it wasn't meant to be. Something like this would really get me ready to meet the mother. Someone that would break Ted's heart and then when he meets the mother we see him happy. It would actually add something to the story, but instead the writers made her a crazy person... Big opportunity missed.  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18fda7/am_i_the_only_one_in_regards_to_jeanette/"
  }, {
    "id" : 43,
    "title" : "Watching the new episode when Barney's \"antique Swiss clock\" reminded me of something.",
    "snippet" : "  It reminded you of a clock? Like the clock that was used? So the clock reminded you of a clock. Got it. No, I have a clock identical to it. That's what it reminded me of. Those clocks aren't really that rare",
    "url" : "http://imgur.com/z6WKslX"
  }, {
    "id" : 44,
    "title" : "Netflix reloaded at an awkward moment",
    "snippet" : "  Is it sad that I know this is the beginning of S02E20 Showdown.  Is it sad that I know this is the beginning of S02E20 Showdown.  ",
    "url" : "http://i.imgur.com/vpQJq6d.png"
  }, {
    "id" : 45,
    "title" : "Malicious Advice Mallard for those who don't watch HIMYM (fixed)",
    "snippet" : "   I think Barney's the mother.  original?  Have you people read the Fan Theory that he's explaining to his kids how he's marrying Robin to fulfill their \"when we're forty\" agreement because in the future Ted and Robin's spouses die? Except the fact that Ted canceled that agreement last season.  [deleted] Be realistic, it's a fucking sitcom not a soap. [deleted] 1. Kids would not be sitting there bored and complaining if he is telling them about their dead mother (\"Are we being punished\", \"You've been talking for like a year\", etc.)\n\n2. The whole point of starting with Robin was because it's the story of how he gets over Robin to become the person he is when he meets his wife. That's why they keep bringing the Robin arc back, because people don't get over someone in a matter of days, or even years. That's why the meeting of the mother is such a significant event for the show; the entire time he has been in love with Robin and it's not until right before he meets the mother that he gets over Robin. \n\nHe's not going to fucking marry Robin after all that. That would undermine the entire show's meaning. [deleted] Sorry for my colorful vocabulary but my point still stands.  Robin can't have kids Robin can't have kids    seven... hundred.... thirty.... eight... upvotes.... all I had to do was change Patrice to Robin Hey, thanks for the idea though         But what if Robin really is the mother? But what if Robin really is the mother? Robin can't be the mother because Ted said that he met her on Robins wedding. She played the bass.  Surprise twist: Robin plays the bass at her own wedding Robin can't be the mother because Ted said that he met her on Robins wedding. She played the bass.  But what if Robin really is the mother? ... Are you caught up at all? And no I'm not talking about \"The Final Play\" Most of us figured it out by the first episode. But what if Robin really is the mother? I don't see why this is getting such hate. You'd have to be an idiot to count out the fact that anything is a possibility at this point.  I don't see why this is getting such hate. You'd have to be an idiot to count out the fact that anything is a possibility at this point. ",
    "url" : "http://www.quickmeme.com/meme/3syaj5/"
  }, {
    "id" : 46,
    "title" : "Just something I observed last night.",
    "snippet" : "   Is that pizza box like the newspaper? For anyone who doesn't understand this comment; the same newspaper has been used in many different movies and TV shows for years.  According to this [article here](http://www.slate.com/blogs/browbeat/2010/06/07/the_story_behind_the_recycled_newspaper_prop.html) this was discovered by a user on Reddit though I can't seem to find the original thread.\n\nSomeone manages a Google+ album with a bunch of screen caps of the newspaper [here](https://plus.google.com/photos/116472086794963776491/albums/5370865631009460305?banner=pwa#photos/116472086794963776491/albums/5370865631009460305?banner=pwa) if anyone is interested.  Why is no one pointing out how awesome it is that you recognized that? I also observed that people don't like it when I find similarities in HIMYM and Friends. People hate that. They wanna act like himym was the first to do anything and is super original. I love himym don't get me wrong, but they've taken a ton of things straight out of friends. Granted, friends had 200+ episodes so its kind of impossible for them not to have done almost every single sitcom trick in the book. Surprisingly, very few people I know even watched Friends, let alone watching all the seasons. Many of them, however, like HIMYM. On polish imdb's equivalent, filmweb.pl, HIMYM ranks 10th amongst TV series while Friends haven't even made it to the top 100.  \n  \nI actually watched HIMYM first and just then, like a year ago, Friends. Even though I liked (and still like, very much) HIMYM, Friends are way better. It's going to sound weird, but they seem more 'real' (of course it isn't 100% realistic, but still). Surprisingly, very few people I know even watched Friends, let alone watching all the seasons. Many of them, however, like HIMYM. On polish imdb's equivalent, filmweb.pl, HIMYM ranks 10th amongst TV series while Friends haven't even made it to the top 100.  \n  \nI actually watched HIMYM first and just then, like a year ago, Friends. Even though I liked (and still like, very much) HIMYM, Friends are way better. It's going to sound weird, but they seem more 'real' (of course it isn't 100% realistic, but still). People hate that. They wanna act like himym was the first to do anything and is super original. I love himym don't get me wrong, but they've taken a ton of things straight out of friends. Granted, friends had 200+ episodes so its kind of impossible for them not to have done almost every single sitcom trick in the book. People hate that. They wanna act like himym was the first to do anything and is super original. I love himym don't get me wrong, but they've taken a ton of things straight out of friends. Granted, friends had 200+ episodes so its kind of impossible for them not to have done almost every single sitcom trick in the book. It actually doesn't have anything to do with that, its just not that interesting. Real pizza joints have this box, fake pizza joints have this box. Its like noticing a Jeep. I mean good eyes, but don't feel like theres some vicious subculture like that in this sub.  It actually doesn't have anything to do with that, its just not that interesting. Real pizza joints have this box, fake pizza joints have this box. Its like noticing a Jeep. I mean good eyes, but don't feel like theres some vicious subculture like that in this sub.  It actually doesn't have anything to do with that, its just not that interesting. Real pizza joints have this box, fake pizza joints have this box. Its like noticing a Jeep. I mean good eyes, but don't feel like theres some vicious subculture like that in this sub.  Why is no one pointing out how awesome it is that you recognized that? probably bc about half the pizza places in america have that design   *We got George Stephanopolis's pizza?!*\n\nHow the fuck does one spell his last name?  ",
    "url" : "http://i.imgur.com/gdEFLM1.jpg"
  }, {
    "id" : 47,
    "title" : "Does anyone have a list of all the episodes the kids appear in?",
    "snippet" : "I'm working on a post about all the background items but since they change on occasion I want to make sure I get as many as possible. I haven't seen such a list anywhere online but I figured this was the place where someone might actually have it...  http://www.imdb.com/character/ch0072051/filmoseries#tt0460649  everything past season one is all recycled footage, except for a scene that is kept under lock and key for when Ted finally reveals the mother, so you only need to view season one, and i think the first of season 2 , past that there wont be any change\n I know it's been filmed in advance but there are for sure changes in each season. I'm assuming they moved things around and updated the decor for a reason - I saw an interview once where the set director mentioned how everything is purposeful - but tracking those changes is hard. Right now I have a ton of screenshots but I'm not positive which coordinates with which episode. I'm working on it though! the changes in decor and whatnot are probably from episodes in season 1 and earl 2, past then, you wont find a change, simply because it is a million times easier for there not to be a change. \n\nif they are recycling footage, it becomes very hard for them to edit something in or out, its is just easier for them to leave it.\n\n\nthe main point of the show, is that we are viewing and listening to a very in depth version, and Ted is probably telling his kids about 2-3 minutes of info for every episode, aso the kids are getting a story all in one night, whilst we are getting it across 8 years. since this program is good with continuity, they wont be changing/editing anything in the room once they begin recycling footage, since people like you will begin to ask questions like where did it suddenly come from and stuff.\n\nseriously, once you get your information from the first two seasons, stop looking through the episodes.  I understand your point, but I'm saying that I've seen changes from season to season. For example, the scenes with the kids in season 6 are not exactly the same as the scenes from season 8. \n\nBackground items have already been confirmed as important - the little yellow bus, for example, and the piece of artwork seen in both Ted's future house and Stella's current house. \n\nThe changes could be completely random, with the set director moving and replacing things in between shots of the kids, and then dispersing them through the seasons, but there are absolutely changes past season 2. there could very well be a change from one scene in se6 and se8, but both of those scenes would have already appeared in season 1 and 2. no new footage of the kids has been filmed since season 2, and it is unlikely they have unseen footage (except for the mother reaction) or they wouldve already used it. im not saying there wont be changes, im saying that after season 2, you would have already seen any possible changes that werent edited in there could very well be a change from one scene in se6 and se8, but both of those scenes would have already appeared in season 1 and 2. no new footage of the kids has been filmed since season 2, and it is unlikely they have unseen footage (except for the mother reaction) or they wouldve already used it. im not saying there wont be changes, im saying that after season 2, you would have already seen any possible changes that werent edited in  The only time i recall seeing a change is from the pilot to the actual episodes.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18ef2h/does_anyone_have_a_list_of_all_the_episodes_the/"
  }, {
    "id" : 48,
    "title" : "How I Met Your Mother: Exclusive Paley Center Interview Series on Reserve Channel",
    "snippet" : "   I watched until they started fielding audience questions.\n\nThese videos were super rad. Way better than the shitty karma grab posts this sub gets flooded with all the time. I agree a little with that but then without those this sub  would be so quiet. Better to have shitty meme pictures than nothing. I suppose. I just always enjoy stuff like this and serious discussion threads so much more than \"LOL LOOKS GUYS MY COFFEE SAYS SWARLEY.\" I don't know, I guess I just get irritated with the more circlejerk type of stuff, the same tired jokes and memes over and over.",
    "url" : "http://youtu.be/A0v-ao0-_RQ"
  }, {
    "id" : 49,
    "title" : "Good Guy HIMYM",
    "snippet" : "  nope. they just make you wait 8+ years to actually do the thing the show is titled after.  would you rather them have introduced her after season 1? I think a lot of people here would have preferred Barney's 52 seconds to 9 years of long-form narrative. These are the same people who watch the Super Bowl for the commercials and fall asleep during Star Wars. \n\nLife's not about the destination but the journey, and it's sad to see so many people wanting to check off boxes rather than just enjoy the story going on around them, whether it's in life or in this show. I think a lot of people here would have preferred Barney's 52 seconds to 9 years of long-form narrative. These are the same people who watch the Super Bowl for the commercials and fall asleep during Star Wars. \n\nLife's not about the destination but the journey, and it's sad to see so many people wanting to check off boxes rather than just enjoy the story going on around them, whether it's in life or in this show. I definitely agree that life is more about the journey, but HIMYM is starting to push it. To me, season 7 was frustrating. In the beginning of it, we see Barney getting married. Then he goes through this whole thing with Quinn and they end the season by showing that he actually gets married to Robin (something I thought was inevitable after their episode together early on in the series).  \nI completely understand that the show is about how these relationships evolve, but having the entire season be about barney and Quinn and then to throw it out in the last minute feels like a waste. Like, a lot of that could be spent on Barney and Robin, or maybe some more info about the mother.  \nIdk, just my two cents, I guess. The pacing at the end of Barney's and Quinn's relationship was quite unfitting, though the relationship itself was quite important for Barney's character development. After he was ready to settle down he realized he needed someone he could trust in, which led him to Robin. Sure, you could have just put them together otherwise, but I liked it that way. would you rather them have introduced her after season 1? I'd rather they made fewer seasons with less filler. This.\n\nIf we look closely to the series, basically nothing changed between the 3rd/4th season and the 6th/7th, maybe only the baby of Lily and Marshall.\n\nThis is bad writing. It's a sitcom. If every episode revealed something important, the show would've been finished in season 2. Filler is pretty much inevitable. And I personally am enjoying the journey, even if it's long. This.\n\nIf we look closely to the series, basically nothing changed between the 3rd/4th season and the 6th/7th, maybe only the baby of Lily and Marshall.\n\nThis is bad writing.  Wait, what huge breakthrough are you talking about?  Like when Barney Proposed the Robin Okay, I can see that. Although one could make the argument that it didn't really advance the plot because we knew that it was going to happen.  Or like when Barney met his dad Ohhhhh... I thought something big had been announced in yesterdays episode. Sort of. We know that there will be no girls (probably) between the crazy one and the mother. Like when Barney Proposed the Robin That was at the mid-season break. It makes sense to leave a cliffhanger there as much as at the end of the season.  Like when Barney Proposed the Robin   Like when we found out Barney was getting married? Or when we found out Robin was marrying Barney? Or when Ted proposed to Stella? Or when Ted became a professor? Or when Lily and Marshall decide to have a baby?  Like when we found out Barney was getting married? Or when we found out Robin was marrying Barney? Or when Ted proposed to Stella? Or when Ted became a professor? Or when Lily and Marshall decide to have a baby?  why *wouldn't* you leave a season on a high note? OP is just saying they don't save them all for finales.    I'm just happy we now know that this is the last girl before Ted meets their mother.\nI love the show, honestly I do, but holy shit an 8 year long story.    \nDo these kids ever shower? They're in the same clothes every episode! I've always assumed he's only been telling them the story for a few hours. He doesn't go to the nitty gritty but remembers them in his own mind.",
    "url" : "http://i.imgur.com/BFvo3RY.jpg"
  } ],
  "processing-time-source" : 94,
  "processing-result.title" : "himym3_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/himym3_reddit.xml"
  }
}