{
  "processing-time-total" : 1281,
  "clusters" : [ {
    "id" : 0,
    "size" : 11,
    "score" : 38.80980981663543,
    "phrases" : [ "Way" ],
    "documents" : [ 0, 1, 4, 10, 14, 17, 26, 27, 33, 35, 37 ],
    "attributes" : {
      "score" : 38.80980981663543
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 52.42403321851845,
    "phrases" : [ "Love" ],
    "documents" : [ 1, 4, 14, 18, 26, 43, 45 ],
    "attributes" : {
      "score" : 52.42403321851845
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 64.54538509426833,
    "phrases" : [ "Know a Girl that Looks Way" ],
    "documents" : [ 0, 1, 4, 14, 26, 47 ],
    "attributes" : {
      "score" : 64.54538509426833
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 63.77223088722042,
    "phrases" : [ "Feel Like" ],
    "documents" : [ 14, 18, 26, 28, 38 ],
    "attributes" : {
      "score" : 63.77223088722042
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 72.29392535500892,
    "phrases" : [ "Ted Mosby" ],
    "documents" : [ 0, 5, 26, 40, 43 ],
    "attributes" : {
      "score" : 72.29392535500892
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 49.43868943306491,
    "phrases" : [ "Moment" ],
    "documents" : [ 12, 26, 38, 42 ],
    "attributes" : {
      "score" : 49.43868943306491
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 61.663938228031256,
    "phrases" : [ "New HIMYM" ],
    "documents" : [ 2, 14, 29, 37 ],
    "attributes" : {
      "score" : 61.663938228031256
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 45.04428418138155,
    "phrases" : [ "Advice" ],
    "documents" : [ 16, 30, 32 ],
    "attributes" : {
      "score" : 45.04428418138155
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 23.92740349620328,
    "phrases" : [ "Children" ],
    "documents" : [ 5, 9, 39 ],
    "attributes" : {
      "score" : 23.92740349620328
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 40.79181617260379,
    "phrases" : [ "Help" ],
    "documents" : [ 3, 4, 34 ],
    "attributes" : {
      "score" : 40.79181617260379
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 48.65680060467649,
    "phrases" : [ "I'd have to Watch" ],
    "documents" : [ 1, 4, 14 ],
    "attributes" : {
      "score" : 48.65680060467649
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 47.30415019275344,
    "phrases" : [ "Order" ],
    "documents" : [ 1, 8, 14 ],
    "attributes" : {
      "score" : 47.30415019275344
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 35.309312167178945,
    "phrases" : [ "Paused" ],
    "documents" : [ 11, 30, 49 ],
    "attributes" : {
      "score" : 35.309312167178945
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 23.695406941097485,
    "phrases" : [ "Woman" ],
    "documents" : [ 14, 22, 35 ],
    "attributes" : {
      "score" : 23.695406941097485
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 36.422165331449186,
    "phrases" : [ "Argue" ],
    "documents" : [ 1, 30 ],
    "attributes" : {
      "score" : 36.422165331449186
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 45.73764169274164,
    "phrases" : [ "Emergency" ],
    "documents" : [ 4, 19 ],
    "attributes" : {
      "score" : 45.73764169274164
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 48.12240662501528,
    "phrases" : [ "Project free Tv" ],
    "documents" : [ 27, 33 ],
    "attributes" : {
      "score" : 48.12240662501528
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 44.08716197142309,
    "phrases" : [ "Sex Architect" ],
    "documents" : [ 5, 26 ],
    "attributes" : {
      "score" : 44.08716197142309
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 73.85646978312033,
    "phrases" : [ "Tim Hortons" ],
    "documents" : [ 46, 48 ],
    "attributes" : {
      "score" : 73.85646978312033
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 62.36756268313997,
    "phrases" : [ "Years isn't Really that Big a Difference" ],
    "documents" : [ 1, 23 ],
    "attributes" : {
      "score" : 62.36756268313997
    }
  }, {
    "id" : 20,
    "size" : 12,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 6, 7, 13, 15, 20, 21, 24, 25, 31, 36, 41, 44 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1205,
  "documents" : [ {
    "id" : 0,
    "title" : "Ted telling his kids inappropriate stories...",
    "snippet" : "  But he won't tell them how he used to smoke pot.  Has to be a line somewhere This is probably a sign that pot is still illegal in 2030. I think it's a sign that you're not allowed to smoke pot on a national television station.  They did on Freaks and Geeks, which was on NBC in the 1999-2000 season (which I would think would be stricter than today) It didn't show them actually smoking it though, did it? That 70's show never showed them actually smoking because they were't allowed, and that aired in 1998. I'm pretty sure they showed them smoking on Freaks and Geeks.  I'm pretty sure they showed them smoking on Freaks and Geeks.  It didn't show them actually smoking it though, did it? That 70's show never showed them actually smoking because they were't allowed, and that aired in 1998. If I remember correctly, Lindsay rolls a joint and they show her smoking it before she throws it out the window when her dad comes in. Maybe they didn't actually show an inhale? They did on Freaks and Geeks, which was on NBC in the 1999-2000 season (which I would think would be stricter than today) I think it's a sign that you're not allowed to smoke pot on a national television station.  I think it's just supposed to be a running joke.  I'm sure they could get away with just coming out and saying that the characters smoke weed from time to time, but it's funnier to have the running joke about sandwiches. I think it's just supposed to be a running joke.  I'm sure they could get away with just coming out and saying that the characters smoke weed from time to time, but it's funnier to have the running joke about sandwiches. It also led to other jokes like the confetti. I think it's a sign that you're not allowed to smoke pot on a national television station.   How did you manage to Instagram this? Photoshop\n\nemail to yourself\n\nopen email on phone\n\nsave to photos \n\ninstagram\n ........why? Why not? There's like 50 reasons...  I never really noticed how good a pick david henrie was to be ted's son. Dont look too much into it, just a glance The girls really does have Robin-like features.\n\nThat bugs me. I think it's meant to lead you off on the pilot, making you believe Robin is the mother...     The original red boots episode was on tonight and actually had to turn to my Gf tonight and ask her what the kids must have been thinking when he mentions the great sex he had with robin in the episode. I'm pretty sure I would vomit if my dad told me a story like that  My dad has told me stories like that.  And all the times he got high.  And...\n\nOh, shit.  My dad is Ted Mosby.  And fuck, I still don't know how he met my mother.  I just know it was in Germany and that they got married 3 weeks after they met... and Dad tells us stories leading up to meeting Mom, but he never actually got to that point.  And I'm 29.  My dad is worse than Ted Mosby. Germany huh? Sounds like your dad is alternate reality Ted Mosby who went to Germany with Victoria and then met your mother there after falling out with Victoria over the pronunciation of German words, most egregiously her pronunciation of Bauhaus.\n\n...Damn it my imagination is way over active. Why would I even come up with that narrative? Why would I give it so many details!? ",
    "url" : "http://i.imgur.com/PVaPrMB.jpg"
  }, {
    "id" : 1,
    "title" : "Looks like Robin and Barney...  Spoiler?",
    "snippet" : "  Also, apparently Robin and Lily are vampires. Carl turns them in 2015. Also, apparently Robin and Lily are vampires. Bored now... Bored now... Bored now... Here we go.\nhttp://www.gifsoup.com/view/989278/bored-now.html What is that from? What is that from? Also, apparently Robin and Lily are vampires.  I think it's just an oversight on the show and Cobie's part. After flashing it, she couldn't put her hand down fast enough. Same with NPH in \"Trilogy Time,\" when he was hiding his own hand. He wasn't wearing a ring, but it doesn't mean they're not married.\n HIMYM is typically great with continuity.  I'm not so sure they'd make such a big continuity mistake---especially while Barney and Robin's engagement/wedding is so salient right now. I think HIMYM are a bit rubbish with continuity.  Sometimes they go really out of their way to make sure something is perfect, sometimes they totally miss stuff out. Do you have any examples? I can't remember exactly, but in early episodes Robin says she never took part in any team sports, I think she said she played tennis or do bring similar. \nThen later she's in the hockey team, kisses a boy and her dad sees.  I can't remember exactly, but in early episodes Robin says she never took part in any team sports, I think she said she played tennis or do bring similar. \nThen later she's in the hockey team, kisses a boy and her dad sees.  Yes--that's one.  I think that's relatively minor, though.  Definitely nowhere near the scope of forgetting that Robin's married.\n\nA bigger one is the timeline with Lily returning from SF and Barney setting up Marshall with girls and stealing them from him.  That's the only major continuity error I know of.\n\nOther than the hockey error, I can't think of any others---which is certainly far fewer continuity errors than most sitcoms. &gt; A bigger one is the timeline with Lily returning from SF and Barney setting up Marshall with girls and stealing them from him. That's the only major continuity error I know of.\n\nWait, where is the continuity error here? The error is that in E01, Lily returns from SF to NY.  Then in a later episode, E02 IIRC, Barney starts trying to set Marshall up with other women (so that he will get over Lily), but he ends up stealing all of the women from him.\n\nLater in S2, it's revealed that Barney was the one who flew to SF, convinced Lily to come home, and bought her a ticket.  In that flashback, he says to her something to the effect of, \"And come home soon, because I can't keep stealing women from Marshall forever.\"\n\nI consider this the biggest continuity error because it gets the events out of order (Lily came back BEFORE Barney started setting Marshall up on dates) and it gets the character's motives wrong (Barney wasn't stealing women from Marshall to keep him for Lily---Barney was the one who actually started pushing Marshall to date, and then stole the women because, well, he's Barney). The motive is not an issue. Barney wasn't pushing Marshall to date other women because he wanted Marshall to date other women; he was pushing that so that Marshall would stop being mopey-loser-Marshall and start being able-to-pick-up-a-girl Marshall - in other words, a version of Marshall that would be able to win Lily back.\n\nOf all the things Barney's done, stealing women from his bros is something he just doesn't do, outside of this Marshall thing. (I don't think.) It's blatantly clear that he was doing it to stop Marshall, not merely to get laid himself. \n\nThe timing issue... I'd have to watch it again, but weren't the \"Barney staling girls\" scenes in a double-flashback back to during the summer? The motive is not an issue. Barney wasn't pushing Marshall to date other women because he wanted Marshall to date other women; he was pushing that so that Marshall would stop being mopey-loser-Marshall and start being able-to-pick-up-a-girl Marshall - in other words, a version of Marshall that would be able to win Lily back.\n\nOf all the things Barney's done, stealing women from his bros is something he just doesn't do, outside of this Marshall thing. (I don't think.) It's blatantly clear that he was doing it to stop Marshall, not merely to get laid himself. \n\nThe timing issue... I'd have to watch it again, but weren't the \"Barney staling girls\" scenes in a double-flashback back to during the summer? Yes--that's one.  I think that's relatively minor, though.  Definitely nowhere near the scope of forgetting that Robin's married.\n\nA bigger one is the timeline with Lily returning from SF and Barney setting up Marshall with girls and stealing them from him.  That's the only major continuity error I know of.\n\nOther than the hockey error, I can't think of any others---which is certainly far fewer continuity errors than most sitcoms. Do you have any examples? also, early on in the show maybe season 1 or 2 Marshall says something like he's never been in a fight before and is portrayed as some sort of sissy\n\nand then later in the show we see he held fight clubs with his brothers and beat up doug. minor, but the errors are all over the place. One that's always really bothered me is that in one of the earlier seasons, Barney is TERRIFIED of driving, cars and everything to do with them. A few seasons later he's driving and it's never referenced that he used to have this irrational phobia.  The scenes where he didn't know how to drive were flash backs. And the scenes where he is driving are a couple of seasons later. Chances are that he learned to drive in that time frame - maybe Ted made a big deal about it and made sure to teach him when he found out.  also, early on in the show maybe season 1 or 2 Marshall says something like he's never been in a fight before and is portrayed as some sort of sissy\n\nand then later in the show we see he held fight clubs with his brothers and beat up doug. minor, but the errors are all over the place. He just doesn't count fights with his brothers as real fights. There is a difference between wrestling with your brothers and getting into a fight in a bar.  Except we saw that this is definitely not the case for Marshall and his brothers. They were not just wrestling like brothers normally do. Their fights were really damn violent.  There's still a difference between fighting with your friends/siblings and getting into fights in a freaking bar. I got into a fight back in middle school, but I would still say I've never gotten into a \"real\" fight before. In Marshall's case there would be real repercussions for getting into a fight at MacLaren's but that's not the case when he was fighting with his brothers, no matter how \"violent\" they were. Except we saw that this is definitely not the case for Marshall and his brothers. They were not just wrestling like brothers normally do. Their fights were really damn violent.  Do you have any examples? Ted says \"Vomit free since '93!\"\n\nThen in the episode where they made a drinking game about Robin saying But um: \"Then i guess it's not a very good drinking which would mean last night when barney and I played it I didn't get super wasted and throw up all over myself. Oh wait, I did both of those things so… face!\" Ted says \"Vomit free since '93!\"\n\nThen in the episode where they made a drinking game about Robin saying But um: \"Then i guess it's not a very good drinking which would mean last night when barney and I played it I didn't get super wasted and throw up all over myself. Oh wait, I did both of those things so… face!\" Ted says \"Vomit free since '93!\" way back in the first season. He pukes from Robin's drinking game in the fourth or fifth season I think. That's not inconsistent. Do you have any examples? HIMYM is typically great with continuity.  I'm not so sure they'd make such a big continuity mistake---especially while Barney and Robin's engagement/wedding is so salient right now. HIMYM aren't that great with continuity actually. They got better at towards the end when the finally figured out their end game, but there are plenty of mistakes. Do you have any examples?  The only real severe continuity error I'm aware of is the season 2 timeline surrounding Lily coming home and Barney trying to set Marshall up with women. Marshall has the no food/drink in the Fierro rule, yet in the Tantrum episode, they're shown drinking it in the Fierro.\n\n*Barney is shown being unable to drive, then later an episode features him trying to get out of speeding tickets.\n\nOne episode states that Marshall and Lilly shared a toothbrush, but there are episodes where they're brushing simultaneously.\n\nThese are just a couple off the top of my head, but there are many more throughout the series. I mean, most are fairly minor nitpicks, but it's still annoying, because it's a hallmark of lazy TV writing - create some trope/idea/joke for one episode, and then forget it.\n\n*The Barney driving one has been discussed to death, with many people arguing that he could have learned to drive in that time, which I suppose is plausible, but I still think it counts.\n\n I think it's just an oversight on the show and Cobie's part. After flashing it, she couldn't put her hand down fast enough. Same with NPH in \"Trilogy Time,\" when he was hiding his own hand. He wasn't wearing a ring, but it doesn't mean they're not married.\n &gt;He wasn't wearing a ring, but it doesn't mean they're not married.\n\nLots of couples don't wear rings or even have rings. I never bothered with one because I can't wear it while at work and I;m too great at losing things to have one that I take off. Also I got dirty looks from clerks at jewelry stores when I told them i'm a size U, and was then given that condescending 'we don't have anything in *your* size\" even though I know they do because my partner is also a U and that's where we bought his ring. &gt;Also I got dirty looks from clerks at jewelry stores when I told them i'm a size U, and was then given that condescending 'we don't have anything in your size\" even though I know they do because my partner is also a U and that's where we bought his ring.\n\nI have no idea what a ring size of U is. We use numbers in the US. Can you explain? I'm curious what that translates to and why the clerks would give you dirty looks for having that ring size. It's a large men's size, very, very few women have that ring size and there is  stigma attached with anything over an 'R' because you are into the bigger men's sizes, a lot of people think you are trans or buying rings for a gay wedding a lot of high-class jewelry shops are very conservative and a bit prejudice so they are not quick to sell rings if they suspect that.  How many years ahead was this? This might lend some weight to the Barney's dead in the future theory. This was during the 'twelve years later...' scene.  I can't say I'm familiar with that theory though. Basically, people are theorizing that Barney is dead in the future, and that he's so extravagant in the show because Ted is idealizing him. Him dying sometime before 12 years into the future could cause Robin to stop wearing her ring. Well... Now I'm sad. :( Don't worry he's not dead its just a crazy theory. I read the theory. It sort of makes sense. :(\n\nHis last cigarette was 2017, after all. Why would they choose 4 years later? :(((((((\n\nI need to stop reading sad theories. There are some references by future Ted that clearly indicate that he isn't dead like In season 7 Episode10 Tick Tick Tick *Future Ted* say \n\n\n*To this day Barney and Robin swear this is the song they danced to that night*\n\n\nTo me this means he's still alive in 2030 atleast. \n\nEDIT: Ok found another one\n\nSeason 5 Robots Vs. Wrestlers: *\"But every year, we [the gang] still get together for Robots vs. Wrestlers.\",*\n\nSeason 6, Subway Wars: *\"To this day, your Uncle Barney won't admit it ...* This is nice. I certainly don't want him to be dead ... but we all need to understand that when the show ends, there will be inconsistencies in the timeline. There already are such inconsistencies. For example, in season 1, it's stated that Marshall has never been in a fight (in an early episode), but then we learn in season 3 that Marshall is an expert fighter from years of fighting with his brothers. For that particular example it could just mean that he doesn't fights with his brothers as legitimate fights. There is a difference between wrestling ~~either~~ older siblings and getting into a fight in a bar.  There are some references by future Ted that clearly indicate that he isn't dead like In season 7 Episode10 Tick Tick Tick *Future Ted* say \n\n\n*To this day Barney and Robin swear this is the song they danced to that night*\n\n\nTo me this means he's still alive in 2030 atleast. \n\nEDIT: Ok found another one\n\nSeason 5 Robots Vs. Wrestlers: *\"But every year, we [the gang] still get together for Robots vs. Wrestlers.\",*\n\nSeason 6, Subway Wars: *\"To this day, your Uncle Barney won't admit it ...* Easily a throwaway nostalgia line.\n\nEdit: JEEZUS people, I don't want Barney dead. you really want him to be dead dont you? I read the theory. It sort of makes sense. :(\n\nHis last cigarette was 2017, after all. Why would they choose 4 years later? :(((((((\n\nI need to stop reading sad theories. In The Exploding Meatball Sub (Season 6 Episode 20, originally aired April 11, 2011) there is a fast forward at the end to \"Ten Years Later...\" in which Barney tricks Marshall into eating a meatball sub... that explodes.\n\nThat means, at the earliest, Barney can die in 2021.  So last cigarette in 2017 doesn't make much sense for that theory. He stops smoking because he develops lung cancer. He stops smoking because he develops lung cancer. He says he's perfectly healthy, so the cigarette has nothing to do with it.  Well... Now I'm sad. :( Exploding Meatball Sub disproves that theory Basically, people are theorizing that Barney is dead in the future, and that he's so extravagant in the show because Ted is idealizing him. Him dying sometime before 12 years into the future could cause Robin to stop wearing her ring. How many years ahead was this? This might lend some weight to the Barney's dead in the future theory. My grandfather died about 20 years ago, and my grandmother still wears her wedding ring.\n\nIt's more likely that the wedding doesn't go through, or Barney and Robin divorce. We already know the wedding goes through. For one, Thomas &amp; Bays have said it does. For another, we saw Robin happily dancing with her father at the reception.  But doesn't Ted seem to be sad/remembering something sad when he sits at the train station after the wedding?   what is the point of wearing the the ring when they clearly want hands not to be shown.Totally agree its an oversight on Cobie's part in this scene. What's the point of hiding the hands if there's nothing to hide? The writers probably want the speculation. You know them. They love teasing us above all things. I can agree about the speculation, I just think that if they were to go that far I think they'd be careful to have her wear/not wear the ring in that scene. Even if she wore the ring we were still not supposed to see the hand it was an clear over sight.\nRing was not relevant in this scene hiding the hand was to generate the speculation on their *will they won't they* thing as mentioned above.   Maybe Robin's like my mom and just never wears her wedding ring.  I only know my mom had a wedding ring because she showed us, and it was gorgeous, and it's opal which is my birthstone by coincidence which means it's going to be my ring one day.  Mom just never liked wearing jewelry that often.\n\nEither that, or Barney's dead. Robin doesn't wear a ring because she likes getting free stuff. Robin doesn't wear a ring because she likes getting free stuff. That was her story line for an entire episode, wasn't it? Robin doesn't wear a ring because she likes getting free stuff.    I maintain, Ted recounts Barney to the kids as if they've never met him.. Likely because he is dead in the future.  We've never seen him in a flash forward I thought this was disproven by the exploding meatball sub future bit. how far ahead was this, i thought it wasn't very far down the line.  I may be remembering incorrectly. the episode aired in april 2011 and the deathbed scene is apparently \"10 years later\" so he's still alive and well in 2021. If I remember correctly Ted's oldest is definitely born by 2015 going by the starwars every 3 years episode. So his daughter would be at least 6 and his son would already be born with Barney still quite alive.  It could simply mean they get divorced not that Barney is dead as many of you are proclaiming. I really hope Barney doesn't die in the future.    Guys, Barney's dead and she just got over it and she took off the ring...  Why is everyone so sure they marry? At the beginning of this season 'after' the wedding, Ted looks all sad and (I'm not sure) he says it wasn't a great time or he didn't want to talk about it. \n\nAnd let's not forget the \"never invite an ex to your wedding.\" \n\nAlthough I do want for them to marry and get it over. 1. Because Thomas &amp; Bays said they absolutely get married and 2. because we saw Robin happily dancing with her father at the reception.  1. Because Thomas &amp; Bays said they absolutely get married and 2. because we saw Robin happily dancing with her father at the reception.  Remember how Ted says, \"a wedding day that went horribly wrong\"?  What do you think that means then?  I like to hear theories Why is everyone so sure they marry? At the beginning of this season 'after' the wedding, Ted looks all sad and (I'm not sure) he says it wasn't a great time or he didn't want to talk about it. \n\nAnd let's not forget the \"never invite an ex to your wedding.\" \n\nAlthough I do want for them to marry and get it over. God I hope they invite crazy Meg. ",
    "url" : "http://i.imgur.com/VkIlbXe.jpg"
  }, {
    "id" : 2,
    "title" : "Just noticed this while watching the new HIMYM episode",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/EVMc38V.jpg"
  }, {
    "id" : 3,
    "title" : "Every time I watch the Murtaugh episode, I can't help but think this",
    "snippet" : "    ",
    "url" : "http://www.quickmeme.com/meme/3sy60f/"
  }, {
    "id" : 4,
    "title" : "Episode Discussion S08E16 - \"Bad Crazy\" (Here be spoilers!)",
    "snippet" : "**Live Chat:**\n\n----------------------------------\n\nWe now have our own registered IRC channel. Pop in any time to see if people are there discussing the show!\n\n\nFollow [this link](http://webchat.freenode.net/?channels=#himym), log in with your reddit nick and we will discuss live! **Chat is open now, but picks up ~15 minutes prior to airing.**\n\n-----------------------------------\n\n**Reddit:**\n\nThere will still be discussion here on this post, but we will be live in IRC as well.\n\n--------------------------------------\n\n\n**DISCUSS!**  Mike Tyson completely caught me off guard. Loved it! &gt;Senator Mike Tyson \n\nFTFY Mike Tyson completely caught me off guard. Loved it!  At this point, you just call the cops. Like seriously. I get it's all for the sitcom fun, but that's ridiculous.\n\nEDIT: scratch that. Ted's fucked. At this point, you just call the cops. Like seriously. I get it's all for the sitcom fun, but that's ridiculous.\n\nEDIT: scratch that. Ted's fucked. At this point, you just call the cops. Like seriously. I get it's all for the sitcom fun, but that's ridiculous.\n\nEDIT: scratch that. Ted's fucked. It's still illegal for a cop to do that. He just has to somehow get a different cop to come down. but she's a CAWP IS SHE A CAWP? but she's a CAWP At this point, you just call the cops. Like seriously. I get it's all for the sitcom fun, but that's ridiculous.\n\nEDIT: scratch that. Ted's fucked.  DEPARTED!! Yes! \"Is she a cawp?!\" \"I think she's a cawp!\" DEPARTED!! Yes! \"Is she a cawp?!\" \"I think she's a cawp!\" DEPARTED!! Yes! \"Is she a cawp?!\" \"I think she's a cawp!\"  Kids, I had such a great time being a man-whore in NYC. Kids, I had such a great time being a man-whore in NYC. I'm pretty sure they got almost everyone on [the list](http://i.imgur.com/OBPMuN7.jpg) in that montage. Unfortunately, there are so many errors and mistakes in that list.  Why's the earth round?\nWhy does the sun rise?\nWhat do I do for a living?\nSome things are meant to never be answered... They are fan servicing us so hard right now. They are fan servicing us so hard right now. Why's the earth round?\nWhy does the sun rise?\nWhat do I do for a living?\nSome things are meant to never be answered... Why's the earth round?\nWhy does the sun rise?\nWhat do I do for a living?\nSome things are meant to never be answered...  Wow... I can't believe that Ted's dead... Major Spoilers bro. [Killed by a bazooka. Holy shit.](/spoiler)  Future Robin and Lily are FOINE\n\nEdit: Okay I was talking about the first flashforward, the 4 years ahead one. fYne Future Robin and Lily are FOINE\n\nEdit: Okay I was talking about the first flashforward, the 4 years ahead one. Robin looks fine in the second one too. It might be cause of the lipstick though.  Yeah for sure. In the first one though I was like \"DAAAAAAAAAAAAAAAAAAAAYUUUUUUUUUUMM GURRL\" Future Robin and Lily are FOINE\n\nEdit: Okay I was talking about the first flashforward, the 4 years ahead one.  Pulling. Them. Off. Did you notice they were burning in the scene at the beginning/throughout the episode? RIP Red Boots. The Mother never knew you.\n\n*whew* Did you notice they were burning in the scene at the beginning/throughout the episode? Pulling. Them. Off. Pulling. Them. Off.    Best cameo EVER!  He's so good with babies. I found this really awkward because his daughter died accidentally while unsupervised.  They're hiding Robin's left hand a lot in these fast forward scenes.  They showed her left hand, and there is a bigass ring on it. They showed her left hand, and there is a bigass ring on it. They're hiding Robin's left hand a lot in these fast forward scenes.  Revival of the Barney's dead in the future theory?? has barney been in any of the fast forward scenes? They're hiding Robin's left hand a lot in these fast forward scenes.   She's a cawwwwp!!!!!  Yay, no more meaningless girlfriends  I really dug that quote by ~~Lily~~ Mike freakin' Tyson about \"crazy girls.\" I used to date someone that drove me so crazy because of his constant mixed signals. It was awful. But the way ~~s~~he described it totally nailed it.\n\nEdit: *\"Here's the thing about crazy. When a guy sends mixed signals to a girl, it takes a toll on her psychological well-being. You wanna know why a girl acts crazy? Look at the guy she's dating. Then you'll really see some crazy.\"*\n\nYep, definitely nailed it. \"Are you Mike Tyson?\" I really dug that quote by ~~Lily~~ Mike freakin' Tyson about \"crazy girls.\" I used to date someone that drove me so crazy because of his constant mixed signals. It was awful. But the way ~~s~~he described it totally nailed it.\n\nEdit: *\"Here's the thing about crazy. When a guy sends mixed signals to a girl, it takes a toll on her psychological well-being. You wanna know why a girl acts crazy? Look at the guy she's dating. Then you'll really see some crazy.\"*\n\nYep, definitely nailed it. Don't think that was Lily's quote, think that was Mike Tysons I really dug that quote by ~~Lily~~ Mike freakin' Tyson about \"crazy girls.\" I used to date someone that drove me so crazy because of his constant mixed signals. It was awful. But the way ~~s~~he described it totally nailed it.\n\nEdit: *\"Here's the thing about crazy. When a guy sends mixed signals to a girl, it takes a toll on her psychological well-being. You wanna know why a girl acts crazy? Look at the guy she's dating. Then you'll really see some crazy.\"*\n\nYep, definitely nailed it.  Jesus, it seems like Robin and Lily can't do their drinking meet-ups often enough. If you've hung around aging women who were best friends when they were younger but have grown into their own lives separate of their old friends as long as I have, you realize that the time jumps were appropriate.  Then them constantly saying how they should do this more often was just icing on the cake.  Hey color theorists, she's wearing purple  Why does Barney not get to keep the Boba Fett suit when he already has the stormtrooper? Maybe Robin and him made a compromise and he got to keep the stormtrooper. Why would you ever choose a Stormtrooper over Boba Fett? Didn't barney have sex with someone when they were wearing the stormtrooper suit? Maybe he got a fetish for it.  Why would you ever choose a Stormtrooper over Boba Fett?  I can't help thinking that this episode would be a lot better if the writers could have found a more creative way to get her into the apartment. Rather than Ted saying, \"Don't let her in.\" And Barney and Marshall doing it anyway. I would've liked it if the second he closes the door and turns around she is in the living room. I would've liked it if the second he closes the door and turns around she is in the living room. How about:\n\nHe leaves after warning them, and when the door is knocked on (when marshall thinks its ted forgetting his keys) ted walks in, and grabs his keys from the table. He turns to leave and bam, there she is.  Anyone notice how everyone at the game was wearing white/grey/black except for Jeanette who was wearing Orange? Doubt it's a coincidence that Orange comes directly before Yellow in the rainbow. I also noticed that the nightgown she was wearing toward the end was purple, and that Robin's shirt in one of the flash-forwards was also purple. There was also a whole lot of red in Ted's apartment. Anyone notice how everyone at the game was wearing white/grey/black except for Jeanette who was wearing Orange? Doubt it's a coincidence that Orange comes directly before Yellow in the rainbow. I noticed this in another episode the other day… when they're boogie boarding outside of the bar, *everyone* is wearing dark colors except Robin, who is wearing bright yellow.  isn't it weird for Barney to be hanging out in his ex fiances old apartment?     References to the Barclay's Center and Sandy. That works. References to the Barclay's Center and Sandy. That works. were they watching a hockey game at barclays though? because that wouldn't work yet (islanders will start playing there in 2015) I'd say basketball. There was no hockey period when they filmed this episode.     Lily and Robin age so well It was like, the makeup department wasn't even trying I like to think that immortality will be invented in a few years. Lily and Robin age so well  Thank you officer Jeanette! [the resemblence is uncanny](http://imgur.com/bWu2g0t)   \"i could just eat you up\" heh \"i could just eat you up\" heh   I really want Barney to show the hot/crazy scale.   First flashforward with Robin?\n\nEdit: Pretty sure I saw a ring on her finger. This confirms any doubt of the marraige   What was the point of the Robin/Marvin storyline if Robin doesn't tell Barney she's infertile? adoption or kidnapping is still a possibility. robin's never been a fan of kids, she always avoided holding them (i forget which episode, but there was one when ted and robin were dating).\n\nI think the writers are showing that even though she can't have kids she's getting over her \"fear\" of them, possibly opening the door for adoption or something like that. Or they're just showing a development that they've already laid out several seasons ago, when Robin dated that guy with a kid. At the end future Ted says something about how she got over that and went on to star in his kids' crayon portraits. adoption or kidnapping is still a possibility. No I meant this would've been a perfect opportunity for discussion.  No I meant this would've been a perfect opportunity for discussion.           [Flair challenge in progress](http://www.reddit.com/r/HIMYM/comments/ynteq/challenge_accepted/).\n\nS08E01 Flair: Li'l tiny chicken legs\n\nS08E02 Flair: The \"Pre-schtupp\", patent pending\n\nS08E03 Flair: Yah bettah than this, Bahney\n\nS08E04 Flair: Mental self-five\n\nS08E05 Flair: No one chases tail like him!\n\nS08E06 Flair: The ghost of Leonardo DiCaprio\n\nS08E07 Flair: All the strip clubs are after me\n\nS08E08 Flair: Late hand-bloomer\n\nS08E09 Flair: Bib up!\n\nS08E10 Flair: That could be anybody's baby handprint, Ted\n\nS08E11-12 Flair: Turn it over.\n\nS08E13 Flair: I left the meatball at home\n\nS08E14 Flair: It wasn't night and we weren't standing\n\nS08E15 Flair: This is re-dick-a-luss\n\nS08E16 Flair: But then, when she starts bringing knives into bed...\n   Jeanette was wearing all purple when she was in Ted's room. Well, purple with red boots. And she looked smoking hot, amirite?  Fun fact: all the food in the picture when Ted is describing his emergency rations are Irish brands. Neat.  Abby Eliot! Chris Eliot's daughter!!!!!! :D Nice   Ugh. Kind of a nothing episode. Some good jokes, great use of running gags, I loved the flashforward sequences, but it just seemed to fly by!\n\nWe're in that weird space before the last four or so episodes where nothing all that earth-shattering is going to happen, so the story seems stagnant.\n\nThough now after having written all of that I actually think I really liked this episode.  So we're not supposed to know what Barney does for a living!? So we're not supposed to know what Barney does for a living!?      I can't see the comments :(\n\nEdit: nevermind, its good          Why is Barney not using the hot crazy scale in this episode? She was just as crazy as she was hot, so she'd be right on the Vicky Mendoza diagonal.   In the beginning of the episode Ted refers to Marvin as his kids' cousin.  Why?     I want Ted's suit. Thingy.                  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18cg5b/episode_discussion_s08e16_bad_crazy_here_be/"
  }, {
    "id" : 5,
    "title" : "After seeing all 38 women Ted has dated before he met the mother",
    "snippet" : "  Easy, Costanza Don't you mean Art Vandelay: Sex-City Planner?  I'm in latex.   You should also buy a bar. Woah, dude. We should open a bar! We should TOTALLY buy a bar! And we'll call it Puzzles! Why is it called puzzles? And we'll call it Puzzles!  Architect here: My lifestyle of dating many women is due to the fact that my career is life consuming and doesn't allow me to maintain normal relationships. \n\nDON'T DO IT! (trust me, I'm an architect)  Architect here: My lifestyle of dating many women is due to the fact that my career is life consuming and doesn't allow me to maintain normal relationships. \n\nDON'T DO IT! (trust me, I'm an architect)  Don't listen to him OP, I just heard 7 girls swoon after reading u/brettchitect was indeed an architect.  Don't listen to him OP, I just heard 7 girls swoon after reading u/brettchitect was indeed an architect.  I'm swooning as we speak, but I think it might be the drugs... has anyone seen my adrenaline?  Architect here: My lifestyle of dating many women is due to the fact that my career is life consuming and doesn't allow me to maintain normal relationships. \n\nDON'T DO IT! (trust me, I'm an architect)  It's a lot easier as an architectural student/junior designer. Still no girl seems to really care about it though. It's more of a \"oh really? Cool story bro\" response Upvote for username. I'm still in that stage as well, my case study's have shown it's usually awesome until they find out how under paid you are... again this perception of architects/doctors/lawyers in the same realm... don't let the secret out!  Have you also noticed that it's \"cool\" and \"awesome\" if you only give sound bites of what you actually do. When they start asking too many questions, the illusion disappears. I've learned to steer questions into another topic for this reason.  It's a lot easier as an architectural student/junior designer. Still no girl seems to really care about it though. It's more of a \"oh really? Cool story bro\" response Architect here: My lifestyle of dating many women is due to the fact that my career is life consuming and doesn't allow me to maintain normal relationships. \n\nDON'T DO IT! (trust me, I'm an architect)  Although, my uncle is a somewhat high profile architect in Ontario, and he has been happily married for what must be 10 - 15 years now with 3 kids. It may just be a personal thing, or who you work for. Although, my uncle is a somewhat high profile architect in Ontario, and he has been happily married for what must be 10 - 15 years now with 3 kids. It may just be a personal thing, or who you work for. \"High Profile\" .. I work for a \"high profile\" firm.. and for every one or two guys like your uncle that are out schmoozing clients all day there are about 75 of me doing the real grunt work getting yelled at by contractors all day :)  Architect here: My lifestyle of dating many women is due to the fact that my career is life consuming and doesn't allow me to maintain normal relationships. \n\nDON'T DO IT! (trust me, I'm an architect)  A *Sex* Architect?  *Sex* architect.  Lance Hardwood: Sex Architect- Played by Ted Mosby *Sex* architect.   Or you can hire a casting director to cast the girls in your life.... Exactly. Especially in a prime time television show where all women have to be super hot to keep ratings high.    Or just live in an apartment above a bar that you hang out at every night    While you're at it, take out some Pablo Neruda from the library.    \"I should become an Actor\" FTFY       Isn't Ted an architecture professor?  Totally different thing.  My wife, an architect, says our children can do anything they want in life, so long as architecture is not on the list. \n\n  OK you proved the whole Architect thing worked, but this isn't you Ted.      ",
    "url" : "http://www.quickmeme.com/meme/3sxucz/"
  }, {
    "id" : 6,
    "title" : "One Last Hair Brained Theory For the Road Involving Everyone's Favorite Red Herring -- Bump Girl (theory in comments)",
    "snippet" : "  Part of me hopes the writers just say fuck it and somehow make Robin the mother.\n\nThen it zooms out to Saget, with the producers behind him, and they just say 'Fuck you' to the camera. End show. Part of me hopes the writers just say fuck it and somehow make Robin the mother.\n\nThen it zooms out to Saget, with the producers behind him, and they just say 'Fuck you' to the camera. End show. they would also have to say Robin can have kids too ROBIN IS THE KIDS.\n\nThey're clones of her and Ted.\n\nSpin-off show - How I cloned your father. they would also have to say Robin can have kids too  As the producer of the show gradually reveal additional secrets about the mother and also flat out tell us that she will be located in specific places at specific times, I think that one last hair brained theory will be fun to discuss.  \n\nOn tonight's episode, early on we were shown a montage of several of the women Ted has met/dated/had sex with/etc.  One of whom they showed for just about the same amount of time she was originally on the show was Bump Girl.  If you're unfamiliar with Bump Girl, she was the red herring in the episode No Tomorrow in which Ted claims that the mother was at that St. Patrick's Day party.  The fan theory about Bump Girl is essentially that Ted only met 2 girls at that party, one of whom he shared drinks with, the other of whom he bumped into, and so therefore she might possibly be Bump Girl.\n\nThen if we jump to the episode Band or DJ?, we learn that Ted's ex-girlfriend Cindy's former room mate (AKA the person who is definitely the mother) is in a band that does weddings, which is of course the band that performs at Barney and Robin's wedding.\n\nMy hypothesis is this: what if Bump Girl is in the band along with the mother?  If there are multiple women in the band, why couldn't one of them be Bump Girl?  What if Bump Girl, the mother, and Cindy are all friends (and hell, maybe even Stella is one of their friends too which would explain how she was at that bar on St. Patrick's Day as well)?  Further, what if the producers of the show placed the footage of Bump Girl into tonight's episode specifically to give us 1 last red herring in this season's finale?  Bump Girl could be a girl in the band that Ted meets at the wedding (though he has as almost no memory of meeting her prior on St. Patrick's Day) and he could meet her minutes before he meets the mother.  I'm not saying he would date Bump Girl or anything because we know that's not possible because of his explanation tonight that Jeanette was his last girlfriend before he's ready to settle down.\n\nI would be extremely happy if this season ends with Bump Girl as the one that Ted is supposedly looking at only to have her be revealed to be an impossible option for the mother.  Then Ted looks over at the bass player and they echo the same ending sequence from Band or DJ? before rolling the credits.  This would indicate that the very beginning of next season will reveal who the mother is while leaving us desperately wondering who she is all summer.  And don't think they won't split up a scene at a wedding around one season ending and another one beginning -- they did it at the end of season 2 into season 3.  If they did that, it would be legen...wait for it...\n\n**tl;dr** - I hope they bring back Bump Girl for a 5 year red herring pay off of epic proportions. I would enjoy the reappearance of the bump girl as well but they didn't show her this episode. That was the married lady - Ashlee - that he made out with, played by Vanessa Minnillo (now Lachey). Damn, I just reviewed the tape and you're right.  I was mistaken about their similarly strange patterned shirts.  Still, despite not being included in that montage, the theory could still work.  I just have a lot less faith in it now though.  Good catch. As the producer of the show gradually reveal additional secrets about the mother and also flat out tell us that she will be located in specific places at specific times, I think that one last hair brained theory will be fun to discuss.  \n\nOn tonight's episode, early on we were shown a montage of several of the women Ted has met/dated/had sex with/etc.  One of whom they showed for just about the same amount of time she was originally on the show was Bump Girl.  If you're unfamiliar with Bump Girl, she was the red herring in the episode No Tomorrow in which Ted claims that the mother was at that St. Patrick's Day party.  The fan theory about Bump Girl is essentially that Ted only met 2 girls at that party, one of whom he shared drinks with, the other of whom he bumped into, and so therefore she might possibly be Bump Girl.\n\nThen if we jump to the episode Band or DJ?, we learn that Ted's ex-girlfriend Cindy's former room mate (AKA the person who is definitely the mother) is in a band that does weddings, which is of course the band that performs at Barney and Robin's wedding.\n\nMy hypothesis is this: what if Bump Girl is in the band along with the mother?  If there are multiple women in the band, why couldn't one of them be Bump Girl?  What if Bump Girl, the mother, and Cindy are all friends (and hell, maybe even Stella is one of their friends too which would explain how she was at that bar on St. Patrick's Day as well)?  Further, what if the producers of the show placed the footage of Bump Girl into tonight's episode specifically to give us 1 last red herring in this season's finale?  Bump Girl could be a girl in the band that Ted meets at the wedding (though he has as almost no memory of meeting her prior on St. Patrick's Day) and he could meet her minutes before he meets the mother.  I'm not saying he would date Bump Girl or anything because we know that's not possible because of his explanation tonight that Jeanette was his last girlfriend before he's ready to settle down.\n\nI would be extremely happy if this season ends with Bump Girl as the one that Ted is supposedly looking at only to have her be revealed to be an impossible option for the mother.  Then Ted looks over at the bass player and they echo the same ending sequence from Band or DJ? before rolling the credits.  This would indicate that the very beginning of next season will reveal who the mother is while leaving us desperately wondering who she is all summer.  And don't think they won't split up a scene at a wedding around one season ending and another one beginning -- they did it at the end of season 2 into season 3.  If they did that, it would be legen...wait for it...\n\n**tl;dr** - I hope they bring back Bump Girl for a 5 year red herring pay off of epic proportions. ",
    "url" : "http://i.imgur.com/lfiLf52.jpg"
  }, {
    "id" : 7,
    "title" : "Finally encountered printed condoms.",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/25A6KeD.jpg"
  }, {
    "id" : 8,
    "title" : "Just ordered this!",
    "snippet" : "    ",
    "url" : "http://imgur.com/f1roSNR"
  }, {
    "id" : 9,
    "title" : "Age of Ted's Children",
    "snippet" : "If it is now 2013 and Ted's kids have not even been conceived yet, hell he hasn't even met their mother, how old are they supposed to be in 2030? The son at the beginning of the show look at least 17, so he should have already been born. How are they going to keep dragging the show on with this constraint?  Well by the next time they watch The Trilogy the daughter is born, so sometime in 2014 or very early 2015. She definitely looks older than the son, so if she's 15ish in 2030 he's probably 13-14 or so. Definitely not 17.   ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18ch4q/age_of_teds_children/"
  }, {
    "id" : 10,
    "title" : "Alfred Hitchcock generalizing (watch all the way through)",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=gu5g86nhWK4"
  }, {
    "id" : 11,
    "title" : "I was watching the Ducky Tie episode and paused here...Barney's expression is priceless",
    "snippet" : "  #REFILL!!!",
    "url" : "http://i.imgur.com/yvFwyQp.jpg"
  }, {
    "id" : 12,
    "title" : "A Barney moment that always makes me laugh - [0:22]",
    "url" : "http://youtu.be/QYExdT95e54"
  }, {
    "id" : 13,
    "title" : "So Carlsberg tweeted this",
    "snippet" : "  THIS WORKS!!!\n\nI was drunk at the time.  dude i just met was looking over at a table of girls and he pointed out one he thought was cute and wanted to talk to her.  I say \"follow my lead\", walk him over to the table (i knew 1 one of the girls) said \"Hey\" or whatever and then \"Haaave you met Robert?\"  Pulled him up to the table and walk away.  \n\nHe went home with the girl.  I tried it once but my friend didn't know what was going so he followed me as I walked away. [So he did this?](http://rlv.zcache.com/socially_awkward_penguin_customize_to_add_text_postcard-r1737641c5b1041d095468f10448d1b30_vgbaq_8byvr_512.jpg) I tried it once but my friend didn't know what was going so he followed me as I walked away.       Who or what is a Carlsberg and why should I care that he/she/it made a HIMYM reference? It's a huge danish beer company.",
    "url" : "http://i.imgur.com/j0NsDqe.jpg"
  }, {
    "id" : 14,
    "title" : "All 38 women Ted dated before he met the mother (now in the correct order)",
    "snippet" : "  Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together. Seriously. \"I dated 40 supermodels, but none of 'em really *got* me.\"  My biggest peeve about this show!  Ted dates a parade of gorgeous and interesting women and all he does is mope and complain about it. He's worse than Taylor Swift. we are never ever ever going to meet the mother. I kinda wish the show would get cancelled before we meet the mother. I probably shouldn't say that in /r/HIMYM, but I still think it would be funny.  My biggest peeve about this show!  Ted dates a parade of gorgeous and interesting women and all he does is mope and complain about it. He's worse than Taylor Swift. What if the mother IS Taylor Swift? My biggest peeve about this show!  Ted dates a parade of gorgeous and interesting women and all he does is mope and complain about it. He's worse than Taylor Swift. Perhaps, seeing as this all comes from his perspective, he views himself as a stud, and therefore, every woman he ever had sex/dated is STUNNINGLY GORGEOUS 10/10. Never quite thought about that before, actually. I'm going with this. My biggest peeve about this show!  Ted dates a parade of gorgeous and interesting women and all he does is mope and complain about it. He's worse than Taylor Swift. Seriously. \"I dated 40 supermodels, but none of 'em really *got* me.\"  Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together. Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together. Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together. Given that the photographs are all publicity shots/magazine spreads, it also says something about how actresses are marketed differently from actors. It'd be much harder to find cheesecake shots of, say, all the guys Robin's dated. I would hope someone would say \"Challenge accepted\" as I'd like to see someone try. Challenge...*ignored*. I would hope someone would say \"Challenge accepted\" as I'd like to see someone try. [Challange ACCEPTED!](http://how-i-met-your-mother.wikia.com/wiki/Category:Guys_who_dated_Robin) [Challange ACCEPTED!](http://how-i-met-your-mother.wikia.com/wiki/Category:Guys_who_dated_Robin) Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together. this is pretty much the whole robin thing. he looks for flaws in other girls because he still has feelings for robin. this is pretty much the whole point of the last season. This is pretty much all lowercase letters. Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together. Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together. Wow talk about a picky dude.  I didn't realize he dated so many good looking girls until I saw them all together.  Hottest and most wasted potential has to be Mary the paralegal.\n\n That by far is the worst prank barney does she is so hot! Hottest and most wasted potential has to be Mary the paralegal.\n\n Idk man I think Katy perry is pretty easy on the eyes Stella is pretty good looking too  I don't even know half of these and I rewatched the entire show 2 months ago. Should I be worried? Some of them don't last more than 5 min so it's okay to not remover them. To not what them? I don't even know half of these and I rewatched the entire show 2 months ago. Should I be worried? I don't even know half of these and I rewatched the entire show 2 months ago. Should I be worried? I watched the entire series through through season 4 last week, still don't know who Marybeth, Molly, Amy, Stacy, or Cathy are.  Marybeth was a coworker of Ted, he invited her in the limo on New Years Eve in season 1.\n\nMolly was the first girl Ted slept with.\n\nAmy was the reason Ted got a tattoo.\n\nStacey was the yoga-reggae-girl Ted and Barney competed for.\n\nAnd Cathy was the one who talked very much and annoyed the whole group.\n Marybeth was a coworker of Ted, he invited her in the limo on New Years Eve in season 1.\n\nMolly was the first girl Ted slept with.\n\nAmy was the reason Ted got a tattoo.\n\nStacey was the yoga-reggae-girl Ted and Barney competed for.\n\nAnd Cathy was the one who talked very much and annoyed the whole group.\n If Molly was the first girl ted slept with, and I agree, then how is this in order? Karen should be closer to first too\n\nedit: typed mary instead of molly It's ordered by when they are mentioned in the show, as Ted often tells about girls he dated in the past, but we don't know when (for example Strawberry). And it was Molly, not Mary. Marybeth was a coworker of Ted, he invited her in the limo on New Years Eve in season 1.\n\nMolly was the first girl Ted slept with.\n\nAmy was the reason Ted got a tattoo.\n\nStacey was the yoga-reggae-girl Ted and Barney competed for.\n\nAnd Cathy was the one who talked very much and annoyed the whole group.\n I watched the entire series through through season 4 last week, still don't know who Marybeth, Molly, Amy, Stacy, or Cathy are.  Who the fuck is Vicky? Ted met her in the elevator and pulled off the naked men. While she's a horrible bitch in the show, i still think she's damn hot.  FYI she's naked in Dexter.\n\nAlso, Holly is supposed to be spelled \"Holli\", with an \"I\", remember? Holli with \"I\" is on the list, as well as Holly with \"Y\" (she was one of the three online-dating-girls where Ted visualizes Robin). Don't forget Yobin. I don't even know half of these and I rewatched the entire show 2 months ago. Should I be worried?  He didn't date a lot of them... So why are they there? ;b No idea. Off the top of my head he never date Honey, Henrietta or Jen,  Or Maggie. No idea. Off the top of my head he never date Honey, Henrietta or Jen,   After seeing this... I'm not even mad, I'm impressed. I don't care if I even meet the Mother anymore. The show should be called \"The many adventures of Ted the pimp, and his wacky sidekicks.\" After seeing this... I'm not even mad, I'm impressed. I don't care if I even meet the Mother anymore. The show should be called \"The many adventures of Ted the pimp, and his wacky sidekicks.\" After seeing this... I'm not even mad, I'm impressed. I don't care if I even meet the Mother anymore. The show should be called \"The many adventures of Ted the pimp, and his wacky sidekicks.\" Barney would be the quantity end of the spectrum, Ted would be the quality. And quantity, to be fair. I'm fairly sure Marshal is at the high quality low quantity end while Barney is the opposite. Ted is basically Goldilocks and keeps going between the two extremes.  Maggie so doesn't count. I was going to say, I thought he never dated her? He tried, but he never got to ask her out.  Honey shouldn't count either.  Honey shouldn't count either.  Neither should Henrietta. Or Robyn Well at least he went on a date with Robyn so ill allow it Well at least he went on a date with Robyn so ill allow it Maggie so doesn't count. Tiffany shouldn't either, right? He wasn't really dating her. He was just on her leash, unless I'm confused. Maggie so doesn't count. Maggie so doesn't count.  I miss Victoria... I miss Season 1 Victoria, not so much Season 8 Victoria. This is very true. I wish they'd have made their breakup a little more heartbreaking. She deserved it IMO This is very true. I wish they'd have made their breakup a little more heartbreaking. She deserved it IMO  Poor Blahblah and Unnamed What episode is Unnamed from? I remember Blahblah and Honey, but can't think of any other name slips that Ted had. It could be the chick from \"The Sexless Innkeeper\" but she is officially credited as Maiden and is a blond on imdb.  Yes, it is the chick from \"The Sexless Innkeeper\", her name wasn't mentioned on the show.  Ted: How was I supposed to know she was crazy?\n\nEveryone else: Her name was ***Strawberry*** What episode is she from, I can't remember for the life of me.  where is the coat wench from the club in \"Okay, Awesome\" where is the coat wench from the club in \"Okay, Awesome\"  Stella is the hottest IMO! \n\nBut I'm a scrubs boy that's why.  I'm a fan of Zoey.\n\nBut maybe that's because of House.  Stella is the hottest IMO! \n\nBut I'm a scrubs boy that's why.   So many white girls... They make a comment when going through Barney's scrap book of conquests that there's a lack of diversity in the girls he's been with. Didn't Barney have a quest to sleep with one girl from every country? So many white girls... So many white girls... Except we missed one!!!! The really accomplished girl from \"mystery vs history\"... I can't remember her name So many white girls... What is that supposed to mean?  I think blah blah is my favorite. What do you think of that robin?  According to Ted, who said that Jeanette was his last mistake before he met the mother.  Shouldn't Karen actually be first, if we are going in order of Ted's life, and not the show. Shouldn't Karen actually be first, if we are going in order of Ted's life, and not the show. According to Ted, who said that Jeanette was his last mistake before he met the mother.  Last mistake, but maybe not last relationship. But in Ted's eye, they're all mistakes unless he married then, or at least I'd think so.  I don't know that he'd consider Victoria, Robin, Stella, or Zooey a mistake.  He truly loved them, and they had future wife potential, in his mind (even though Robin stated from the beginning that she didn't want to he married).  And certainly he shouldn't consider dating Cindy a mistake because if he hadn't he never would have met the mother. I agree with you. The way the show is written it just seems like every girl is a mistake and he needs to go back to Robin, who he truly loves. He even says in one episode about Stella something along the lines of knowing she loved her ex but trying to ignore it because he wanted a wife. I think the conclusion of the show will be him getting over Robin (who up to this point is still \"the one\") and meeting the mother. Who he will then fall in love and realize that Robin was never truly right for him.  According to Ted, who said that Jeanette was his last mistake before he met the mother.  According to Ted, who said that Jeanette was his last mistake before he met the mother.   He didn't date Henrietta. They were hanging out as friends, but she expected it to be more in the future. He kept her \"on the hook\".\n\nEdit: Didn't Honey go to Barney's place? I guess they were on a date but she went home with Barney.   Where's Rachel Bilson?   Didn't Ted only go on one date with Janet?  A date which ended poorly, too.  Should that really count?   went on a date with = participated in dating = dated went on a date with = participated in dating = dated          Zoey.  I like her.  What's the actress's name?  Zoey.  I like her.  What's the actress's name?   It would be nice if the pictures were actually of that particular character, rather than the actress.  lizabeth?      I do not remember Ted sleeping with this many women at all.I need to pay more attention. He didn't sleep with all of them. That's a list of women he dated.   Technically Karen came first, they dated in college. Technically Karen came first, they dated in college. I think they're in order of appearance, not the order he dated them in.      Where's Skylar?                                  ",
    "url" : "http://i.imgur.com/OBPMuN7.jpg"
  }, {
    "id" : 15,
    "title" : "McAwesomeville",
    "snippet" : "      ",
    "url" : "http://imgur.com/wzs3Xsz"
  }, {
    "id" : 16,
    "title" : "Malicious Advice Mallard for people who don't watch HIMYM",
    "snippet" : "        Why is the duck red? It's the Malicious Advice Mallard, the red means it's malicious. WHOOOOOOOOOOOOOSH Why is the duck red?",
    "url" : "http://www.quickmeme.com/meme/3sxqud/"
  }, {
    "id" : 17,
    "title" : "'How I Met Your Mother' Season 9: Showrunner Craig Thomas Says All Questions Will Be Answered",
    "snippet" : "  Did they ever figure out where that pineapple came from? Yea, that's one of the questions which won't be answered because it has already been by narrator Ted. He says something along the lines \"We never got to know how the pineapple got there.\" and the writers also refer to it as a big lesson to not write themselves into corner like that ever again. Did they ever figure out where that pineapple came from? Im thinking that one of the other characters knows but doesnt tell Ted for some reason and then it is revealed in S9 Did they ever figure out where that pineapple came from?   This really sound s like season 9 will be from the mother's perspective. This really sound s like season 9 will be from the mother's perspective. This really sound s like season 9 will be from the mother's perspective. I'm kinda surprised they haven't done any sort of spin off yet that's set in the same universe only from the mother's perspective.    That's what they said about the final season of Lost...  Sadly only the major questions were answered.   Will Barney's job finally be answered too? Will Barney's job finally be answered too?   \"We have no doubt that [Carter Bays and Craig Thomas] will guide one of the greatest comedies of the last decade to a gratifying conclusion when they finally reveal the identity of the 'Mother.'\" \n\nDoes this mean they wont revel the mother until the end of season 9? They've already put themselves into a corner where they have to reveal the mother either at the end of the season 8 finale or the beginning of season 9, if it opens still on the night of the wedding.  There's no way to fit any significant porton of an episode between the wedding and the meeting at Farhampton, unless done as a present-day flashback where present Ted is telling the gang about meeting her shortly before (as in, the previous night).     I had an idea for an episode one time that I know they wouldn't do, but it would be awesome. \n\nWhat if one of the gang calls a cab and they get into the Cash Cab? Then they'd use Ted for a shout-out and Ben Bailey would be a guest star. ",
    "url" : "http://www.huffingtonpost.com/2013/02/04/how-i-met-your-mother-season-9_n_2617585.html"
  }, {
    "id" : 18,
    "title" : "I was texting my friend the other day and he told me HIMYM was stupid. I sent back this. ",
    "snippet" : "  It's strange, people either passionately love or they passionately HATE HIMYM Not me, I like it, but I'm not obsessed with it. I also don't hate it.  Does sending gifs via text work? I havent tried but I feel like it wont work for some phones  Which episode / scenario was this?   ",
    "url" : "http://i.imgur.com/co0Ys.gif"
  }, {
    "id" : 19,
    "title" : "Me and some friends made an emergency banner",
    "snippet" : " ",
    "url" : "http://i.imgur.com/uXTkwFS.jpg"
  }, {
    "id" : 20,
    "title" : "Ted, please go to your nearest Microsoft Store, stat!! [Re-post with imgur link]",
    "snippet" : "  This picture has gotta be photoshopped, you never see this many people anywhere near a microsoft store. I've never seen a microsoft store. I've never seen a microsoft store.   He would end up talking to the person with the partially green umbrella the entire time.  ",
    "url" : "http://i.imgur.com/xaqL2OZ.jpg"
  }, {
    "id" : 21,
    "title" : "I was told that this gif, sans text, was from an episode of HIMYM. Does anyone know if that is true and if so what episode is it in?",
    "snippet" : "  It is true, it's from Barney's resume video in Season 4, Ep. 14, The Possimpible. :) Wow you guys are quick! Thanks.\n\nDo you have any idea how I could go about finding where they got the video from?   ",
    "url" : "http://i.imgur.com/6kO74.gif"
  }, {
    "id" : 22,
    "title" : "MFW Ted meets a new woman...",
    "snippet" : "     ",
    "url" : "http://i.imgur.com/UJRsIK3.jpg"
  }, {
    "id" : 23,
    "title" : "When I saw that Jason Segel is 6 years younger than Josh Radnor and Alyson Hannigan",
    "snippet" : "    6 years isn't really that big a difference... 6 years isn't really that big a difference... 6 years isn't really that big a difference... 6 years isn't really that big a difference...  ",
    "url" : "http://i930.photobucket.com/albums/ad145/howimetyourmothergifs/mindblown.gif"
  }, {
    "id" : 24,
    "title" : "Watching Rugby in Ireland with unexpected HIMYM related results! (xpost r/ireland)",
    "snippet" : "   ",
    "url" : "http://i.imgur.com/9sgt4q4.png"
  }, {
    "id" : 25,
    "title" : "I dont recall saying snakes.",
    "url" : "http://www.youtube.com/watch?v=ZtvFcLKV8zg"
  }, {
    "id" : 26,
    "title" : "All of Ted's exes",
    "snippet" : "  [Larger resolution.](http://i.imgur.com/uReA8tD.jpg) This guy ^.  [Larger resolution.](http://i.imgur.com/uReA8tD.jpg)  The whole purpose of the story is obviously to allow Ted to assert his dominance in front of his son.  It's a long-winded way of saying \"you will never have more sex than I did.\" The whole purpose of the story is obviously to allow Ted to assert his dominance in front of his son.  It's a long-winded way of saying \"you will never have more sex than I did.\" The whole purpose of the story is obviously to allow Ted to assert his dominance in front of his son.  It's a long-winded way of saying \"you will never have more sex than I did.\" The whole purpose of the story is obviously to allow Ted to assert his dominance in front of his son.  It's a long-winded way of saying \"you will never have more sex than I did.\" Do we even know for sure that these are Ted's kids at all? What if he is just talking to someone else's kids? What if Ted never dates their mother at all, but just meets her. \"Dad.\" - The kids. Do we even know for sure that these are Ted's kids at all? What if he is just talking to someone else's kids? What if Ted never dates their mother at all, but just meets her. Do we even know for sure that these are Ted's kids at all? What if he is just talking to someone else's kids? What if Ted never dates their mother at all, but just meets her.  I wouldn't say honey is an ex, didnt Barney sleep with her and not Ted?\n\nBut I get what you're saying Ted sure is a slut Neither of them slept with her, Barney just wound up crying. \"Who's *your* daddy?\" Neither of them slept with her, Barney just wound up crying. I wouldn't say honey is an ex, didnt Barney sleep with her and not Ted?\n\nBut I get what you're saying Ted sure is a slut And isn't Robyn just a girl he met only a few times? I think she was the palate cleanser. I wouldn't say honey is an ex, didnt Barney sleep with her and not Ted?\n\nBut I get what you're saying Ted sure is a slut I wouldn't say honey is an ex, didnt Barney sleep with her and not Ted?\n\nBut I get what you're saying Ted sure is a slut I wouldn't say honey is an ex, didnt Barney sleep with her and not Ted?\n\nBut I get what you're saying Ted sure is a slut I wouldn't say honey is an ex, didnt Barney sleep with her and not Ted?\n\nBut I get what you're saying Ted sure is a slut  Oh Victoria, I love you. amen! if there was a church of victoria, i would be there every sunday... as long as she makes pastries. mmmm.\n\nted's an idiot. I feel like they really wasted her this season. It diluted the experience. It just seems like they wanted that moment of them running off together, but didn't know what to do since they couldn't keep them a couple. I was disappointed, because Victoria really is the shit, and it seemed out of character for her to basically say \"All your friends, or me.\" \n \nI know she was just asking to cut Robin out, but truth is, if Ted did it, Marshall, Lily, and Barney would never speak to Ted again for doing it. It was very apparent Victoria was brought back as a plot-device to bring back the \"Robin is keeping you from moving on\" schtick. It would've been much MUCH better to have it been about a deep-seated character flaw about each other (Ted/Victoria) or their relationship (built on a betrayal). \n\nFrankly, I would've liked to have seen the conflict between Victoria that would be afraid of reality/commitment (See \"Drumroll, Please\" and abandoning her wedding), and Ted similarly afraid of reality, but desperate for commitment (See moving to NJ, staying with Zooey despite potentially giving up his dreams, keeping Victoria from her wedding). \n\nOh well.  Seriously you should write for the show. Stop it from getting corny and stale. I feel like they really wasted her this season. It diluted the experience. It just seems like they wanted that moment of them running off together, but didn't know what to do since they couldn't keep them a couple. I was disappointed, because Victoria really is the shit, and it seemed out of character for her to basically say \"All your friends, or me.\" \n \nI know she was just asking to cut Robin out, but truth is, if Ted did it, Marshall, Lily, and Barney would never speak to Ted again for doing it. amen! if there was a church of victoria, i would be there every sunday... as long as she makes pastries. mmmm.\n\nted's an idiot.  I don't remember/recognize half of these women Name that bitch, Ted. ...Bertha? No, it was Lilly's birthday. I don't remember/recognize half of these women I remember Katy Perry.  Ahem, strawberry?  What about [Janet?](http://how-i-met-your-mother.wikia.com/wiki/Janet_McIntyre) didn't hook up  Isn't this not up to date? Carly, and the chick he's currently dating. \n [Well, it's not a new list.](http://www.reddit.com/r/HIMYM/comments/yum03/watched_a_marathon_of_himym_decided_to_collect/) Yes, it's both a repost, and it's inaccurate. \n\nI like it, but come on.   Victoria was so hot. Definitely my favorite of Teds exes.  i think she was the least attractive of his exes Nobody asked you Patrice!!! For least attractive I would say its a toss up between Zoey and this new crazy one he just met last episode. Least attractive is Zoey?\n\nGet out. Now. Nobody asked you Patrice!!! For least attractive I would say its a toss up between Zoey and this new crazy one he just met last episode. No, Zoey is so hot! Least attractive is Victoria then Natalie. Yeah I will agree with you on Natalie.  Just looked again, Naomi isn't incredibly attractive either. Nobody asked you Patrice!!! For least attractive I would say its a toss up between Zoey and this new crazy one he just met last episode. Nobody asked you Patrice!!! For least attractive I would say its a toss up between Zoey and this new crazy one he just met last episode. Nobody asked you Patrice!!! For least attractive I would say its a toss up between Zoey and this new crazy one he just met last episode. I agree about Zoey. Her personality and behavior were so obnoxious to me that she became increasingly unattractive as the episodes went on. Victoria was so hot. Definitely my favorite of Teds exes.    And yet he always whines about how alone he is He's like the male Taylor Swift, but without the singing. Just architecting ;)  Sex-architecting ;)  Sex-architecting ;)  sextitecting? Sex-architecting ;)  And yet he always whines about how alone he is   Now make one for Barney.  you can't tell me a dumbass like ted mosby scored all of these hot chicks. IN WHAT WORLD. They must have a cowboy boot fetish. A RED cowboy boot fetish. Pulling. Them. Off.  You're missing a few, like Barney's sister.        Give some brown girls a chance bro!  Or at least an Asian!    You can hardly call Honey his ex. Same goes for Mary the Paralegal    Scumbag Ted    I suddenly dislike Ted a lot more.\n\nTo be fair, this was over a span of what, 8 years? you dislike him simply because of the amount of women he's had a relationship with? real mature. I suddenly dislike Ted a lot more.\n\nTo be fair, this was over a span of what, 8 years?  I know a girl that looks way too much like Natalie.... Can't really tell her though because she's in a commutes relationship....  &gt;I know a girl that looks way too much like Natalie.... Can't really tell her though because she's in a committed relationship....\n\nFTFY Also isn't that the actress from House? Two of them are from House.  Any one of these women is 10x hotter than every girl I've been with combined :(    Carrie Underwood's character is missing.                                 I know that either holly or holli was the one he was supposedly texting in 3 days rule... but who is the other one?  I can't see her face but Barney date a holly who he left in the woods.. It wasn't Ted. There was Molly the chick he lost his V card to  I can't see her face but Barney date a holly who he left in the woods.. It wasn't Ted. There was Molly the chick he lost his V card to     Some of these are not exes.. For example Robyn had a blind date with Ted and that was it Some of these are not exes.. For example Robyn had a blind date with Ted and that was it     ",
    "url" : "http://i.imgur.com/0rqoJDf.jpg"
  }, {
    "id" : 27,
    "title" : "Season 8 online?",
    "snippet" : "Does anyone know where I can watch season 8 for free online? I went to the CBS website but you can only watch the 5 most recent episodes...  project free tv. Just Google it. I forget the complete URL.\n  1channel.ch has all of them  http://iseri.es/category/how-i-met-your-mother/\n\nWorks on mobile  I tried every single one on this thread and none of them worked. I've been trying to find something free for so long and I can't find anything. I did the 1channel.ch one. google that with how i met your mother. You'll have to set up an account but it's free. Then when you click on an episode it will bring you to a list of links. The nowvideo ones work pretty good. I did the 1channel.ch one. google that with how i met your mother. You'll have to set up an account but it's free. Then when you click on an episode it will bring you to a list of links. The nowvideo ones work pretty good. I tried every single one on this thread and none of them worked. I've been trying to find something free for so long and I can't find anything. Try movie2k.to. It's quality is good enough that you won't want to tear your eyes out and it usually gets new episodes pretty frequently - it's already got last night's episode on there. This place is my go-to for movies or TV shows if they aren't on netflix. Thank you. Hopefully it will work for me.\n**EDIT:** Just season 7 and it's all in German. You probably picked the German version on accident. [Here's](http://www.movie2k.to/How-I-Met-Your-Mother-watch-tvshow-2525872.html) the English version.\n Oh my gosh thank you so much. Is there any way you could give me a link to season 8 episode 1?   This has all of them and other shows too.\nhttp://www.cucirca.com/2009/06/05/watch-how-i-met-your-mother-online/ YOU ARE PHENOMENAL.  I just has internetz. But thank you =). You are awesome!!!!!",
    "url" : "http://www.reddit.com/r/HIMYM/comments/189ma9/season_8_online/"
  }, {
    "id" : 28,
    "title" : "I got this in a fortune cookie tonight... I feel like I am Ted.",
    "snippet" : " ",
    "url" : "http://imgur.com/W5S0GWU"
  }, {
    "id" : 29,
    "title" : "New HIMYM shirt on TeeFury for today only!",
    "snippet" : "  Legendary Irish Stout by Drew Wise - For sale on February 10th at http://teefury.com/\n\nFor a larger view, click here: http://www.teefury.com/products_large_images/1358371012_bot-legendary.jpg  Thanks! I am totally buying one.   I want this shirt so much but I'm so poor...I think I'm going to cry :(  The yellow umbrella is a really nice touch. I've been waiting for an *awesome* HIMYM shirt for quite some time! ",
    "url" : "http://i.imgur.com/Jl06yn9.jpg"
  }, {
    "id" : 30,
    "title" : "Do any of you actually argue like Marshall and Lily?",
    "snippet" : "When they argue, Marshall and Lily maintain civility and can stop being upset if something important happens - or if one of them calls \"pause\" in early seasons.  Does anyone have a relationship that healthy?  \n\nIf so, what other advice do you have?  Did you have that arguing style already or develop it with time?   I've been with my girlfriend for 3 years this month and we've never argued. Don't know why, its just never happened. [deleted] I've been with my girlfriend for 3 years this month and we've never argued. Don't know why, its just never happened.    ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/189pat/do_any_of_you_actually_argue_like_marshall_and/"
  }, {
    "id" : 31,
    "title" : "How will you be spending 'Desperation Day' this year?",
    "snippet" : "I'll be getting horrendously drunk.         ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/189lxb/how_will_you_be_spending_desperation_day_this_year/"
  }, {
    "id" : 32,
    "title" : "Good advice.",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/OXSHBTq.jpg"
  }, {
    "id" : 33,
    "title" : "I have seen the seasons 1-7, but I can't watch 8 on tv, as I am busy when're it comes on. I can't afford to buy it on iTunes or any where else. I have Netflix, but don't want to wait. Is there any way to watch it somewhere else? Thanks!",
    "snippet" : "  Project free tv!!! Just google it. I'm on mobile so I don't have a link.  torrenting is your best friend.       ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/189vvj/i_have_seen_the_seasons_17_but_i_cant_watch_8_on/"
  }, {
    "id" : 34,
    "title" : "I couldn't help but grab today's design on Teefury. It made me smile.",
    "snippet" : " ",
    "url" : "http://www.teefury.com/products_large_images/1358371012_bot-legendary.jpg"
  }, {
    "id" : 35,
    "title" : "My \"play\" for Valentine's Day: The No-posal. I think Barney would be proud. Unfortunately, I work the 14th. So, if one of you wants to accept the challenge...",
    "snippet" : "  That is a very immoral, sly, and downright despicable way to get a woman to sleep with you. Barney would be so proud.       [deleted]  You're a fucking creep  You would ruin a happy relationship to get laid. Fuck you man, seriously, reconsider how you live your life. Maybe it's not a perfectly happy relationship. Maybe that other guys just lookin to get some vday beej and he's a dirtball too Hell, maybe this post is a joke. ",
    "url" : "http://i.imgur.com/tu7o7QC.jpg"
  }, {
    "id" : 36,
    "title" : "So has everyone been disregarding.. [Spoilers]",
    "snippet" : "Older Marshal time traveling to McClaren's? Would this have anything to do with the main plot?  This is just a one-off joke like the lightsabre joke. It was just for lulz. This is just a one-off joke like the lightsabre joke. It was just for lulz. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18a19k/so_has_everyone_been_disregarding_spoilers/"
  }, {
    "id" : 37,
    "title" : "Are the group supposed to be sitting by a wall at the bar? or is this just a bloop? ",
    "snippet" : "  Seems to me that they couldn't decide if the 'Fourth Wall' was going to be an actual wall in MacLaren's. This is from early in the series, later on we see the booth doesn't meet the wall (in the closet gag when Marvin is born).  Seems to me that they couldn't decide if the 'Fourth Wall' was going to be an actual wall in MacLaren's. This is from early in the series, later on we see the booth doesn't meet the wall (in the closet gag when Marvin is born).   The wall is there if the show needs it, its not if they don't. That's all chocked up to Ted's unreliable memory, so he they can say any continuity error is from that. Unreliable narrator - the easiest way to explain your continuity errors and plot holes. If used correctly in a short or a movie or a book it can be an incredible tool, but HIMYM just uses it to add new things to the plot and let them overwrite things that were there before. Unreliable narrator - the easiest way to explain your continuity errors and plot holes. I actually hear that excuse used by the fans way too much when discussing loose ends. I actually hear that excuse used by the fans way too much when discussing loose ends. In this case the entire show is an exploration of unreliable subjective narrative. There are plenty of gags overtly based on this premise in the show. The wall is there if the show needs it, its not if they don't. That's all chocked up to Ted's unreliable memory, so he they can say any continuity error is from that. chalked*  The other side of the booth is shown in the episode where Lilly is in labor and Ted &amp; robin tell her stories to try and calm her down. They tell \"where does that door go\" and it shows there are more tables and space on the camera side of the booth. which episode? i barely remember it but enough to wanna see it again! :D         It's like the episode where Lilly and Michelle get together. You see Lilly walk away, then the next scene she is sat where Ted is, next scene Ted is back. I read this as \"next scene Ted is black\"\nThat would have been a pretty big error. ",
    "url" : "http://i.imgur.com/Qv6C2CT.jpg"
  }, {
    "id" : 38,
    "title" : "Greatest photo of all time!",
    "snippet" : "  Oh my god, you caught Marshall in a photo with his eyes open and Barney isn't making sure his tie is perfect!!!!!!   What episode is this from? Season 8, Episode 11: The Final Page Part 1 Great moment. This season has been great, especially after the initial 4-5 eps. \n\nI really feel like Bays and the creators and cast have been able to excel since the season 9 deal was done and the future and finale of the show has been determined. Just feels like they've all been preparing for this moment, when the show has an expiration date (yup, went there) and they know what they must accomplish in 30 some episodes. Great moment. This season has been great, especially after the initial 4-5 eps. \n\nI really feel like Bays and the creators and cast have been able to excel since the season 9 deal was done and the future and finale of the show has been determined. Just feels like they've all been preparing for this moment, when the show has an expiration date (yup, went there) and they know what they must accomplish in 30 some episodes. Robin Daggers was the best episode they've had in a year.  Great moment. This season has been great, especially after the initial 4-5 eps. \n\nI really feel like Bays and the creators and cast have been able to excel since the season 9 deal was done and the future and finale of the show has been determined. Just feels like they've all been preparing for this moment, when the show has an expiration date (yup, went there) and they know what they must accomplish in 30 some episodes.    Whats happening here?        Is 8 suppose to be the last season? Nope, season 9 is the last! They announced it a little while back.      ",
    "url" : "http://i.imgur.com/f1iFaT2.jpg"
  }, {
    "id" : 39,
    "title" : "How I met your.... father?",
    "snippet" : "  This would explain a lot of things.\n\n1. Why the children listen to stories of Ted banging women that do not share the name of their Mother\n\n2. Barney's widespread sexual conquests were really the ultimate move of the playbook : finding a suitable surrogate for their gay baby\n Why does the baby have to be gay? ",
    "url" : "http://www.youtube.com/watch?v=mNvTeDjFRPM"
  }, {
    "id" : 40,
    "title" : "Ted Eriksen / Marshall Mosby - 100% less creepy version",
    "snippet" : "  98.6835% less creepy.   83% less creepy   Ted Marshby          ",
    "url" : "http://i.imgur.com/qlmbhhT.jpg"
  }, {
    "id" : 41,
    "title" : "It is among us",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/4E8cpiJ.jpg"
  }, {
    "id" : 42,
    "title" : "Favorite Cobie moment of the entire show, hands down.",
    "snippet" : "     I don't find her that attractive, am I weird?  she just seems really awkward to me whenever she is doing \"im hot\" scenes I don't find her that attractive, am I weird?  I though she was at first but it didn't take long for me to arrive at the fact that she has a nice face but that's about it. Alyson hannigan though...   In the early season they were both great.  Season 1 AH was cute as fuck, but now she is really showing her age... In the early season they were both great.  Season 1 AH was cute as fuck, but now she is really showing her age... I though she was at first but it didn't take long for me to arrive at the fact that she has a nice face but that's about it. Alyson hannigan though...   I don't find her that attractive, am I weird?  I don't find her that attractive, am I weird?  I don't find her that attractive, am I weird?     http://i.imgur.com/JPoem.jpg\n\n   ",
    "url" : "http://i.imgur.com/2gAmP.jpg"
  }, {
    "id" : 43,
    "title" : "Marshall Mosby or Ted Eriksen?",
    "snippet" : "  This is terrifying  Zuckerberg, Mark This is terrifying   You combined two perfectly good looking men to create a lesbian.   ***Tarshall*** ***Tarshall*** ***Tarshall***   do lilly &amp; robin plz You know Lilly would love for you to be mixed with Robin ;) do lilly &amp; robin plz  [Original image of Ted for reference](http://i.imgur.com/5Z1cn0z.jpg) Am I the only one who can't look away from the size of his ear lobes? Am I the only one who can't look away from the size of his ear lobes? Am I the only one who can't look away from the size of his ear lobes? [Original image of Ted for reference](http://i.imgur.com/5Z1cn0z.jpg)      We need to see the opposite of this.  Ted's face on Marshall's head.  GET TO IT!                                           ",
    "url" : "http://i.imgur.com/XkbJ7W9.jpg"
  }, {
    "id" : 44,
    "title" : "How was the goat in \"The Wedding Bride\" if it hadn't happened yet?",
    "snippet" : "In the \"Wedding Bride\", there was a slapstick scene with the goat, but that didn't actually happen until Ted had broken up with Stella and Robin moved back in.  Plot hole, or Ted as the unreliable narrator?    Well Ted didn't take the job as a professor until after his birthday and the goat incident. Maybe Tony asked Ted why he changed his mind and he mentioned it.  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/187ivp/how_was_the_goat_in_the_wedding_bride_if_it_hadnt/"
  }, {
    "id" : 45,
    "title" : "PS I love you",
    "url" : "http://i.minus.com/iKjBGSD6iF1j6.gif"
  }, {
    "id" : 46,
    "title" : "Wow you guys!",
    "snippet" : "  THIS.\nThe page is flooded with those posts.  What posts? Tim Hortons making that donut... Oh. I never saw anything aboat it. Oh, i guess I should go make a post about it to get the word out.    ",
    "url" : "http://www.quickmeme.com/meme/3swwol/"
  }, {
    "id" : 47,
    "title" : "Found out I own the same radio/cd player as Barney! I'm Awesome",
    "snippet" : "  That is legen wait for it...  Looks like something you would get at Sharper Image.   ",
    "url" : "http://imgur.com/cr1sxNz"
  }, {
    "id" : 48,
    "title" : "Tim Hortons creates \"The Priestley\" after How I Met Your Mother joke",
    "snippet" : "     ",
    "url" : "http://o.canada.com/2013/02/05/tim-hortons-creates-the-prestley-after-how-i-met-your-mother-joke/"
  }, {
    "id" : 49,
    "title" : "I paused the video at the perfect time to find Marshall's face like this. ",
    "snippet" : "  When did Sylvester Stallone make a cameo appearance?",
    "url" : "http://imgur.com/xPMJWYX"
  } ],
  "processing-time-source" : 76,
  "processing-result.title" : "himym4_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/himym4_reddit.xml"
  }
}