{
  "processing-time-total" : 922,
  "clusters" : [ {
    "id" : 0,
    "size" : 9,
    "score" : 36.47223309201131,
    "phrases" : [ "There's no Way" ],
    "documents" : [ 20, 21, 27, 36, 38, 39, 41, 45, 46 ],
    "attributes" : {
      "score" : 36.47223309201131
    }
  }, {
    "id" : 1,
    "size" : 8,
    "score" : 18.88812427325689,
    "phrases" : [ "Reference" ],
    "documents" : [ 13, 16, 20, 25, 31, 37, 45, 49 ],
    "attributes" : {
      "score" : 18.88812427325689
    }
  }, {
    "id" : 2,
    "size" : 7,
    "score" : 29.14666331480735,
    "phrases" : [ "Friend" ],
    "documents" : [ 13, 14, 20, 27, 29, 36, 38 ],
    "attributes" : {
      "score" : 29.14666331480735
    }
  }, {
    "id" : 3,
    "size" : 7,
    "score" : 32.750358870484845,
    "phrases" : [ "Love" ],
    "documents" : [ 5, 9, 20, 27, 28, 30, 36 ],
    "attributes" : {
      "score" : 32.750358870484845
    }
  }, {
    "id" : 4,
    "size" : 7,
    "score" : 68.84393493096948,
    "phrases" : [ "Marshall Looks" ],
    "documents" : [ 9, 10, 17, 20, 21, 27, 41 ],
    "attributes" : {
      "score" : 68.84393493096948
    }
  }, {
    "id" : 5,
    "size" : 5,
    "score" : 34.3056949624112,
    "phrases" : [ "Episode and this was the first Thing" ],
    "documents" : [ 20, 27, 36, 45, 46 ],
    "attributes" : {
      "score" : 34.3056949624112
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 55.02297881090049,
    "phrases" : [ "Episode in which Barney" ],
    "documents" : [ 15, 22, 23, 30, 35 ],
    "attributes" : {
      "score" : 55.02297881090049
    }
  }, {
    "id" : 7,
    "size" : 5,
    "score" : 21.417949355668636,
    "phrases" : [ "Laughed" ],
    "documents" : [ 6, 9, 29, 34, 44 ],
    "attributes" : {
      "score" : 21.417949355668636
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 30.857660975318257,
    "phrases" : [ "Awesome" ],
    "documents" : [ 3, 13, 20, 47 ],
    "attributes" : {
      "score" : 30.857660975318257
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 60.535678465173326,
    "phrases" : [ "Bad Crazy" ],
    "documents" : [ 20, 22, 23, 29 ],
    "attributes" : {
      "score" : 60.535678465173326
    }
  }, {
    "id" : 10,
    "size" : 4,
    "score" : 32.04222469220134,
    "phrases" : [ "HIMYM Reference" ],
    "documents" : [ 20, 31, 37, 49 ],
    "attributes" : {
      "score" : 32.04222469220134
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 37.92463957590804,
    "phrases" : [ "Figure" ],
    "documents" : [ 11, 35, 47 ],
    "attributes" : {
      "score" : 37.92463957590804
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 53.51281637699734,
    "phrases" : [ "Robin Sparkles" ],
    "documents" : [ 17, 21, 24 ],
    "attributes" : {
      "score" : 53.51281637699734
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 37.25110939502001,
    "phrases" : [ "Think that the Story might Change" ],
    "documents" : [ 30, 36, 46 ],
    "attributes" : {
      "score" : 37.25110939502001
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 27.19664753759296,
    "phrases" : [ "Tim" ],
    "documents" : [ 26, 41, 47 ],
    "attributes" : {
      "score" : 27.19664753759296
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 37.6320111781888,
    "phrases" : [ "College" ],
    "documents" : [ 9, 12 ],
    "attributes" : {
      "score" : 37.6320111781888
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 34.331316217644826,
    "phrases" : [ "Karma" ],
    "documents" : [ 8, 35 ],
    "attributes" : {
      "score" : 34.331316217644826
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 54.36018179006465,
    "phrases" : [ "Mother's because the New Season is Supposed" ],
    "documents" : [ 27, 30 ],
    "attributes" : {
      "score" : 54.36018179006465
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 41.626336425670196,
    "phrases" : [ "Really NPH" ],
    "documents" : [ 4, 41 ],
    "attributes" : {
      "score" : 41.626336425670196
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 36.64154149650415,
    "phrases" : [ "SPOILERS" ],
    "documents" : [ 23, 48 ],
    "attributes" : {
      "score" : 36.64154149650415
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 23.040313377835904,
    "phrases" : [ "Way to see who it was Shared" ],
    "documents" : [ 36, 38 ],
    "attributes" : {
      "score" : 23.040313377835904
    }
  }, {
    "id" : 21,
    "size" : 11,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 1, 2, 7, 18, 19, 32, 33, 40, 42, 43 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 839,
  "documents" : [ {
    "id" : 0,
    "title" : "Here's both images for a comparison of the face swap (Marshall and Ted)",
    "snippet" : "    your shop is bad and you should feel bad This was mine!  Surprised to see it pop up again, and I agree it's pretty rough, was just learning the ropes then.\n\nhttp://www.reddit.com/r/photoshopbattles/comments/tv3b2/celebrity_face_swap_thread_ill_kick_it_off/c4q363l?context=3 This was mine!  Surprised to see it pop up again, and I agree it's pretty rough, was just learning the ropes then.\n\nhttp://www.reddit.com/r/photoshopbattles/comments/tv3b2/celebrity_face_swap_thread_ill_kick_it_off/c4q363l?context=3 Ahaha thank you. I had the picture saved on my phone from a while ago and I was trying to find the original source before I posted it yesterday. I didn't think to search /r/photoshopbattles, I kept searching this subreddit..  ",
    "url" : "http://i.imgur.com/krHCCrx.jpg"
  }, {
    "id" : 1,
    "title" : "Just noticed Marshall wearing the Threeway Belt in S04E16",
    "snippet" : "  I suppose technically you're right, but the one Marshall is wearing in that scene is the crappy toy version. Barney bought the $300 replica version of the WWE Undisputed Championship belt for the three way belt.\n\nEDIT: further investigation revealed Marshall is actually wearing the crappy toy replica of the Classic Winged Eagle WWF Championship.   Godamnit, i kept trying to click the play button, forgetting that it was a picture. Godamnit, i kept trying to click the play button, forgetting that it was a picture. ",
    "url" : "http://imgur.com/pfJfmnX"
  }, {
    "id" : 2,
    "title" : "Barney does it best... ",
    "snippet" : "  Two of my favorite people on this planet. Who? JT and NPH JT? Are you stupid? Look at the damn picture. I don't know who he is or what he's from, and the only damn thing you're doing is giving initials. You can go fuck yourself. I don't know who he is or what he's from, and the only damn thing you're doing is giving initials. You can go fuck yourself. He could quite possibly the most famous male celebrity on the planet. No clue. You must live on a different planet  If Barney does not mention in some way how Justin took his advice and made the song I give up ",
    "url" : "http://www.quickmeme.com/meme/3swp8g/"
  }, {
    "id" : 3,
    "title" : "I live by this every day. Be Awesome! ",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/I2SqEXZ.jpg"
  }, {
    "id" : 4,
    "title" : "Was browsing a prank caller site when....",
    "snippet" : "   Is that really NPH?\n\nEdit: I don't understand why I'm being downvoted, to be honest. Is that really NPH?\n\nEdit: I don't understand why I'm being downvoted, to be honest.  ",
    "url" : "http://www.prankdial.com/pranks/gaytelemarketer"
  }, {
    "id" : 5,
    "title" : "Thanks to this show I am using \"PS\" more often and now when I do I can't get Robin's head out of my voice.",
    "snippet" : "It happens subconsciously. Instead of ending something with \"Also\" I am now using PS. I never use PS.\n\nI also want to change whatever my PS is to \"PS I love you\" once I noticed I do it. Or even re-write the PS as  \"Paul Shaffer: [insert PS message here]\" but no one would get the \"Paul Shaffer\" part. \n\nHIMYM World Problems.  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/185sjl/thanks_to_this_show_i_am_using_ps_more_often_and/"
  }, {
    "id" : 6,
    "title" : "The Real-Life Woo-Girl...",
    "snippet" : "   Holy cow that girl is so damn annoying.  I know. She has a crazy laugh, too. It's bothersome. do you thnk that's annoying?? [you don't even have to learn spanish to think that she's annoying](http://www.youtube.com/watch?v=3XUsHZYSUZc)   ",
    "url" : "http://www.youtube.com/watch?feature=player_detailpage&amp;v=8m51QglsMnI#t=89s"
  }, {
    "id" : 7,
    "title" : "My girlfriend got me suit pajamas. They are now the most legendary thing I own.",
    "snippet" : "  i think you mean suitjamas Of course, I came here to say that exact same thing. One comment, and that's what it was. Damn you Reddit, can I ever get to point out the errors of others first without someone beating me to it??? ",
    "url" : "http://i.imgur.com/OYjloGl.jpg"
  }, {
    "id" : 8,
    "title" : "Oh really now?",
    "snippet" : "  The image should have been of Quinn. (aka Karma) ",
    "url" : "http://qkme.me/3swcya"
  }, {
    "id" : 9,
    "title" : "This needs to happen before the finale.",
    "snippet" : "Bob Saget should have a physical cameo in some way. I would love to see him at the wedding as a photographer or even the minister.  I laughed pretty hard when Dave Coulier said \"Cut it Out\" and Bob Sagat replied \"I always liked that joke\" I laughed pretty hard when Dave Coulier said \"Cut it Out\" and Bob Sagat replied \"I always liked that joke\"  He needs to have an interaction with Ted.\n\nLike that clip we keep seeing of Ted leaning against the bar at the wedding and seeing the mother. Have him look the his right and see Bob Saget wearing the same cloths and in the same pose. Get Ted to say something like \"Wait a second...\" then get Saget to walk away. He needs to have an interaction with Ted.\n\nLike that clip we keep seeing of Ted leaning against the bar at the wedding and seeing the mother. Have him look the his right and see Bob Saget wearing the same cloths and in the same pose. Get Ted to say something like \"Wait a second...\" then get Saget to walk away. It's possible! At the end of S5 E10 future Marshal time travels and gives past Marshal hot wings. So it would be possible for Saget to time travel to the wedding. Yeah but future Ted has been shown too (at their college reunion, for example) and it's Josh Radnor still. It would be really confusing for him to be played by Bob Saget in any capacity. A cameo where they interact would be funny though.   ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/1841q3/this_needs_to_happen_before_the_finale/"
  }, {
    "id" : 10,
    "title" : "Marshall looks great in a suit.",
    "snippet" : "  This picture chills me to the bone, not sure why.    Barney as marshall looks like a chihuahua    ",
    "url" : "http://i.imgur.com/ww5ENad.jpg"
  }, {
    "id" : 11,
    "title" : "I figured you all would like this.",
    "snippet" : "  What episode is that from?",
    "url" : "http://www.reactiongifs.com/wp-content/uploads/2013/02/oh-hey-sup.gif"
  }, {
    "id" : 12,
    "title" : "I used to do sandwiches like this back in college.",
    "snippet" : "  I mean, as a college freshman I bagpipe pretty hard. ",
    "url" : "http://i.imgur.com/opnup0M.jpg"
  }, {
    "id" : 13,
    "title" : "Just noticed an interesting sign at the beginning of \"Disaster Averted\" (S7E9)",
    "snippet" : "    Awesome find. I thought I watched this show too closely, my friend, you're as clever as a chama leon.  Words cannot describe how tickled I am that you used that reference.   Remind me what that means? ",
    "url" : "http://i.imgur.com/Y8gIUqd.png"
  }, {
    "id" : 14,
    "title" : "Canadians. \nMade me think of HIMYM. \nenjoy! \n",
    "snippet" : "  The \"awkward\" distance can be a friendly distance if the person you're holding the door for is elderly, disabled, or smokin' hot. Or if you know them. The \"awkward\" distance can be a friendly distance if the person you're holding the door for is elderly, disabled, or smokin' hot. The \"awkward\" distance can be a friendly distance if the person you're holding the door for is elderly, disabled, or smokin' hot.   ",
    "url" : "http://i.imgur.com/GsKAfnl.jpg"
  }, {
    "id" : 15,
    "title" : "Watching any episode in which Barney and Ted have a crazy night out",
    "snippet" : "  To me it's the bro code that I am everyone's wing man, and they are mine.  \nIf I see a man in trouble, I always step up to help.  \nThe more of us that get laid the better, imho.  \n ",
    "url" : "http://i.imgur.com/DWeJIFt.jpg"
  }, {
    "id" : 16,
    "title" : "I see your cup Swarley and raise you my car Swarley. ",
    "snippet" : "    I started a trend :)\n\nAs for the license plate, DAY-UM! Yeah... You started it... What's that supposed to mean? That there is a million of these posts and everytime one comes a thousand other comes up as well. He's referring to mine though. That's the point. Dude, you totally didn't start a trend.",
    "url" : "http://i.imgur.com/gRNAju4.jpg"
  }, {
    "id" : 17,
    "title" : "Found a Robin Sparkles outfit today",
    "snippet" : "  At Marshalls.  Anyone ever tell you that you look a lot like Heather Morris from glee   I hope you bought it. You could totally pull it off. It would be legen- wait for it- dary",
    "url" : "http://i.imgur.com/gqvkZH7.jpg"
  }, {
    "id" : 18,
    "title" : "My favorite \"true story\" ",
    "snippet" : "   ",
    "url" : "http://youtu.be/laKTUIWEPjU"
  }, {
    "id" : 19,
    "title" : "My exact thought after watching the end of \"Dobler/Dahmer\"",
    "snippet" : "   I mean, that really got out of hand, fast.",
    "url" : "http://i.imgur.com/kAV8ieO.jpg"
  }, {
    "id" : 20,
    "title" : "Scumbag Marshall",
    "snippet" : "  They did never show his search for the burger in any previous episodes, why would they show him eating the burger in any of the latter ones? Obviously he went back there but it has nothing to do with the plot of the show.  im aware of that but i just watched this episode and this was the first thing that came to my mind after i finished, its just supposed to be a joke not criticism;) I thought your post was a good representation of both OP. It would be nice to see them in S9 just eating there as some form of celebration, without explaining the significance of the restaurant to the potentially unaware audience.   im aware of that but i just watched this episode and this was the first thing that came to my mind after i finished, its just supposed to be a joke not criticism;) Wow, I'm from r/all and your comment (very polite and fair) is getting destroyed!! Wonder why? r/all usually brings in ass hats. Wow, I'm from r/all and your comment (very polite and fair) is getting destroyed!! Wonder why? Wow, I'm from r/all and your comment (very polite and fair) is getting destroyed!! Wonder why?  that's not the bad part, it's all the wasted burgers that were pissing me off.. but, but, but... food it was probably a bad ep to watch hungry in hindsight.. but, but, but... food  I watched this episode as I was catching up on Netflix at approximately 2am... I have never been so hungry in my entire life. I do this all of the time. I'm awake really late, and watch something that makes me hungry. Everyone else is asleep, so I sneak around the house looking for snacks that I can take away quietly.  Scumbag Ted's sister - convinces Ted to co-sign lease, ceases existence. she is the mother???  \"I wake up at night, going, 'Get out of my head, burger. Get out!'\" -Regis P. Whenever my friends are discussing cheeseburgers, I always interject with \"I had nightmares about that burger!\"   Scumbag Marshall? No such thing. Genius Marshall.   I know this is kind of a copout answer, but isn't kind of the point of that episode that he used finding that burger as kind of an ability to move on to the next phase of his life? Like he had to experience that burger again to get off the couch and put pants on and get a new job?\n\nThat burger was the first thing that he really enjoyed about New York City (which was the first big post-college part of his life) and since he hadn't had it since that day, it was always a part missing.\n\n(Plus, the whole, he probably went to the burger place more often than Ted told his kids about, e.g. like how the group still smoked outside of the smoking episode). Marshall?  You know a lot about these character's depth. Don't know if I caught that when I watched it months back. I thought the burger was a metaphor for something he couldn't find any more because his tastes had changed.  Marshall?  You know a lot about these character's depth. Don't know if I caught that when I watched it months back. I thought the burger was a metaphor for something he couldn't find any more because his tastes had changed.  From the episode:\n\n&gt;It's stupid. I think about that first week in New York. You know? I was 22 years old. I had my whole future ahead of me. I guess I just kind of thought that if I could have that burger one more time and feel that way for one more night, that I might be able to check that off the list, and grow up, go work for the stupid bank, and just... be happy.\n\n-Marshall\n\nAnd later on:\n\n&gt;And so, after finally tasting again the burger he'd craved for so many years, Marshall got up the next morning, put on some pants, and went to work, and he never looked back.\n\n-Future Ted It's pretty awesome that I heard that in their voices. Of course it wasn't until last year that I realized Future Ted is Bob Saget. Crazy. It's a good thing you learned it before last episode then because you wouldn't have gotten the joke! I actually haven't seen the last episode, but I'll be watching it today. I'll make sure to watch out for the reference. You're going to love it.    I hate when people do this, it happens a lot in /r/HIMYM in particular. Just because something isn't shown on the show doesn't mean it doesn't happen. \n\nWe have to suspend our disbelief and pretend marshall eriksen (and the other characters) is a real person for the show to have any value, first of all. Second, we have to realize that as a real person, he does things we don't see.\n\nDo you see every single thing your best friend does? No? Does this mean you believe they just sit there until you're around again so they can continue with their lives? Of course not. Neither does Marshall.   I always wondered why he didn't just order one burger and test it out before *everyone* ordered burgers...  I can understand actually. A while back, i showed all my closest friends the best place for a burger in the city and we haven't all been back up there together in a long time. Sure one or two of us might go from time time, but we didn't make it the new hangout spot. Yeah, the thing about the best burger joint in town, is that it's normally the most expensive too. The inverse is true for kebab places. The inverse is true for kebab places. I wish we had Kebab places. I don't think I've ever actually *had* a Kebab.          It actually makes sense that he wouldn't go back that often. What happens when you eat a certain food too often, even if you really like it? You get sick of it. The answer is simply that Marshall did not want to lose affection for his favorite burger by eating there too often.   Well they technically didn't even eat there...the place was closed and replaced with a GNB cash machine. Soooo there's no where to eat the \"right\" burger. That's why they where never there again But they did get the right burger at the end of the episode... The restaurant had just moved.        Or maybe they just don't show him going to lunch, because that would be fucking retarded.   They never found the right burger the restaurant got turned into a Goliath national bank ATM  They did find it in the end. It moved.",
    "url" : "http://i.imgur.com/mbwhS4T.png"
  }, {
    "id" : 21,
    "title" : "HIMYM Valentines...",
    "snippet" : "  There should be a Robin Sparkles one that says, \"I'd go to the mall with you.\" There should be a Robin Sparkles one that says, \"I'd go to the mall with you.\" http://i.imgur.com/aqCSfhq.jpg\n [Robin Sparkles](http://userserve-ak.last.fm/serve/_/587566/Robin+Sparkles.jpg), not Robin Sherbatsky.  You gotta put on your jelly bracelets and your cool graffiti coat before you go to the mall... today.  And because I just realized this...http://i.imgur.com/FPbU6nq.jpg  The Marshall one is a bit terrifying.   I was expecting Robin's to be \"... You're an idiot\", but this one's legit  Needs more Ranjit. http://i.imgur.com/ST4WQ0U.jpg  After reading what an old king clancy is, the Robin one kind of weirds me out.  But still good stuff Wait...Those Canadian Sex Acts are real??!!\n\nBtw, Old King Clancy doesn't sound so bad...&gt;__&gt;        I think the faces should be centered more, away from the point where the line joins at the top. It feels like their heads are sliced off a bit. Otherwise, they're terrific! I felt the same way when I was making them to be honest.  But then the higher up I got the point, the more it got away from their face, the more room I had on the bottom and it became awkward looking, and it looked even less even and more crowded. \nsidenote: this is when I learned that NPH has a very high forehead and it made me hate him for like a split second.       ",
    "url" : "http://imgur.com/a/X0TmD"
  }, {
    "id" : 22,
    "title" : "How I Met Your Mother 8x16 Promo \"Bad Crazy\" (HD)",
    "snippet" : "       Does anyone have an idea why this episode is called Bad Crazy as opposed to the S07Exx Good Crazy? Good Crazy was the episode in which Barney sets up dates for Ted through an online dating agency.",
    "url" : "http://www.youtube.com/watch?v=5sHSl_LB8z0"
  }, {
    "id" : 23,
    "title" : "Spoilers for the next three episodes",
    "snippet" : "16. Bad Crazy \n\n Ted is reluctant to break up with his crazy girlfriend Jeanette. Meanwhile, Robin becomes attached to Marvin after finally holding him for the first time.\n  \n\n17. The Ashtray \n\n When Ted receives an unexpected call from The Captain, the gang reminisces about their last awkward encounter with him.\n\n  The Captain comes back, as do Patrice and Sandy Rivers.\n\n\n18. Weekend At Barney's \n\n When Ted and Jeanette break up, Barney tries to help him land a new girl by using the infamous playbook Robin thought he had destroyed. Meanwhile, at a gallery opening where Lily hopes to make a good impression, Marshall ends up unintentionally getting noticed.   #3 wont that put a big dent in the entire Robin/Barney relationship. #3 wont that put a big dent in the entire Robin/Barney relationship.  They've also released the titles of the two episodes after Weekend at Barney's: e19, Time Travelers, and e20, The Fortress of Barnitude.\n\n&gt; at a gallery opening where Lily hopes to make a good impression\n\nGreat, finally an interesting storyline with Lily and Marshall. im guessing the painting of Marshall naked is whats getting the attention. \nThe fortress of Barnitude will be about how Robin and Barney deals with moving in together\nand the episode with the Captin will run in the simular line as when Punchie came to New York.\nIf you rewatch season 3-5 and take the most popular episodes its like the writers are redoing all the plot lines in season 8 They've also released the titles of the two episodes after Weekend at Barney's: e19, Time Travelers, and e20, The Fortress of Barnitude.\n\n&gt; at a gallery opening where Lily hopes to make a good impression\n\nGreat, finally an interesting storyline with Lily and Marshall.   I thought lily was selling her art to vets to keep dogs calm?",
    "url" : "http://www.reddit.com/r/HIMYM/comments/1846yf/spoilers_for_the_next_three_episodes/"
  }, {
    "id" : 24,
    "title" : "xpost from TIL: Alanis Morissette was a Canadian pop singer before going grunge (Like Robin Sparkles)",
    "snippet" : "   ",
    "url" : "http://www.youtube.com/watch?v=ccNJDSQeFEA"
  }, {
    "id" : 25,
    "title" : "So I realized something today...",
    "snippet" : "I was watching The Leap, and as soon as Ted said \"It's here, Lily. It's looking at me\" (about Missy the goat) I realized that was the exact thing that Robin said to Lily when she first met George's son Doug. :) This may have been brought up before, but I thought it was interesting.   I believe it is a reference to the movie Ghostbusters. Bill Murray says this line when he sees Slimer. RAY! When someone asks you if you are a god you say yes!  I believe it is a reference to the movie Ghostbusters. Bill Murray says this line when he sees Slimer.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/1839pl/so_i_realized_something_today/"
  }, {
    "id" : 26,
    "title" : "Poll: should Tim Hortons sell 'the Priestley\" in its stores? A Twitter history",
    "snippet" : "  I not Canadian or American, so what exactly is a timbit? From the pictures I imagine it be a  red gold ball  ",
    "url" : "http://www.cbc.ca/news/yourcommunity/2013/02/tim-hortons-creates-doughnut-imagined-on-how-i-met-your-mother.html"
  }, {
    "id" : 27,
    "title" : "Guy on FB said this - can anyone confirm? I'm pretty sure it's wrong...",
    "snippet" : "In response to a post with a collage showing Full House/HIMYM connections, he said:\n\nThe mother is not from full house.  The creators, writers, and producers of this show have said numerous times that the \"mother\" has been on the show on more than one occasion....she has had no speaking lines, and no direct contact with Ted.  I have every episode...and my curiosity has driven me to watch them till my eyes bleed.  There isn't any \"Full House\" actresses that have appeared on the show with no speaking lines.  Sorry guys!\n\n....and...\n\nI have developed a \"minor\" case of OCD involving this show.  I'm like the Sherlock Holmes of How I Met Your Mother haha.  I don't WANT to keep watching the show!!  I'm done with it...have been for the past 4 seasons.  So far...I've got it narrowed down to season 2 when she first appears.  Down to 6 possible episodes.  Notice anytime Ted is walking in front of the bar....you'll notice the SAME extra walking by numerous times.  Also...the protest outside with Zoey, same extra.  And again at one of the New Years parties.\n\n\nSooo has anyone else seen or read anything from the creators confirming this idea? Everything I've read seems to say the complete opposite.  the writers on multiple times said that they have not cast the mother. \n\nYour friend is dead wrong. Lol I've noticed that now people aren't only getting confused by the show but also everything the writers have said. I always have to do tons of research when I blog about HIMYM because I rely on quotes from the writers to confirm and deny so much stuff! I would agree with that.\n\nWhat is your blog? Posted this in the wrong place before - my log is corinawrites.com. I do a bunch of HIMYM sleuthing posts :) damn, that is some impressive research on the show.  The mother is Dave Coulier Cut it out!  I don't know if this helps, but I read recently that when the mother is cast, there will be absolutely no casting announcements of any sort so we do not know what she looks like.  Do you have screen caps of this extra?     I had never heard one way or the other, but I always just kind of assumed that the mother has been showing up as an extra throughout the series.  that would really fit the style of the show.  Perhaps they have always had the mother narrowed down to 2 or 3 women, and they've each been showing up as extras.  That way, they could still say that she hasn't been cast yet, right?  I would look for someone more subtle than the extra that corinawrites noticed.  She sounds like the least likely contender if my theory pans out.  I would watch for someone sitting on the other side of the bar, and almost impossible to notice if you aren't looking for her.  How cool would it be if we finally see the mother, and then it goes to a montage of footage of her in various episodes.  I think that would tie in with the other times he has crossed paths with her - we know they've been living in the same area.  I think we will find out that when he turned and said excuse me to Bump Girl, he just missed seeing the mother walk by.    My best guess on the mom is the chick that comes out in the St. pattys Episode where Ted bumps into her while walking to the bar. I say this because he was talking about how the kids mom was there that same time.  That kind of makes sense. Go one step further and WHY include her bumping into Ted, when we don't ever see her again? I don't think she is the mother though. They put a lady bumping into Ted there to fuck with the viewers, who specifically know to \"look out\" for the mother in this scene.  She may or may not be the mother and in the end it doesn't matter.  It was a fun little thing to do to make the viewers speculate/get excited.  It is inherently wrong to assume the woman was of any actual importance to the story.  Am I the only one who doesn't even care about who the mother is anymore? It may mostly be because I hate Ted and don't want him to have happiness Ted has really been pissing me off the past few seasons. I guess I feel like he isn't trying to move on or really find his destiny, he's just kinda stuck in the past or moping around all the time. I still think he's funny but I find this current version of Ted much less appealing than, say, No Tomorrow's Ted. He's the worst. He always does annoying ass things and then makes people feel bad for getting mad. Like when he took over with Marvin and became totally creepy and was taking him to do all that stuff without telling Marshall and Lilly, that's pretty fucking annoying. Then they get mad at him and he's like \"oh but I thought I'd have my own by now, blah blah feel bad for me\"  It is seriously annoying. I totally get where he's coming from - I'm single &amp; would love to settle down but haven't found the right guy. My BFF is happily married, owns a house, and has a beautiful family. But I don't begrudge her happiness or become depressed by it. If anything her happily ever after gives me hope that I will find mine. I guess I just don't think it's cool to use your misery as an excuse to make others miserable. That's cause you're not a poop like Ted Well he does have a few years on me so I suppose there's a chance I will descend into bitterness...but I doubt it. Grow up Mosby! Haha for real. We seem to have annoyed some Mosby lovers",
    "url" : "http://www.reddit.com/r/HIMYM/comments/182l85/guy_on_fb_said_this_can_anyone_confirm_im_pretty/"
  }, {
    "id" : 28,
    "title" : "I for one loved the newest episode.",
    "snippet" : " ",
    "url" : "http://i.imgur.com/A1mE1rq.jpg"
  }, {
    "id" : 29,
    "title" : "Immediately thought of this after seeing the Dobler/Dahmer episode. My friends and I always just called it the \"Stalker Theory\".",
    "snippet" : "  The key to romantic success: Be attractive + Don't be unattractive. + ??? = Profit\n  As a guy who has had very bad luck with acne in my life, I can attest this is a sad truth.   [relevant](http://www.youtube.com/watch?v=gBVuAGFcGKY) :)  You... You are my god now... A while back I was chasing after a girl I was crazy about, but it got to the point where I had to take a step back and see the big picture. So I called a female friend (different girl) and asked for her opinion on where the line was on me either being a \"hopeless romantic\" OR a \"creepy stalker\", and if I had crossed it or what would need to happen for me to cross it. That was when she just laughed and then had to explain the \"Stalker Theory\" to me. Three years later - HIMYM confirmed its truth :) I'm saving this comment so it can someday be religious doctrine  I fu ked Ted",
    "url" : "http://i.imgur.com/IsPo5vK.png"
  }, {
    "id" : 30,
    "title" : "Season 9 theory",
    "snippet" : "Ted is going to meet two girls at Barney's wedding. They'll reveal that one of them is the mother. Season 9 will be about Ted's developing affection and indecicion about these two girls, including stories that will make the viewers fell in love with both of them. The series will end with Ted's wedding, or another emotionally charged event, where they reveal who, among these two girls is the mother. \n\nIt would be sort of a season-long version of [Definetively Maybe](http://www.imdb.com/title/tt0832266/).   I, for one, think that the story might change to a different point of view (possibly that of the mother's) because the new season is supposed to \"look and feel  much different from past seasons\" which lends itself to a different method in story-telling. \n I, for one, think that the story might change to a different point of view (possibly that of the mother's) because the new season is supposed to \"look and feel  much different from past seasons\" which lends itself to a different method in story-telling. \n \"look and feel much different from past seasons\" was the reason I thought about this theory. I'm excited about season 9 anyways!   Nope. Good idea and all, but he def has stated it was love at first sight and blah, blah, blah. Plus, that would kinda kill the whole concept of the show, because he's supposed to be head over heels for her. And he's already obsessed with Robin, so another girl in the way would just be shitty.    I have a theory on what the mothers name is and backed up by the bassest comment. i think the mothers name is tracey becuase in a older episode he sais that he met te kids mither in a strip club where she said her names tracey and the kids freak out. so by that i think its her name",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18229v/season_9_theory/"
  }, {
    "id" : 31,
    "title" : "Someone took a HIMYM reference a little bit too far...",
    "snippet" : "     Somebody please explain the HIMYM reference here. Thanks! [deleted]",
    "url" : "http://myfox8.com/2013/02/05/graham-man-busted-for-trying-to-pass-sandwich-as-pot/"
  }, {
    "id" : 32,
    "title" : "Lorenzo Von Matterhorn ",
    "snippet" : "  I think I might have Phallumegaly, too. :( ",
    "url" : "http://www.lorenzovonmatterhorn.com/"
  }, {
    "id" : 33,
    "title" : "This might be old, but relevant. Cobie Smulders on Robin being Canadian.",
    "snippet" : "  What's that guys name? Strombolopolououss? We know him as Strombo.  I always called him George. Watched him when he was on Much all the time. Damn, it was a hard day when I went from Cable to a satellite provider that didn't have Much. Felt like I was being less of a Canadian somehow. ",
    "url" : "http://www.youtube.com/watch?v=xjxfglfM-S8&amp;sns=em"
  }, {
    "id" : 34,
    "title" : "Whenever Robin yells at/about Patrice, I usually cry laughing, thought I would share what I found. ",
    "snippet" : "  She also uses the same tone when she tells Marshall and Lily, \"Have you NEVER heard of overhead lighting?!\" One of my favorite Robin lines. ",
    "url" : "http://www.youtube.com/watch?v=xF-YDdbRYmA"
  }, {
    "id" : 35,
    "title" : "Did Barney hook up with Karma in the past?",
    "snippet" : "I was watching HIMYM, on season 3 episode 14 when they are trying to figure out the girl who is telling Barney's girls that he is trying to hook up with them and leave. Then when Barney can't figure out who it is. Lilly says \"Maybe its Karma?\" Then Barney says \"Naw shes touring in Vegas and we're cool.\"\n\nI thought this was something cool. Maybe the name Karma was an accident or its the same one he almost married.   Also Karma/Quinn said she started working at the lusty leopard a year ago to Barney.\n   It's not like every stripper has a completely unique stage name.  Get your head out of your ass.  Its a play on words. Lilly means what goes around comes around. Barney used it as a stripper name saying \"she's touring in las vegas\" ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/181vca/did_barney_hook_up_with_karma_in_the_past/"
  }, {
    "id" : 36,
    "title" : "Craig Thomas states that next season will \"look and feel much different from past seasons,\" also revealing that there's \"going to be a new way to tell the story\" and that fans are \"never going to mistake a Season 9 episode [as being] from one of the previous eight [seasons].\" ",
    "snippet" : "  I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\". I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\". I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\". I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\". I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\". Sorry, but I already called this yesterday \n\nhttp://www.reddit.com/r/HIMYM/comments/17xb6e/new_story_telling_approach_for_season_9/c89odqq\n\nWhen this happens, you will have to get in line for the sweet karmic reward\n I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\". I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\". Or... or she starts from scrap and tells her adventure of meeting Ted. I'm calling it right now. The (future) mother walks into the room where future Ted is telling the kids the story and either shares the storytelling duties with future Ted or takes over and starts telling her side of how things went after she met \"your father\".  If there's anything I've learned from watching Scrubs...\n\n..it's that Season 9's never, ever, end well. This is true with Friends, too. The Joey and Rachel love quest was the worst part of the entire series. The very, very large majority of that storyline was in season 10. If there's anything I've learned from watching Scrubs...\n\n..it's that Season 9's never, ever, end well. The Office Season 9 has been one of the best seasons imo. It's only getting better by the week! The Office Season 9 has been one of the best seasons imo. It's only getting better by the week! It's weird, as you are missing the /s If there's anything I've learned from watching Scrubs...\n\n..it's that Season 9's never, ever, end well. If there's anything I've learned from watching Scrubs...\n\n..it's that Season 9's never, ever, end well. If there's anything I've learned from watching Scrubs...\n\n..it's that Season 9's never, ever, end well.  Sorry I linked to the TV.com prediction article and not the actual [article](http://www.tvguide.com/News/How-Met-Mother-Bosses-1060327.aspx).\n   I said this before on another thread so I'm going to repost with a few extra thoughts here: I'm wondering if they're going to go back and retrace some of the close calls and coincidences between Ted and the mother during the 9th Season--basically retell episodes from previous seasons. I'd love to see them discover and then recount St. Patrick's Day, the Economics classroom etc. from the two perspectives. They've done similar things in other episodes--like Subway Wars or Brunch where they tell pieces of a story and how they fit together. That wouldn't require having to switch it up and tell from the mother's perspective which would change the entire feel of the show. I think it would help give closure to long time fans and show the development of the mother in certain ways and help to fit the pieces of the puzzle together so we can see how Ted and the mother \"fit\" as well. Plus, I think it could keep people interested if the writers do it well, discovering little easter eggs from previous seasons that might not have been obvious before.    Things I would like to see in the final season:\n\nA final Slapsgiving\nAn answer to the pineapple incident\nSt patty's day from mom's pov\n\n\nAnything else?....       I thought we were going to meet the mother at the end of this season! Are they going to make us wait *another* year? All I have to say to that is that Ted meets the mom on the day of the wedding. The wedding is 5/25, the season finale is before that. We (the audience) may meet the mother this season, but Ted will not  Did they say when the wedding is? I completely missed the specific date. All I have to say to that is that Ted meets the mom on the day of the wedding. The wedding is 5/25, the season finale is before that. We (the audience) may meet the mother this season, but Ted will not    ",
    "url" : "http://www.tv.com/news/prediction-how-i-met-your-mother-is-about-to-become-how-i-met-your-father-30552/"
  }, {
    "id" : 37,
    "title" : "I finally confessed",
    "snippet" : "  What the hell does \"Finally gathered straight\" mean?  Where are you from? I don't know the phrase, but maybe it's colloquialism from an unfamiliar dialect.\n\nOr OP is an idiot. OP probably isn't a native English speaker and made a mistake, attempting to say 'strength' What the hell does \"Finally gathered straight\" mean?   Classic schmosby! Goddamnit someone always beats me to it!   Ouch. At least she gave you an out. Not really. Mosbeying was used to end relationships, remember? She'd think he was trying to break up. Not the first time--the first instance of \"Pulling a Mosby,\" was after Robin and Teds *first date*.  She's a keeper. Unfortunately for OP, apparently not his to keep. Oh whoops, I interpreted it as her saying it as a joke for some reason.  Dude. A HIMYM reference?\n\nShe's the one! ",
    "url" : "http://www.quickmeme.com/meme/3svidu/"
  }, {
    "id" : 38,
    "title" : "When people feel the need to give me any kind of advice..",
    "snippet" : "    There's a really annoying guy who always comments on my facebook status's.  I'm always yelling \"NOBODY ASKED YOU MARCUS!\" in my head. You can hide your status updates from individual people as you post them, you know... :) But be careful.. \nBecause now, other people can see exactly who you are sharing with/hiding post from.   \nShit gets awkward and sometimes other friends will tell that first friend, etc. \n\nEdit: \"I believe that if it's \"Everyone but X\", it'll show up as Custom, with no way to dig deeper than that.\"\n/u/mynameisvlad is right. \nMy bad guys :) I believe that if it's \"Everyone but X\", it'll show up as Custom, with no way to dig deeper than that. But be careful.. \nBecause now, other people can see exactly who you are sharing with/hiding post from.   \nShit gets awkward and sometimes other friends will tell that first friend, etc. \n\nEdit: \"I believe that if it's \"Everyone but X\", it'll show up as Custom, with no way to dig deeper than that.\"\n/u/mynameisvlad is right. \nMy bad guys :) Wait. What. http://i.imgur.com/qHo792N.png\n\nEdit: Misleading, See above comments. We're talking about the other way around, does that show up, too? Well, no, because when they can't see the post, there's no way to see who it was shared with. Well, no, because when they can't see the post, there's no way to see who it was shared with. You can hide your status updates from individual people as you post them, you know... :) You can hide your status updates from individual people as you post them, you know... :)  Cobie Smulders' mouth.  Yeah, it's so perfect.    You know Bresarus, you might find your life easier if you at least pretend to be receptive to their input! Just a little advice...        Came here to ask who the fuck practice is.... Came here to ask who the fuck practice is....",
    "url" : "http://imgur.com/Tt8rhOQ"
  }, {
    "id" : 39,
    "title" : "So I just found out about the hidden countdown in \"Bad News.\" I was just wondering, what other cool hidden features are there in episodes of HIMYM? ",
    "snippet" : "  Holy fuck where have you been To be fair, I probably wouldn't know about it unless someone pointed it out. Probably lots of people wouldn't. It's actually pretty blatantly thrown out at you. Most of the numbers are large or look out of place      Will someone explain to a newbie? :-) Throughout the episodes there are numbers on random stuff (pamphlets, posters, books that people are holding or that are in the background) and they start at 50 and count all the way down to the climax of the episode In EVERY episode?? Throughout the episodes there are numbers on random stuff (pamphlets, posters, books that people are holding or that are in the background) and they start at 50 and count all the way down to the climax of the episode",
    "url" : "http://www.reddit.com/r/HIMYM/comments/181e9d/so_i_just_found_out_about_the_hidden_countdown_in/"
  }, {
    "id" : 40,
    "title" : "I saw this commercial right before the latest episode came out",
    "url" : "https://www.youtube.com/watch?v=1Z8QhDkufjI"
  }, {
    "id" : 41,
    "title" : "In my opinion, one of the saddest scenes in the show. ",
    "snippet" : "  Or Marshal listening to his dad's voice mail. For me, it's The Countdown, voicemail, and then this post.\n\nSomething about the way the line is delivered.  \"If you were gonna be some lame, suburban dad, why couldn't you do that for me?\"  Tears me up. Doesn't tear me up like most moments in the show, but when Barney says he can never talk to his dad, then Marshall says \"No Barney, I can never talk to my dad.\"\n\nEDIT: I grammer'd. Or Marshal listening to his dad's voice mail.  A kid needs a hoop\n\n\n\nIf you are going to be that lame suburban dad they why couldn't you \nhave been that for me!\n\n\n\n\n\nGet me every time  The scene reminds me a lot of the fresh prince scene where wills dad leaves again and will gets very emotional which culminates in \"why don't he want me man?\" As uncle Phil proceeds to grab him and tightly hug him.  I've read that will went off script into that line and the hug wasn't part of the scene either just actor to actor feels...I don't know much about NPH but either its a similar situation or nph is just that good of an actor which wouldn't surprise me  So I looked up that Fresh Prince scene... http://www.youtube.com/watch?v=z7MKS4sM1KE wow :'( Damn...ಥ_ಥ The scene reminds me a lot of the fresh prince scene where wills dad leaves again and will gets very emotional which culminates in \"why don't he want me man?\" As uncle Phil proceeds to grab him and tightly hug him.  I've read that will went off script into that line and the hug wasn't part of the scene either just actor to actor feels...I don't know much about NPH but either its a similar situation or nph is just that good of an actor which wouldn't surprise me  That scene and the scene where Carlton buys a gun and Will talks him down... it got really real in Bel Air. video of it? please video of it? please The scene reminds me a lot of the fresh prince scene where wills dad leaves again and will gets very emotional which culminates in \"why don't he want me man?\" As uncle Phil proceeds to grab him and tightly hug him.  I've read that will went off script into that line and the hug wasn't part of the scene either just actor to actor feels...I don't know much about NPH but either its a similar situation or nph is just that good of an actor which wouldn't surprise me  A kid needs a hoop\n\n\n\nIf you are going to be that lame suburban dad they why couldn't you \nhave been that for me!\n\n\n\n\n\nGet me every time  I just watched that one scene over and over. \n\nThe way his voice shakes when he says dad sounds so real. \n\nWhere the fuck did the onions come from?  I just watched that one scene over and over. \n\nThe way his voice shakes when he says dad sounds so real. \n\nWhere the fuck did the onions come from?   http://i.imgur.com/niv3m.jpg\n\n^That's pretty sad too. I think we're all kind of emotionally invested in these people though.  http://i.imgur.com/niv3m.jpg\n\n^That's pretty sad too. I think we're all kind of emotionally invested in these people though.  http://i.imgur.com/niv3m.jpg\n\n^That's pretty sad too. I think we're all kind of emotionally invested in these people though.  Hold on, I've completely forgotten about that. Context? Robin's infertility. It starts with her narrating to her imaginary kids. She had just been done punching Barney in the face over telling him she's pregnant. She says she hasn't had sex with Kevin, so it's his. Once Dr. Sonya tells her she's not pregnant, she calls her back in to tell her she's infertile. Robin's upset, so then they all try to find out what's wrong with her and she says she's upset about not being a Canadian pole vaulter. Meanwhile, Marshall's setting up the large light display in the suburbs with the neighbor kid Scott. After Ted tries to convince Robin to tell him what's wrong she leaves with egg nog and sits in the park. (That scene) When she comes back, Ted lit up their whole apartment to AC/DC to try and cheer her up.  Oh yes, of course. That was very descriptive, thanks!   Or when Barney got a stain on one of his ties...He was good, that one. When Tim Gunn couldn't make it work.  Either the hoop scene, or \"I'm not ready for this.\"  Growing up without a father (being a boy), this scene really hit me... Growing up without a father (being a boy), this scene really hit me...   Living the last 18 years of my life without a father, I can confirm that this is the saddest scene in the entire show. He's living interstate with a typical family, he's nothing special, so why couldn't he be my nothing special?\n\nRight in the feels, Stinson, right in the feels.  are we going to start this all over again?  How is this not the saddest scene!?!? Right in the feels! Because there's the two scenes relating to Marshall's dad dying (finding out and then the voicemail), and the scene of robin in the park where her future kids fade away.           The scene where Barney is in the bar and he finds out that Robin did not break up with Kevin gets me.  When time stops and barney is the only one moving in the bar... ",
    "url" : "http://i.imgur.com/ILNBQT0.png"
  }, {
    "id" : 42,
    "title" : "Theory for Marshall's last slap.",
    "snippet" : "I was thinking this over the other night and realized that Marshall only has one slap to give out. With Barney's wedding coming up, I think Barney will chicken out toward the end of the season. Marshall will use his last slap as a wake up call to Barney.\n\nBarney will realize how serious Marshall is about the whole situation since he gave up his last slap for the better. Not only that, but he made himself lose the bet he and Lily had going on (Ted will end up with Robin vs. not).\n\n---\n\nIt would go something like this:\n\nBarney is in the dressing room nervously pacing around. He stops and starts ranting to Marshall about how he isn't ready to make such a big commitment. Mid rant, Marshall slaps Barney to shut him up.\n\n\"You just used your last slap...\"  What if he bequeaths unto Ted the last slap, your scenario plays out, but Ted slaps him (Thus reinforcing for the last time that Ted's okay with the wedding) hard enough to hurt his hand somehow, then gets it bandaged, as we saw it in Farhampton?  I thought he had 2 slaps left? He had 1 until he made a deal for 3 more to let Barney out of wearing the ducky tie. Then he slapped him twice. I don't remember any slaps after that. Please refresh my memory if I'm wrong here. Damn, you are right. This would have to be for his second to last slap then.        ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/17zi9y/theory_for_marshalls_last_slap/"
  }, {
    "id" : 43,
    "title" : "Was watching S2 Ep 15 \"Destiny and noticed something",
    "snippet" : "Barney and Marshall are the only ones up with Ted at the altar. This seems slightly significant, without Punchy, his dad, any family members. I dunno, not the smallest thing to be overanalyzed.  Punchy wasn't even a character yet.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/181w18/was_watching_s2_ep_15_destiny_and_noticed/"
  }, {
    "id" : 44,
    "title" : "Finding out I've missed my cakeday by 6 minutes",
    "snippet" : "  I laughed, and then thought \"Hey, mine should be coming up some day soon!\"\n\nCrap.   how do you view when your cakeday is? Should be in your profile and it looks like yours was actually last week. It says \"Redditor since:2011-01-31\". Bummer, dude.",
    "url" : "http://24.media.tumblr.com/tumblr_m8tuci23un1rvfoo8o1_500.gif"
  }, {
    "id" : 45,
    "title" : "It's not just one thing exactly that I can put my finger on, but that last episode left me kind of....well unimpressed",
    "snippet" : "Anyone else feel this way? Like I was watching the episode and I giggled a little bit but not much. It's like someone else previously posted, they've all become caricatures and not characters.  I also kind of felt like the whole \"lily met marshal to get him to fix his stereo\" bit contradicted a previous episode. Wasn't there a different reason as to why she went to his dorm room or am I just mistaken?  I vaguely recall there being a story where she was actually going to Marshall's room to see Ted, not Marshall. Is that what you're referring to? But aren't the stories presented in the order the Ted would learn about them? So in this instance, this would also be the first time Ted had learned the 'real' story.  I vaguely recall there being a story where she was actually going to Marshall's room to see Ted, not Marshall. Is that what you're referring to? I thought there was something like this too. Maybe from \"How I Met Everyone Else,\" but I'm not sure. I did find this:\n\n&gt; In the episode Best Prom Ever  Lily has a backflash which directly conflicts with her statement that she broke her stereo on purpose to get in direct contact with Marshall and become his girlfriend. In the backflash she is fixing the stereo while Marshall watches and she is talking about travelling the world and doing her art and not having a boyfriend to tie her down. If she had, as previously stated, went to the trouble of breaking her stereo to arrange the relationship between the two of them - why would she be talking about not having a boyfriend or being tied down, let alone why she was fixing the stereo instead of Marshall.\n\nFrom here: http://how-i-met-your-mother.wikia.com/wiki/P.S._I_Love_You I vaguely recall there being a story where she was actually going to Marshall's room to see Ted, not Marshall. Is that what you're referring to?  I don't know if anyone else noticed, but lily was wearing the goth lipstick while knocking on the other doors and when she comes to Marshall, woosh. No lipstick. Are you sure that's true? I'm not questioning your observations skills, but that is a really basic error. Although it proves my thought that the show just seems tired. It that is true, then it is just lazy.  I've done a quick check and, yeah, it's correct. She's wearing lipstick while checking the other doors, but not when she comes to Marshall. By the way, I think they've reused the old scene of her appearing at Marshall's door while all the others were obviously filmed for the new episode.  Are you sure that's true? I'm not questioning your observations skills, but that is a really basic error. Although it proves my thought that the show just seems tired. It that is true, then it is just lazy.  [Proof](http://imgur.com/a/0R1Uk)\n  On the subject, I can't find the discussion post... where is it? go to the subreddit home page, click on submit a post in the top right hand corner, and then click text instead of url Oh haha no that's not what I meant, I meant the post that is put up after every episode to discuss it. I found it though. could you post the link here, I cant find it    I enjoyed the Canadian references, so it was good fun for me.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/181aix/its_not_just_one_thing_exactly_that_i_can_put_my/"
  }, {
    "id" : 46,
    "title" : "Any guesses on how season 9 story will be told?",
    "snippet" : "Curious to as what everyone else thinks. I for one cant see a way of telling the story differently without completely changing the dynamics of the show. \n\nI would like the writers to do things other then the obviously easy way out,where the mother is telling her side of the story. If the show turns in to How I met your Father, it would be disappointing. Maybe use someone that has always been \"around\". Like when they green screened Mark the bouncer into various scenes. Seeing the group from the view of someone completely outside the group will be pretty interesting. Carl the bartender would be perfect. I mean his been there from day one. I'm guessing Teds gang, in Carls eyes is pretty messed up. \n\n  Maybe through the eyes of ranjit? Hes seen some of their best/most random moments, and has been there from the start too Maybe through the eyes of ranjit? Hes seen some of their best/most random moments, and has been there from the start too  Maybe it will be told from the mother's point of view, telling her story leading up to meeting ted.      My guess: Most of the 9th season will be like 24, a real time narration of the wedding day, perhaps from different points of view (as in the beekeeper episode).  Not a guess but more of a hope. I hope we find everything out at the end.of this season, and next season is in the present (2030) and we see how theirs lives have ended up Yes I thought of the same thing and end the series with the Daughter looking across a crowded room with the Mosby smile.\n\n  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/180d5u/any_guesses_on_how_season_9_story_will_be_told/"
  }, {
    "id" : 47,
    "title" : "Lethbridge...maple dip",
    "snippet" : "  America, Kripsy Kreme New Jersey, Dunkin' Donuts. Pennsylvania, Fausnaught. is it just me, or are these not donuts, but donut establishments? Krispy Kreme is a doughnut style as well as establishment. There's nothing like a good Krispy Kreme. I swear they're the gods of donuts.  Have you *had* Timbits? Those are the greatest inventions to donutkind. is it just me, or are these not donuts, but donut establishments? The Dunkin Donut was originally a doughnut that you were to dip into your coffee...there was even a \"handle\" attached to it.\n\nSadly, the closest you're going to get now is an old fashioned :(  I was trying to figure out where you were sitting in the Uni...then I realized that is creepy and could easily be misconstrued as a dahmer...sorry :( aha good catch...it's in the cur lab btw oh right! i see that now. it was annoying me that i couldn't figure it out :P  Lethbridge Redditor? yes sir/madam  Lol its sir, thats awesome!  What Tim Hortons was that at. the tims in the uni       There are 399 Tim Horton's in the United States. 600 locations in the US.\n3000 in Canada.\nThat's 2400 not enough eh?\nWhat's that aboot?        Dallas, Donut Stop  \n\nHowever, I sure want to visit Canada, just to try out a Tim Horton's. (only an American would admit that he/she wants to travel to another country, just to try a donut.) ",
    "url" : "http://i.imgur.com/aZxkN3t.jpg"
  }, {
    "id" : 48,
    "title" : "[SPOILERS] Barney&amp;Robin [/SPOILERS] yes, manly tears were shed",
    "snippet" : "  would have been much better if it weren't Nickelback   would have been much better if it weren't Nickelback    ",
    "url" : "http://www.youtube.com/watch?v=GDwcjtPDeyo"
  }, {
    "id" : 49,
    "title" : "Apparently the people of youtube don't like it when you quote Randy",
    "snippet" : "  Man, djtimwright really Britta'd that one. Are people using Britta to mean \"make a small mistake\"? DUH-doy! DUH-doy! Cool. Cool Cool Cool. Man, djtimwright really Britta'd that one.  what youtube video is that from? lets vote him/her up to top comment https://www.youtube.com/watch?v=SQbDg1LtnAY https://www.youtube.com/watch?v=SQbDg1LtnAY I don't know how you did it since you're not the OP but good job. i was gonna make an upvoting obama for such a random situation but then laziness happened so... fuck it have an upvote. Probably looked up one of their profiles in the right time frame what youtube video is that from? lets vote him/her up to top comment   Most likely, no one got the reference and just thought they messed up Barney's quote. thatsthejoke.jpg    I've done a few HIMYM references on other subreddits...they all fell flat.   That was lead and Jerry. - Young Barney Since small Barney and Jerry were talking about Led Zeppelin, I thought he said \"Led and Jerry\", which is a pretty good joke if it was on purpose. It was on purpose. It's a scripted TV show. It's on purpose. I realize that, but was small Barney scripted to actually say \"Led and Jerry\" or just mess up \"legendary\"? That's the question... It was scripted as \"Led and Jerry.\"  It was scripted. Since small Barney and Jerry were talking about Led Zeppelin, I thought he said \"Led and Jerry\", which is a pretty good joke if it was on purpose.   You are the assistant to the under secretary of only ok.        who else though the 1st comment \"how I banged every girl before ur mother\" was the funniest part of the post lol /r/im14andthisisfunny oh man, that's real.",
    "url" : "http://i.imgur.com/U7qO86V.png"
  } ],
  "processing-time-source" : 83,
  "processing-result.title" : "himym5_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/himym5_reddit.xml"
  }
}