{
  "processing-time-total" : 1227,
  "clusters" : [ {
    "id" : 0,
    "size" : 10,
    "score" : 52.19162787865583,
    "phrases" : [ "Ted and Robin" ],
    "documents" : [ 7, 13, 16, 17, 22, 27, 30, 41, 47, 48 ],
    "attributes" : {
      "score" : 52.19162787865583
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 77.71517000413552,
    "phrases" : [ "Robin's Wedding" ],
    "documents" : [ 7, 13, 14, 17, 27, 41 ],
    "attributes" : {
      "score" : 77.71517000413552
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 66.83790598096878,
    "phrases" : [ "Waiting for Season" ],
    "documents" : [ 3, 13, 22, 27, 38, 45 ],
    "attributes" : {
      "score" : 66.83790598096878
    }
  }, {
    "id" : 3,
    "size" : 4,
    "score" : 68.1730797093716,
    "phrases" : [ "Favorite" ],
    "documents" : [ 30, 35, 37, 47 ],
    "attributes" : {
      "score" : 68.1730797093716
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 83.56638881251028,
    "phrases" : [ "Love of his Life" ],
    "documents" : [ 7, 13, 41, 46 ],
    "attributes" : {
      "score" : 83.56638881251028
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 97.45026157525857,
    "phrases" : [ "Meet the Mother" ],
    "documents" : [ 27, 41, 45, 48 ],
    "attributes" : {
      "score" : 97.45026157525857
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 35.84096996545172,
    "phrases" : [ "Phone" ],
    "documents" : [ 13, 19, 31, 42 ],
    "attributes" : {
      "score" : 35.84096996545172
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 91.8789339003525,
    "phrases" : [ "Sure how I Feel with Ted" ],
    "documents" : [ 2, 13, 27, 48 ],
    "attributes" : {
      "score" : 91.8789339003525
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 37.31787728888426,
    "phrases" : [ "Month in between these Times" ],
    "documents" : [ 3, 7, 26 ],
    "attributes" : {
      "score" : 37.31787728888426
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 33.56051408195615,
    "phrases" : [ "Moved" ],
    "documents" : [ 13, 17, 31 ],
    "attributes" : {
      "score" : 33.56051408195615
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 53.80528153601229,
    "phrases" : [ "Nice Guy" ],
    "documents" : [ 13, 27, 31 ],
    "attributes" : {
      "score" : 53.80528153601229
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 58.29908264304291,
    "phrases" : [ "Profile" ],
    "documents" : [ 4, 29, 42 ],
    "attributes" : {
      "score" : 58.29908264304291
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 54.14248576973464,
    "phrases" : [ "Reminded" ],
    "documents" : [ 28, 41, 46 ],
    "attributes" : {
      "score" : 54.14248576973464
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 55.63605056755167,
    "phrases" : [ "Weekend" ],
    "documents" : [ 9, 10, 22 ],
    "attributes" : {
      "score" : 55.63605056755167
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 47.700554640048175,
    "phrases" : [ "Years" ],
    "documents" : [ 7, 13, 36 ],
    "attributes" : {
      "score" : 47.700554640048175
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 38.484678881754455,
    "phrases" : [ "Apart" ],
    "documents" : [ 0, 13 ],
    "attributes" : {
      "score" : 38.484678881754455
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 37.24857075833563,
    "phrases" : [ "Kyle" ],
    "documents" : [ 8, 31 ],
    "attributes" : {
      "score" : 37.24857075833563
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 54.18558330128427,
    "phrases" : [ "Slap" ],
    "documents" : [ 33, 44 ],
    "attributes" : {
      "score" : 54.18558330128427
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 26.65452680193283,
    "phrases" : [ "Video" ],
    "documents" : [ 5, 26 ],
    "attributes" : {
      "score" : 26.65452680193283
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 56.93625692729836,
    "phrases" : [ "Wore" ],
    "documents" : [ 1, 39 ],
    "attributes" : {
      "score" : 56.93625692729836
    }
  }, {
    "id" : 20,
    "size" : 15,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 6, 11, 12, 15, 18, 20, 21, 23, 24, 25, 32, 34, 40, 43, 49 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1148,
  "documents" : [ {
    "id" : 0,
    "title" : "Fact: It's always 4:20 in Marshall&amp;Lily's Apartment!",
    "snippet" : "  That looks more like 12:15 if you ask me...    ",
    "url" : "http://i.imgur.com/6cZK1IR.jpg"
  }, {
    "id" : 1,
    "title" : "What's the best line in the show?",
    "snippet" : "  Maybe I don't wanna be saved the trouble. Maybe I want the trouble. I haven't wanted the trouble in a long time, but with you, the trouble doesn't seem so troubling.             \"Remember that time in the future when we say, 'remember when Marshall wore a night gown?' THIS IS THAT TIME!\" ~Barney Stintson    \"The great moments of your life won’t necessarily be the things you do; they’ll also be the things that happen to you. Now, I’m not saying you can’t take action to affect the outcome of your life, you have to take action, and you will. But never forget that on any day, you can step out the front door and your whole life can change forever. You see, the universe has a plan, and that plan is always in motion. A butterfly flaps its wings, and it starts to rain. It’s a scary thought but it’s also kind of wonderful. All these little parts of the machine constantly working, making sure that you end up exactly where you’re supposed to be, exactly when you’re supposed to be there. The right place at the right time.\"         Your a sturdy cheesebearing cracker!               ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/192xy1/whats_the_best_line_in_the_show/"
  }, {
    "id" : 2,
    "title" : "Ahhhh just one more season.",
    "snippet" : "  What happened to that old man's head? First thing I noticed! What happened to that old man's head?  I like Ted with beard :) I hate Ted with a beard :( I'm not sure how I feel with Ted with a beard. :-| Why does he grow it anyway :/ Because beards are cool! Why does he grow it anyway :/ Why does he grow it anyway :/ http://tvtropes.org/pmwiki/pmwiki.php/Main/GrowingTheBeard\n\nthat's why I'm not sure how I feel with Ted with a beard. :-| I hate Ted with a beard :( I like it, it shows that he has matured and is ready to settle down.    Is it just the camera angle or is she an extremely short individual? Is it just the camera angle or is she an extremely short individual? Yeah, I think it's the fact that everyone else is on the stairs. \n\nBut what about the priest? Is he made out of cardboard?      ",
    "url" : "http://imgur.com/3lggJfD"
  }, {
    "id" : 3,
    "title" : "What was Barney's grand total?",
    "snippet" : "I know we didn't get to see every girl Barney slept with, but he mentioned his number more than a few times on the show. The one I remember that was the highest was 286, but did he mention a number higher than that? Also, do you think that Robin will ask how many people he's slept with on screen? It may seem weird, but I really want to know how many girls the Barnacle tapped before he got tied down.   The highest number actually mentioned was 283, in \"The Perfect Cocktail\" which was near the end of season 6. About 6 months earlier it was 237 (I think), which would mean 46 girls in 6 months, or roughly 7-8 per month. Since then he's dated Nora for a while, Quinn for a few months, and Robin since December. I estimate that given a constant hookup rate of 7 per month in between these times, Barney has slept with (wait for it) ~320 women. The highest number actually mentioned was 283, in \"The Perfect Cocktail\" which was near the end of season 6. About 6 months earlier it was 237 (I think), which would mean 46 girls in 6 months, or roughly 7-8 per month. Since then he's dated Nora for a while, Quinn for a few months, and Robin since December. I estimate that given a constant hookup rate of 7 per month in between these times, Barney has slept with (wait for it) ~320 women. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/192ylh/what_was_barneys_grand_total/"
  }, {
    "id" : 4,
    "title" : "A strip club in my town is having laser tag...",
    "snippet" : "  Why would you like a strip club on Facebook ? I'm a burlesque dancer.  My performer profile is friends with all of the different bars and clubs in town. I can assure you that my \"real life\" profile does not have it liked.  I'm a burlesque dancer.  My performer profile is friends with all of the different bars and clubs in town. I can assure you that my \"real life\" profile does not have it liked.  Random question; how do you become a burlesque dancer?   IS THIS IN FORT WAYNE, INDIANA?  ",
    "url" : "http://imgur.com/CEMssc9.png"
  }, {
    "id" : 5,
    "title" : "Someone on YouTube's comments pointed this out: Screenshot of P.S. I Love You video",
    "snippet" : "  Hmm I just checked out the video and I definitely didnt see this.. I had to rewind a bit but it looks like it flashes really fast around 1:30 right after \"angst\" on the chalkboard. yep, play to around 1:29 and use the arrow keys to progress frame by frame. yep, play to around 1:29 and use the arrow keys to progress frame by frame.  I just love how this show keeps amazing me with their little puns.\n puns? I believe he means the word play of making you think P.S is like \"P.S\" but it actually means Paul Schaffer. I believe he means the word play of making you think P.S is like \"P.S\" but it actually means Paul Schaffer.  [Link!](http://youtu.be/wJ-pEeRDv90?t=1m25s) [Link!](http://youtu.be/wJ-pEeRDv90?t=1m25s)  ",
    "url" : "http://i.imgur.com/hEMlcZX.png"
  }, {
    "id" : 6,
    "title" : "I love this Episode",
    "snippet" : "  I love Katy perry ...'s boobs. I love Katy perry I am also in love with Katy Perry  ",
    "url" : "http://imgur.com/JOtseyF"
  }, {
    "id" : 7,
    "title" : "Ted describing his wedding in Season 1, Episode 1",
    "snippet" : "  People will dance! Im not going to worry about it! (or 'Ted' out about it) People will dance!  How does Carl land a Lebanese girl?  Classic Schmosby  Isn't this because he wants Robin, so he doesn't want to be their marriage like the marriage he always had in mind? So that's why he's saying DJ. Because if he would marry Robin, he would hire a band.\n\nEdit: Ok, my comment wasn't fully clear to everybody:\nTed always wants a band on his wedding. Not a DJ. But in the episode 'band or dj', Robin, the (almost) love of his life and Barney are getting married, and having a band was part of his idea of a perfect wedding. He doesn't want the love of his life having that part on her wedding, when he's not the one marrying her. So that's why he wants a DJ instead of a band.\nI'm also sure that he'll have a band on his wedding. Isn't this because he wants Robin, so he doesn't want to be their marriage like the marriage he always had in mind? So that's why he's saying DJ. Because if he would marry Robin, he would hire a band.\n\nEdit: Ok, my comment wasn't fully clear to everybody:\nTed always wants a band on his wedding. Not a DJ. But in the episode 'band or dj', Robin, the (almost) love of his life and Barney are getting married, and having a band was part of his idea of a perfect wedding. He doesn't want the love of his life having that part on her wedding, when he's not the one marrying her. So that's why he wants a DJ instead of a band.\nI'm also sure that he'll have a band on his wedding. No this is before he met Robin. I know. But I mean the 'band or DJ' episode. Ya I think Ted even describes this word for word at the end of the episode doesn't he? Not sure about that. I don't have a good memory... Doesn't have good memory for episode like a month ago. Can remember words from the beginning of the first episode from eight years ago. Maybe you should check the link of this post.   [Posting really is about timing](http://www.reddit.com/r/HIMYM/comments/17dttc/after_all_the_fuss_he_made_about_getting_a_dj_for/) [Posting really is about timing](http://www.reddit.com/r/HIMYM/comments/17dttc/after_all_the_fuss_he_made_about_getting_a_dj_for/)    [deleted]  I love these writers! The only thing thats funny about that is he was so pro-band for Barney and Robin's wedding.  I thought he wanted a dj for Barney and Robins wedding?  I thought he wanted a dj for Barney and Robins wedding?  He was pro dj and lily booked the band for robin and barney wedding  Lawyered He was pro dj and lily booked the band for robin and barney wedding  I thought he wanted a dj for Barney and Robins wedding? ",
    "url" : "http://i.imgur.com/UtD6UsY.png"
  }, {
    "id" : 8,
    "title" : "Happy 54th Birthday to Kyle MacLachlan! (aka the Captain)",
    "snippet" : "  ",
    "url" : "http://mentalfloss.com/article/49043/late-movies-happy-birthday-kyle-maclachlan"
  }, {
    "id" : 9,
    "title" : "How I Met Your Mother 8x18 Promo \"Weekend at Barney's\" (HD)",
    "url" : "http://www.youtube.com/watch?v=tiY2hBZo2Ro"
  }, {
    "id" : 10,
    "title" : "Weekend at Barney's sneak peak",
    "snippet" : "    ",
    "url" : "http://www.cbs.com/shows/how_i_met_your_mother/video/oEaOQnv3ZI6zcaGDmgRKZnlaV4uSmRdz/how-i-met-your-mother-weekend-at-barney-s-sneak-peek-/"
  }, {
    "id" : 11,
    "title" : "Just re watched the last episode of season seven and still hate Teds storyline.... Spoilers",
    "snippet" : "Dunno if this has been posted or not before but Ted and Victoria riding off into the sunset was up there with one of the worst parts of himym I've ever seen.\n\nI know in the grand scheme of things it doesn't matter since she's not the mother but it ruined for me what was a great, great episode.  Its so not ted, me and my sister yelled at the tv with anger that the writers wrote ted into that Thank you!",
    "url" : "http://www.reddit.com/r/HIMYM/comments/191t0u/just_re_watched_the_last_episode_of_season_seven/"
  }, {
    "id" : 12,
    "title" : "All byourselves",
    "snippet" : "Was that Neil Patrick Harris and Cobie Smulders singing it? Because it sounded like NPH and I bet my brother that they sang it ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/192923/all_byourselves/"
  }, {
    "id" : 13,
    "title" : "Made my friend start watching HIMYM. She really hates Stella (screenshot)",
    "snippet" : "  I like Nicole White's attitude. I, too, appreciate Nicole White's candor. I especially approve of her description of Ted's vagina and it's emotions. its* [deleted] [deleted] [deleted] I like Nicole White's attitude.  \"Ted couldn't yell at her cause his vagina got scared.\"\n\n\nI want to give your friend the highest of fives. High six? Never mind... High six? Never mind... According to Article 9:\n\"Should a Bro lose a body part due to an accident or illness, his fellow Bros will not make lame jokes such as “Gimme three!” or “Wow, quitting your job like that really took a lot of ball”. It’s still a high five and that Bro still has a lot of balls… metaphorically speaking, of course.\"\n\nI'm sure this is the same with extra parts too...\n\n \"Ted couldn't yell at her cause his vagina got scared.\"\n\n\nI want to give your friend the highest of fives.  For me, it was really weird seing Sarah Chalke play a doctor on a different show than [Scrubs]. Even Stella seemed to fit into Elliot Reid character.  For me, it was really weird seing Sarah Chalke play a doctor on a different show than [Scrubs]. Even Stella seemed to fit into Elliot Reid character.  For me, it was really weird seing Sarah Chalke play a doctor on a different show than [Scrubs]. Even Stella seemed to fit into Elliot Reid character.  I like to think that after Mark (or David, if you believe the finale) died of an OD, Becky changed her name and tried to start over in med school. For me, it was really weird seing Sarah Chalke play a doctor on a different show than [Scrubs]. Even Stella seemed to fit into Elliot Reid character.  I hated her in Scrubs and hated her in HIMYM. Something about her makes me want to turn off the TV. I hated her in Scrubs and hated her in HIMYM. Something about her makes me want to turn off the TV. I hated her in Scrubs and hated her in HIMYM. Something about her makes me want to turn off the TV. Wasn't her biggest fan on HIMYM, but how the hell did you hate Elliot?   To be honest, I can't really think of a likeable girl Ted's dated on the show. Maybe it's because everything comes from his point of view, but apart from Robin, they certainly make it seem that it's always the other girl's fault for being crazy or needy or weird; it just takes a while for Ted to realize it. Ted can do no wrong in relationship terms...even with Victoria we eventually find out she's almost as guilty as he is (from his point of view at least). I liked the mother's roommate, Cindy or so. But that's actually a really good point you made, that most women Ted has dated seem to be unlikable because he tells the story and they are his exes. I liked season 1 Victoria  yeah...then they completely destroyed her character :/ No, Klaus did. Effing German.\n\nEdit: Fuzzy Nomenclature\n\nEdit 2: singular German She only fucked 1 German as far as we know. Given a normal dating cycle vs length of time in country, Imma haveta disagree. Except she started dating Klaus a day after breaking up with Ted (presumably whilst being faithful until then) then 6 years later she almost gets married to the same Klaus after moving back to NY. So unless she cheated on Ted or Klaus in germany (there is no suggestion she did sleep with anybody else) her total count is 1 German. No, Klaus did. Effing German.\n\nEdit: Fuzzy Nomenclature\n\nEdit 2: singular German I liked the mother's roommate, Cindy or so. But that's actually a really good point you made, that most women Ted has dated seem to be unlikable because he tells the story and they are his exes. We just had an episode about this where the gang confronts Ted and say, \"You know Ted, maybe it's you.\" Basically Ted is Taylor Swift. It's probably why he thinks he can pull off the red cowboy boots.\n\nedit: Also probably why he thought he could pull off dyeing his hair blonde But what would happen if Ted dated Taylor Swift? 0_o\n\nEDIT: HOLY CRAP I THINK TAYLOR IS THE MOTHER!  Maybe it's me, but how epic would it be if they actually had Taylor play the mother? But what would happen if Ted dated Taylor Swift? 0_o\n\nEDIT: HOLY CRAP I THINK TAYLOR IS THE MOTHER!  But what would happen if Ted dated Taylor Swift? 0_o\n\nEDIT: HOLY CRAP I THINK TAYLOR IS THE MOTHER!  It all makes sense now. I can't believe this hasn't been brought up before (or if it has, I've not seen it). Basically Ted is Taylor Swift. It's probably why he thinks he can pull off the red cowboy boots.\n\nedit: Also probably why he thought he could pull off dyeing his hair blonde I liked the mother's roommate, Cindy or so. But that's actually a really good point you made, that most women Ted has dated seem to be unlikable because he tells the story and they are his exes. I liked the mother's roommate, Cindy or so. But that's actually a really good point you made, that most women Ted has dated seem to be unlikable because he tells the story and they are his exes. To be honest, I can't really think of a likeable girl Ted's dated on the show. Maybe it's because everything comes from his point of view, but apart from Robin, they certainly make it seem that it's always the other girl's fault for being crazy or needy or weird; it just takes a while for Ted to realize it. Ted can do no wrong in relationship terms...even with Victoria we eventually find out she's almost as guilty as he is (from his point of view at least). To be honest, I can't really think of a likeable girl Ted's dated on the show. Maybe it's because everything comes from his point of view, but apart from Robin, they certainly make it seem that it's always the other girl's fault for being crazy or needy or weird; it just takes a while for Ted to realize it. Ted can do no wrong in relationship terms...even with Victoria we eventually find out she's almost as guilty as he is (from his point of view at least). I still freaking love Victoria. Victoria did to klaus what Stella did to Ted. She is just as bad  Klaus was doing the same thing to her. Clearly they weren't right for each other. True but it just means they are all at fault and Ted shouldn't have supported Victorias actions because he knew what being left at the altar did to him.  Ted fought her on it, though. He pushed the issue until she laid it out plainly for him, \"I left him for you.\" It was basically only on the fact that she would leave him a note that he decided to continue driving into the sunset. Victoria did to klaus what Stella did to Ted. She is just as bad  I still freaking love Victoria. We all do.   We all do.   I feel like the only person in this entire subreddit who actually hates Victoria. I hate her too. She has nothing memorable about her. She's boring and plain-looking too.  To be honest, I can't really think of a likeable girl Ted's dated on the show. Maybe it's because everything comes from his point of view, but apart from Robin, they certainly make it seem that it's always the other girl's fault for being crazy or needy or weird; it just takes a while for Ted to realize it. Ted can do no wrong in relationship terms...even with Victoria we eventually find out she's almost as guilty as he is (from his point of view at least). To be honest, I can't really think of a likeable girl Ted's dated on the show. Maybe it's because everything comes from his point of view, but apart from Robin, they certainly make it seem that it's always the other girl's fault for being crazy or needy or weird; it just takes a while for Ted to realize it. Ted can do no wrong in relationship terms...even with Victoria we eventually find out she's almost as guilty as he is (from his point of view at least). SPOILERS!!!! MUST BE CAUGHT UP TO READ.\n\n\n      I have to respectfully disagree. Remember the movie which was based off Ted and Stellas relationship?\nIn said movie during an episode I forget the name of, it is clear Ted was in the wrong.\nI also have to disagree about Robyn because she treated Ted the worst.\nIf you remember how Robyn acted in consideration to Ted you will realise how bad of a friend and worse of a partner she was.\nVictoria was in no way crazy but the new girl is.\nWhat about Mary the paralegal? She wasn't crazy either.\nLook Ted is a a good guy but he makes mistakes as well.(No tomorrow?)\nI despise Robyn and her daddy issues.\nGranted, the time was given to flesh out her character so we understand but it if wasn't then she would be the worst of Ted's girlfriends.\nShe: Tells Ted she doesn't want a relationship but gets into one anyway.\nSays she has no feelings but kisses him anyway then tells him to turn it off.\nThey break up and she goes to Argentina only to come back with a guy to parade around Ted's friends.(she sticks around because fuck ted right?)\nShe stays in his apartment post break up only to use him for sex KNOWING that Ted loves her.\nShe sleeps with Ted's apprentice because he has keys to TEDS bathroom.\nShe sits there and acts innocent to all of Ted's girlfriends but when it blows up she's all smiles and \"still friends right?\"\nTo top it off, EVERYTIME a relationship ends she cries to Ted and strings him along more. Every single time. \nI hate Robyn and how she has abused Ted.\nOh and she marries one of Ted's best friends. You do know that Robyn's only in one episode right? You do know that Robyn's only in one episode right? I don't know Robyn. I know Yobin, though. SPOILERS!!!! MUST BE CAUGHT UP TO READ.\n\n\n      I have to respectfully disagree. Remember the movie which was based off Ted and Stellas relationship?\nIn said movie during an episode I forget the name of, it is clear Ted was in the wrong.\nI also have to disagree about Robyn because she treated Ted the worst.\nIf you remember how Robyn acted in consideration to Ted you will realise how bad of a friend and worse of a partner she was.\nVictoria was in no way crazy but the new girl is.\nWhat about Mary the paralegal? She wasn't crazy either.\nLook Ted is a a good guy but he makes mistakes as well.(No tomorrow?)\nI despise Robyn and her daddy issues.\nGranted, the time was given to flesh out her character so we understand but it if wasn't then she would be the worst of Ted's girlfriends.\nShe: Tells Ted she doesn't want a relationship but gets into one anyway.\nSays she has no feelings but kisses him anyway then tells him to turn it off.\nThey break up and she goes to Argentina only to come back with a guy to parade around Ted's friends.(she sticks around because fuck ted right?)\nShe stays in his apartment post break up only to use him for sex KNOWING that Ted loves her.\nShe sleeps with Ted's apprentice because he has keys to TEDS bathroom.\nShe sits there and acts innocent to all of Ted's girlfriends but when it blows up she's all smiles and \"still friends right?\"\nTo top it off, EVERYTIME a relationship ends she cries to Ted and strings him along more. Every single time. \nI hate Robyn and how she has abused Ted.\nOh and she marries one of Ted's best friends. So, I'm not going to downvote your opinion, 'cause that's not what downvoting is for. However, to begin with, Stella knows what she did to Ted was horrible. That's made clear in the episode As Fast As She Can (S4E23). She also knew it was necessary. The movie Tony made was from a very slanted point of view, and pretty much warped every detail of the relationship, so I'm really not sure if I'm reading it correctly that you're using the movie as an accurate account of what happened.\n\nOn to Robin: You're looking at it from a very narrow point of view. As a guy who relates to Ted a lot, I tend to see all of the things he's doing wrong because I do the same things. If you're a romantic like Ted, then you'll have seen all of the cheesy movies where persistence pays off, and think that's how real life works, and well, it sort of does. Persistence in Ted's case paid off in getting Robin to like him, but he knew from the start that she didn't want the whole marriage and kids thing. They both just ignored it, and that was very evident in their break up (\"Where do you see yourself in 5 years?\"). When Ted kissed Robin (yes, Ted kissed her, not the other way), she told him beforehand that there was no off switch to his wanting to settle down, and he disagreed. When Robin comes back from Argentina with rebound guy, she tries to be nice about it with Ted, which ends up making Ted that much more jealous, but she did try. As far as sticking around, I think Lily had a lot more to do with that than Robin. She (Lily) even talks with Ted about how Robin is one of their friends now too, and she's going to be around after they break up. When two exes live together, the relapse sex is a risk you take. In that scenario, Ted broke it off because of Barney, not because of anything either of them felt at the time. I fail to see how the apprentice thing is relevant. Ted wasn't trying to date her at the time, and even if he was, just because a guy likes a girl that he has a history with doesn't mean that girl should just stop dating for him (I had to come to this realization on my own when I was younger and more annoying).\n\nFinally, I know it's not a big deal, but since there has been a character that is not Robin that was specifically named Robyn, I would suggest getting used to spelling it with an 'i' to prevent any misunderstandings. This post is perfectly clear, but others might not be. SPOILERS!!!! MUST BE CAUGHT UP TO READ.\n\n\n      I have to respectfully disagree. Remember the movie which was based off Ted and Stellas relationship?\nIn said movie during an episode I forget the name of, it is clear Ted was in the wrong.\nI also have to disagree about Robyn because she treated Ted the worst.\nIf you remember how Robyn acted in consideration to Ted you will realise how bad of a friend and worse of a partner she was.\nVictoria was in no way crazy but the new girl is.\nWhat about Mary the paralegal? She wasn't crazy either.\nLook Ted is a a good guy but he makes mistakes as well.(No tomorrow?)\nI despise Robyn and her daddy issues.\nGranted, the time was given to flesh out her character so we understand but it if wasn't then she would be the worst of Ted's girlfriends.\nShe: Tells Ted she doesn't want a relationship but gets into one anyway.\nSays she has no feelings but kisses him anyway then tells him to turn it off.\nThey break up and she goes to Argentina only to come back with a guy to parade around Ted's friends.(she sticks around because fuck ted right?)\nShe stays in his apartment post break up only to use him for sex KNOWING that Ted loves her.\nShe sleeps with Ted's apprentice because he has keys to TEDS bathroom.\nShe sits there and acts innocent to all of Ted's girlfriends but when it blows up she's all smiles and \"still friends right?\"\nTo top it off, EVERYTIME a relationship ends she cries to Ted and strings him along more. Every single time. \nI hate Robyn and how she has abused Ted.\nOh and she marries one of Ted's best friends. I agree Ted has a hand in most of the relationships going badly. But how was that with Stella? I can't remember any big conflicts where he was in the wrong. Maybe the whole New Jersey issue?  SPOILERS!!!! MUST BE CAUGHT UP TO READ.\n\n\n      I have to respectfully disagree. Remember the movie which was based off Ted and Stellas relationship?\nIn said movie during an episode I forget the name of, it is clear Ted was in the wrong.\nI also have to disagree about Robyn because she treated Ted the worst.\nIf you remember how Robyn acted in consideration to Ted you will realise how bad of a friend and worse of a partner she was.\nVictoria was in no way crazy but the new girl is.\nWhat about Mary the paralegal? She wasn't crazy either.\nLook Ted is a a good guy but he makes mistakes as well.(No tomorrow?)\nI despise Robyn and her daddy issues.\nGranted, the time was given to flesh out her character so we understand but it if wasn't then she would be the worst of Ted's girlfriends.\nShe: Tells Ted she doesn't want a relationship but gets into one anyway.\nSays she has no feelings but kisses him anyway then tells him to turn it off.\nThey break up and she goes to Argentina only to come back with a guy to parade around Ted's friends.(she sticks around because fuck ted right?)\nShe stays in his apartment post break up only to use him for sex KNOWING that Ted loves her.\nShe sleeps with Ted's apprentice because he has keys to TEDS bathroom.\nShe sits there and acts innocent to all of Ted's girlfriends but when it blows up she's all smiles and \"still friends right?\"\nTo top it off, EVERYTIME a relationship ends she cries to Ted and strings him along more. Every single time. \nI hate Robyn and how she has abused Ted.\nOh and she marries one of Ted's best friends. downvote me all you want because this is something I feel strong about.\nRobyn Sparkles is the worst. To be fair, all of the single characters have glass-shattering annoyances. But ummmm, I don't see how that relates to the discussion about Ted's girlfriends. They are (also) single? Did you not catch that reference? They are (also) single? To be honest, I can't really think of a likeable girl Ted's dated on the show. Maybe it's because everything comes from his point of view, but apart from Robin, they certainly make it seem that it's always the other girl's fault for being crazy or needy or weird; it just takes a while for Ted to realize it. Ted can do no wrong in relationship terms...even with Victoria we eventually find out she's almost as guilty as he is (from his point of view at least).  Sorry, but I can't hate Stella for this. Not when Ted provided the means for his own undoing.\n\nFrom the start, Ted was insistent that they date, even as Stella continually rejected him. He knew she had baggage: a daughter; hasn't slept with anyone since her ex-boyfriend, father of their daughter, five years prior; unwilling to commit to a relationship with Ted. The signs are all there, yet Ted kept pushing to make it happen. He was rushing the relationship, and even admitted not knowing her *that* well. To top it off, he invited her ex to their rushed wedding (a wedding, btw, which was originally someone else's that they took over).\n\nThis is Ted being Ted, trying to take shortcuts and desperately wanting to find that feeling of being with *the one*. He forced this idea so hard, I can't help but feel sorry for all parties involved. But ultimately, the pursuit of the relationship, the evolution of the relationship, and the demise of the relationship were almost all entirely thanks to Ted's impulsiveness. (Which is why we like the guy, right? I mean, not as much as we used to, but that's for another post) Please, you're pinning all that on Ted? She had to agree to go out with him and she chose to marry him. You don't make that decision lightly, so it sounds like she jumped into something she wasn't ready for and Ted got hurt.\n\nEdit: spelling Sorry, but I can't hate Stella for this. Not when Ted provided the means for his own undoing.\n\nFrom the start, Ted was insistent that they date, even as Stella continually rejected him. He knew she had baggage: a daughter; hasn't slept with anyone since her ex-boyfriend, father of their daughter, five years prior; unwilling to commit to a relationship with Ted. The signs are all there, yet Ted kept pushing to make it happen. He was rushing the relationship, and even admitted not knowing her *that* well. To top it off, he invited her ex to their rushed wedding (a wedding, btw, which was originally someone else's that they took over).\n\nThis is Ted being Ted, trying to take shortcuts and desperately wanting to find that feeling of being with *the one*. He forced this idea so hard, I can't help but feel sorry for all parties involved. But ultimately, the pursuit of the relationship, the evolution of the relationship, and the demise of the relationship were almost all entirely thanks to Ted's impulsiveness. (Which is why we like the guy, right? I mean, not as much as we used to, but that's for another post) Everything you mentioned took 2 people to do.  Yes things we're rushed but she never told Ted she didn't want to do any of those things. Except the original date, but that was played off as her being \"hard to get\". \n\nIt seems like your argument is that she was crazy and damaged so it was Ted's fault because he should have known she was?  Yes, Stella was at fault, but not solely at fault. Her biggest crime was accepting Ted's proposal (leaving him at the altar was bad, but getting married was an even worse idea...they were obviously meant to be with other people, so I applaud her \"bravery\" and remaining true to her feelings). Remember: *Ted's* proposal. She did not pursue the relationship, and was satisfied with just being friends from the very beginning.\n\nThere were many red flags, and no one forced Ted to do any of these things. I do not think she was crazy. She was a single mom who raised a nice daughter, and she had a successful dermatology practice which she commuted to several times a week. She seemed more well-adjusted than any main character outside of Marshall. Emotionally damaged? I won't go that far. Everyone understood that she had baggage though.  I agree she was damaged but not more so than anyone else on the show. Yes Ted is the one that pursued her. \n\nBut I disagree that just because Ted was the one that initiated and pursued her, means that it going wrong was his fault. One person asks, the other accepts (or not). Once you've committed then it's \"their\" engagement not Ted's engagement. \n\nI agree that for her, she probably had no choice. If she loved Barry? Then she couldn't marry Ted. But that doesn't absolve her of the fact that she is leaving Ted at the altar and breaking his heart. What she's doing is still hurting him, she just has a good reason (to her).  At the time, it was somewhat foolish for them to be engaged. It was even more foolish to move up the wedding date. And it was damn foolish to invite Tony, her ex and father of her child, to the wedding. \n\nWe don't really know what exactly went on through her mind at the time. If she was in love with her ex the whole time and she knew it, AND she decided to get married to Ted despite that, it's pretty awful to not tell him these things. I don't think she's evil or manipulative so I think she didn't realize what she truly wanted, until after seeing Tony. \n\nTry to put yourself her situation. You think you want to get married to this person. But this same person throws your ex (with whom you are not on speaking terms) back into your life, and now you realize that you would truly be happy with your ex. Do you get married anyway? It won't work. The lesser evil is preventing this huge mistake of a marriage from happening in the first place and breaking his heart now rather than later. I don't think she is a bad person for this. She's just...a person. I agree with everything you said. It was foolish for both of them to do what they did, but only in hindsight. In their situation, like you said, they didn't really know what they wanted. Heck she may not have even known she had feelings for her ex until faced with the situation of being at her wedding to marry someone else and having your ex there. \n\nShe did the right thing (from our pov), but like you said, it was the lesser of two big evils. In the end though, it was her that decided to leave Ted at the altar on their wedding day. Even if she couldn't marry Ted, she could have spared his feelings by calling off the wedding, talking to him, and maybe take some time to figure herself out. \n\nBut instead she runs away with her ex husband, leaving Ted wondering what's happened, with just a note trying to explain. Plus he had to face the guests alone, and basically clean up the mess. \n\nOf course all this makes good tv, so there's that, but you have to admit, the way she did what she had to do was pretty dickish.  I would have rather her leave Ted at the alter than he have a shitty first marriage. What I am saying and I think what Ted was saying, it turned out for the best.  I couldn't hate Stella easily because I like Elliot to much.     Hint: Black out her last name. Or white it out.  Or perhaps purple it out. The world is your oyster. Way to kill a joke. I thought it was amusing. Hint: Black out her last name. It's not her real name. It's a joke in my phone. I have a white friend named Nicole and a black friend named Nicole so this is how Nicole (the white one) but her name into my contacts It's not her real name. It's a joke in my phone. I have a white friend named Nicole and a black friend named Nicole so this is how Nicole (the white one) but her name into my contacts Very clever method   if your friends mad from that she/he's going to be pissed when she/he sees the episode the wedding bride That episode made me so annoyed. The writers asked me to suspend my disbelief just a bit too much. I just skip it now. It makes absolutely no sense. Stella's husband feels horrible for stealing her away from Ted, goes out of his way to make it better, Ted saves their relationship for them, and they make the The Wedding Bride?\n\nStella feels absolutely horrible for how she treated Ted and she's going to allow her husband to not only make the Wedding Bride, but sequels? \n\nEvery part of it is stupid and awful. I just skip it now. It makes absolutely no sense. Stella's husband feels horrible for stealing her away from Ted, goes out of his way to make it better, Ted saves their relationship for them, and they make the The Wedding Bride?\n\nStella feels absolutely horrible for how she treated Ted and she's going to allow her husband to not only make the Wedding Bride, but sequels? \n\nEvery part of it is stupid and awful. &gt; ....not only make The Wedding Bride, but sequels?\n\nWait, what? There's a sequel(s) to The Wedding Bride?\n\nI must have missed that episode... In [No Pressure](http://how-i-met-your-mother.wikia.com/wiki/No_Pressure) the Wedding Bride 3 is mentioned. Ahh, okay. I either haven't seen that episode, or I have and just missed that part. It's during the flash-forward to him telling the Mother that he loves her. It's on the movie theater marquee. I just skip it now. It makes absolutely no sense. Stella's husband feels horrible for stealing her away from Ted, goes out of his way to make it better, Ted saves their relationship for them, and they make the The Wedding Bride?\n\nStella feels absolutely horrible for how she treated Ted and she's going to allow her husband to not only make the Wedding Bride, but sequels? \n\nEvery part of it is stupid and awful. I just skip it now. It makes absolutely no sense. Stella's husband feels horrible for stealing her away from Ted, goes out of his way to make it better, Ted saves their relationship for them, and they make the The Wedding Bride?\n\nStella feels absolutely horrible for how she treated Ted and she's going to allow her husband to not only make the Wedding Bride, but sequels? \n\nEvery part of it is stupid and awful. I just skip it now. It makes absolutely no sense. Stella's husband feels horrible for stealing her away from Ted, goes out of his way to make it better, Ted saves their relationship for them, and they make the The Wedding Bride?\n\nStella feels absolutely horrible for how she treated Ted and she's going to allow her husband to not only make the Wedding Bride, but sequels? \n\nEvery part of it is stupid and awful. at first i thought so too, but then i realized that tony may very well have written a script in which everything happened the way it did for real, but the execs flanderized the character based on ted into even more of a jerk than he is for the sake of marketing. happens in hollywood all the time. Or the movie really wasn't nearly as slanted as Ted is making it out to be in the story.    Has she met Karen yet? Has she met Karen yet? Has she met Karen yet?                   Spoiler yo!  [deleted] Yes, a nearly five year old spoiler. [deleted] Their fault for stumbling into a subreddit about an 8-year-old show. Exactly why I'm not subscribed to /r/breakingbad or /r/Dexter. You deserve it if you're stupid enough to come here. you're* but yeah, I didn't sub to any game of thrones subreddits because I wanted to avoid spoilers. [deleted] [deleted] After about 2 years..... You don't get to call spoiler GUYS DUMBLEDORE DIES. Vader is Luke's father, all Dorothy had to do was tap her shoes together and Rhett Butler just fucking leaves",
    "url" : "http://i.imgur.com/JEVNBAL.png"
  }, {
    "id" : 14,
    "title" : "Song during Barney &amp; Robin's wedding (George Harrison - Let It Roll)",
    "snippet" : "   ",
    "url" : "https://www.youtube.com/watch?v=oYP0wlFbEq0"
  }, {
    "id" : 15,
    "title" : "Lily crying",
    "snippet" : "Made me realize once again she is the best actor in the show. Also \"I'm old\" ---&gt; heavy stuff   I think most of them are doing an excellent job in dramatic scenes. Neil and Cobie are lucky to have a lot of scenes where they can show their potential. Alyson and Jason just don't get enough of those, in my opinion, but they are great and make very powerful impression when given such material.   many people dont like her character. even though i disagree, theres no doubting her great acting skills  Anyone who says that Alyson Hannigan is the worst actor/actress couldn't have seen Buffy the Vampire Slayer. In my opinion, by the end of the show, she was outshining Sarah (Buffy) herself. As said so well by Tumblr, \"When Willow Rosenberg [Aly's character] cries, you cry too bitch\". If Lily's crying touches you, go watch Buffy. Seriously.    ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/191c0i/lily_crying/"
  }, {
    "id" : 16,
    "title" : "Immediately thought of Ted and Robin",
    "snippet" : " ",
    "url" : "http://i.crackedcdn.com/phpimages/photoshop/6/1/3/168613_slide.jpg?v=1"
  }, {
    "id" : 17,
    "title" : "I just rewatched Marshall and Lilys wedding. Future Ted said that Robin will move on to live in Greece, Japan, Argentina, and Russia. She did two them, does this say anything any get marriage with Barney, or they'll just move thereor a while?\n",
    "snippet" : "  Mmm... That title wording Mmm... That title wording The grammar. It gave me cancer. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/191owi/i_just_rewatched_marshall_and_lilys_wedding/"
  }, {
    "id" : 18,
    "title" : "As Someone Who Was Born and Raised in Connecticut...",
    "snippet" : "  ",
    "url" : "http://imgur.com/82y3sOl"
  }, {
    "id" : 19,
    "title" : "Phones are down at work.. I would be annoyed at the inconvenience, but this on the screen is keeping me laughing to myself..",
    "snippet" : "    ",
    "url" : "http://i.imgur.com/EXZcxrz.jpg"
  }, {
    "id" : 20,
    "title" : "Now all I need is a proper suit for them",
    "snippet" : "   You use those for a shirt, not a suit....sorry.  Please don't ever wear those with a suit. You'd look ridiculous.\n\nEven Barney wouldn't wear those with a suit. He loves suits too much to compromise their integrity with those cuff links.",
    "url" : "http://i.imgur.com/Qtx3DGU.jpg"
  }, {
    "id" : 21,
    "title" : "No wonder Robin looks so good in her clothes all the time. (Season 5, Episode 12)",
    "snippet" : "   ...i still feel like an idiot... ",
    "url" : "http://i.imgur.com/wAwOKXN.jpg"
  }, {
    "id" : 22,
    "title" : "Weekend at Barney's promo pics (imgur mirror)[SPOILERS]",
    "snippet" : "  This is going to be the best episode since the final page I agree. I think when they get ridiculous it gets great.  Also, hopefully it puts the whole \"Barney's Dead\" rumors to rest. I may be out of the loop here, but what \"Barney's dead\" rumor? A couple of theories stemmed from the last episode and the one previous.\n[spoiler] (/s \"In Bad Crazy, Robin wasn't wearing her ring.  In The Ashtray, Barney talks about being in places he obviously wasn't\") causing people to think that at some point he became a figment of their imagination.\n\nI think that some folks are over-thinking this, but what the heck, it adds a little intrigue. A couple of theories stemmed from the last episode and the one previous.\n[spoiler] (/s \"In Bad Crazy, Robin wasn't wearing her ring.  In The Ashtray, Barney talks about being in places he obviously wasn't\") causing people to think that at some point he became a figment of their imagination.\n\nI think that some folks are over-thinking this, but what the heck, it adds a little intrigue. It didn't stem from the past two episodes. People have been theorising 'Barney is dead' since the third season, where they showed they drawing of Robin that showed her alone with the kids.\n\nAlso the fact that the entire show, while ostensibly being about how he met their mother, is actually more 'how Barney influenced me'. A couple of theories stemmed from the last episode and the one previous.\n[spoiler] (/s \"In Bad Crazy, Robin wasn't wearing her ring.  In The Ashtray, Barney talks about being in places he obviously wasn't\") causing people to think that at some point he became a figment of their imagination.\n\nI think that some folks are over-thinking this, but what the heck, it adds a little intrigue. I agree. I think when they get ridiculous it gets great.  Also, hopefully it puts the whole \"Barney's Dead\" rumors to rest. I agree. I think when they get ridiculous it gets great.  Also, hopefully it puts the whole \"Barney's Dead\" rumors to rest. I agree. I think when they get ridiculous it gets great.  Also, hopefully it puts the whole \"Barney's Dead\" rumors to rest.  **The Playbook lives!**\n\nBut apparently not for long.  This discrepancy with *The Final Page* I'm going to chalk up to Barney made Ted a copy of the Playbook, but forgot about it. **The Playbook lives!**\n\nBut apparently not for long.  This discrepancy with *The Final Page* I'm going to chalk up to Barney made Ted a copy of the Playbook, but forgot about it. Or, Barney does magic tricks and never burned it to begin with.  I'm a little disappointed that The Playbook still exists because to me it takes a little away from The Final Page. I thought it was a significant step for Barney to destroy it; one of the things that made me believe Barney was ready. Now I know it's all a lie... :\\ Agreed. This is what pisses me off about the writers from time to time. We don't know that exact situation though. He could have destroyed his copy and this can be a copy he gave to Ted a long time ago. Yeah, but I am not feeling so hopeful right now. You're absolutely right though, it could be just a copy Ted has, but I am getting a little tired of the playbook joke. That's just me though. I agree they're dragging this a little bit too much, but I remember that, after the episode where Barney burned the playbook, people have noticed the copy they showed looked differently. Let's hope they've figured a good way to bring it back and it won't wipe out Barney's big decision.        I bet that Ted and that girl are going to break up at the end of this episode!!!! because we know that their relationship Literally Goes up in flames, and in that last picture she is holding (I think it's the playbook) with fireworks shoved inside.  So wait a minute!!!. Barney didn't destroy the playbook then!!! That sonofabitch!!!! So wait a minute!!!. Barney didn't destroy the playbook then!!! That sonofabitch!!!!       ",
    "url" : "http://imgur.com/a/bnPkp"
  }, {
    "id" : 23,
    "title" : "For Hallowe'en a friend of mine was Ted Mosby, as a hanging chad!",
    "snippet" : "    classic schmosby!  ",
    "url" : "http://i.imgur.com/TtW9YId.jpg"
  }, {
    "id" : 24,
    "title" : "So, I think I just found Lily on Reddit...",
    "snippet" : "   And myself. It's just an icky word.",
    "url" : "http://imgur.com/FRfFVqF"
  }, {
    "id" : 25,
    "title" : "You better have a Metrocard for this one because tonight is....",
    "url" : "http://imgur.com/sC7OgQb"
  }, {
    "id" : 26,
    "title" : "No makeup",
    "snippet" : "  She is quite clearly wearing make up For some girls, that's \"not wearing makeup\". Then for some girls, that is a blatant lie. Natural makeup and minimal makeup *are still makeup.* Then for some girls, that is a blatant lie. Natural makeup and minimal makeup *are still makeup.* She is quite clearly wearing make up She is quite clearly wearing make up She is quite clearly wearing make up  I have used this line on random girls and they *fucking love it*.\n\nHowever I start it out with saying something like \"I really like your makeup!\"  even when I can tell they aren't wearing any.\n\nGranted, I'm a girl so they're a little more trusting but *damn* it works.\n\nBut yeah, pull of the last line sounding just like Barney- \"Holy crap, you're BEAUTIFUL.\" works like a charm &gt;Granted, I'm a girl\n\nYeah, we got that from the \"telling when they're not wearing any\" part. No dude can do that. TIL I'm not a guy. You might think that you can see it, but you can't really. It's impossible. Girls does this thing where they add lots of makeup without looking any different, and it's impossible to see. I believe it might be to honor some sort of great Goddess or something.  [deleted] TIL I'm not a guy. I have used this line on random girls and they *fucking love it*.\n\nHowever I start it out with saying something like \"I really like your makeup!\"  even when I can tell they aren't wearing any.\n\nGranted, I'm a girl so they're a little more trusting but *damn* it works.\n\nBut yeah, pull of the last line sounding just like Barney- \"Holy crap, you're BEAUTIFUL.\" works like a charm &gt;Granted, I'm a girl\n\nGo on... [deleted] Just stop Stop what? What did he say?? Stop what? What did he say?? [–]Knoxie_89 [deleted] 4 hours ago (8|26)\nPics/videos for proof? Science? Both.\n\nunedditreddit is an add-on that lets you see deleted comments.  I have used this line on random girls and they *fucking love it*.\n\nHowever I start it out with saying something like \"I really like your makeup!\"  even when I can tell they aren't wearing any.\n\nGranted, I'm a girl so they're a little more trusting but *damn* it works.\n\nBut yeah, pull of the last line sounding just like Barney- \"Holy crap, you're BEAUTIFUL.\" works like a charm My friend once said she was thinking about cutting her hair, to which I responded, \"WHY?! Your hair is FUCKING RADIANT!\"  should we wait a month or so until we repost this once again or may i do it next week? Next week should be fine.  Nobody will notice. Fuck it, post it in few hours and nobody will notice. Damn, this subreddit turned into posting screenshots from the series. [deleted] Fuck it, post it in few hours and nobody will notice. Damn, this subreddit turned into posting screenshots from the series. should we wait a month or so until we repost this once again or may i do it next week? [deleted]  This might be a mistake but I think this is a repost of a repost of a repost of a repost. I went back over three months to make sure it wasn't a repost. I haven't found it yet. Sorry.  Finally found it. http://www.reddit.com/r/HIMYM/comments/14zs0v/holy_crap_youre_beautiful/\n^Last time it was posted This might be a mistake but I think this is a repost of a repost of a repost of a repost.  What episode is this from?    Her saying she isn't wearing makeup is like me saying I have a 10 inch cock. Its a TV show, *everyone* is wearing makeup.  Its required under the harsh lighting.  ",
    "url" : "http://imgur.com/EJoT5FG"
  }, {
    "id" : 27,
    "title" : "Writers of HIMYM, you've done it again. ",
    "snippet" : "So I'm re-watching the earlier seasons, and I'm on Season 1, Episode 13: Drumroll, Please. I'm at the part where Robin is in the bathroom crying because of Ted, and Victoria, standing outside Robin's stall, hands her [spoiler] (/s \"the bouquet of flowers under the stall. This tradition implies that the person whom the bouquet is handed to is next to be married.\") Now, following that line of thought, and barring anyone outside of the group, this foreshadows [spoiler] (/s \"Robin getting married with Barney. You might think that Lily and Marshall get married first, but they were already engaged\") \n\nThe writers didn't plan it, but it played out that way. At least that's what I think.   What a catch. Never ever would have even thought of that. Good job.  Robin's also the one who catches the bouquet at Marshall and Lily's wedding. Will The Mother catch the bouquet at Robin's wedding? I can see Robin with her canadian strength chucking it far enough it goes to the band You just blew my fucking mind. And really, that's the mind he uses most of the time. Now he's going to have to use the regular one. Think of all the fucking he might miss out on! Oh, the productivity! Robin's also the one who catches the bouquet at Marshall and Lily's wedding.  What if, through some zany series of plot twists and antics from the Gang, Ted catches the bouquet and it injures his hand? What if, through some zany series of plot twists and antics from the Gang, Ted catches the bouquet and it injures his hand? That would be nice. Every other theory I've seen so far is kind of sad and related to Ted still being in love with Robin, this one is far more optimistic and turned to his future. \n\nWhen do they usually do the bouquet stuff in American weddings, after the ceremony or after the reception (we've seen [spoiler] (/s \"his hand is ok at one point during the reception\"))?  They do the bouquet/garter toss during the reception.  At the ones I've been to it's pretty late in the reception, right before the bride and groom leave. Thanks, so the theory could tie up with what we've seen until now. It could.  Ted may tussle for the garter, and that's how he hurt his hand.  But that wouldn't exactly explain why he's at the train station alone.  Maybe he's so depressed that he *didn't* get the garter that he just decides to leave.  I don't think they say what time it is in that episode, but it's clear he left near the end of the reception due to the fact that the mother, who was playing in the band at the reception, shows up just moments later.  So I don't know that Ted left early or was asked to leave, like some people speculate (unless he was waiting for a train for hours, which doesn't seem likely, but I don't know much about train schedules).  Hmm... I guess we'll just have to wait.\n\nedit:  I agree that the other theories about Ted being in love with Robin are rather sad.  I truly hope he's well over her by then.  I want the last few episodes before the wedding, if not earlier, to prove that.  It's possible he could punch someone, but  if that's true it  would have to be someone being and enormous jackass, otherwise the mother (if she sees) may not like him after that and he *would* be asked to leave by Barney/Robin.  Ted says he's only ever been in one fight.  Maybe throwing one punch doesn't count at a fight if the other person doesn't fight back?  Maybe he punches a wall in frustration that he's still alone.  I just hope it's not something related to being in love with Robin still, especially since he meets the mother later that day and is supposedly in love with her right away, Yeah, I'm not sure anymore if we have to think he left earlier because of some kind of accident. The flashforward confirms he didn't leave until some time during the reception, and his hand is ok at that point. That kind of kills the theory of Ted bursting into tears while making the toast at the begining of the reception, confessing his feelings, cutting his hand and being asked to leave. You are correct about the punching theory. It's possible one punch doesn't count as a fight. If he punches someone who is acting crazy for some reason, chances are he wouldn't be asked to leave. Brad was openly pursuing Scooter at Lily and Marshall's wedding, and was walking around half naked, yet he wasn't asked to leave. \n\nI am begining to think that whatever happens to his hand is not directly related to him leaving. Maybe it's just another random thing that goes wrong that day. Maybe Ted will do his best to perform all his duties, and, at the end of the day, he'll just be confronted to his emotions, and will realize he's in the same place as when the story began. He could have plans for the night, but, feeling sad and alone, he could decide to go home by train.\n\nAs for the bouquet, I don't know if he could be upset because he didn't get it. I live in Europe and most people I know seem to think it's a tradition for one of the girls to catch it. I am pretty sure a guy here wouldn't try to get it, and he wouldn't be upset if he didn't (though it would still be considered symbolic if it happened). Of course, it could be different elsewhere, and knowing all the jokes they made about Ted's emotions, that kind of scenario wouldn't be so strange.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18zj7b/writers_of_himym_youve_done_it_again/"
  }, {
    "id" : 28,
    "title" : "Reminded me of Barney",
    "url" : "http://i.imgur.com/mCYO1AT.jpg"
  }, {
    "id" : 29,
    "title" : "What the fake online dating profile Barney made to trick Ted said \n",
    "snippet" : "   Amusing how it calls him by name twice   ",
    "url" : "http://imgur.com/a/oej9F"
  }, {
    "id" : 30,
    "title" : "Of the main 5 characters, who is your favorite characters and least favorites? ",
    "snippet" : "My list is Barney, Marshall, robin, Lilly, Ted.  I HATE Ted   Try 2nd favorite and least favorite next time. More than 83% HIMYM fan's favorite character is Barney.\n\n Try 2nd favorite and least favorite next time. More than 83% HIMYM fan's favorite character is Barney.\n\n Try 2nd favorite and least favorite next time. More than 83% HIMYM fan's favorite character is Barney.\n\n Did you know that 83% of barney's statistics have 83% in them    I like multi dimensional characters, and ones that have some kind of tension and inner struggles within them. Because of that, my favourite is Barney, and the second one should be Lily. Robin should be the third one, but I am kind of biased as, in my opinion, the writers don't seem to focus enough on the complexity of her character. Ted and Marshall come after that, not because I don't like them as characters (they've both great personalities), but because I relate less to their inner challanges.\n\nThat being said, I think that for a sitcom, all five of them are very deep and well written.   1 Swarls Barkley\n\n2 Big Fudge\n\n3 Lily pad\n\n4 tied Robin Sparkles and Ted Evelyn Mosby  1 Ted 2 Barney 3 Marshall 4 Lily 5 Robin\nTed is the only consistent character dedicated to one thing, I feel very relatable to him. Barney, because duh. Marshall's awesome just sort of bland sometimes. Lily is just kinda there, I hated her after leaving Marshall and how she meddles and does childish things. And hated Robin since Season 3, also where she started to become unattractive.             ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18zpoy/of_the_main_5_characters_who_is_your_favorite/"
  }, {
    "id" : 31,
    "title" : "Bad Luck Captain",
    "snippet" : "  I literally just put my hand over half of it 'nice guy...' then moved my hand covering the other half 'looks like he's gonna MURDER Ya!'\" I totally did too.. The best part is it works out so the text fits with the part of the face you can see. I tried making [something](http://cdn.memegenerator.net/instances/400x/35160680.jpg), but I realized there's already enough memes based on \"top half= awkward, intimidating, scary; bottom half= completely inocuous\". I literally just put my hand over half of it 'nice guy...' then moved my hand covering the other half 'looks like he's gonna MURDER Ya!'\" [I did a little messing around in paint to help show off the effect.](http://i.imgur.com/wboQJmv.jpg) Because using your hand is too mainstream.  https://www.youtube.com/watch?feature=player_detailpage&amp;v=KMy1zO8m8sM#t=21s I literally just put my hand over half of it 'nice guy...' then moved my hand covering the other half 'looks like he's gonna MURDER Ya!'\" I literally just put my hand over half of it 'nice guy...' then moved my hand covering the other half 'looks like he's gonna MURDER Ya!'\"  A few days before the episode aired, I turned to my gf and said, \"I miss the Captain.  He was a great character, acted superbly, and brought out Ted's fun sarcastic side.\"\n\nI am so glad he's back... without Zoe. What? But I like Zo - oh, no, wait, I just liked the actress in Once Upon A Time. House, too Only sometimes in House. Cameron could be annoying as well Only sometimes in House. Cameron could be annoying as well Only sometimes in House. Cameron could be annoying as well  A DOUBLE BARREL HARPOON!!! With a scope. No scope. Noscope 360 harpoon shot! \"420 blaze it faggot\" - The Captain  so did it come out that he actually didn't say what Lilly recalled about only being a teacher?  Was it another memory that was 'misremembered'?  I thought that was odd since he is so nice. Upvote because this is totally what happened and I didn't even realize it at the time. They didn't directly say that this was the case, but it makes total sense. Really? Maybe not in so many words, but Lily says she stole the ashtray because he said she was just a kindergarten teacher, so it seems like he did say it (else why would she have stolen something from him?) He probably did say it, but we were seeing it from her perspective, and it probably came off harsher to Lily than The Captain meant it to be. Really? Maybe not in so many words, but Lily says she stole the ashtray because he said she was just a kindergarten teacher, so it seems like he did say it (else why would she have stolen something from him?) Really? Maybe not in so many words, but Lily says she stole the ashtray because he said she was just a kindergarten teacher, so it seems like he did say it (else why would she have stolen something from him?)    The interesting fact is the complete inverse is also true. Made out to be a really nice guy; one of the biggest assholes on television. \n\nYes. **Ted.**\n\nHe's the definition of the self-proclaimed nice guy who's dismissive, judgemental, treats people (chiefly women) as commodities and generally acts like a mawkish tit but demands the universe should reward him. Because he's nice. His friendship group backs him up, so he must be.\n\nTed Mosby is the worst main character in sitcom history.  The interesting fact is the complete inverse is also true. Made out to be a really nice guy; one of the biggest assholes on television. \n\nYes. **Ted.**\n\nHe's the definition of the self-proclaimed nice guy who's dismissive, judgemental, treats people (chiefly women) as commodities and generally acts like a mawkish tit but demands the universe should reward him. Because he's nice. His friendship group backs him up, so he must be.\n\nTed Mosby is the worst main character in sitcom history.  The interesting fact is the complete inverse is also true. Made out to be a really nice guy; one of the biggest assholes on television. \n\nYes. **Ted.**\n\nHe's the definition of the self-proclaimed nice guy who's dismissive, judgemental, treats people (chiefly women) as commodities and generally acts like a mawkish tit but demands the universe should reward him. Because he's nice. His friendship group backs him up, so he must be.\n\nTed Mosby is the worst main character in sitcom history.   Except what he said to Lily! That wasn't nice  He's a rich bitch... he's had plenty of high-horse moments, but ultimately his good nature comes through... sort of. Well, to be fair in this instance he was only interested in making amends with Lily since she managed to pick a painting that increased a lot in value. I was really expecting him to apologize about what he said True, but at the same time, just moments after she left, he went and bought the painting based simply on the fact that she said she liked it... not TOO bad of a guy. That doesn't make him a nice guy at all! That means that he thought she was right, but still insulted her anyway. The definition of mean.  Except what he said to Lily! That wasn't nice  I don't think it came out as mean-mean, she was just a kindergarten teacher, but he followed her advice which means he trusted her enough to buy the painting. Yeah but even if he followed her advice, it was still a mean thing to say Read upthread. Since the whole episode was about misremembering the party, it could be that he didn't say it nearly as harshly as Lily remembered it. It could have been a passing comment which Lily interpreted to be much more mean-spirited. Considering that it never came up that Lily was a teacher, how would he even have known?  You could say that Zoe told him but that's an awful strange thing to remember and bring up at that time. Read upthread. Since the whole episode was about misremembering the party, it could be that he didn't say it nearly as harshly as Lily remembered it. It could have been a passing comment which Lily interpreted to be much more mean-spirited.  And he can still take enough time off from his boats to be the mayor of Portland.  And he can still take enough time off from his boats to be the mayor of Portland.   I've been answering the phone saying \"Ahoy!\" since I watched this weeks episode! I've been answering the phone saying \"Ahoy!\" since I watched this weeks episode!  Here is what the linked Quickmeme image says in case the site goes down or you can't reach it:\n\n&gt;Title: Bad Luck Captain\n\n&gt;* MADE OUT TO BE A HUGE ASSHOLE\n&gt;* ONE OF THE NICEST CHARACTERS ON SHOW\n\n&gt;^〘[Direct](http://i.qkme.me/3t2gk6.jpg)〙 ^〘[Background](http://imgur.com/k2ahO1E)〙 ^〘[Translate](http://translate.google.com/#auto||MADE+OUT+TO+BE+A+HUGE+ASSHOLE+-+ONE+OF+THE+NICEST+CHARACTERS+ON+SHOW)〙\n\n[**Why?**](http://www.reddit.com/r/qkme_transcriber/comments/o426k/faq_for_the_qkme_transcriber_bot/) ┊ [More Info](http://www.reddit.com/r/qkme_transcriber/) ┊ AMA: [Bot](http://www.reddit.com/r/self/comments/vxeak/hello_i_am_a_bot_who_posts_transcriptions_of/), [Human](http://www.reddit.com/r/InternetAMA/comments/12gog9/i_am_the_creator_of_qkme_transcriber_a_definitely/) Hey bro, how's your day going? Not bad, bro.     Just like guys named Kyle everywhere. I resent that Just like guys named Kyle everywhere. [Carlin reference](http://www.youtube.com/watch?v=PxqCGTkV5wg), right? Actually, from experience. \n\nI've known a *lot* of Kyles in my time, and nearly all of them are assholes. \n\nCouple of them are cool, though.    How did Agent Cooper get so old? ",
    "url" : "http://www.quickmeme.com/meme/3t2gk6/"
  }, {
    "id" : 32,
    "title" : "Season 8 Episode 18 Photos",
    "snippet" : " ",
    "url" : "http://www.cbs.com/shows/how_i_met_your_mother/photos/1000206/season-8-episode-18/35497/"
  }, {
    "id" : 33,
    "title" : "Slap Bet",
    "snippet" : "Am I just missing something entirely? I do not remember the 5th slap. Please help.   As far as I know:\n\nSlap 1: [S02E09](http://how-i-met-your-mother.wikia.com/wiki/Slap_Bet) (Marshall gets 5 slaps, uses 1) (4 left)\n\nSlap 2: [S02E16](http://how-i-met-your-mother.wikia.com/wiki/Stuff) (3 left)\n\nSlap 3: [S03E09](http://how-i-met-your-mother.wikia.com/wiki/Slapsgiving) (2 left)\n\nSlap 4: [S05E09](http://how-i-met-your-mother.wikia.com/wiki/Slapsgiving_2:_Revenge_of_the_Slap) (1 left)\n\nSlap 5 &amp; 6: [S07E09](http://how-i-met-your-mother.wikia.com/wiki/Disaster_Averted) (Marshall gains 3 slaps, uses 2) (2 left)\n\nSlap 7: [05-06-2013](http://www.theslapbetcountdown.com) (1 left after this episode unless it's a double-slap)\n\nSlap 8: To be determined.\n\nHow's that? :) Damn. \n\nThat's impressive.  As far as I know:\n\nSlap 1: [S02E09](http://how-i-met-your-mother.wikia.com/wiki/Slap_Bet) (Marshall gets 5 slaps, uses 1) (4 left)\n\nSlap 2: [S02E16](http://how-i-met-your-mother.wikia.com/wiki/Stuff) (3 left)\n\nSlap 3: [S03E09](http://how-i-met-your-mother.wikia.com/wiki/Slapsgiving) (2 left)\n\nSlap 4: [S05E09](http://how-i-met-your-mother.wikia.com/wiki/Slapsgiving_2:_Revenge_of_the_Slap) (1 left)\n\nSlap 5 &amp; 6: [S07E09](http://how-i-met-your-mother.wikia.com/wiki/Disaster_Averted) (Marshall gains 3 slaps, uses 2) (2 left)\n\nSlap 7: [05-06-2013](http://www.theslapbetcountdown.com) (1 left after this episode unless it's a double-slap)\n\nSlap 8: To be determined.\n\nHow's that? :) theory: what if he uses it on barney's wedding day.  Actually, there is a website leading to the next slap: theslapbetcountdown.com\n\nAccording to it, the next slap is supposed to be around early May, 2013.   A lot of people use the Slap countdown, but I have a major problem with it. It doesn't land on a time around an airing of a show. It's around 4:30 pm est which doesn't make sense.  Right, but the characters have been doing things at 2 a.m. in the show when it's clearly not 2 a.m. when the show is being aired.  \n  \nThe slap countdown applies to their world, not \"the real world.\" If the episode recounts things that happened on May xx, 2013, the slap happens at 4:30 p.m. on May xx, 2013, and we don't get to witness it until the show airs later that night (8 p.m.) on May xx, 2013. Right, but the characters have been doing things at 2 a.m. in the show when it's clearly not 2 a.m. when the show is being aired.  \n  \nThe slap countdown applies to their world, not \"the real world.\" If the episode recounts things that happened on May xx, 2013, the slap happens at 4:30 p.m. on May xx, 2013, and we don't get to witness it until the show airs later that night (8 p.m.) on May xx, 2013.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18yxlv/slap_bet/"
  }, {
    "id" : 34,
    "title" : "Good Guy Captain",
    "snippet" : "  Not really \"good guy,\" more like \"insanely rich guy who didn't even notice it was missing.\"    Wait, when did she steal his ashtray? what episode? Also what did he do to deserve her Aldrin Justice?",
    "url" : "http://www.quickmeme.com/meme/3t2seh/"
  }, {
    "id" : 35,
    "title" : "I found Robins favorite beer!",
    "snippet" : "  But she's allergic to pecans!  Where did you get this?  Sam Adams is one of my favorite breweries but I don't think I've ever seen this. ",
    "url" : "http://i.imgur.com/Akp62qW.jpg"
  }, {
    "id" : 36,
    "title" : "Marshall said we'd be 'carving up the turkey with old green' in 3-5 years time. It's been 4 years now, and he was correct....",
    "snippet" : "   Is this really a thing?",
    "url" : "http://25.media.tumblr.com/tumblr_lka8m1NWPs1qfy2kdo1_500.gif"
  }, {
    "id" : 37,
    "title" : "My favorite Marshall quote. ",
    "snippet" : "  What episode is this from? ",
    "url" : "http://24.media.tumblr.com/tumblr_mebzi2oMcV1r20f1fo1_400.gif"
  }, {
    "id" : 38,
    "title" : "I noticed that they changed the actor of Robin's father",
    "snippet" : "  After some research I found an [article ](http://blog.zap2it.com/frominsidethebox/2010/12/how-i-met-your-mother-eric-braeden-out-ray-wise-in-for-robins-dad.html)about that. After some research I found an [article ](http://blog.zap2it.com/frominsidethebox/2010/12/how-i-met-your-mother-eric-braeden-out-ray-wise-in-for-robins-dad.html)about that.   The new one seems a bit scarier, but I might be biased since I just finished watching [Twin Peaks](http://semiblog.opaquedream.com/wp-content/uploads/2008/03/Ray-Wise-Twin-Peaks-5.jpg) Ray Wise is fantastic.  If you've seen Reaper, you'll love him. Im still waiting for season 3... *crickets Im still waiting for season 3... *crickets The new one seems a bit scarier, but I might be biased since I just finished watching [Twin Peaks](http://semiblog.opaquedream.com/wp-content/uploads/2008/03/Ray-Wise-Twin-Peaks-5.jpg)   Change for the worse, but it was because the original actor got mad his part wasn't bigger and bailed.   Robin's new dad is also the devil from Reaper.      ",
    "url" : "http://i.imgur.com/6nlPAOv.jpg"
  }, {
    "id" : 39,
    "title" : "I had to do a presentation today, and this is what i wore for it. ",
    "snippet" : " ",
    "url" : "http://i.imgur.com/4YnEfJF.jpg?1"
  }, {
    "id" : 40,
    "title" : "Not sure if its been posted before, but that's an interesting newspaper article",
    "snippet" : "  It's been posted before. About a billion times. Sorry. I've been avoiding the sub until I caught up with the series.     No, it has never been posted here. You are the first person to ever see it. Congratulations.",
    "url" : "http://i.imgur.com/HQWgJrx.jpg"
  }, {
    "id" : 41,
    "title" : "Lily's becoming an Art Consultant ties up nicely with the story...",
    "snippet" : "In \"Girls Vs Suits\", Ted mentioned that the mother painted robots playing sports.  Given Lily's eye for art in unlikely places, I was wondering if that would play any role in the future.  \n\nLily was also the one who advocated for a band at Robin's wedding. Given that the mother plays bass in the wedding band, and is a painter as well, I'm guessing Lily is going to approve of her and not sabotage Ted's relationship like she did in the past.   This post reminded me of why i dislike Lily so much. Who repeatedly sabotages their friend's relationships? Couple that with the fact that she thinks she 'settled' for Marshall, abandons her friends on occasion, lies about credit card debt to her fiance when she got  engaged, meddles in other people's lives, is unable to keep a secret, and steals shit from people who are mean to her, I can't stand the grinch.\n\nI love that the writers created deeply flawed but likable, realistic, and relatable characters, but I don't think I'd be friends with Lily. I watch the show sometimes frustrated that fictional character Marshall didn't play the field more in the fictional HIMYM universe and meet a girl cooler than Lily. /endrant I've defended Lily many times before, but here we go again.\n\n&gt;Who repeatedly sabotages their friend's relationships?\n\nJust Ted's - and it's generally for the right reasons. She didn't sabotage his relationships with Victoria and Stella, two women that she saw as a good fit for them (and yes, she bet against him, but she didn't actively make the attempt - Ted made a mistake many of us might make). With Robin, she didn't intend to, and she had a very cogent point in trying to make them talk things out about the future and how it could lead to a much more bitter breakup than their clean one back in season two.\n\nShe learned from the fight that she and Ted had and swore off doing it, which showed personal growth. She faces a moral dilemma when it comes to Barney and Robin - she doesn't want to until it becomes glaringly obvious to her that there is seemingly no better alternative, only brought 'out of retirement' at Marshall and Ted's urging seeing their downward spiral.\n\n&gt;Couple that with the fact that she thinks she 'settled' for Marshall\n\nAfter Marshall badgers her into oblivion about it - and even then, her determining that she must be the 'settler' was shown to be false when she attacked Jenkins for kissing him, a pretty clear sign that their relationship dynamic isn't the one that Ted and Robin instilled in his mind. Logically you'd think she'd know otherwise, given the circumstances that led up to her and Marshall getting back together in the first place was because Lily was mad jealous about Chloe. It could just an ego thing that she'd put herself in that position given Marshall's obvious insecurity.\n\n&gt;abandons her friends on occasion\n\nYou mean when she left Marshall for San Francisco? It's harder to defend this, but for someone who had this idea about what they wanted to accomplish before settling down, that's a lot of gravity you can't just dismiss for very long. She freaked out. I can understand to a point. When she almost ditched Marshall for Spain, you have to admit that being that supportive really would push her to wit's end. It'd be better if she had just been honest in that regard, admittedly, but I think she thought she was between a rock and a hard place.\n\n&gt;lies about credit card debt to her fiance when she got engaged\n\nIt's not exactly uncommon to hide your problems from your significant other until you can't hide it any longer. When push came to shove, she wanted to take responsibility for her actions by trying to pay it down herself and trying to keep her name off of the mortgage. \n\n&gt;meddles in other people's lives\n\nWith good intent. You can't honestly claim to not meddle in the affairs of your friends' lives - we do it everyday just by talking about what everyone else is talking about concerning your little group or whatever.\n\n&gt;is unable to keep a secret\n\nAll gossipy stuff, nothing that would actively harm another's life.\n\n&gt;and steals shit from people who are mean to her\n\nYeah, this is another one of those flaws that are hard to defend, so I'll concede to this. \n\nMeh. I'd still be friends with her. Then again I tend to be attracted to and care more for crazy girls.\n\n\n\n\n\n This post reminded me of why i dislike Lily so much. Who repeatedly sabotages their friend's relationships? Couple that with the fact that she thinks she 'settled' for Marshall, abandons her friends on occasion, lies about credit card debt to her fiance when she got  engaged, meddles in other people's lives, is unable to keep a secret, and steals shit from people who are mean to her, I can't stand the grinch.\n\nI love that the writers created deeply flawed but likable, realistic, and relatable characters, but I don't think I'd be friends with Lily. I watch the show sometimes frustrated that fictional character Marshall didn't play the field more in the fictional HIMYM universe and meet a girl cooler than Lily. /endrant I hope that the creators didn't figure Lily being a Mom will just be all the growth for her. I sincerely hope there'll be more growth for her to be less manipulative and such. Perhaps that's why they brought back the \"Lily Justice\" thing. I'm hoping that, as she grows up, she'll realize she CAN'T do all the things you just ranted about, and will simply allow her friends to make the choices she thinks aren't all that great, but will support them because she cares for them.  This post reminded me of why i dislike Lily so much. Who repeatedly sabotages their friend's relationships? Couple that with the fact that she thinks she 'settled' for Marshall, abandons her friends on occasion, lies about credit card debt to her fiance when she got  engaged, meddles in other people's lives, is unable to keep a secret, and steals shit from people who are mean to her, I can't stand the grinch.\n\nI love that the writers created deeply flawed but likable, realistic, and relatable characters, but I don't think I'd be friends with Lily. I watch the show sometimes frustrated that fictional character Marshall didn't play the field more in the fictional HIMYM universe and meet a girl cooler than Lily. /endrant I get a little pissed when nobody calls out Lilly and Marshal when they play  the \"I'm morally superior\" card. Marshal is an idiot with no inherent morality and Lilly is just a bad person. Marshall's a lawyer. Meaning he has a huge sense of morality and he's very intelligent. &gt;a lawyer\n\n&gt;huge sense of morality \n\n&amp;#3232;\\_&amp;#3232;...Maybe personally, yes, but I doubt Marshall was employing his sense of morality while working for GNB as long as he did. Probably hated hearing himself on occasion. \n    It good that she got the job, but it doesn't seem too realistic that she would get a job like that. I d'unno, if I was the one that bought a painting like that at her behest and made $4 million off of it I'd certainly be calling her back to see what else she might have in mind, which is probably what The Captain intends to do. It'd be cool if they show here and there how she does in that regard. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18wjk3/lilys_becoming_an_art_consultant_ties_up_nicely/"
  }, {
    "id" : 42,
    "title" : "I feel like the Blitz",
    "snippet" : "   This is a thing?  You could just click on your own profile and hover over the \"redditor for ____\". I can't on my phone. I can't on my phone. [Link for the Lazy!]\n(http://www.redditcakeday.com/) [Link for the Lazy!]\n(http://www.redditcakeday.com/)     [same here bro](http://imgur.com/mPkSK90)\n\nHINT: There are only 28 days in February    ",
    "url" : "http://i.imgur.com/JMegGRs.png"
  }, {
    "id" : 43,
    "title" : "A Gentlemen's Agreement (How I Met Your Mother - 4x19)",
    "snippet" : "  ",
    "url" : "http://www.youtube.com/watch?v=tj4491K75oI"
  }, {
    "id" : 44,
    "title" : "Quick question about what barney said in last episode",
    "snippet" : "&gt;Wait a second\n\n&gt;No\n\n&gt;Unless\n\n&gt;Absolutely not\n\n&gt;However\n\n&gt;Forget it\n\n&gt;On the other hand\n\n&gt;....\n\nWhat was the last thing he said before slapping himself. I couldn't understand it clearly but loved the joke nonetheless.\n  http://amaliasmix.tumblr.com/post/43470763593/the-internal-struggles-of-barney-stinson-8x17 Funny how the subtitle doesn't have the last word I was wondering about.  Ixnay.     Icksnay\nPeople say it when they want others to not say/do something and they speak in pig latin.\nPig latin is where you take the first letter of a word and put it at the end, then at \"ay\"\n'Mother' for example is 'othermay'\nI have no idea what 'nicks' means, but it's quite common on American tv shows. Nix, actually. Put an end to; cancel: \"he nixed the deal just before it was to be signed\".  ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18ycya/quick_question_about_what_barney_said_in_last/"
  }, {
    "id" : 45,
    "title" : "Prediction for next season",
    "snippet" : "Bob Saget and an actress representing the older version of the mother (who Ted meets at the end of this season) will narrate together.  They'll tell the story to the kids about how after they met, it wasn't all smooth sailing and there were some \"things\" that happened during the courtship.   That would be a nice twist. Esp. if they did it before they introduced the mother in the show. It doesn't seem like a bold prediction since the producers basically said something to the effect of, \"If you're turning on the tv and HIMYM is on, there will be an obvious way to tell if the episode is or is not one from the final season.\" Wait...what?  I'm not \"predicting\" it. You are.  I'm just saying your idea would be a cool way to really toy around with the audience. Wait...what?  I wasn't saying you were predicting it.\n\nOne of the things I was hoping to learn from this thread:  Is it just assumed that we'll see the mother at the end of this season?  Or is it assumed that Ted will meet the mother?  Or do we know for sure either? Oops. Sorry. \n\nThere are many schools of thoughts on that matter. I think with the announcement of the new season, they are probably going to reveal the mother in the next season.  How, or when, is really up to the writers.  I don't want to be a debbie downer but I have read somewhere that they could do season 9 in flash backs Like \"kids I missed some things in 2006 or 2008 so let me tell you about that first\" they could do this without showing the mother.TBH I would hate it if  they done this possibly wouldn't even watch it .so my fingers are crossed I hope your theory comes true. I don't want to be a debbie downer but I have read somewhere that they could do season 9 in flash backs Like \"kids I missed some things in 2006 or 2008 so let me tell you about that first\" they could do this without showing the mother.TBH I would hate it if  they done this possibly wouldn't even watch it .so my fingers are crossed I hope your theory comes true.   I like this idea, except that in the past when they have shown future Ted, it has been Josh Radnor as the actor. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18whjt/prediction_for_next_season/"
  }, {
    "id" : 46,
    "title" : "Sometimes this is how I see Ted.",
    "snippet" : "  Ted is me, I am Ted. I should stop thinking that in public. Loves of my life around every corner.    What an astute observation that anybody who's watched a single episode of the show could've made. /s\n\nTed isn't ever afraid or nervous to talk to pretty girls like the guy in the comic. He's actually pretty confident and outgoing, just not as hyper-alpha as Barney. I found a comic, it reminded me of ted, and i wanted to share, sue me. I found a comic, it reminded me of ted, and i wanted to share, sue me.   The cat in the last picture is only out of place. Lily doesn't have a cat. And she also doesn't wear hats. And the goatee! Who would picture her with this goatee?",
    "url" : "http://imgur.com/NBMQi6f"
  }, {
    "id" : 47,
    "title" : "Platonic Friends",
    "snippet" : "  Repost of the most upvoted thing on the sub. Ahhh but who cares By god you're right. Here are the rest of the top 5 all time:\n\n[Number 2](http://i.imgur.com/mgl5t.jpg)\n\n[Number 3](http://i.imgur.com/UEwFf.jpg)\n\n[Number 4](http://cdn01.cdn.justjared.com/wp-content/uploads/2012/11/nph-mission/matt-bomer-neil-patrick-harris-thanksgiving-mission-help-01.jpg)\n\n[Number 5](http://i.imgur.com/YMI14.jpg)\n\nNow everyone who has read this comment section will know if these are reposts or not.\n\nNot to mention I've seen \"Marshall reciting pi\" reposted a few times already. Who would repost number 5? Are you really going to pretend to be someone else? I assume you're new here Who would repost number 5? Are you really going to pretend to be someone else? Hi, sorry, you must be new to Reddit. I'm german80, umm the lunchroom is over there. And the repost files are over there, and that's Jim! Ah jim, always with the cat pictures. Angry Atheist Neil, hi Neil, new guy, yep. Umm, Gamer Mike \"That's PC Gamer Mike!\" Ok Mike! And yeaaaah have fun with those points!  Hi, sorry, you must be new to Reddit. I'm german80, umm the lunchroom is over there. And the repost files are over there, and that's Jim! Ah jim, always with the cat pictures. Angry Atheist Neil, hi Neil, new guy, yep. Umm, Gamer Mike \"That's PC Gamer Mike!\" Ok Mike! And yeaaaah have fun with those points!  Who would repost number 5? Are you really going to pretend to be someone else? By god you're right. Here are the rest of the top 5 all time:\n\n[Number 2](http://i.imgur.com/mgl5t.jpg)\n\n[Number 3](http://i.imgur.com/UEwFf.jpg)\n\n[Number 4](http://cdn01.cdn.justjared.com/wp-content/uploads/2012/11/nph-mission/matt-bomer-neil-patrick-harris-thanksgiving-mission-help-01.jpg)\n\n[Number 5](http://i.imgur.com/YMI14.jpg)\n\nNow everyone who has read this comment section will know if these are reposts or not.\n\nNot to mention I've seen \"Marshall reciting pi\" reposted a few times already. By god you're right. Here are the rest of the top 5 all time:\n\n[Number 2](http://i.imgur.com/mgl5t.jpg)\n\n[Number 3](http://i.imgur.com/UEwFf.jpg)\n\n[Number 4](http://cdn01.cdn.justjared.com/wp-content/uploads/2012/11/nph-mission/matt-bomer-neil-patrick-harris-thanksgiving-mission-help-01.jpg)\n\n[Number 5](http://i.imgur.com/YMI14.jpg)\n\nNow everyone who has read this comment section will know if these are reposts or not.\n\nNot to mention I've seen \"Marshall reciting pi\" reposted a few times already.  There should be a rule to post season and episode number when posting stuff like this. There should be a rule to post season and episode number when posting stuff like this. There should be a rule to post season and episode number when posting stuff like this.    This is literally the top post on this sub. Seriously? Rabbit.  Ted broke up with his girlfriend because of his friendship with Robin, but will he do the same thing if that was Marshall, Lily or Barney?\n\nWell, he did that already. He broke up with Karen for Lily and Marshall and broke up with Zoey for Barney (and his career); beside that, he didn't go any further with Robin when he had chances to do that because he want Barney and Robin happy together.\n\nAnd everybody say Ted is full of himself ... &gt;he didn't go any further with Barney when he had chances to do that because he want Barney and Robin happy together\n\nI'm not up to date on the show - are you saying what I think you're saying? &gt;he didn't go any further with Barney when he had chances to do that because he want Barney and Robin happy together\n\nI'm not up to date on the show - are you saying what I think you're saying?    Season 7 Episode 17 in short, my favorite HIMYM episode because of sentimental reasons.  Have all of my upvotes!   God dammit OP.  I've been avoiding rewatching this series and catching up with the current season, because it's so long and I can't _not_ watch a TV show from start to finish.  And now I have to.  I hope you're happy. What are you complaining about. He's acting agitated for comic effect. What are you complaining about.",
    "url" : "http://imgur.com/cluDy0n.jpg"
  }, {
    "id" : 48,
    "title" : "In your opinion, what is the saddest moment in HIMYM history?",
    "snippet" : "  Definitely Marshall finding out about his dad. \"I'm not ready for this\".  Marshall's reaction was entirely off the cuff. He was not told what Lily would say to him in the scene and just rolled with it when it was given to him. If you listen closely you can actually hear him mutter \"Fuck\" under his breath. Marshall's reaction was entirely off the cuff. He was not told what Lily would say to him in the scene and just rolled with it when it was given to him. If you listen closely you can actually hear him mutter \"Fuck\" under his breath. Marshall's reaction was entirely off the cuff. He was not told what Lily would say to him in the scene and just rolled with it when it was given to him. If you listen closely you can actually hear him mutter \"Fuck\" under his breath. Marshall's reaction was entirely off the cuff. He was not told what Lily would say to him in the scene and just rolled with it when it was given to him. If you listen closely you can actually hear him mutter \"Fuck\" under his breath. When does he mutter that? I tried listening for it multiple times, but then I just got depressed. Definitely Marshall finding out about his dad. \"I'm not ready for this\".  I have to agree. With some daddy issues myself, I called him after I watched this episode. Hit right in the feels. Daddy issues...hot. Definitely Marshall finding out about his dad. \"I'm not ready for this\".  Definitely Marshall finding out about his dad. \"I'm not ready for this\".   That scene when Barney finds out Robin chose Kevin over himself. That single scene has made me slightly anti-Robin.  The ending of Tick, Tick, Tick when Barney is cleaning up the rose petals he had prepared on Robin's bed. The ending of Tick, Tick, Tick when Barney is cleaning up the rose petals he had prepared on Robin's bed.  Barney:  \"You're just some lame suburban                          dad.\"\n\nBarney's Dad:  \"And why does that make you so mad?\"\n\nBarney:  \"Because if you were going to be some lame suburban dad, then why couldn't you have been that for me?\"\n\nThese quotes really showed a whole different side of Barney.  In this episode, he is seen as more of a respectable character, who finally let's out his feelings.\"  \n\nAnother scene I liked was when Robin and Lily are on the roof, and she says she's not ready to be a mom, and sometimes she thinks of running away and never looking back.  There are several other scenes throughout the series that are really memorable.   One great thing about How I Met Your Mother is because it literally has everything you could want in a TV show.  It has comedy, romance, adventure, a hell of a mystery, dynamic characters who are both dependent of one another as well as independent.  A really good plot/story line, and of course, the occasional scene that really speaks to you.  \n\n *Ted and Lily are on the roof Sounds like the beginning to a bad joke. Barney:  \"You're just some lame suburban                          dad.\"\n\nBarney's Dad:  \"And why does that make you so mad?\"\n\nBarney:  \"Because if you were going to be some lame suburban dad, then why couldn't you have been that for me?\"\n\nThese quotes really showed a whole different side of Barney.  In this episode, he is seen as more of a respectable character, who finally let's out his feelings.\"  \n\nAnother scene I liked was when Robin and Lily are on the roof, and she says she's not ready to be a mom, and sometimes she thinks of running away and never looking back.  There are several other scenes throughout the series that are really memorable.   One great thing about How I Met Your Mother is because it literally has everything you could want in a TV show.  It has comedy, romance, adventure, a hell of a mystery, dynamic characters who are both dependent of one another as well as independent.  A really good plot/story line, and of course, the occasional scene that really speaks to you.  \n\n  Marshall and Lilly breaking up, more specifically Ted finding Marshall on the steps, good God could I just ball my eyes out at that scene for weeks!  Bawl* Ahh thank you, I'd never actually seen that word in writing, only ever heard it. No homework.. for awhile Marshall and Lilly breaking up, more specifically Ted finding Marshall on the steps, good God could I just ball my eyes out at that scene for weeks!   Robin saying that she can't have kids   \"My dads dead?\"  The episode where Robin finds out she's infertile.  The whole sequence in No Pressure when they played \"Shake it Out\" by Florence.\n\nAlso, Last Words, when they're all in the back listening to the pocket dial. Some of the best acting I've been on the show.      I swear I got something in my eye as soon as I started reading this thread I got something in both eyes  Barney: Because if you were going to be some lame suburban dad, why couldn't you have been that for me?!\n\nCan relate.  Easily Jurassic Bark.... Oh wait, wrong TV show... I'm gonna have to go with Marshall's dad dying.   Stella and Ted, i really liked them together:/ but hey it needed to happen for him to meet the mother. I just hope i like her:/              When Robin finds out she can't have kids. I know she didn't necessarily want kids, but any woman hearing that would feel like they got punched in the gut, I think. I think the saddest part about that episode is that it was really feel goody and you thought you were getting barney/robin story line and then boom crash it wasn't even real.      When Robin Sparkles becomes Robin Daggers...  SERIOUSLY?! How many times are we going to have this conversation, folks? This shit is getting real old real fast...  The opening scene of this crappy show. I was so sad when it started.  sure makes sense to go to the subreddit then.. It was in r/new. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18wbn0/in_your_opinion_what_is_the_saddest_moment_in/"
  }, {
    "id" : 49,
    "title" : "'Some questions weren't meant to be answered'",
    "snippet" : "I don't think we're going to find out Barney's job, last week he said, \"Some questions are just not meant to be answered [...] like where do I work?\", does this mean that we'll never find out?  I doubt they ever will tell. For the simple reason, that no answer they give will live up to the interesting mystery they've created.\n\nPersonally, I'm pretty sure he's a transponster.   ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18wtb5/some_questions_werent_meant_to_be_answered/"
  } ],
  "processing-time-source" : 79,
  "processing-result.title" : "himym1_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/himym1_reddit.xml"
  }
}