{
  "processing-time-total" : 1341,
  "clusters" : [ {
    "id" : 0,
    "size" : 11,
    "score" : 35.064646851870776,
    "phrases" : [ "Going through all the Seasons" ],
    "documents" : [ 14, 16, 18, 21, 22, 25, 32, 33, 34, 38, 49 ],
    "attributes" : {
      "score" : 35.064646851870776
    }
  }, {
    "id" : 1,
    "size" : 8,
    "score" : 38.148658192494544,
    "phrases" : [ "Lily and Marshall" ],
    "documents" : [ 0, 6, 13, 15, 18, 21, 22, 25 ],
    "attributes" : {
      "score" : 38.148658192494544
    }
  }, {
    "id" : 2,
    "size" : 7,
    "score" : 33.20252168802076,
    "phrases" : [ "Better" ],
    "documents" : [ 13, 16, 30, 34, 40, 44, 49 ],
    "attributes" : {
      "score" : 33.20252168802076
    }
  }, {
    "id" : 3,
    "size" : 7,
    "score" : 50.42802313412965,
    "phrases" : [ "Friends" ],
    "documents" : [ 3, 4, 22, 34, 36, 37, 38 ],
    "attributes" : {
      "score" : 50.42802313412965
    }
  }, {
    "id" : 4,
    "size" : 6,
    "score" : 40.19230979965378,
    "phrases" : [ "Far as to Say" ],
    "documents" : [ 18, 34, 38, 44, 48, 49 ],
    "attributes" : {
      "score" : 40.19230979965378
    }
  }, {
    "id" : 5,
    "size" : 6,
    "score" : 64.45626639352643,
    "phrases" : [ "Going back and Seeing" ],
    "documents" : [ 21, 25, 32, 34, 40, 49 ],
    "attributes" : {
      "score" : 64.45626639352643
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 39.01356254121218,
    "phrases" : [ "Saw" ],
    "documents" : [ 11, 23, 25, 37, 42 ],
    "attributes" : {
      "score" : 39.01356254121218
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 86.45748625622099,
    "phrases" : [ "Barney has been in a Total" ],
    "documents" : [ 21, 25, 34, 38 ],
    "attributes" : {
      "score" : 86.45748625622099
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 48.04877722326408,
    "phrases" : [ "Music" ],
    "documents" : [ 1, 17, 32 ],
    "attributes" : {
      "score" : 48.04877722326408
    }
  }, {
    "id" : 9,
    "size" : 2,
    "score" : 53.42566450093882,
    "phrases" : [ "Clock" ],
    "documents" : [ 15, 34 ],
    "attributes" : {
      "score" : 53.42566450093882
    }
  }, {
    "id" : 10,
    "size" : 2,
    "score" : 60.50792520398058,
    "phrases" : [ "Cut Robin out of his Life" ],
    "documents" : [ 34, 49 ],
    "attributes" : {
      "score" : 60.50792520398058
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 35.99578836544811,
    "phrases" : [ "Damn Near" ],
    "documents" : [ 3, 9 ],
    "attributes" : {
      "score" : 35.99578836544811
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 55.59861863962966,
    "phrases" : [ "Flirting" ],
    "documents" : [ 7, 10 ],
    "attributes" : {
      "score" : 55.59861863962966
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 48.53633522563335,
    "phrases" : [ "Good Song" ],
    "documents" : [ 19, 32 ],
    "attributes" : {
      "score" : 48.53633522563335
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 26.553784647382447,
    "phrases" : [ "Pilot" ],
    "documents" : [ 3, 13 ],
    "attributes" : {
      "score" : 26.553784647382447
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 39.709446260104734,
    "phrases" : [ "Pirating" ],
    "documents" : [ 10, 13 ],
    "attributes" : {
      "score" : 39.709446260104734
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 40.13784684210717,
    "phrases" : [ "Real Name" ],
    "documents" : [ 34, 38 ],
    "attributes" : {
      "score" : 40.13784684210717
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 66.14096688278396,
    "phrases" : [ "Skiing in Aspen" ],
    "documents" : [ 6, 48 ],
    "attributes" : {
      "score" : 66.14096688278396
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 37.87164617917063,
    "phrases" : [ "Student" ],
    "documents" : [ 21, 28 ],
    "attributes" : {
      "score" : 37.87164617917063
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 31.196229877723177,
    "phrases" : [ "Tag" ],
    "documents" : [ 2, 16 ],
    "attributes" : {
      "score" : 31.196229877723177
    }
  }, {
    "id" : 20,
    "size" : 16,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 5, 8, 12, 20, 24, 26, 27, 29, 31, 35, 39, 41, 43, 45, 46, 47 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1261,
  "documents" : [ {
    "id" : 0,
    "title" : "What do you think is the funniest moment of the show?",
    "snippet" : "I'm tired of focusing on the sad moments. Let's hear some funny ones!      In \"No Pressure\" when there is a flashback to lily, marshall, and barney driving to ted's wedding with stella, and barney is dancing in the back seat. That was the most I've ever laughed watching a show Wasn't he wearing headphones? Haha I wonder what he was listening to. In \"No Pressure\" when there is a flashback to lily, marshall, and barney driving to ted's wedding with stella, and barney is dancing in the back seat. That was the most I've ever laughed watching a show  [This scene kills me. Classic Marshall.](http://www.youtube.com/watch?v=H7XFT26IvkQ)   \"Hey Jessica, how's your beaver?!\"\n\nhttp://www.youtube.com/watch?v=L4pkpuQ_ziI\n\nEDIT: link   Marshall's singing in The Sweet Taste Of Liberty - \"Studying law...\" \"Wazzup Ted\"   It's not the funniest on repeat viewing, but the first time through, the delivery of the second slap at the end of \"Stuff\" had my rolling.  That was a running gag I never expected to turn up again, and then just out of nowhere- BAM!  Brilliantly delivered, and I wish the later episodes didn't ruin the slaps by having to give the backstory for them.          ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18wrrc/what_do_you_think_is_the_funniest_moment_of_the/"
  }, {
    "id" : 1,
    "title" : "Robin Daggers Stuck In My Head",
    "snippet" : "I watched the whole P.S I Love You Music Video on the HIMYM website yesterday, and ever since, that songs been stuck in my head.  Anyone else have this song stuck?   Even the robot says \"Move on!\" I'M TRYING",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18x1ky/robin_daggers_stuck_in_my_head/"
  }, {
    "id" : 2,
    "title" : "Look who has all of the lazer tag high scores... ",
    "snippet" : "  nice catch nice catch Who was it... I couldn't read it\n ",
    "url" : "http://imgur.com/00l7TWl"
  }, {
    "id" : 3,
    "title" : "I get 1 episode...",
    "snippet" : "So I have watched How I Met Your Mother from the beginning and loved every second, however my boyfriend has never seen one episode.  His challenge to me is to show him one episode to get him into the show, so my question to you all is what is the BEST episode that will be sure to get him hooked.  I can't wait to hear what you all have to say, thanks for helping!  The Pineapple incident!  I usually show my friends Slap Bet or Best Burger in New York Best Burger in NY was what reeled me in... I usually show my friends Slap Bet or Best Burger in New York   The Pilot..  The Pilot..  Yeah, when i watched individual episodes I couldn't get into it. When I started from the beginning I was hooked. A friend who I tried convincing to watch it started from the beginning and got hooked too      rabbit or duck.  The Pineapple Incident, I think it's their highest rated episode.   Pilot    \"Tick Tick Tick\"  Holy crap why would you show that to someone as their first episode? It spoils damn near everything and isn't even a spectacular episode.\n\nSome men just want to watch the world burn.             Bad Crazy. Bunch of funny noncontext jokes, I garuntee he'll laugh at the The Departed joke.         ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18wdtm/i_get_1_episode/"
  }, {
    "id" : 4,
    "title" : "Just realised this after making the mistake one too many times..",
    "snippet" : "  For me, the opposite happens. I went (and am kinda still going through) through a really long on and off LTR breakup, and watching HIMYM and Friends (although I've skipped over certain episodes) from start to finish is what I do to process and work through everything. Maybe it's because it's something to occupy my brain,  but no other shows have been able to help. For me, the opposite happens. I went (and am kinda still going through) through a really long on and off LTR breakup, and watching HIMYM and Friends (although I've skipped over certain episodes) from start to finish is what I do to process and work through everything. Maybe it's because it's something to occupy my brain,  but no other shows have been able to help.      ",
    "url" : "http://www.quickmeme.com/meme/3t25xc/"
  }, {
    "id" : 5,
    "title" : "This is how I feel when I don't go on reddit for a couple of days...",
    "snippet" : "       ",
    "url" : "http://imgur.com/Ebpkh1g"
  }, {
    "id" : 6,
    "title" : "S4E13 Three Days of Snow",
    "snippet" : "What is the Aspen Yards Ale reference in this episode? Thanks in advance. \nLily: Look Aspen Yards Ale! Get it!\nMarshall: No actually.\nLily: Me neither I was hoping you would.\n  Aspen [Yard Sale](http://www.familyskitrips.com/images/SaddlebackYardSale.jpg) But what is Aspen Yard Sale? Aspen [Yard Sale](http://www.familyskitrips.com/images/SaddlebackYardSale.jpg) Still don't get it Ok when you fall skiing, your skis, gloves, poles, hat, googles, etc... all get scattered across the slope. It looks like a yard sale (where people display things all over their lawn to sell them). So it is a \"yard sale\" in Aspen. Aspen is a huge skiing town. So it's just a term that is commenting on what it looks like when you fall skiing. \n\nTo put it simply the joke is that its a beer named after people falling while skiing. Thats it. That simple. Theres nothing else to get. The beer is named after people falling while skiing.  Because people also fall down while drunk. no. As I said it is seriously just a joke about falling while skiing because the beer is from aspen. Not drunk. Skiing.  Ok when you fall skiing, your skis, gloves, poles, hat, googles, etc... all get scattered across the slope. It looks like a yard sale (where people display things all over their lawn to sell them). So it is a \"yard sale\" in Aspen. Aspen is a huge skiing town. So it's just a term that is commenting on what it looks like when you fall skiing. \n\nTo put it simply the joke is that its a beer named after people falling while skiing. Thats it. That simple. Theres nothing else to get. The beer is named after people falling while skiing.  Still don't get it ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18x53t/s4e13_three_days_of_snow/"
  }, {
    "id" : 7,
    "title" : "Flirting 201",
    "snippet" : "   Kyle MacLachlan is the man.    Daddy's home ",
    "url" : "http://i.imgur.com/GIExreC.gif"
  }, {
    "id" : 8,
    "title" : "When I haven't watched in a few weeks and see a picture on r/himym of some random new love interest.",
    "snippet" : " ",
    "url" : "http://8.asset.soup.io/asset/2418/8216_3573.gif"
  }, {
    "id" : 9,
    "title" : "Fixed: Middle one is wrong.",
    "snippet" : "  Also, the episode \"Blah Blah\" they show Marshal at forty, and he is damn near bald. It is very off putting how \"old\" they made them all look.",
    "url" : "http://imgur.com/pqUzMbN"
  }, {
    "id" : 10,
    "title" : "Flirting 101",
    "snippet" : "  Someone should make an extended version of this with all her lip-flirting scenes.  Lik this? http://i.minus.com/irEVwZlRvq7PU.gif Lik this? http://i.minus.com/irEVwZlRvq7PU.gif Kinda, but with an even lower framerate. Lik this? http://i.minus.com/irEVwZlRvq7PU.gif   CityTV! Hello fellow Canadian. =) Not necessarily. I can confirm from experience that, half the time, CityTV is where the first rip of shows(especially CBS shows) will come from.\n\nAs a matter of fact, the first 720p rip of last night's episode was indeed CityTV.\n\nIt's less \"Hello fellow Canadian\" and more \"Yarrr me fellow pirate\" Pirating is fine in some situations, like when you have to wait months for a show to come to your country. Which is why I won't be pirating Game of Thrones anymore. HBO Nordic baby! Pirating is fine in some situations, like when you have to wait months for a show to come to your country. Which is why I won't be pirating Game of Thrones anymore. HBO Nordic baby! It's also the first airing of a TV show and if you live outside of the US or don't have a Nielsen Box in the US, your viewing doesn't matter anyway.  Might as well watch it however you want and turn more people onto the show. Pirating a TV show on first run just means you turn a 30 minute episode with pee breaks into a 22 minute one. If you're pirating DVDs, it's more of a gray area.  Pirating is fine in some situations, like when you have to wait months for a show to come to your country. Which is why I won't be pirating Game of Thrones anymore. HBO Nordic baby!    [deleted]",
    "url" : "http://i.minus.com/ibqmj0yUx109qB.gif"
  }, {
    "id" : 11,
    "title" : "Saw this. Thought of you guys!",
    "url" : "http://cdn.iwastesomuchtime.com/21820131614183.jpg"
  }, {
    "id" : 12,
    "title" : "Barney's blog: I was there",
    "snippet" : " ",
    "url" : "http://www.cbs.com/shows/how_i_met_your_mother/barneys_blog/1000366/"
  }, {
    "id" : 13,
    "title" : "Writers' second draft of the pilot's teleplay (1/2005). Interesting read, even if the final production's script was much better.",
    "snippet" : "http://www.dailyscript.com/scripts/How_I_Met_Your_Mother_--_Pilot.pdf\n\nI'm very confident this is legit...I have an eye for people who transcribe an episode or movie and try to pass it off as an actual script by adding in an extra line or two, I do not think that is the case here.\n\nMostly the same (70%) with some lame or inferior versions of jokes put in (i.e. the \"Smurf penis\" joke is presented to Robin as an anecdote about something Barney said rather than a spontaneous \"crap I shouldn't have said that\" moment). Other interesting notes for those who don't want to read the entire thing:\n\n* Marshall had a thing where he would diagnose himself with ridiculous diseases (farfetched things even for HIMYM) for the smallest symptom. His character also comes off as a lot wimpier than Segel's eventual portrayal.\n* Ted is WAY creepier when he talks to the Lebanese girl about how planned out his future is.\n* They overdo the pirate references for Lily's eye patch. \n* One of the funnier cut scenes took place right when the group drops Ted off at Robin's place after he steals the blue horn. Ted promises the others he will give them a signal that it's okay to leave by calling them and letting the phone ring once. In the apartment Robin says line after line that makes Ted pull out the phone, then put it away, then pull it out, and put it away as he anticipates the possibility of an overnight stay.\n* When Robin and Ted talk on the couch after he admits he loves her, she admits she would have slept with him if he hadn't said that.\n* Lily and Marshall buy champagne while waiting for Ted to get out of Robin's apartment. They are happy because the cap is a twist-off. They end up getting arrested. Barney just sits there and watches. Marshall calls Barney a douche.\n\nAnother thing I noticed too...even the dialogue that was kept seemed not to be as good as I remember from actually watching the end result (but that's typical when reading screen/teleplays). Makes you appreciate the exceptional casting of the five leads, because a LOT of these jokes would have come off as really dumb if they had gotten only decent actors.   ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18unk3/writers_second_draft_of_the_pilots_teleplay_12005/"
  }, {
    "id" : 14,
    "title" : "I don't know about you guys, but I personally don't want to find out what Barney's job is.",
    "snippet" : "With them having this running gag going for eight seasons now, it can only end in disappointment. They already have enough pressure to make the mother Ted's perfect woman while still pleasing the loyal fans. I think it is one secret that we are never meant to know.  Except we DO KNOW what his work is. \"Haha. Please.\" IS the answer. His work is to [spoiler] (/s \"make sure the company looks good. In other words, he meets with the higher-ups and tells them what they want to hear, making GNB look good. His job is literally to please his co-workers and those that do business with GNB.\") That's my take anyway. Except we DO KNOW what his work is. \"Haha. Please.\" IS the answer. His work is to [spoiler] (/s \"make sure the company looks good. In other words, he meets with the higher-ups and tells them what they want to hear, making GNB look good. His job is literally to please his co-workers and those that do business with GNB.\") That's my take anyway.    Don't worry, we won't. It'll be like The Janitor...\"Glen Matthews.\" Don't worry, we won't. It'll be like The Janitor...\"Glen Matthews.\"        ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18u2q2/i_dont_know_about_you_guys_but_i_personally_dont/"
  }, {
    "id" : 15,
    "title" : "Did anyone else notice the time on the clock in Marshall and Lily's apartment? [Spoilers]",
    "snippet" : "    The clock doesn't work. It's always read 4:20. Check it, go ahead. Even a broken clock is correct twice a day\n The clock doesn't work. It's always read 4:20. Check it, go ahead.  It's always 4:20 somewhere... false   I don't get it. Why is the clock relevant?  Isn't that a pulp fiction reference?",
    "url" : "http://imgur.com/RR7VV1j"
  }, {
    "id" : 16,
    "title" : "Daddy's home [spoilers]",
    "snippet" : "  I like how at the end it turns out he was actually there... Was he? The end clip could have been in his head, but then there was the \"Shelly was with some archduke\" thing...\n\nUnless Lily just threw that in for Barney's ego. The Shelly thing is what I meant... But I didn't think that part was from Lilys point of view. I thought it was just what happened. lol I guess we'll never know... Was he? The end clip could have been in his head, but then there was the \"Shelly was with some archduke\" thing...\n\nUnless Lily just threw that in for Barney's ego. I went back through the episode immediately after watching it, but couldn't find a single trace of Barney or the Archduke in the background... real shame.   I miss this Barney. Me too. But I'm glad he's not like this anymore, it was necessary for his character to grow out of it. I think they're doing a really good job of showing how difficult it is for him to step out of his old ways though, that keeps it entertaining while showing that he actually has matured. I miss this Barney.     Not sure this is really spoilerish I thought that the comments might contain spoilers. Better to put the tag than have butthurt people start yelling. ",
    "url" : "http://i.imgur.com/Yh96NK5.jpg"
  }, {
    "id" : 17,
    "title" : "Musical references: S06E03 - Unfinished",
    "snippet" : "\"Unfinished\" is the general theme of the episode, starting out with Ted lecturing about Gaudí's unfinished project, the Sagrada Família. And the music playing in the background is... Schubert's [Unfinished Symphony](http://en.wikipedia.org/wiki/Unfinished_Symphony). There are more musical references like this one in the show, but I found this one to be quite a beautiful and fairly subtle one. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18tkrg/musical_references_s06e03_unfinished/"
  }, {
    "id" : 18,
    "title" : "Maybe the best picture of the cast ever. They're pictured as the Jonas Brothers and fans. ",
    "snippet" : "  I found a [higher resolution](http://i.imgur.com/m2EO99G.jpg) version. I found a [higher resolution](http://i.imgur.com/m2EO99G.jpg) version. I found a [higher resolution](http://i.imgur.com/m2EO99G.jpg) version.  The one on the far left is Marshall, right?? O.o The one on the far left is Marshall, right?? O.o The one on the far left is Marshall, right?? O.o [deleted] Oh, look! You're trying to get negative karma. Upvotes for you. What did he say? &gt;this is fucking gay. you queers need to go outside or kill yourselfs. choose one, faggots.\n\n/u/mancitymavs [deleted] Upvote the slut to 0 karma. Then he'll never win.     Damn i would turn gay for neil patrick harris  It looks as if Lily is in this picture twice!  I want to believe, but the more I look at it, the faker it gets. It's real. It was an Entertainment Weekly photoshoot a few years back. Yeah but look at Marshall. Yeah but look at Marshall. It's real. It was an Entertainment Weekly photoshoot a few years back.         This is like the anti-Robin Sparkles!  That show isn't funny.. Run of the mill sitcom..I feel like I'm being patronized when I watch this as well as Big Bang theory. It's amazing to me that so many people buy into this stuff  ...then why are you in r/HIMYM? It was on my front page.. and to tell you people my opinion because I know you all care We don't,  but do you realize you can unsubscribe from /r/HIMYM?   This has been posted a dozen times over :/ This has been posted a dozen times over :/",
    "url" : "http://imgur.com/2vJmzAs"
  }, {
    "id" : 19,
    "title" : "I wonder if the HIMYM creators got some ideas of how Ted will meet the mother from this song",
    "snippet" : "  Maybe a stretch but on an unrelated note, what a good song!  i wouldn't mind if they worked this into that farhampton scene Maybe a stretch but on an unrelated note, what a good song!  i wouldn't mind if they worked this into that farhampton scene",
    "url" : "http://youtu.be/7rEhGLs3fI0"
  }, {
    "id" : 20,
    "title" : "Jason has calmed down a lot in his lifetime. ",
    "snippet" : "  SLC Punk, one of the best movies I'll ever see. SLC Punk, one of the best movies I'll ever see. SLC Punk, one of the best movies I'll ever see. SLC Punk, one of the best movies I'll ever see.      ONLY POSERS DIE!  I've said it before and I'll say it again. This is a subreddit for HIMYM. Not a subreddit for a single actor and all the other acting jobs they've had. This doesn't belong here,",
    "url" : "http://imgur.com/7OrgiUL"
  }, {
    "id" : 21,
    "title" : "Episode Discussion S08E17 - \"The Ashtray\" (Here be spoilers!)",
    "snippet" : "**Live Chat:**\n\n----------------------------------\n\nWe now have our own registered IRC channel. Pop in any time to see if people are there discussing the show!\n\n\nFollow [this link](http://webchat.freenode.net/?channels=#himym), log in with your reddit nick and we will discuss live! **Chat is open now, but picks up ~15 minutes prior to airing.**\n\n-----------------------------------\n\n**Reddit:**\n\nThere will still be discussion here on this post, but we will be live in IRC as well.\n\n--------------------------------------\n\n\n**DISCUSS!**  am I the only one who thought Lilly actually painted the painting and was just being coy? am I the only one who thought Lilly actually painted the painting and was just being coy?  The Captain on the bed would have been PERFECT for the Naked Man.   \"Please hold.\" Captain: \"Dropping anchor\"   Omg it's Lily development!  Heck yeah! Also anyone else notice that Ted got an awesome job through his breakup with Stella and now Lily got an awesome job through his breakup with Zooey? It's really help tying together the \"everything happens for a reason/this is why I had to date all these random chicks before I met your mother\" theme.  That's true! Zooey's always been the most pointless major girlfriend in the series, I've thought, so this is good.  Major Girlfriend! http://stream1.gifsoup.com/view7/2637726/himym-salute-o.gif   Major Girlfriend! That's true! Zooey's always been the most pointless major girlfriend in the series, I've thought, so this is good. Heck yeah! Also anyone else notice that Ted got an awesome job through his breakup with Stella and now Lily got an awesome job through his breakup with Zooey? It's really help tying together the \"everything happens for a reason/this is why I had to date all these random chicks before I met your mother\" theme.  well ted also was able to build his building because of their breakup. \n Heck yeah! Also anyone else notice that Ted got an awesome job through his breakup with Stella and now Lily got an awesome job through his breakup with Zooey? It's really help tying together the \"everything happens for a reason/this is why I had to date all these random chicks before I met your mother\" theme.  So what's going to happen with Geanette?   Omg it's Lily development!  I'm watching it right now.\n\n\"I have a degree in art history and yes I was supposed to do something with it, but I didn't. Somewhere along the line I forgot to pursue my dream.\"\n\nOh I'm sorry, did you not break off your engagement to Marshall to go pursue an art career in SF 6 years ago? I'm watching it right now.\n\n\"I have a degree in art history and yes I was supposed to do something with it, but I didn't. Somewhere along the line I forgot to pursue my dream.\"\n\nOh I'm sorry, did you not break off your engagement to Marshall to go pursue an art career in SF 6 years ago?  Is it me or is this episode just a way of saying all plot holes are because Ted can't tell a story?  Is it me or is this episode just a way of saying all plot holes are because Ted can't tell a story?  Future Ted has always been an unreliable narrator, intentionally or not. He's been smoking a few too many sandwiches. Is it me or is this episode just a way of saying all plot holes are because Ted can't tell a story?  Is it me or is this episode just a way of saying all plot holes are because Ted can't tell a story?  Any plotholes can be explained with \"A wizard did it\", true story   Lily teaching lessons by stealing. Many good callbacks this episode. I got very frustrated at Aldrin Justice, because it's so petty and juvenile, but they turned it around into something pretty cool by giving her a legitimate reason to be upset.  She's boats, boats, boats and he's the Captain. How sweet! She's boats, boats, boats and he's the Captain. How sweet!  The Real ArchDuke of Grand Fenwick was amazing  Marshall's too polite to not answer the phone. I totally forgot about that Marshall trait. I just thought he was super keen to get a ride on The Captain's boat.  Anyone catch the reference to *The Most Dangerous Game*? I read it earlier this year for English. The captain= General Zaroff Anyone catch the reference to *The Most Dangerous Game*? I read it earlier this year for English. Anyone catch the reference to *The Most Dangerous Game*? I read it earlier this year for English. Anyone catch the reference to *The Most Dangerous Game*? I read it earlier this year for English. Anyone catch the reference to *The Most Dangerous Game*? I read it earlier this year for English.  Captain's rocking red pants.  Pulling. Them. Off.    \"Oh where are my\"\n\"-MANNERS. That's how that feels...\"  HAHAHAHA Barney's story this episode went from being one of the lamest things the show has done to one of the greatest HAHAHAHA Barney's story this episode went from being one of the lamest things the show has done to one of the greatest  Hey they bringing back Lily's insecurities about her career. Cool beans. It's the fall back for her... I'm glad they finally gave her a positive closure on that aspect.\n\nOn a different note, I always thought her degree was in education and her minor in art. When she said she got a degree in Art History, as a teacher, my first thought was \"There's no way in hell she's a kindergarten teacher with that only that degree and an emergency certification. She'd have to go back and get her masters (in education) for No Child Left Behind.\" Then I realized, it's a show and maybe the laws of education don't apply. It's the fall back for her... I'm glad they finally gave her a positive closure on that aspect.\n\nOn a different note, I always thought her degree was in education and her minor in art. When she said she got a degree in Art History, as a teacher, my first thought was \"There's no way in hell she's a kindergarten teacher with that only that degree and an emergency certification. She'd have to go back and get her masters (in education) for No Child Left Behind.\" Then I realized, it's a show and maybe the laws of education don't apply.   The way they tell a story and then change it. Genuis. It's called a [Rashomon story](http://en.wikipedia.org/wiki/Rashomon_effect), it's been used frequently in film and television. It's one of my favorite storytelling tropes. I remember a funny episode of The Fresh Prince of Bel Air where Uncle Phil/Carlton/Will all are talking to a judge about a party they had where they do this. It's called a [Rashomon story](http://en.wikipedia.org/wiki/Rashomon_effect), it's been used frequently in film and television. It's one of my favorite storytelling tropes. What's up, film school student.    The Captain is back tonight, so I hope to see his upper and lower face in all their glory. I did the same thing with Amy Poehler. She's a 25 year old above the nose and 50 below.  If those numbers are on a 1-10 scale of attractiveness, I agree with you. Mos def I did the same thing with Amy Poehler. She's a 25 year old above the nose and 50 below.  The Captain is back tonight, so I hope to see his upper and lower face in all their glory.     Ted's Mancave= My new favorite set on the show. Ted's Mancave= My new favorite set on the show. I love it too..I just realized its the same set as his old architecture firm with some changes.  Gotta love them big fat sandwiches. I loved this episode...because I was on a sandwich.  LOL The Captain's recording the real Housewives. LOL The Captain's recording the real Housewives.  I don't know about you guys, but I LOVED all the resurfacings of topics from old episodes. I mean, come on, the playbook, lily's thieving ways, the good ol' \"tell the same story from different perspectives\", and of course, THE CAPTAIN   \"Lily, I would punch a girl for you.\"\n\n   I feel that Robin/lip balm part will become a gif. I feel the captain/lip balm will become a gif. I feel Ted knocking over the waiter's tray will become a gif I feel the captain/lip balm will become a gif. Especially the Captain    So Barney was there?     Ted dies.   Please call me back at your earliest convenience.\n\n\"Oh.. man, he seems pissed!\"   Ah, another example of Lily's questionable morals She'll be turning evil, kill a guy and try to take over the world by the end of the season then her and Marshall can have a touching scene at a ruined church to handwave most of the bad things she did And then they find out Carl actually IS a vampire, and Robin is the slayer on a mission to kill him. and then they discover that Clive is trying to become an immortal giant snake Do you mean Clint? I wonder who'd be his version of Faith. yeah, that's the one. Ted's mother will do I guess, with Sandy as her watcher   with a scope! No scope!  That felt so short...     :o thought this was the end of the playbook! I like it!       Good thing he didn't do the naked man Good thing he didn't do the naked man     I think the mother is the artist of the Elephant painting. The mother paints weird things [Paints awesome pictures of robots playing sports (S5E12) Why else tell this story?       Is it just me, or does giving Lily a job just like that feel like such a cop out?\n\"My dream is gone!\"\nTwo seconds later: \"would you like your dream job?\" I disagree. Lily has revealed earlier that she has been struggling for a while now.                      What was the point of the Barney storyline? Besides teasing that he's freaking out about being engaged? What was the point of the Barney storyline? Besides teasing that he's freaking out about being engaged?           If this is 2011 wouldn't Lily be pregnant? Just wondering, maybe I'm wrong\nEDIT: I'm stupid. Lily, not robin Do you watch this show? Pretty sure he meant Lily... If this is 2011 wouldn't Lily be pregnant? Just wondering, maybe I'm wrong\nEDIT: I'm stupid. Lily, not robin      ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18s9cw/episode_discussion_s08e17_the_ashtray_here_be/"
  }, {
    "id" : 22,
    "title" : "(Spoilers)I think it's safe to say that everyone has achieved their life goals",
    "snippet" : "Lily and Marshall are married have a family and are doing what they always wanted. Marhsall has gone above and beyond what he wanted to do and will become a judge, Lily is finally doing art(she may not be an artist per-se but she's finally doing something in the industry)Robin is a news anchor and Barney is doing whatever the hell he does and they are engaged and are going to be married.  Ted has his building and is a professor and will meet the mother either this season or the next.\n\nThey've all done what they said they will do, the series is wrapping up nicely   It works out very nicely because it makes sense that each of his friends will now be able to do their part in getting Ted to be with/marry the mother. They are fulfilled in their own lives and will be able to devote more time helping him out in the way that they need to. \n\nFor example, earlier this season when Ted was freaking out about still loving Robin and being jealous of her and Barney, Lily wasn't exactly able to help him on the roof because she was having her own freak out about being an unfulfilled mother. If such problems arise when he is courting/dating the mother, she and the others will help him through it.   I thought Barney wanted to be a violinist? I thought Barney wanted to be a violinist?  But.. but... Marshall still hasn't found Nessie yet!  But.. but... Marshall still hasn't found Nessie yet!     I wanna find out what Barney does so badly. I want to know but I'm scared simultaneously. Remember all the scenes at GNB of them burning/shredding paperwork, or being indicted by the government, or the time where he thinks he sold a person. What ever Barney does its both intriguing and terrifying.  I wanna find out what Barney does so badly.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18sonk/spoilersi_think_its_safe_to_say_that_everyone_has/"
  }, {
    "id" : 23,
    "title" : "Tonight's playbook has to be one of the most random references yet on the show. Grand Fenwick is a fake nation created for a 1955 novel, The Mouse that Roared",
    "snippet" : "  does anyone know if this \"play\" was in the actual playbook book that cbs released a few years ago? Yes it is. When I saw it I was just like \"Holy shit that is actually in the Playbook\" and my brother was just like really? Proof? I mean, I believe you but I'd like to see it.    ",
    "url" : "http://en.wikipedia.org/wiki/The_Mouse_That_Roared"
  }, {
    "id" : 24,
    "title" : "HIMYM Themed Coffee Shop",
    "snippet" : "  Do the cups there come with \"Swarley\" written on them? Or do I pay extra for that? Do the cups there come with \"Swarley\" written on them? Or do I pay extra for that?   Where is this place? The picture was taken at Common Ground coffee house in Grand Rapids, Michigan. It was posted on /r/grandrapids about a week ago.     ",
    "url" : "http://i.imgur.com/O9fWdXn.jpg"
  }, {
    "id" : 25,
    "title" : "Am I the only one who is very annoyed with the constant objections and little remarks from Barney about his marriage?",
    "snippet" : "It's starting to piss me off that even after he is in a committed relationship, he still wants to be single.  I think they are setting it up for some breakdown cold feet right before the wedding, which of course we already know will still end in their marriage. I think they are setting it up for some breakdown cold feet right before the wedding, which of course we already know will still end in their marriage. Do we? We do. We've seen the wedding reception, which typically means there was a wedding. Wedding receptions are generally held whether or not they say \"I do.\" It's a lot of non-refundable money to spend on a party. Wedding receptions are generally held whether or not they say \"I do.\" It's a lot of non-refundable money to spend on a party. is that true? \n\nThat'd be the most bummer party ever.  Remember, Barney has been in a total of three real relationships before this: robin, nora, and quinn.  Plus, he went from single straight to engaged.  He is adjusting to his new status.  Give him some time Don't forget Shannon. But Shanon was pre-Barney Barney. So she doesn't really count. Remember, Barney has been in a total of three real relationships before this: robin, nora, and quinn.  Plus, he went from single straight to engaged.  He is adjusting to his new status.  Give him some time  It's normal for him to experience that. Even though he loves Robin and wants to marry her, the thought of being with the same woman for the rest of his life would slightly terrify him.  Exactly. Anyone remember Chandler and his little freak outs? Pretty normal considering his character. It will take some time.  I think it's not so much about wanting to be single, it's about his identity as the single and wild fun person. That's why he had the freak out about being \"the cool story\" guy. Face it, your stories are going to be way less interesting when you're settled down in a committed relationship. He's not like Ted or Marshall or Lily who always saw commitment as the holy grail to aspire to. \n\nBut yeah, he really hasn't fallen into couple mode at all yet this time and it's kind of weird. I would like to see more signs and indications that him and Robin actually want to get married as the season progresses. I think it's not so much about wanting to be single, it's about his identity as the single and wild fun person. That's why he had the freak out about being \"the cool story\" guy. Face it, your stories are going to be way less interesting when you're settled down in a committed relationship. He's not like Ted or Marshall or Lily who always saw commitment as the holy grail to aspire to. \n\nBut yeah, he really hasn't fallen into couple mode at all yet this time and it's kind of weird. I would like to see more signs and indications that him and Robin actually want to get married as the season progresses.   ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18skds/am_i_the_only_one_who_is_very_annoyed_with_the/"
  }, {
    "id" : 26,
    "title" : "Why aren't the discussion threads going up on the sidebar?",
    "snippet" : "I don't usually catch the episodes when they air, so its getting a bit annoying to scroll through everything since the side and top bar aren't being updated ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18s17h/why_arent_the_discussion_threads_going_up_on_the/"
  }, {
    "id" : 27,
    "title" : "Hello Siri",
    "snippet" : "  This is what Siri called me when I had my iPhone 4S too!   I've tried several times to do this but Siri never says it right I've tried several times to do this but Siri never says it right You gotta type it in. Go to your contacts, there should be one for yourself. Hit edit, then change your nickname.   Calling bullshit. I'm using an iPhone too and that photo doesn't fit on my screen. Calling bullshit. I'm using an iPhone too and that photo doesn't fit on my screen. Calling bullshit. I'm using an iPhone too and that photo doesn't fit on my screen. Calling bullshit. I'm using an iPhone too and that photo doesn't fit on my screen. Calling bullshit. I'm using an iPhone too and that photo doesn't fit on my screen. Calling bullshit. I'm using an iPhone too and that photo doesn't fit on my screen.",
    "url" : "http://imgur.com/bpusD7n"
  }, {
    "id" : 28,
    "title" : "The other day, the third grade teacher I'm student teaching with told a student to \"snowsuit up\". I was the only one who understood the reference.",
    "snippet" : "   Would you really want 8 year olds watching this show?    I came here to point out the third graders thing..but..yea.    Good points all around, but there were five other adults around, not just the third graders. I was just delighted my supervising practitioner was so cool!",
    "url" : "http://imgur.com/gNYBA4Y"
  }, {
    "id" : 29,
    "title" : "Back boobs... They're gonna be a thing (x-post from /r/funny)",
    "snippet" : "     Looks shopped. You can tell by the pixels...\n\nsource: I opened MS paint once or twice. I've seen a few shops in my day. And this is definitely shopped. How new can you be? this is a real ad\n\nhttp://www.cinemablend.com/games/Behold-Creepiest-PS-Vita-Ad-Ever-48857.html   aha the reference to French Stella with backboobs\n\n    YES I AM NOT THE ONLY PERSO. WHO THOUGHT THAT!!!!!",
    "url" : "http://i.imgur.com/FFb6eWC.jpg"
  }, {
    "id" : 30,
    "title" : "Just a little something I made for my intro to photoshop class :)",
    "snippet" : "    In the third one you missed a bit of umbrella between Ted's head and Robin's hand, but other than that it looks good for an intro class.\n\nGood luck with the class, photoshop can be incredibly fun.  And if you don't know about it already /r/photoshopbattles is a great subreddit to get silly/fun content practice with, and to see others technique. :)   You have that second one in a better resolution, that would be a great wall paper. I agree. It's the best photo I've seen of all of them (except for Marshall). You have that second one in a better resolution, that would be a great wall paper.   ",
    "url" : "http://imgur.com/a/BAg8T"
  }, {
    "id" : 31,
    "title" : "Meet the girl that Ted lost her virginity to. I think she's gorgeous ",
    "snippet" : "  \"Ted lost her virginity to.\" Yeah Ted is a bit of a woman. [Hiyoooo!!](http://www.hiyoooo.com/)\n \"Ted lost her virginity to.\" Yeah Ted is a bit of a woman.   Who is this? I'm confused. And if this isn't HIMYM related, it really shouldn't even be here... http://imgur.com/kLqpzSJ That does nothing to answer my question, sorry. Sorry. I really don't know what I was thinking just posting that. I was in a hurry. Her name in the show was Molly. And in one of Ted's flashbacks he tells a story of how he had slept with her and pretty much just bailed and asked for $20 on his way out. Later we find out the truth is that the girl had actually done that to him. And it was the girl he lost his virginity to. That pic is just a clip from her in that scene. Sorry. I really don't know what I was thinking just posting that. I was in a hurry. Her name in the show was Molly. And in one of Ted's flashbacks he tells a story of how he had slept with her and pretty much just bailed and asked for $20 on his way out. Later we find out the truth is that the girl had actually done that to him. And it was the girl he lost his virginity to. That pic is just a clip from her in that scene. Ahhh I remember that now! Thank you :)\n\nHowever, still not sure what the point of this thread is...",
    "url" : "http://i.imgur.com/i0x5Z3K.jpg"
  }, {
    "id" : 32,
    "title" : "Music that plays when Ted meets her",
    "snippet" : "I recently bought the album How I Met Your Music and think it would be really awesome if right when Ted meets the mother the song Hey Beautiful starts playing but from the start not the whole bababab part. Just my thought on it.  Okay so here's my idea.  We've already seen the scene at the Barney and Robins wedding reception where Ted sees the mother playing bass.  So what if leading up to that the wedding band starts playing Hey Beautiful initiating Future Ted making a speech about destiny/fate and how everything up to that day, even that moment had to happen in order for him to be ready to meet the mother. At about the breakdown of the song (where the vocals pretty much disappear) a montage of all of Teds girlfriends over the years. Not necessarily all off them but Robin, Victoria, Stella, and Zooey for sure. Possibly starting and ending with Robin. This montage ends as the wedding band gets to the ba ba ba ba part at which point Future Ted looks up at the band and sees the mother and hopefully we get to see her too. Then the song ends and we're left with Ted looking at the mother and the season ends presumably with Ted summing up his entire speech with an impactful sentence. And the season ends and we all get upset that we have to wait for them to meet in Season 9.  I have uneasy feelings about season 9.   I'd be okay with this if they were going to end it with a montage, 'cause it would be cool to have the song play all the way through with clips of Ted and the mother dating, getting married, having kids, etc., all ending with the familiar part of the song.\n\nIt's looking more and more like they're going to meet at the beginning of S9 though, so I don't know. As much as I would love the show to keep going I really don't think it will be as good if it continues on after he meets her.    This is gonna sound very corny. But how about before Ted sees her, Hey Beautiful starts playing. Future Ted talks about fate and love and how easy it would have been for him not to meet the mother while Hey Beautiful is still playing faintly in the background. Then when the Ted's eyes see the mother, the \"Ba Ba Ba Ba\" part starts playing.   I think Ted mentioned he shares a love for Otis Redding with the mother. If I remember correctly, and the creators know what they are doing, we'll get Otis.\n\nedit: correction, it was [the girl from the agency](http://how-i-met-your-mother.wikia.com/wiki/Ted%27s_Love_Solutions_Match) but she did have staff like the bass that the mother has, and it's still possible she's the mother.   Murder Train needs to play.  It would be cool but the thing is, the only good part of that song is the ending - the rest of it is really sucky. I know that's just a personal opinion, but even generally speaking, aside from the ending of the song, it doesn't carry any emotional resonance. \n\nI'd be pretty disapointed if they used that - especially when they've nailed so many music moments before.",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18qx6w/music_that_plays_when_ted_meets_her/"
  }, {
    "id" : 33,
    "title" : "By far my favorite HIMYM conversation ",
    "snippet" : "   Ted's face when he orders them is priceless!    now i am thinking about nachos. fucking 6am and I want nachos. thanks. Maybe if you lived in New York instead of California your craving would seem slightly more reasonable Maybe if you lived in New York instead of California your craving would seem slightly more reasonable noon, a day latter seems reasonable http://i.imgur.com/2VdTXzP.jpg\n\n noon, a day latter seems reasonable http://i.imgur.com/2VdTXzP.jpg\n\n  this is a close second for me--my favorite is the one where ted and barney decide to take over maclaren's  i dont remember this, what episode? Doppelgängers. More like Doppel-*Bang-Hers*\n\n/highfive o/  \\o More like Doppel-*Bang-Hers*\n\n/highfive   [Here's the scene](http://www.youtube.com/watch?v=y7TJ2Dh2t-E)  I just watch this episode with my wife. You should watch some other episodes, too. Oh, we have. We're going through all the seasons. Starting season 6 today (or tomorrow) Oh, we have. We're going through all the seasons. Starting season 6 today (or tomorrow)  ",
    "url" : "http://imgur.com/h6ajTgy"
  }, {
    "id" : 34,
    "title" : "How will the show convince us that Ted is over Robin and in love with the mother in one season?",
    "snippet" : "We know that Robin is not the mother, yet the writers, time and time again, continue to revisit Ted's feelings for her. You can chalk it up to lazy writing or genuine suspense, but either way my concern is that the writers are making it increasingly difficult for them to convince the audience that Ted really is over Robin.\n\nWe've already been told and shown, multiple times, that Ted has gotten over Robin only for that to be reversed. They continue this EVEN after Barney and Robin become engaged.\n\nMy real concern is that they won't really address it. If they just have Ted fall in love and stop pursuing Robin cold turkey, I don't know that it will be very convincing. Even if they make it love at first sight, Ted had that with Robin, AND he had an additional eight years of pursuing her.\n\nI found a post on a random website that captured my thoughts pretty well:\n\nhttp://www.fanforum.com/f289/blue-french-horn-lovers-%7Bt%E2%99%A5r%7D-8-because-marshall-doesnt-want-pay-lily-up-yet-63076360/index10.html\n\n&gt;The first episode explains it all. Ted falls in love with Robin instantly. From the moment he met her, he knew it was love and that love has endured through 8 seasons. Every time Ted tries to move on, Robin is always in the back of his head and he will choose her over anyone, no matter how special they are supposed to be to him. \n\n&gt;I think that with the mother being the “bass player” at the wedding, or maybe someone who meets him at the stop, or however they are going to explain it to us, is “supposed” to show us that Ted falls in love with the mother at first sight, maybe signifying he’s officially over Robin.\n\n&gt;I don’t really think they know what they are doing. How is just one “love at first sight” moment going to replace that + the many years that he’s spent pining privately and openly about Robin. How are we supposed to just “forget” all of his feelings about her because he sees this women across a room just like he did with Victoria, Stella, and the many others he’s been with. It doesn’t make the mother anything special, just another one of Ted’s brief hookups. \n\n&gt;I know that all the theories and the timeline have canceled out any hope of Robin being the mother or the woman future Ted marries, I’m not one of those delusional shippers. But why? What amazing thing is the woman going to do to prove to us Ted loves her more or just as much as he’s loved Robin all these years.  Ted is over Robin. Ted just wants to be married. His Ted-ological clock is ticking away, and he's super jealous and probably a bit depressed that his two friends who are so totally anti-marriage are getting married before him, and to each other no less. All he needs this time to get through his jealousy is a girl of his own (maybe one who isn't completely insane, too) &gt;Ted-ological clock\n\n:D\n\nI see what you're saying, but I personally don't really feel like they've established that Ted has gotten over Robin. You may be right that it could just be jealousy at this point, but I don't see anything solid in the last two seasons to show that. I think the will show the door is closed during the wedding. I never really got the idea he was into her in the first place. Anytime they hooked up after the first dating period it was right when he was on the rebound. Every time they broke it off it barely phased him. If he really did have true feelings for her the \"fuck buddy\" period would have never worked. She was no more than his security blanket.  Ted is over Robin. Ted just wants to be married. His Ted-ological clock is ticking away, and he's super jealous and probably a bit depressed that his two friends who are so totally anti-marriage are getting married before him, and to each other no less. All he needs this time to get through his jealousy is a girl of his own (maybe one who isn't completely insane, too)   This reminds me of the time that Marshall said \"not yet\" when they though Ted was finally over Robin. That has to play into something later on in the series. \n I loved that - that scene sticks out the most for me as a Ted/Robin foretelling. As illogical as I think Ted &amp; Robin are at this point, that line makes me want it so badly.   How will we see Ted is over Robin? Easy: He'll bring out the notepad and do some pros/cons between Robin and the mother. How will we see Ted is over Robin? Easy: He'll bring out the notepad and do some pros/cons between Robin and the mother.  I'm guessing that he'll meet the mother in a state of emotional crisis (crying over Robin most likely) and something about that will cause him to fall even harder for her... Either way I totally get what you're saying. Ted and Robin have something so special and it's hard to see some random bass player eclipsing that. Interesting idea with the emotional crisis. He does meet her at the train station, right? Do we know yet why Ted finds himself at the train station after Barney and Robin's wedding? My guess is something akin to this.\n\nTed was nervous/upset the day of the wedding hence him peeling the label off the beer. My guess is Robin panicked and asked Ted to run away with her. He struggles and struggles and then they go just like Ted and Victoria. He takes her to the train station and tells her he can't/won't. She leaves without him, and there in the moment he relinquishes the purple giraffe he meets the yellow umbrella. She offers Ted shelter from the rain Ted looks up at her and confesses eternal love. Because that is how Teddy Westside does it. So they run away *after* she's married?  Because we've seen the father/daughter dance. Did we? Shiiiiittt. I must revise then. We have.  It was just a glimpse, I believe near the end of an episode.  Ted is watching the mother play while Robin dances with her dad, smiling.  Ted's hand is still unbandaged at this point. How do you know it's the mother? Cindy's former roommate is the mother. Cindy's former roommate is the bass player in Barney and Robin's wedding band.\n\nIt may not be airtight, but it's pretty solid. No I know but I figured that she didn't make it to the wedding. Because he didn't meet her until the train station. My guess is something akin to this.\n\nTed was nervous/upset the day of the wedding hence him peeling the label off the beer. My guess is Robin panicked and asked Ted to run away with her. He struggles and struggles and then they go just like Ted and Victoria. He takes her to the train station and tells her he can't/won't. She leaves without him, and there in the moment he relinquishes the purple giraffe he meets the yellow umbrella. She offers Ted shelter from the rain Ted looks up at her and confesses eternal love. Because that is how Teddy Westside does it. I think you're close but they don't actually run away. Ted talks her out of it. He will realize she was never really the one and tell her so. She'll come to her senses, agree and go through with the wedding happily. Interesting idea with the emotional crisis. He does meet her at the train station, right? Do we know yet why Ted finds himself at the train station after Barney and Robin's wedding? I don't think so... But it seemed like the train was the easiest way to get to/from the church? Yeah, it kind of seems the train is the best transporting option if you're on your own (no car or anything else), as shown with Klaus. Still, it's a curious thing Ted is alone at the station. One would think that as a best man he'd leave late and would have planned to have some kind of transportation or a place to stay for the night. Isn't there a hotel right in the church, or something like that? Interesting idea with the emotional crisis. He does meet her at the train station, right? Do we know yet why Ted finds himself at the train station after Barney and Robin's wedding? Here's a theory I have posted on here before that I came up with:\n\nAlright here's what I think what will happen, But what show is without it's final bit of drama before the happy ending? Robin will find out after Barney proposes and in a sheer moment of panic and lust will sleep with Ted, both he and Robin will be racked with guilt until the day the wedding. Robin asks to see Ted to find out if she wants to run away with him out of panic but here we see Ted's growth and he rejects Robin's idea and calms her down. Then Ted goes to see Barney and admits what he did to him and they fight(which leads to his injured hand)and he gets asked to leave the wedding. That's why Ted seems dejected but kind of satisfied at the train station he may have lost a friend but won his self respect back. Now for the next point you'll have to have seen My Name is Earl, in one episode Earl describes Karma not working as a point system but sometimes one more good deed will put you over the top. Because he's atoned for his sin and put his own selfish desires aside for the greater good he finally gets to meet the mother and Barney forgives him.\n Here's a theory I have posted on here before that I came up with:\n\nAlright here's what I think what will happen, But what show is without it's final bit of drama before the happy ending? Robin will find out after Barney proposes and in a sheer moment of panic and lust will sleep with Ted, both he and Robin will be racked with guilt until the day the wedding. Robin asks to see Ted to find out if she wants to run away with him out of panic but here we see Ted's growth and he rejects Robin's idea and calms her down. Then Ted goes to see Barney and admits what he did to him and they fight(which leads to his injured hand)and he gets asked to leave the wedding. That's why Ted seems dejected but kind of satisfied at the train station he may have lost a friend but won his self respect back. Now for the next point you'll have to have seen My Name is Earl, in one episode Earl describes Karma not working as a point system but sometimes one more good deed will put you over the top. Because he's atoned for his sin and put his own selfish desires aside for the greater good he finally gets to meet the mother and Barney forgives him.\n   I think that when Ted falls for the mother, eventually things will start to slow down between them. However, the mother won't be bitchy like Victoria and ask Ted to not be friends with Robin. They'll end up having a talk about why their relationship isn't moving along like they want it to be, causing Ted to realize that it is Robin, and that at least for the sake of their relationship at that moment, Ted has to distance himself from Robin. Ted will have the \"talk\" with Robin explaining this, showing he truly is over Robin and how much he loves the mother.\n (Then the mother could show how awesome she is by telling Ted to not try and cut Robin out of his life. But Ted having the talk would prove how over Robin he is.) I think that when Ted falls for the mother, eventually things will start to slow down between them. However, the mother won't be bitchy like Victoria and ask Ted to not be friends with Robin. They'll end up having a talk about why their relationship isn't moving along like they want it to be, causing Ted to realize that it is Robin, and that at least for the sake of their relationship at that moment, Ted has to distance himself from Robin. Ted will have the \"talk\" with Robin explaining this, showing he truly is over Robin and how much he loves the mother.\n (Then the mother could show how awesome she is by telling Ted to not try and cut Robin out of his life. But Ted having the talk would prove how over Robin he is.) I think that when Ted falls for the mother, eventually things will start to slow down between them. However, the mother won't be bitchy like Victoria and ask Ted to not be friends with Robin. They'll end up having a talk about why their relationship isn't moving along like they want it to be, causing Ted to realize that it is Robin, and that at least for the sake of their relationship at that moment, Ted has to distance himself from Robin. Ted will have the \"talk\" with Robin explaining this, showing he truly is over Robin and how much he loves the mother.\n (Then the mother could show how awesome she is by telling Ted to not try and cut Robin out of his life. But Ted having the talk would prove how over Robin he is.) Yes, this is a great possibility. Remember the episode where Victoria told him that it (him, Barney, and Robin hanging out at the bar night in and night out) wasn't working, Narrator Ted said something like \"it didn't work... we just didn't realize it yet.\" And they've yet to realize it this far. Perhaps your scenario would be that realization? I think that when Ted falls for the mother, eventually things will start to slow down between them. However, the mother won't be bitchy like Victoria and ask Ted to not be friends with Robin. They'll end up having a talk about why their relationship isn't moving along like they want it to be, causing Ted to realize that it is Robin, and that at least for the sake of their relationship at that moment, Ted has to distance himself from Robin. Ted will have the \"talk\" with Robin explaining this, showing he truly is over Robin and how much he loves the mother.\n (Then the mother could show how awesome she is by telling Ted to not try and cut Robin out of his life. But Ted having the talk would prove how over Robin he is.) I think when you meet \"The One\" the emotional baggage gets eclipsed by all the good things going on with the right person. I'm not saying your scenario couldn't happen, but I'd rather see it become something that doesn't matter any more to Ted.  I think he's going to be looking at Robin while she's dancing with barney at the wedding and he'll look over her shoulder and see the mom and robin gets blurry in the shot and zooms in on her and end whole fucking series This sounds pretty cool, but Ted meets the mother at the train station. I'm fairly sure that has been established through interviews with the creators, which means he only sees her at the wedding, and they can't end it without them meeting.   It's called how I MET your mother. Not how I fell in love with your mother. You don't think that's incredibly cliche and anticlimactic at this point? For him to shake her hand or whatever and the show to cut to black? That's such a cop out.  How is that a cliche and anticlimactic if that's what was intended since the beginning? I think that's the right way to end the show. Really? You don't want to actually get to know the character we've spent 9 years following the story of? What makes her so special? What makes her better than Stella or Victoria or Robin or any of the other women Ted has dated? Its just so cheesey. I'm going to be pretty upset if they end it that way, although that seems to be the direction the show is headed. Hopefully we get Barney and Robin's wedding at the end of S8 or the beginning of S9 and can spend most of S9 getting to know her. Frankly, the way they've written the show (and seem to be headed), having Robin NOT be the mother is pretty incredibly lame. They've set her up as the perfect character for it.  Really? You don't want to actually get to know the character we've spent 9 years following the story of? What makes her so special? What makes her better than Stella or Victoria or Robin or any of the other women Ted has dated? Its just so cheesey. I'm going to be pretty upset if they end it that way, although that seems to be the direction the show is headed. Hopefully we get Barney and Robin's wedding at the end of S8 or the beginning of S9 and can spend most of S9 getting to know her. Frankly, the way they've written the show (and seem to be headed), having Robin NOT be the mother is pretty incredibly lame. They've set her up as the perfect character for it.  [deleted] I also think it's possible season 9 will be told from the mother's perspective - and I might actually **enjoy** that. Of course, that possibility comes from the quote from the producers about how we'll never be able to mistake an episode from season 9 for an episode of any other season - it will be DRASTICALLY different. You don't think that's incredibly cliche and anticlimactic at this point? For him to shake her hand or whatever and the show to cut to black? That's such a cop out.  You don't think that's incredibly cliche and anticlimactic at this point? For him to shake her hand or whatever and the show to cut to black? That's such a cop out.  I see what your saying and I think that he should meet the mother at the end of this season and then season 9 be how they fell in love but I seriously doubt that'll happen The season 8 finale is going to be the Barney/robin wedding. Barney even said the date and we know Ted meets the mother at that wedding. It seems to me like the writers were *going* to end the series with Ted simply meeting the mother before they knew whether or not there would be a ninth season. Now that there is. The writers are free to spend the final season telling the story if how Ted and this girl end up together. ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18pukb/how_will_the_show_convince_us_that_ted_is_over/"
  }, {
    "id" : 35,
    "title" : "One of the first shots of the Hoser Hut and there he is",
    "snippet" : "  P.S I love you. I thought it was clever to use of the initials of Paul Shaffer, it was a small a-ha moment on realising it. Didn't even realise this...   Season 4 episode 11~ The amount of detail and little things they put into this story and get it right...  It's like they wrote out nine years ago in 2004, then got everyone together and started filming and put it on the air in 2005.  There was a flash forward with the ducky tie, as needed.  The episode with them watching the trilogy has NPH hiding his left hand so a ring may or may not be visible, just all the little things that won't show up again for years.  And then the accuracy with which they do flashbacks as well.  I'm just blown away time and again. The amount of detail and little things they put into this story and get it right...  It's like they wrote out nine years ago in 2004, then got everyone together and started filming and put it on the air in 2005.  There was a flash forward with the ducky tie, as needed.  The episode with them watching the trilogy has NPH hiding his left hand so a ring may or may not be visible, just all the little things that won't show up again for years.  And then the accuracy with which they do flashbacks as well.  I'm just blown away time and again.  There who is?    Wow...Cobie looks really good in this screenshot. Jason too, matter of fact. Colbie?\n\nEDIT: Above comment was edited after I made this one, prospective downvoters. no, her name is Cobie. Wow...Cobie looks really good in this screenshot. Jason too, matter of fact.   its runcle!  ",
    "url" : "http://i.imgur.com/GlmzMge.jpg"
  }, {
    "id" : 36,
    "title" : "I was out with my friends and at midnight I stood up and shouted....",
    "url" : "http://24.media.tumblr.com/1a89348535faebbe182109ef87fcdbd0/tumblr_mgx9tl4lhE1rd9pz4o1_500.gif"
  }, {
    "id" : 37,
    "title" : "r/HIMYM - What is your wardrobe equivalent to Ted's red cowboy boots?",
    "snippet" : "Ted continues to think he pulls off the red cowboy boots, despite everyone in the gang making fun of him for them. What item in your closet are you convinced works despite all your friends saying otherwise?\n\nFor me, it is a seafoam green western shirt. It isn't so much that it's ugly, but that it's just way too small on me. \n\nIt looks kind of like [this](http://www.google.com/imgres?hl=en&amp;sa=X&amp;tbo=d&amp;biw=1366&amp;bih=653&amp;tbm=isch&amp;tbnid=iJsIRjigvy0GUM:&amp;imgrefurl=http://www.etsy.com/listing/109236435/vintage-seafoam-green-cowboy-shirt&amp;docid=JM7B_B2gBXn86M&amp;itg=1&amp;imgurl=http://img3.etsystatic.com/006/0/5789651/il_fullxfull.374421835_bj8x.jpg&amp;w=1153&amp;h=1154&amp;ei=9hghUfrNJNPU0gGh1oD4Aw&amp;zoom=1&amp;ved=1t:3588,r:3,s:0,i:93&amp;iact=rc&amp;dur=1062&amp;sig=117658934451402949460&amp;page=1&amp;tbnh=187&amp;tbnw=195&amp;start=0&amp;ndsp=23&amp;tx=98&amp;ty=66) only with stitching throughout.  I have [this](http://cache1.bigcartel.com/product_images/69330579/hamburger.jpg) in my closet, and i wear it on pretty much a weekly basis. I still haven't met **any** girl, who thought it was nice. I have [this](http://cache1.bigcartel.com/product_images/69330579/hamburger.jpg) in my closet, and i wear it on pretty much a weekly basis. I still haven't met **any** girl, who thought it was nice. I want one! And you can! http://mrgugumissgo.bigcartel.com \n  I have a jacket covered in butterflies that everyone hates, but they're just jealous.   I used to have a fedora that I wore any time I went somewhere.\n\nMan...what was I thinking?   I used to think I looked cute in a pair of overalls.  I have this blue and white striped sailor shirt. It is weird because it is a regular neckline, but goes as deep as a v neck and has no  neck collar. The complaints have gone from that it looks like a cum blanket to a half incomplete shirt to a glorified rag. They are just jealous that I am PULLING. IT. OFF. \n\nIronically I wore it last night and saw the captain and had to salute and go \"ahoy Captain.\"          Where I live red pants actually became a big thing like two years ago and everyone wears them.   \nI wore red pants for like 4 years and when I started it was something really strange      ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18p727/rhimym_what_is_your_wardrobe_equivalent_to_teds/"
  }, {
    "id" : 38,
    "title" : "If you could choose the mother's name, what would it be?",
    "snippet" : "Something that brings back a reference to earlier in the show?\n\nSomething cheesy like Destiny, Hope or Fate?  Puzzles. Why Puzzles? Why Puzzles?  Her name should be Daria. Her friends call her \"Dary\" (Ted's been waiting for it). Daria Jaysent Daria Jaysent I don't get it  Violet. But wouldn't that go a little oddly with the color theory? Violet (which is basically purple) is the color of breakups. oh yeah.... It's a great name and if the color theory is totally wrong I would love it. If only the colors were opposite.  :P Yeah they need some synonym of yellow. But wouldn't that go a little oddly with the color theory? Violet (which is basically purple) is the color of breakups.     PATRICE!!!!   barney \"That was my first choice too!\"  I'm not 100% sure but I think it's gonna be Tracey because Ted was once talking to a woman at the strip club and she said her stripper name and then said \"but my real name is Tracey\". Then Ted says to his kids \"and that's how I met your mother\" and then said he was joking. Now I say I'm not 100% sure because I'm not sure if the name was Tracey, I'm just trying to go off memory. That was more likely just a joke Knowing HIMYM I highly doubt that They've had plenty of one-time jokes that don't mean anything. Remember time traveling Marshall? I doubt they had the mother's name set that long ago. And they surely wouldn't set Tracy in stone just because of one small scene. This is just like how Barney mentioned Karma a couple of seasons before he met Quinn. They didn't let that one line affect Quinn's/Karma's name. Not to be that guy, but that could have easily been a different stripper named karma. The point is that they are not going to hold themselves to a small line like that.\n\nedit: they never re-use names, so it had to be something they just either didn't realize or decided to disregard. How can you be so sure they don't re use names? Either way karma is an alias. They've never reused names in the past. But the point is that they don't needlessly hold themselves to minor/unimportant details. Except for karma. And yeah but why not?  They've never reused names in the past. But the point is that they don't needlessly hold themselves to minor/unimportant details. On the infographic of all of Ted's exes, aren't there two girls named Hollie and Holly? Who knows where they found out the spelling, but that counts as the same name to me. They've had plenty of one-time jokes that don't mean anything. Remember time traveling Marshall? I doubt they had the mother's name set that long ago. And they surely wouldn't set Tracy in stone just because of one small scene. This is just like how Barney mentioned Karma a couple of seasons before he met Quinn. They didn't let that one line affect Quinn's/Karma's name. But would the trick on his kids still have worked if Tracey wasn't the name he said? The kids ask in an earlier episode why he changed all of the women's names except robins so he would've done the same for Tracey  What episode is this? I don't remember it. Season 1 episode 9 \"Belly Full of Turkey\" That's the episode with Tracy the stripper, I know that, but I mean what's the episode where the kids ask why he changed names? But would the trick on his kids still have worked if Tracey wasn't the name he said? The joke was \"and kids, that's how I met your mother\"  not \"That's how I met your mother, Tracy\". The name was unimportant and just happened to be Tracy. Like I said, it was one line from years ago, not a significant plot point.  Well why use a name at all then? She said her stripper name and then in the part that I'm assuming Ted made up, she said but my real name is Tracy. If my dad were to do that and didn't use my moms name I wouldn't looked shocked, I'd be like: \"But that's not Mom's name.\" I don't know maybe I'm just smarter then Ted's kids and look too far into it. The point is, it was a joke that wasn't meant to be taken seriously. I feel like the person that wrote this joke didn't realize the implications that it would have on the future of the series. That being said, they are not going to hold themselves to a small detail like that. There's plenty of examples of times they have said something as a joke or minor plot point in the earlier seasons that they completely gloss over or disregard in the later seasons.\n\nNinja edit: And sorry for the downvotes, it's not me but it seems like people don't like when others try debating theories that they don't like :/       Audrey Hepburn?   Saffron  May   Another Robin?\n  Oh you mean Yobin. I thought it was Jobin but pronounced yobin? \"Robyn, with a 'y'.\" \"Oh, Yobin.\"\n\nI'm pretty sure it's with a 'Y'. I thought it was Jobin but pronounced yobin?       ",
    "url" : "http://www.reddit.com/r/HIMYM/comments/18o6vu/if_you_could_choose_the_mothers_name_what_would/"
  }, {
    "id" : 39,
    "title" : "Robin Daggers- P.s. i love you",
    "url" : "http://www.youtube.com/watch?v=N_7aUSfMzgI"
  }, {
    "id" : 40,
    "title" : "How I Met Your Mother - The Ashtray (S8E17) - Sneak Peak",
    "snippet" : "  Why is he back? They have better things to be doing!  Well they said they wanted to bring back quite a few minor characters just to see where they are, maybe this is the start of it. I like that idea. Going back and seeing how some of the past characters are doing. Would be fun to see \tHammond Druthers Depends on when they filmed these episodes, he might have been busy doing Breaking Bad. Would be fun to see \tHammond Druthers I like that idea. Going back and seeing how some of the past characters are doing. Well they said they wanted to bring back quite a few minor characters just to see where they are, maybe this is the start of it.     [deleted] [deleted] No commas when going from general to specific. As you can see, I'm horrible with grammar. My apologies. I hope I didn't come across dickishly, I was honestly just trying to be helpful.",
    "url" : "http://www.spoilertv.com/2013/02/how-i-met-your-mother-episode-817_2044.html"
  }, {
    "id" : 41,
    "title" : "Best moments of season 1: Confessions of a HIMYM Fan",
    "snippet" : " ",
    "url" : "http://confessionsofahimymfan.blogspot.com.au/2013/02/the-best-moments-of-season-1.html"
  }, {
    "id" : 42,
    "title" : "I knew I recognized that kid from the Super Bowl GoDaddy commercial...",
    "snippet" : "  [He has been in a lot of things.](http://www.youtube.com/watch?v=IdEBu7ODVk8) As much as I've seen him in one scene or two in some random episode of some random show, I was happy to see him in episode after episode of Chuck. This for sure, man. I think he had a line in the finale? like his only one in the whole series haha.   I just saw him in yesterdays (In America/Canada) episode of Big Bang Theory. Came in here to say the same thing.  Same.    ..And the fact that somebody else posted something about him, with almost this exact same picture, in this exact subreddit just a few hours ago, isn't what reminded you?\n\nhttp://www.reddit.com/r/HIMYM/comments/18k3ea/hot_dog_buying_guy_has_totally_moved_up_in_the/  He did an AMA a few months ago.         How old is that kid?         He also was in the last episode of the big bang theory     he's moving up in the world!   He was also in the big bang theory I believe ",
    "url" : "http://i.imgur.com/u9MNo4i.jpg"
  }, {
    "id" : 43,
    "title" : "If Barney had a melon farm...",
    "snippet" : "   No one post any more things like this. \n\nExample: 7up.  I bet Barney does have a melon man though. ",
    "url" : "http://i.imgur.com/9MOWOor.jpg"
  }, {
    "id" : 44,
    "title" : "I'm pretty sure you'' all appreciate this.\nTop 10 Grunge Bands Of All Time",
    "snippet" : "  I was hoping for The 4 Skins - Murder Train. The surprise was alright with me.  Well, I love the HIMYM reference, but there's no way in hell Alice in Chains was better than Nirvana. I'll go so far as to say they wouldn't have even gotten that popular without Nirvana. Well, I love the HIMYM reference, but there's no way in hell Alice in Chains was better than Nirvana. I'll go so far as to say they wouldn't have even gotten that popular without Nirvana. Well, I love the HIMYM reference, but there's no way in hell Alice in Chains was better than Nirvana. I'll go so far as to say they wouldn't have even gotten that popular without Nirvana. I dislike Nirvana and believe it is way over played. I love Alice in Chains. Honestly though, I think it is all about Collective Soul. They weren't really Grunge though. It's not a matter of personal preferences or who gets played more or less, it's about who's honestly better, and who had more impact over time.            ",
    "url" : "http://www.ultimate-guitar.com/news/entertainment/top_10_grunge_bands_of_all_time.html"
  }, {
    "id" : 45,
    "title" : "How I Met Your Mother 8x17 Promo \"The Ashtray\" (HD)",
    "snippet" : "  Did I see The Captain? Did I see The Captain?  Interesting that it will be a flashback sorta episode - we may be seeing lots more of these as we get closer to the wedding date. \n\n\"How I Met Your Mother 8x17 \"The Ashtray\" - When Ted receives an unexpected call from The Captain, the gang reminisced about their last awkward encounter with him, on HOW I MET YOUR MOTHER...\" Yeah, I wonder if this has something to do with the mention of The Captain on that magazine cover.  Marshall sounded pretty serious about that fight...I'm kinda scared Also pretty serious about doing it. ",
    "url" : "http://www.youtube.com/watch?v=jkMKxNZPJCU"
  }, {
    "id" : 46,
    "title" : "GF left me love notes for Valentines Day. I say she's a keeper.",
    "snippet" : "  This has Dobler/Dahmer potential. Also reminds me of OAG. That's all out of context though. In reality it sounds like it was sweet. Am I evil for thinking it all depends on who is out of who's league? Am I evil for thinking it all depends on who is out of who's league? No doubt I'm probably way out of her league Why do you say that? Why do you say that?  Must dump her, OP. She's a liar.\n\nNobody loves anything more than Barney loves being awesome.\n\nTrue story.    Robin sparkles doesnt like going to the mall Not anymore, that is.      ",
    "url" : "http://imgur.com/8qkgLtZ"
  }, {
    "id" : 47,
    "title" : "President Lyndon Johnson asked his wife to marry him on their first date. Ted could learn something",
    "snippet" : "   ",
    "url" : "http://blogs.archives.gov/prologue/?p=11686"
  }, {
    "id" : 48,
    "title" : "One of the most subtle jokes I've ever seen on this show",
    "snippet" : "  My favorite subtle joke is in Little Boys when Ted says what Barney said was \"stuck in his head like a Chumbawamba song\". And Marshall asks which Chumbawumba song My favorite one is when Marshall gets stuck on the roof of his house setting up lights because some punk ass took his ladder away and took over his house. He looks in through the skylight and see the kid eating a sandwich.  There's a hidden joke? The scene is played very straight so I didn't realize the kid is suppose to be getting high until the second viewing.  My favorite subtle joke is in Little Boys when Ted says what Barney said was \"stuck in his head like a Chumbawamba song\". And Marshall asks which Chumbawumba song Explanation? They're a one-hit-wonder They're a one-hit-wonder Oh, right! I didn't get this at all. (I have five Chumbawamba albums - until I looked up their discography details just now I didn't realise how little-known they are in the mainstream...) Oh, right! I didn't get this at all. (I have five Chumbawamba albums - until I looked up their discography details just now I didn't realise how little-known they are in the mainstream...) Oh, right! I didn't get this at all. (I have five Chumbawamba albums - until I looked up their discography details just now I didn't realise how little-known they are in the mainstream...) Hipster much? I liked this band BEFORE HIMYM made a subtle joke about them. They're a one-hit-wonder Baahhh this one hit me hard.  I got Tubthumping as a gift when I was 8 or 9 years old.\n\nDrip Drip Drip is a far superior song but I get really mean glances when I mention that I know (let alone enjoy) a different Chumbawumba song.\n\nEDIT: Just listened through the entire album again.  Holy shit that was amazing. They're a one-hit-wonder  Explanation..? Found this on Google:  \nhttp://www.urbandictionary.com/define.php?term=yard%20sale  \nBecause \"everything went\". I thought it was called a yard sale because all your stuff was spread out on the ground, like at a yard sale. But I don't ski, so.  I thought it was called a yard sale because all your stuff was spread out on the ground, like at a yard sale. But I don't ski, so.  Found this on Google:  \nhttp://www.urbandictionary.com/define.php?term=yard%20sale  \nBecause \"everything went\". I still don't get it. :-/ Okay, so I'm not American but Aspen is obviously famous for skiing. So when you are skiing and if you fall over and lose all of you skiing gear (skies, poles, hat, goggles) while sliding down the hill, it's called a 'yard sale' in skiing, because everything you had on you went away.  \nWe conclude: Aspen Yard's Ale = Aspen yard sale, a 'yard sale' while skiing in Aspen. It's not that big though. Okay, so I'm not American but Aspen is obviously famous for skiing. So when you are skiing and if you fall over and lose all of you skiing gear (skies, poles, hat, goggles) while sliding down the hill, it's called a 'yard sale' in skiing, because everything you had on you went away.  \nWe conclude: Aspen Yard's Ale = Aspen yard sale, a 'yard sale' while skiing in Aspen. It's not that big though. Okay, so I'm not American but Aspen is obviously famous for skiing. So when you are skiing and if you fall over and lose all of you skiing gear (skies, poles, hat, goggles) while sliding down the hill, it's called a 'yard sale' in skiing, because everything you had on you went away.  \nWe conclude: Aspen Yard's Ale = Aspen yard sale, a 'yard sale' while skiing in Aspen. It's not that big though. Okay, so I'm not American but Aspen is obviously famous for skiing. So when you are skiing and if you fall over and lose all of you skiing gear (skies, poles, hat, goggles) while sliding down the hill, it's called a 'yard sale' in skiing, because everything you had on you went away.  \nWe conclude: Aspen Yard's Ale = Aspen yard sale, a 'yard sale' while skiing in Aspen. It's not that big though. Okay, so I'm not American but Aspen is obviously famous for skiing. So when you are skiing and if you fall over and lose all of you skiing gear (skies, poles, hat, goggles) while sliding down the hill, it's called a 'yard sale' in skiing, because everything you had on you went away.  \nWe conclude: Aspen Yard's Ale = Aspen yard sale, a 'yard sale' while skiing in Aspen. It's not that big though. But what's the actual joke? Explanation..?      ",
    "url" : "http://i.imgur.com/ZVRMtOr.jpg"
  }, {
    "id" : 49,
    "title" : "Lily sure had a great plastic surgery...",
    "snippet" : "  And when you say plastic surgery, you mean haircut? More like she didn't cut her hair after that since she had short hair in 2029 and long hair in 2030. You call the way one wears their hair a 'haircut' don't you? If there is a better english word I'm not aware of, please tell me! You call the way one wears their hair a 'haircut' don't you? If there is a better english word I'm not aware of, please tell me! Hairdo.\n\nBut I was referring to how in one she has short hair and in the other one long hair. She couldn't possibly wear those hairdos with the same short hair, but I could be wrong. You call the way one wears their hair a 'haircut' don't you? If there is a better english word I'm not aware of, please tell me! Hair style? Just guessing here, english isn't my first language.  You call the way one wears their hair a 'haircut' don't you? If there is a better english word I'm not aware of, please tell me! Hairstyle or hairdo, because haircut implies the hair was actually cut. The hair was differently cut, not just differently styled or done. Wouldn't therefore the term *haircut* be more precise? If I say I got a haircut, it would imply I recently cut my hair.  But in the picture, it was obvious that she let her hair grow out, since it was short in 2029 and then long in 2030.  If she had cut it, it'd be even shorter. I always assumed there is a difference between 'getting a haircut' as the act of cutting hair and 'haircut' as the manner in which one's hair has been cut. Using the 'haircut' to mean that might be slightly ambiguous, but 'hairstyle' means exactly that.  So 'hairstyle' would be the preferred word.\n\nThis also may vary in different regions, so I should clarify that I'm in New York. Thank you! I probably made incorrect assumptions about the use based on how the translation would be used in my mother language. You call the way one wears their hair a 'haircut' don't you? If there is a better english word I'm not aware of, please tell me! And when you say plastic surgery, you mean haircut? I failed to take good screenshots, but in the respective episodes you can clearly see she has more wrinkles in the first picture than in the second.\n  Yeah, because Ted is the most trustworthy narrator ever. And also, IT'S A TELEVISION SHOW! And also, IT'S A TELEVISION SHOW! Psh, if you build the entire premise of your show around continuity and then consistently mess up the continuity the fans are going to be mad. Yeah, because Ted is the most trustworthy narrator ever. Yeah, because Ted is the most trustworthy narrator ever. How does his narrating matter on something like this?!\n\nBesides, Ted wasn't telling that 2029 story. Anything in that happens in the show is being told to Ted's kids. Have the writers confirmed this? I haven't read much interviews and Ijust want to be sure. Yeah, in fact we've heard Ted tell us the opposite. For example when Robin is telling Ted why he's better than Gael (\"you're bigger\") we get to see that, but then Ted says to the kids, \"I can't remember what she told me, but I'm sure it wasn't something macho or immature\" etc. So it is definitely fair to assume that we are seeing more of the story than Ted's kids are hearing.  But he mentioned that he wasn't telling the whole story.... He does that on multiple instances too. It would actually prove the opposite of what you said. I don't think we have to assume that Ted tells the kids every single time he skips over something in the story he tells them.  Yeah, in fact we've heard Ted tell us the opposite. For example when Robin is telling Ted why he's better than Gael (\"you're bigger\") we get to see that, but then Ted says to the kids, \"I can't remember what she told me, but I'm sure it wasn't something macho or immature\" etc. So it is definitely fair to assume that we are seeing more of the story than Ted's kids are hearing.  How does his narrating matter on something like this?!\n\nBesides, Ted wasn't telling that 2029 story. Yeah, because Ted is the most trustworthy narrator ever. Still, they usually put more attention on the continuity between the episodes. No, there are lots of continuity errors in the show. No, there are lots of continuity errors in the show.  I want to know why Lily and Robin sound exactly the same in seventeen years but suddenly Ted sounds like Bob Saget. I like the idea that the Bob Saget voice is how Ted hears himself talk. I want to know why Lily and Robin sound exactly the same in seventeen years but suddenly Ted sounds like Bob Saget. Her voice was a bit more deeper in the last few flash forwards. more.. deeper... what are you doing I want to know why Lily and Robin sound exactly the same in seventeen years but suddenly Ted sounds like Bob Saget. What if we have been just watching a different version of  Bob Sagets life before Full House I want to know why Lily and Robin sound exactly the same in seventeen years but suddenly Ted sounds like Bob Saget.    she used magic Plus, her husband can travel through time, lol  she used magic [deleted] Tara*  Yeah, that bothered me. They normally do a good job of aging the characters in \"flash-forwards\" (...well, I suppose they are still flash-backs. But not quite as far back), but this time, they didn't bother.  Yeah, that bothered me. They normally do a good job of aging the characters in \"flash-forwards\" (...well, I suppose they are still flash-backs. But not quite as far back), but this time, they didn't bother.  I thought it was more for comedic affect that they didn't age either of them.    The Hilary Clinton haircut was in style in 2029.   Remember this is Ted recalling all of this.\n\n*Ted.* Yeah save that Ted wasn't there for those future conversations. So no THAT was the show just showing other shit. Like the reunion.   I guess they moved again in that year also. I guess they moved again in that year also.            I love her, but going back to the first season, she looks to have aged kind of horribly for only 8 years ago. The others are all about on par, with Robin looking hotter if anything, but Lily's face looks like an old punching bag or something.\n\nlol, downvotes. wow. keep em coming sweet things. \n\nwow -15! I want to thank Jesus, the pope, and Ron Paul I love her, but going back to the first season, she looks to have aged kind of horribly for only 8 years ago. The others are all about on par, with Robin looking hotter if anything, but Lily's face looks like an old punching bag or something.\n\nlol, downvotes. wow. keep em coming sweet things. \n\nwow -15! I want to thank Jesus, the pope, and Ron Paul I agree completely. The past three years has been rapid downhill for her. Cobie looked a little rough after her kid, but is back now. Jason is looking really fit too now after being rough for a couple years. NPH and Josh are timeless. I think Jason gains and loses weight based on what's going on with his movie career. I agree completely. The past three years has been rapid downhill for her. Cobie looked a little rough after her kid, but is back now. Jason is looking really fit too now after being rough for a couple years. NPH and Josh are timeless. Who's Josh? You mean Ted?  Yup Ted... played by Josh Radnor I love her, but going back to the first season, she looks to have aged kind of horribly for only 8 years ago. The others are all about on par, with Robin looking hotter if anything, but Lily's face looks like an old punching bag or something.\n\nlol, downvotes. wow. keep em coming sweet things. \n\nwow -15! I want to thank Jesus, the pope, and Ron Paul I love her, but going back to the first season, she looks to have aged kind of horribly for only 8 years ago. The others are all about on par, with Robin looking hotter if anything, but Lily's face looks like an old punching bag or something.\n\nlol, downvotes. wow. keep em coming sweet things. \n\nwow -15! I want to thank Jesus, the pope, and Ron Paul",
    "url" : "http://i.imgur.com/FuOkEC0.jpg"
  } ],
  "processing-time-source" : 80,
  "processing-result.title" : "himym2_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/himym2_reddit.xml"
  }
}