{"processing-time-total": 1400, "processing-result.title": "irishproblems0_reddit.xml", "documents": [{"snippet": "There is no greater guilt.    I once raided mine for a pint.\n\n\nI regret nothing. A pint of the black stuff? ", "url": "http://www.reddit.com/r/irishproblems/comments/196xhg/i_had_to_take_money_from_the_trócaire_box_this/", "id": 0, "title": "I had to take money from the Trócaire box this morning to make up my bus fare."}, {"snippet": "  At least you woke up, a hell of lot better than waking up dead. I might be dead, I need to listen to South East Radio to see if I am dead.\n\nHen parties are crazy, the bride to be was dressed in tin foil at one stage, and not good when your daughter walks in on the conversation about how many vibrators we have!!! She left then. I'd like to meet the daughter. She sounds like a responsible person. From my bartending time Hen and Stag parties were generally the worst That was on the pre-hen party the main event is next weekend and we are going to Carlow for the weekend.\n\nThe daughter is sensible, I do not know where I got her from, I think maybe I brought home the wrong baby from the hospital. TIL that there are pre-hen parties. Holy God! That's feckin' mad altogether! Holy god is right, I fell home at 5 this morning. Thank fuck the bf is a taxi driver. \n\nPre-hens are mad, our mammies and one of our grannies where dressing up in a suckey in knickers. &gt; our grannies where dressing up in a suckey in knickers.\n\nI really really don't want to know what that means.\n\nPlease please for the love that all is holy, don't enlighten me. Thanks.  One of my friends was out in Wexford last night. Not sure if Wexford town or Enniscorthy. The last time he text me last night he said he had just fallen in love. I apologise if it was one of your group that stole his heart.   Wrong sub-Reddit lad....this one here is for Irish problems not successes!! Can I complain about my selection of burises?  why of course you can, so long as you didn't have to much fun getting them!  You fornicated with Greg.  Due to drink, now me and Greg and going to be parents, as he is against contraception. Niamhish shall be Godmother. Should I ask you or Carrots to be godfather? It might be the ideal time for then to get together, what do you think? I think carrots would be an ideal choice.\n\nAfter all, he is a reverend . You and Niamhish godparents and Carrots can baptise the child. I'm now charging €250 per gig and there's a bottle of Smirnoff and a box of Tayto on my rider. I am sure Greg will pay. I will supply the vodka and Tayto, I have vodka in the babies bottle, start them early. Have you decided on a name for the new arrival? I believe Mahommed is quite popular these days.", "url": "http://www.reddit.com/r/irishproblems/comments/194o3d/i_woke_up_drunk/", "id": 1, "title": "I woke up drunk."}, {"snippet": "It is bad enough that they get money, cars and holidays but they get to keep their dignity as well.   But they might get a ^streak y bacon for a sanwich an' cuppa tae to relax the nerves after getting a *streak* o luck? Do ya mean that behind the scenes it is a hotbed of sleaze.  Jaysus, I might actually watch it if Katherine Thomas ran around in the nip every once and a while. Is she still on that or is she still beating tubbies around the field with a shtick?", "url": "http://www.reddit.com/r/irishproblems/comments/193iez/on_winning_streak_nobody_actually_streaks/", "id": 2, "title": "On Winning Streak nobody actually streaks. "}, {"snippet": "I realise that we have an on and off relationship, and that is off when I can avail of better services, but considering we are stuck with each other for the moment I thought it might be good to clear the air.\n\nI realise that you can only estimate the speeds with which you provide your broadband services, but when I can see the exchange from my bedroom window those excuses ring extremely hollow.  Perhaps you are using a different measuring system and the 8 MB you are talking about are not the expected standard?  Either way, I think it would be best for both of us if you were realistic in your estimation.  It also irks me to have a bill every two months charging me for 8 MB services that don't exist.\n\nAlso, I understand that you think it fantastical that anyone would ever try to use anywhere near their allotted amount of internet but when I do, I would appreciate you not spamming RESET packets to my router.  My router is old and gets confused easily, this necessitates lots of resets and I really don't think that it is fair to do that to old equipment that is only trying to do it's best.\n\nOn the subject of spamming, I would also appreciate you not trying to remotely log into my router.  Even when I used your POS equipment, I turned remote administration off.  My firewall treats your repeatedly failed attempts to log in to a piece of hardware that doesn't exist as an attack and closes some really important and useful ports.\n\n\nLastly, please stop traffic shaping.  It's really obvious and unnecessary.  ADSL is by design, not subject to contention until it hits your DSLAM's at the little green box.  If you are unable to provide a service even though you rolled out fibre to almost every junction, stop pretending you have Next Generation anything.  \n\nI can't quit you (literately) so please help,\n\nyours in everlasting hope,\n\nmdnrnr   I work for a company that sells eircom's stuff, so for the millionth time today, I am sorry they are so hilariously, completely incompetent. My friend, that is not your fault.  I'm glad you are gainfully employed.  And if you work in a public facing support position then double hugs for you.\n\nI actually know lots of people that work for Eircom, trying to identify why they can't provide a really basic service that lots of other companies provide is mysterious and exciting.  Don't fuck up the mystery for the rest of us.  I pay them money each month just to see how incompetent they can be within 30 days,  if you explain it then I'm just stuck giving them money.  Quit ruining it for the rest of us. Oh I wouldn't presume to. What knowledge I've gleaned from the periphery of the beast over the years is quite enough to let me know that I don't want to know how deep the rabbit hole goes, but I do know it's an amazing entity to behold.  I am on one of their 3MB max lines, they tried and succeeded to get my Mother to upgrade to 8MB internet to avail of quicker speeds.\n\nI despair that UPC will never roll out their fibre network to where I live.  I feel your pain, but can you help me out and tell me how to disable the remote administration? ", "url": "http://www.reddit.com/r/irishproblems/comments/1916uq/dear_eircom/", "id": 3, "title": "Dear Eircom..."}, {"snippet": "Should I paint the horses in the field black with white stripes or white with black stripes?   So tasty. They're just horses with 'go fast' stripes though. Do not mention food. Fucking hen parties. I can't move. Was chicken on the menu?  Use the stripy paint.", "url": "http://www.reddit.com/r/irishproblems/comments/190swv/i_want_a_zebra_now/", "id": 4, "title": "I want a zebra now."}, {"snippet": "  www.tetrisfriends.com is a ridiculously dangerous site for tetris addicts like myself.\nI've given up on recovery. The 12 steps just never fit right.  You need a new hobby. I swear its herself who is playing against me. Is she distracting you while you are playing? I think she is Tetris. \n\n ^cock blocking you from winning? :'( Psychology its devastating and is hammering my hormones I think she is Tetris. \n\n Oh she is an evil master, probably should be mistress. &gt;mistress.\n\nMiss Tetris. Ha ha, you need to up your game. I am the victim here. You need counselling.", "url": "http://www.reddit.com/r/irishproblems/comments/18zfjk/tetris_keeps_beating_me/", "id": 5, "title": "Tetris keeps beating me"}, {"snippet": "I don't think anyone likes me!  Stop giving a shite about those imaginary internet points and just participate positively and have fun.\n\nIf people on reddit knew all the things I do/have done on reddit through PM's I'd be a feckin' karma gabillionaire. I'm not interested in gaining imaginary internet karma, I prefer to do it in real life.  You really think so Box of Karma?  [Said Mr downvote hell](http://www.reddit.com/r/irishproblems/comments/154591/my_downvote_hell/) My first two days on reddit I had 140 downvotes. \n\nGood days  [Well so far you've gotten 349 upvotes from me.](http://i.imgur.com/6y6fngN.jpg) Thanks , I can't look up those things. \n\n Do you not have RES? No, I was afraid ! Get it installed: http://www.reddit.com/r/Enhancement/ it enhances your reddit experience and allows you to o so much to make redditting more enjoyable by filtering out the crap.  Boy are you lucky that this is a self post.  why? You can't gain or lose karma for it. Oh i always do self posts But but...why are you complaining about karma then?  Not [everyone](/u/gregorybarnes)", "url": "http://www.reddit.com/r/irishproblems/comments/18vywp/everyone_has_more_karma_than_me/", "id": 6, "title": "Everyone Has More Karma Than Me!!!!!!"}, {"snippet": "No reason here. Just wanted to rant. \n\n  I find FUCK, SHIT, BOLLOX, WHORE to be a great rant. For focks sake man. How in the fucking name i was supposed to bloody remember that when i was doing my rant! Tis the best rant I know and practice make perfect.    Here, no need for that kinda language. Disgrace. What if your mother heard you!? Jaysus man, please don't tell mi mam. She'd kill me if she'd know i'm cursing publicly.  Two-buck ,egg-sucking mother fuckers all up in my cheeser need to back the fuck up afore I bust a round in their pie-hole.(greetings from Colorado, hope your day improves.) Errr... /r/irishproblems probably has no idea what that tirade meant (at least I feckin' didn't), but welcome Colorado person anyway for commenting so eloquently.\n\n*Quickly shuffles through the myriad pages and tomes of the /r/irishproblems comment rules and finally gives up saying \"Feck it anyway, yer grand like, but [\"Don't Take Your Guns To Town Son, leave your guns at home\".](http://www.youtube.com/watch?v=KMMp_llzBT4)* I am currently at home, so this is acceptable..to clarify my initial posting , let me break , break, break it down(&lt;-- old hip-hop reference)\n\nTwo-buck ( refers to the lambasted party as cheap , or unworthy) ,egg-sucking( cuz , eww) mother fuckers( pretty self explanatory) all up in my cheeser ( having invaded my personal space, my face, that which gets it's picture taken while saying \"cheese\")need to back the fuck up( need to remove themselves from my personal space) afore I bust a round in their pie-hole.( Before the need to shoot them in the mouth orifice becomes necessary)* it should be noted that while often threatened in a  light-hearted manner, it is typically frowned upon, even in America, to discharge ones firearm  into people* \nHope this helped  &gt; Hope this helped\n\nI'm still feckin' mystified. Don't worry, I don't require any further explanation as I'm not very interested anyway. Sorry..what? I wasn't paying attention..  ", "url": "http://www.reddit.com/r/irishproblems/comments/18tvkr/fuck_you_fuck_you_too_and_fuck_you_as_well/", "id": 7, "title": "Fuck you, fuck you too and fuck you as well."}, {"snippet": "I marked out my plot in the graveyard and while ago, I went up there today and someone had taken out my post and put down blocks and a bit of cement with their initials on it.  This brings new meaning to \"would you steal my grave as fast?\" It sure does, now all I have to do is wait for them to die first so I know how stole it. Did you buy your plot?  Nope you just mark it out.  And do you register ownership? \n\nThey cost 2 or 3 grand most places so claiming a plot might be useful . You just mark it and hope? Nobody needs it before you. However its a local graveyard for local people. It is one of the very few I think that are still free. If all else fails I will have to go in with my father. Are you going to retaliate Find out who did it, and book the hospital bed they plan to have their child in. That'll show 'em That would mean I would have to have a baby. The bf would love that  Are the gardaí looking into it and treating it as a grave offence? They are going grave to grave as we speak to check for witness, but no one is saying a word.", "url": "http://www.reddit.com/r/irishproblems/comments/18txo2/my_grave_was_taken/", "id": 8, "title": "My grave was taken."}, {"snippet": "   While having the same ingredients, a bag of coal is not a ladies best friend. Says you!  I'm guessing the bag of coal from Santa was a bit more than a threat in your house. Add a hot water bottle and they make some pretty realistic humans to lie in bed with. I really, really didn't need that image. *furiously cuddles coal bag Only an Irish person could make a dakimakura out of coal. We're pretty freaky! ", "url": "http://www.reddit.com/r/irishproblems/comments/18u24a/i_have_a_pile_of_diamonds_lying_about_and_nobody/", "id": 9, "title": "I have a pile of diamonds lying about and nobody to give them to..."}, {"snippet": "  You know what'll make you feel better? A nice cup of tea.  They don't have Barrys Tea . Ah I'm a Lyons girl now myself.", "url": "http://en.wikipedia.org/wiki/List_of_countries_by_tea_consumption_per_capita", "id": 10, "title": "Everyone associates tea with the English, but we drink much more tea :("}, {"snippet": "All the other countries get to have right wing nationalist parties, and it's just not fair.  See! Told you we needed a Fascist party!\n\nSeriously, vote me in. I'll introduce badass uniforms and 'summer' camps.  Scotsman here.  I know your pain.  Ha! As a socialist, I have the exact same problem! The \"exact same problem\"? Or do you mean a similar but inverse problem? What do you think, pedant? What do you think, pedant?   ", "url": "http://www.reddit.com/r/irishproblems/comments/18pnef/who_are_you_supposed_to_vote_for_in_this_country/", "id": 11, "title": "Who are you supposed to vote for in this country if you're a nationalist, but not a Marxist/Socialist?"}, {"snippet": "It could be the cataracts though...  Specsavers are doing a twofer deal at the moment or you could just turn off the subreddit style. [Ooooohhhhhhh](http://gifsoup.com/view/3948027/shooting-stars-handbags-ooooh.html)  I think you're confusing subreddit flairs with solar flares.", "url": "http://www.reddit.com/r/irishproblems/comments/18o0qx/all_this_extra_flare_in_irish_problems_hurts_my/", "id": 12, "title": "All this extra flare in Irish Problems hurts my eyes"}, {"snippet": "I gave up stupid arguments with strangers about football. I knew it was going to be hard but I thought I would make it longer than this.   I know a guy named Paul who is big into football arguments. Have we met before?  I've given up arguing with strangers on Reddit for lent, it's so hard, there's just so many stupid people out there.    Give up football instead? One doesn't simply give up the football. Its not like smoking or that cocaine stuff. Give up football!? Ya mad yoke. Oh right, would it be like me giving up buying shoes? It would be like you giving up *wearing* shoes. We might have to fall out if you keep saying those things. Football is more like crack cocaine or methamphetamine. \n\nShoeloving is like yoga. Yoga I have never done. I went power hooping last week. I killed me. I hurt my back doing pilates. I had to have lots of massages afterwards.  Any excuse for Mrs CDfm having to \"massage\" you. \n\nThe physio for my shoulder involves massages, oh its lovely.", "url": "http://www.reddit.com/r/irishproblems/comments/18n0o6/ive_already_failed_at_lent/", "id": 13, "title": "I've already failed at lent."}, {"snippet": "Instead I ended up buying Dutch Gold 12 pack for 12.75euro... \n\ngawd I miss the cheap 79cent lager....:(  I wasn't aware of the situation, this is terrible news.  I am off the vodka, but I bought bottles of miller for a euro each in the local centra. That works out to about €3 per litre. That ain't cheap woman!  I miss Quinnsworth yellow pack beer, in proper pence.  God I'm so old. I miss Quinnsworth yellow pack beer, in proper pence.  God I'm so old. So am I, but I never drank that stuff.   Pfft. I just got proper 'Murican Badwiser yesterday from my local Tesco's for 70 cents a can. \n\nYup. that's right. They made a mistake when during Christmas time and ordered too much of that shite. \n\nGuess who empties the shelves? ^WAAAAZZZZZZAAAAAAAAAAAAAA!!!!!!!\n\nsorry could not resist.... \n\nbut 70cents, golly gee... dat's a gud price.... \n\nbut hold on... nvm... :P well, go check out nutgrove tesco if they still have stuff left :)", "url": "http://www.reddit.com/r/irishproblems/comments/18lyy1/no_dunnes_stores_cheap_79cent_lager/", "id": 14, "title": "No Dunnes Stores cheap 79cent Lager"}, {"snippet": "I didn't have the heart to correct him.\n\nEdit: [Here's a picture of me with the newlyweds](http://i.imgur.com/qNRBbM8.jpg). The ceremony took place in the ruins of the Adare Manor Abbey. I was really nervous doing the ceremony and I fluffed a line when I was reading from the prepared script.\n\nThe ceremony was wonderful and to me as an old jaded cynic it gladdened my heart to marry a couple so obviously and madly in love after being in a nine year relationship. I had a great time with the couple and their friends down in Adare Manor and was honoured and humbled that they trusted me to officiate at their wedding here in Ireland.\n\nAnother thing re the Italian MD: when I went to the gents, on my way back into the dining room the MD said to me: \"Welcome back father\". Another thing that weirded me out a bit: a bottle of wine was ordered for the table: The MD poured a taste for one of the ladies and when she said \"Ok it's good\" he poured wine for all the three ladies at the table and then came around the table and poured wine for me before pouring wine for the other men at the table.\n\n\n\n  You should have planted a forest on their grounds overnight to teach them to have some respect, reverend. I did steal some acorns. I am shocked that the Metro newspaper has not identified you as a religiously motivated domestic terrorist yet.  I eagerly await the next edition of the Evening Herald, which is totally not the same newspaper at all and is in fact the last bastion of right thinking people who happen to travel on public transport.  The Sun have offered me £52.23 to appear on page 3 in my ~~ex-girfriend's~~ knickers and express my opinions in a monosyllabic 14 word speech bubble.\n\nThe temptation is killing me......  Could it be that he's a Baby Carrot?  Don't be trying to butter him up. I am not dangling anything  So what's your schtick? A carrot stick can be a tasty alternative to celery. As the nun said to the priest at the wedding in Adare \"Carrots are nice but I couldn't eat a whole one\". There were no nuns at the wedding. I' m going to post a photo when I get home from the pub as I'm celebrating my 21st birthday tonight  (again)  I am confused. Are you the priest or the guy with the rose in his hand? I'm the Reverend (my legitimate title), the little guy in black with the short hair on the left beside the wonderful newleyweds. Oh right. My vision of you was very tall and skinny with longish hair. One of my good friends is a reverend in the arse end of Kerry.  Your vision of me is obviously wrong! I'm 'trim' with recently cut long hair and as evidenced by the photo I'm not terribly tall, but shure I don't give a shite about it. I had a fantastically great time with the couple and their friends from all over who came to the wedding.\n\n^^They ^^bought ^^me ^^a ^^year ^^of ^^reddit ^^gold! ^^^Woohoo! Oh go you with your reddit gold. Will we now have to pay to talk to you? I thought you were a Pete Dotherty type. But his cousin is staying in my house tonight.  Now that I've performed my first wedding ceremony which I have now scratched off my bucketlist I'll have to consult with my new agent, new manager and new accountant about charging for my next wedding ceremonies.\n\nAnd shtop it you, ya begrudging fecker 'cos they bought me reddit gold ***for 12 months***..... You know, this doesn't really count for \"marry someone\" on your bucketlist. Feck off you!! Semantically \"marry someone\" has two different meanings. It's explained in the \"Now You Are A Reverend With the U.L.C.\" booklet. I married two wonderful people on St. Valentine's Day, though I doubt very much I myself will marry (get married to a woman) in the near future. Have you not seen the state of my teeth? &gt; I married two wonderful people on St. Valentine's Day\n\nPolygamy! Well I never. Your vision of me is obviously wrong! I'm 'trim' with recently cut long hair and as evidenced by the photo I'm not terribly tall, but shure I don't give a shite about it. I had a fantastically great time with the couple and their friends from all over who came to the wedding.\n\n^^They ^^bought ^^me ^^a ^^year ^^of ^^reddit ^^gold! ^^^Woohoo! I am still in shock your a reverend. So if I die, while we are still redditors I expect you to be at my funeral telling my parish priest to Fuck off and bury me without all that crap. I want teenage kicks being played while I am going into the ground. \n\nI will be the funeral of your bucketlist. I'm an ordained Reverend Doctor with the U.L.C. and [this song, *I did it my way*](http://www.youtube.com/watch?v=HD0eb0tDjIk) is what I want played at my funeral. Ha Sid. My ex husband was a proper mochian, safety pins in his ears wearing punk. He spent many nights in the 100 Club.  100 club in London? I've been to some great gigs there.... Yep. So did he. Then he discovered heroin.   A few questions. How did you get to be a \"reverend\", are the weddings legal and did you leave home dressed as a reverend/how does your Ma react? We need answers!!!!  The public have a right to know.  Frankly I am shocked. I was even more shocked in my drunken stupor last night. And there is evidence that he answers to the name \"Father\".\n\nWitnesses say when asked *more wine Father* that he said *Yes*. Yes, I want to know why he is a Reverand, how he became one and should Niamhish apply to be his Mrs Doyle. We deserve to know and the world deserves to know if Niamhish can make cups of tea on demand.  I don't think she can, but I am sue she can make hot whiskey instead or Jack and coke. It's a holy calling. A few questions. How did you get to be a \"reverend\", are the weddings legal and did you leave home dressed as a reverend/how does your Ma react? I was ordained on www.ulc.org The wedding is not legal in Ireland but would be in certain states of the US, they will marry on their return to Pennsylvania in a registry office. I did leave home dressed as a reverend and it was odd seeing the double takes from people as I was rolling my ciggies in various places. People were very deferential to me and the best was the Italian MD. My ma is in Spain but I did text her a photo, they'll be sending pics of the ceremony when they get back to the States.\n\nJustin posted on /r/ireland a few months ago about getting a humanitarian wedding in Ireland but the guy they were referred to was too expensive for them and I offered to do it for free, refusing payment for my own transport costs.\n\nI had a great time and I'll treasure the memory. I just signed up with ULC now. Something to add to the CV I guess. I was ordained on www.ulc.org The wedding is not legal in Ireland but would be in certain states of the US, they will marry on their return to Pennsylvania in a registry office. I did leave home dressed as a reverend and it was odd seeing the double takes from people as I was rolling my ciggies in various places. People were very deferential to me and the best was the Italian MD. My ma is in Spain but I did text her a photo, they'll be sending pics of the ceremony when they get back to the States.\n\nJustin posted on /r/ireland a few months ago about getting a humanitarian wedding in Ireland but the guy they were referred to was too expensive for them and I offered to do it for free, refusing payment for my own transport costs.\n\nI had a great time and I'll treasure the memory. *Carrots is the food of love* ", "url": "http://www.reddit.com/r/irishproblems/comments/18l218/the_italian_mâitre_dhôtes_at_adare_manor_for_the/", "id": 15, "title": "The Italian Mâitre D'hôtes at Adare Manor for the after wedding dinner I officiated at kept referring to me as 'father' when in fact I'm a reverend."}, {"snippet": "Not just ordinary cranky but super cranky   Have a yam, it will make you feel better.  Me too n'all. Gave up the smokes. Would love to do that. \n\nI got a Chinese last night -beef in black bean and it tasted of fish. \n\nCan still taste it. ...well *that* doesn't sound right...maybe the horse was gone off? Me too n'all. Gave up the smokes. Me too n'all. Gave up the smokes. I'm pretty jealous.\n\nI'll be getting my tonsils out in a few weeks so I'll be forced to give up then I suppose. I'm only on my 6th day. 1 sniff of beer, though, and it would all go out the window. Which is another reason I stopped drinking a couple of weeks back. Yeah see I know that will be my downfall. Being a student though I don't think I could possibly give up drinking.  The comment so nice, you posted it twice! Hate when that happens sorry. I'm only on my 6th day. 1 sniff of beer, though, and it would all go out the window. Which is another reason I stopped drinking a couple of weeks back. Yeah see I know that will be my downfall. Being a student though I don't think I could possibly give up drinking. ", "url": "http://www.reddit.com/r/irishproblems/comments/18k1z5/i_yam_cranky/", "id": 16, "title": "I yam cranky "}, {"snippet": " ", "url": "http://www.reddit.com/r/irishproblems/comments/18ijxj/i_never_get_mentioned_in_the_yeh_big_ride_section/", "id": 17, "title": "I never get mentioned in the Yeh Big Ride section of the Metro."}, {"snippet": "  He gave out to me. Maybe you should have given him hang sangichs instead, hmmm? Would that have worked? You *questioning* me, woman??\n\n^([*runs far far away and hides under an enormous pile of coats*]) Oh I will find you and I will kick you. [](/coats \"Good luck!\") Oh I will find you and make you pay. [](/coats2 \"I haven't a penny to throw in anger!\")  If I had a bean I'd send him to school with ham sandwiches as well. Good job woman. Now to the pub with you!  I had chicken in MaccyD's today. Granted, it probably wasn't chicken, and was indeed, cat. Does that count? Was it a kitten? If it was you at going straight to hell. If it was a big cat day to decades of the rosary. ", "url": "http://www.reddit.com/r/irishproblems/comments/18gw62/i_sent_bean_into_school_today_with_ham_sandwichs/", "id": 18, "title": "I sent Bean into school today with ham sandwichs."}, {"snippet": "Need I say more!?   Online, baby, online. He has only himself to blame.  Indeed. Only last week I got mammy to do the car tax online. About 5 minutes it took, she's converted! Any other way is quite frankly *barbaric* in this day and age. Imagine queueing to tax your car!? Jayzus like... Online, baby, online. I did. But it still took them fuckin ages! Fuppin Wastards! Excuse me kind sir, but is that a FT reference? \n\n\n\n\nTut, tut, tut. On your knees. 20 Hail Mary's. I believe the FT quote is \"Fuppin backstards\" \n\nWell now dont you look silly! 40 HAIL MARY'S AND AND OUR FATHER! Uggggggggh. I'm not religious :( Don't care. Prayers now young lady! *in the voice of your mam* ", "url": "http://www.reddit.com/r/irishproblems/comments/18gdcm/fuckin_tax_office/", "id": 19, "title": "Fuckin tax office!!!!"}, {"snippet": "Like, fuck up about it. Jesus.   Buy flowers and chocolates for your self, that is what I do. I don't like chocolates actually. I guess I'm dodging a bullet then. Well go buy yourself some sexy undies.  For the first time, probably ever, I actually have a \"hot date\" for it. I still hate the cuntin.' day though.    I'm not single but I hate the day as well. So I've just gone to the pub by myself. Probably have a drunk wank tonight and cry for a while. I can never do it when I'm drunk. Whiskey dick I suppose. Takes forever.", "url": "http://www.reddit.com/r/irishproblems/comments/18enl5/as_if_valentines_wasnt_a_shite_enough_excuse_for/", "id": 20, "title": "As if Valentines wasn't a shite enough excuse for a holiday, it's now apparently a cunting week long affair."}, {"snippet": "I was thinking of changing jobs, but with so many unemployed in the country, I did not think it was fair to take one of the jobs they could get.  My own job in a multinational may not get filled in Ireland.\n\nThe TV News yesterday told me there would be an open vacancy in Rome at the end of the month.  I looked into the main legal requirements of the job, which appear to need the post to be filled by a single, Catholic bloke.  Grand, I thought, I can fit the bill. Perks of the job, included your own country, free accommodation and a car(some popemobile model I never heard off, but what the hell it comes with the job)\n\nI went online to try and find where to send my CV, and it turns out that they are not accepting applications.  Instead of the standard Irish job application process, in sending your CV and then your Uncle who knows somebody putting in a good word for you, they have some weird foreign process....\n\nAfter a bit of research I found out who gets the job will be decided by 118 auld fellas who will be locked, or locked in or something, and you can't even get an interview in front of them.  Worst of all, none of my Uncles know any of them, not even some bloke call Brady who lives in Armagh.\n\nI thought I was well scuppered, when I remember this educational DVD I have, something about good parenting (No idea why I have it, it's not as if I have any children).  It included a section on \"How to make an offer he cannot refuse.\"\n\nI found the DVD to watch and learn how to persuade these 118 auld fellas to give me the job.  It appears the throwing a bit of horse meat on their bed is the best method.\n\nI am sure, you have figured out where this is going now.  I popped into my local Tesco, only to find out they can't sell me horse meat after the Department of Agriculture stuck their bloody interfering nose in!\n\nI have racked my brain but still have no idea how to put my name forward for the new job.\n\nHow is the country going move forward if our own fecking Government is block us getting jobs???\n\nSome bloke at work said the good parenting III dvd has some help on how to do things in the Vatican, but I have not looked that up yet.\n\nIf any of you have any suggestions I would appreciate the help.\n\n  Ha, very good.\n\nI know a fellow who knows a fellow, who's uncle is the door man of the place where the auld fellows are locked in, I will tell him to put a word in for you.  Sorry lad, I've taken that post.\n\nMy uncle is Jesus. Fair play to you lad....\n\nIf Jesus was your uncle, I assume you are of a certain age.\n\nCan you name me as your successor?  If you do that you would be a saint and I will name you as such if I can when I take over. \n\nMaking me Pope is surely a miraculous act so you would be a shoo in...  ", "url": "http://www.reddit.com/r/irishproblems/comments/18e6rn/government_may_have_blocked_me_getting_a_new_job/", "id": 21, "title": "Government may have blocked me getting a new job."}, {"snippet": "I don't know what to believe anymore.  Don't have a cow man.", "url": "http://www.reddit.com/r/irishproblems/comments/18cgzz/trace_elements_of_beef_and_pork_have_been_found/", "id": 22, "title": "Trace elements of beef and pork have been found in my horse meat."}, {"snippet": "Feckers.  ", "url": "http://www.reddit.com/r/irishproblems/comments/18bolz/the_social_welfare_office_have_refused_to_accept/", "id": 23, "title": "The Social Welfare Office have refused to accept my application for the Pope job as legitimate job seeking."}, {"snippet": "These are just a selection of the amazing noises coming from a car parked down the street.\n\nAt first it was interesting, but now it is just irritating.  Also where does one get CD's of just noise?  You can get those CDs here http://www.amazon.co.uk/Rihanna/e/B0017PCN16 You can get those CDs here http://www.amazon.co.uk/Rihanna/e/B0017PCN16  I could only understand the last noise. Go to a rave, or actually you could just sit in my sitting room. I went to one once and that was enough, I hate that \"music\", it's just noise. I am now sounding like my mother. My grandad asked me what type of music I was listening to years ago, I said drum and bass, he was shocked, \"Is that all it is, just drums and bass?\"\n\nOne day I shall turn into him, I can't wait. That will happen before you know it. I find myself saying stuff to the kids that I thought I never would. I was giving out the eldest one day and I just stopped and realised I sounded like mammy, shoot me now. \n\nI also give out to them about their taste in music. There father was a punk in his day, with the 8 inch mochian, I'm a bit of hippy and they are such tracksuit wearing chav's.", "url": "http://www.reddit.com/r/irishproblems/comments/18be0r/wubwubwubwub_bvvvvvvvvvvvvvvvvvvvvvvv/", "id": 24, "title": "\"wubwubwubwub\", \"bvvvvvvvvvvvvvvvvvvvvvvv\", \"untzuntzuntzuntz\", \"beeeeeeeeeeeeep\""}, {"snippet": "Try as I might I can't get all frothy at the mouth over some pretty tame Tweets.\n\nI've been sitting here reading about the famine , the execution of 1916 leaders and the BBC claiming Irish athletes as their own but it's still not working.\n\nIs there something wrong with me? Is there some sort of counseling or maybe some classes I can take?   Hate to break it to ya, but it sounds like you've got a terrible case of \"Not Giving Even a Bit Of A Fuck\". Very rare disease, particularly among Irish people cos we think we've got oh so much to be riled up about when really we actually have it pretty good and just enjoy bitching too much. Side effects include being abused by your fellow countrymen for disapproving of PSNI officers being killed, saying that the lads chose a poor time for a Revolution, or even saying it's the players' fault for being just generally shite at soccer. \n\nThere's no known cure.  Are you sure that you are not a vegetarian. I know some vegetarians that are really upset about the horsemeat and it not like they even eat burgers.\n\nSo here you come across situations that you should care about but your feelings are inappropriate. Classic vegetarian behavior that. So I'm a closet vegetarian? Oh Jesus....how will I tell me Mammy?", "url": "http://www.reddit.com/r/irishproblems/comments/189up4/i_cant_get_worked_up_into_a_frenzy_of_self/", "id": 25, "title": "I can't get worked up into a frenzy of self righteous  indignation over some Tweets..."}, {"snippet": ":(  Think yourself lucky, I'm fucked as there doesn't seem to be a /r/borninenglandtodutchandfrenchparentsproblems Feckin' blow-in! From all over the place, like a well wafted fart :o)   I like it here but I'm a Florida native whose grandparents were Irish immigrants.  Ah shure we're all grand like.... Can you pass us over some Florida sunshine? You can keep your alligators and anacondas though. Sadly the python hunt is almost over and I think has only netted 13 of them. Alligators are easy to tie up. Just jump on them and wrap their mouth with duct tape. Ah well. I guess Ill just have to enjoy this 68º weather. ::checks watch:: hmm only 7pm. Guess I should go eat some gator tail. Its delicious fried.  That reminds me of that episode of the Simpsons where they whack snakes, and originally whack the Irish.     You might prefer /r/IrishCirclejerk. I'm not a mod shamelessly plugging it or anything, just think it's a great sub. Moderators:\n\n&gt; ItsTyrrellYo Local Politician\n\n&gt; AtomicKoala In-House Euroskeptic\n\n&gt;AhNowComeOn [+1]Miserable Bitch\n\n&gt;Mr_Hank_Scorpio [+3]Stanky Hank\n\nSeems legit. Moderators:\n\n&gt; ItsTyrrellYo Local Politician\n\n&gt; AtomicKoala In-House Euroskeptic\n\n&gt;AhNowComeOn [+1]Miserable Bitch\n\n&gt;Mr_Hank_Scorpio [+3]Stanky Hank\n\nSeems legit. &gt;ItsTyrrellYo Local Politician\n\nNo number beside my name? You've got a 15 from me :(", "url": "http://www.reddit.com/r/irishproblems/comments/1893bk/i_like_rbritishproblems_more_than_here_but_im_not/", "id": 26, "title": "I like /r/britishproblems more than here but I'm not British"}, {"snippet": "  You are her champion. She seems so shy and vulnerable when you compare her to that outrageous self publicist Rosanna Davison who is a walking wardrobe malfunction.  I think Jordan is shy compared to Rosanna.", "url": "http://www.reddit.com/r/irishproblems/comments/186rg1/jimmy_kimmel_the_us_talk_show_host_says_georgia/", "id": 27, "title": "Jimmy Kimmel the US talk show host says Georgia Salpa's boobs aren't real. It's a national outrage that the Government haven't defended the honour of this delicate flower of Irish loveliness."}, {"snippet": "All my lovely friends (all 4 of them) are busy.  Call your mammy and ask her to go with you? I was tempted, am I brave enought to go on my won? Go on your own but don't wear heels..... Well I can't wear the heels, I have to walk a mile over the road in the dark to get to the pub. I will phone the barmaid and see if there is anyone interesting there first. Why don't you ask mr. box here to go with'cha? He would come out in hives if he ventured outside Dublin. I'm barred from the bog anyway after the unfortunate sheep and Mars bar incident. The poor sheep has a gag order on you. I thought the sheep was gagging for it too, but the little bitch lead me on....  Where about are ya In the arse end of no where. In Wexford. Ah sure its your own fault so :]  I quit drinking. Not that I'd go to Wexford anyway, but there it is.", "url": "http://www.reddit.com/r/irishproblems/comments/1854b9/i_have_no_one_to_go_out_to_the_pub_with_anyone/", "id": 28, "title": "I have no one to go out to the pub with, anyone like to come?"}, {"snippet": "while people will wake up with banging hangovers tomorrow.\n\n\n\nMwahahahaha.  Ever the sensible superheroine!! Well done on getting through the mocks. Why thank you kind sir! On the couch for the night after a fatty feast of pizza and chips, and a few nice vodka and coke's to get me through the night. \n\n\n\nPeace and tranquillity. Pizza *and* chips?? Jaysus! Did you not do healthy eating in Home Ec?  Commiserations on the English result.  I've had a few already. They're making me twitch.... You need nuns.\n\nI nunned the poetry and a Shakespeare play with my son on a Sunday afternoon before his LC.\n\nSo you need to get that inner nun working. \n\n\n\n I think I'm too much of a disgraced impure female to even have an inner nun. Everyone has an inner nun even Box of Carrots.  That's what my therapist and I are exploring during my next sessions. Is your therapist a nun?  I found her on findtherapist.com And how do you find Sister Dominatrex?  Everyone has an inner nun even Box of Carrots.  I thought he would have a box of nuns hidden somewhere ... He could very well have nuns hidden in boxes in lots of places.  A nun warehouse, perhaps.  Cups ear \n\n*Sounds like warehouse* I thought he would have a box of nuns hidden somewhere ... I have an emergency bottle of Blue Nun if I ever reach rock bottom. ...that's actually very nice. There's a great line in The Van: \"What kind of wine do you have?\" \"Blue or Black.\"  *quiet  Mocks. pphsff.", "url": "http://www.reddit.com/r/irishproblems/comments/1857z8/mocks_are_finito_kickin_back_for_a_quite_night_in/", "id": 29, "title": "Mocks are finito. Kickin' back for a quite night in..."}, {"snippet": "We irish love to put ourselves down, it's the Irish way, yet when he criticises the Irish teams commitment Stephen Kelly is all over him and not in a friendly \"Cmon ya boyo\" way. Disgusting.   His knowledge of the modh coinníolach is appaling, he should just give up any pretense and go back to making pizzas. He is making an effort and he should be encouraged. Keane called McCarthy a wanker. It's in the book. Kelly is letting the side down and there is no excuse for him not responding in a traditional irish way. I have zero interest in sport and only know of Trappatoni. Don't know who the others are. Roy Keane is a gentleman from Cork that some say is the reincarnation of Cuchullain.  He slide tackled the entire army of Connaught so hard they went home.  I don't like Trappatoni. Oh dear, why not?  He's just too Italian!! Ha no, he gives me the creeps. That is fair comment. Being Italian and smelling of garlic is creepy.\n\nAnything else? Thats kinda it really. You don't want to call him a wanker or anything?  Objection!! Leading the witness! I am helping her reach he inner irishnezz. You don't want to call him a wanker or anything?  Yes he is a wanker. I DON'T LIKE HIM. See that wasn't so bad. I'll bet Trap feels welcome and even a bit more like  a real irish manager now just like Mick McCarthy was.\n\n I feel empowered, but that migth be down to the 2 mile walk. The walk took me 25 mins but the talking made it an hour.  What has he done in an effort to be more Irish exactly?", "url": "http://www.reddit.com/r/irishproblems/comments/184kq7/why_are_trappatonis_efforts_to_be_more_irish/", "id": 30, "title": "Why are Trappatoni's efforts to be more Irish getting thrown back and in his face? "}, {"snippet": ":(    Girl told me I was too tall to shift. Yeah well you're too rude :( How tall is too tall? 6ft 4-5 supposedly. 6ft 4-5 supposedly. 6ft 4-5 supposedly.  I have the opposite problem. I had to buy a special tool to prise bitches off me whilst exiting da club.  I did! not to rub it in or anything...  It's been 5 weeks since my last shift Im not too bad, 3 weeks here. Of course after last night I drunk texted nearly every girl in my phone book. Jayzus, just have a wank lad! Saves an awful lot of typing...and inevitable apologies.", "url": "http://www.reddit.com/r/irishproblems/comments/181i4r/i_didnt_get_the_shift_tonight/", "id": 31, "title": "I didn't get the shift tonight..."}, {"snippet": "It was a good 10 minutes before the rain died down.  You're one unlucky fucker, were they harassing you to join their cause?   And there you were handing out leaflets like a mad thing.\n\nDid you hear that solongsue is planning an appearance , there's been rumours .... That's a bare faced (and everything else) lie solongsue is way too mature to do that. That's a bare faced (and everything else) lie solongsue is way too mature to do that. Sound carrots :P\n\n\n\nBut if you do see a streaker in the paper, you'll know ;) I don't subscribe to beyond the Pale journals/papers. I'm safely ensconced in my bubble of Dublin superiority. Anyway, shouldn't you be concentrating on your mocks? I was taking a break.... \n\n\n\nMy brain is so mushed I'm fantasizing about running around naked. The weekend can't come fast enough! See you at the GPO, what time?  Midnight. It's when the freaks come out to play ;) Hooray for Zombie Hoodie Day  And zombie everything else :P  They picked a really bad name.\n\nYouth Defence sounds like the junior wing of some totalitarian party.\n\n ", "url": "http://www.reddit.com/r/irishproblems/comments/1801hc/i_took_refuge_from_the_rain_on_front_of_the_gpo/", "id": 32, "title": "I took refuge from the rain on front of the GPO, only to be stuck beside the Youth Defense!"}, {"snippet": "Mammy came over this morning and told me there was a great bit of drying out. So I put all my bed clothes out on the line and now they won't stay on the bloody thing.  Not to worry, sure as soon as you go to the bother of fastening them onto the line securely you don't have to be a meteorological mystic to predict what will happen very shortly after.\n  Fucking rain? Ha no, it's still blue skies outside at the moment. And if you want to keep it that way then I suggest you keep your washing in the kitchen. Also if you see any of your neighbours putting theirs out stop them, rugby tackle them if necessary. I am going to bring them in and put them in the dryer and be done with it. The neighbours never hang out their washing, they don't even have clothes lines. They are strange. I think you need to thank your neighbours for them blue skies you seem to get, indeed the colour of your sky seems to be the strangest thing in your neighbourhood, never mind the neighbours.  If any of it blows away and you can't find it, just leave a saucer of whisky and a note of what was lost.  The little people will bring it back by the evening. Can I not just drink the whiskey and then I won't care! A whole saucer to yourself? you'd be as a sober as a bag full of sober things.", "url": "http://www.reddit.com/r/irishproblems/comments/17zq7m/my_washing_is_blowing_off_the_line_because_of_the/", "id": 33, "title": "My washing is blowing off the line because of the wind."}, {"snippet": "It's full if tits, but I can't stop thinking about how little I understand the plot.  What's it called?   Rome by any chance? Great series.", "url": "http://www.reddit.com/r/irishproblems/comments/17yp4d/theres_some_sort_of_show_on_the_tv_about_scantily/", "id": 34, "title": "There's some sort of show on the TV about scantily clad Romans"}, {"snippet": "    ", "url": "http://www.reddit.com/r/irishproblems/comments/17xw25/i_have_to_turn_up_the_tv_because_the_rain_is_so/", "id": 35, "title": "I have to turn up the tv because the rain is so loud."}, {"snippet": "He doesn't move the cursor of the screen when he shows a video either.  At least it gives your username relevance!  Still waiting on yours though. It's so fecking hard to shoehorn in there. Sick of scouring for Aussie/marsupial posts.\n\nI did meet an AtomicKoala once. Sterile now. At least it gives your username relevance!  Na my username can be relevant whenever someone says or does something  stupid. ", "url": "http://www.reddit.com/r/irishproblems/comments/17vlle/my_it_lecturer_copy_and_pastes_links_into_the_top/", "id": 36, "title": "My IT lecturer copy and pastes links into the top bar instead of just clicking on them."}, {"snippet": "Seriously, did this storm just move in? Should we start charging rent?  Is he subject to the household charge I wonder... Is he subject to the household charge I wonder... I always though of it as a she. You know how it is with inanimate objects. It certainly has the temper  FUCKS SAKE WHAT THE FUCK WOMEN AREN'T ANGRY, WE DON'T HAVE BAD TEMPERS. FUCKING HELL WHAT'S YOUR PROBLEM? YEAH WHAT THE FUCK LIKE? WE'RE ALWAYS CALM AND PRETTY ANGELS. WHAT'S CHANGED THAT HAAA? GRRR. WE'RE SO FUCKING LEVEL HEADED ALL THE TIME FLANFLINGER IS JUST A FUCKING ASSHOLE. As someone who's on his 3rd marriage, each time to a redhead, I can assure you that isn't angry, in fact it was more like foreplay to me As a redhead, 'mere till I punch you. Seeing as the last one stabbed me, you need to up your game ;o) GRRR. WE'RE SO FUCKING LEVEL HEADED ALL THE TIME FLANFLINGER IS JUST A FUCKING ASSHOLE. Very fucking calm today. I just threw the BF's shoes out the door at him and hit his car. Just as well I wan't aiming for him. Exactly we're lovely calm people, angry people would have thrown bricks, shoes are nothing. GRRR. WE'RE SO FUCKING LEVEL HEADED ALL THE TIME FLANFLINGER IS JUST A FUCKING ASSHOLE. YEAH LIKE WHATS THE PROBLEM THERE?  WE'RE JUST SO COOL AND NICE AND AMAZING AND MEN CANT SEE THAT. BASTARDS. This is why I'm married to a pint glass. ...is there a woman holding that pint glass? ", "url": "http://www.reddit.com/r/irishproblems/comments/17u05v/something_something_weather/", "id": 37, "title": "Something something weather..."}, {"snippet": "Now I have a big bruise on my face and the cat keeps staring at me when I go outside for a smoke.\n\nIt thinks I abused it.  Absolutely nothing to do with the /r/dublin meetup last night...... No, those bottles of Chimay had nothing to do with it, honest. Or those lines of coke we did in the toilets. That would help explain the hair cuttings around the right sink.  My neighbours cat just sits there in the darkness when I go out for a fag. Just watching me, fucking creepy little creature so it is. They know!  That's the impression I get from cats like that. Know what??  There's a family of wild cats that live out my back, they're on the third generation. It'd be nice if they didn't make so much noise at night. Try living beside urban foxes. The noise they make when fornicating is unbelievable, something to do with the male fox having a barbed penis I believe. There's a family of them in the general area too. I've always presumed the high pitched sounds were from the cats. Only one way to find out.  Bbrazil, animal voyeur!  And the cat came back the very next day......\n\nDo you and the cat have a history? ", "url": "http://www.reddit.com/r/irishproblems/comments/17tdoq/i_tripped_over_the_neighbours_cat_last_night/", "id": 38, "title": "I tripped over the neighbours cat last night..."}, {"snippet": "  Even the commentary is gold. Keith woods rugby and sex. Even the commentary is gold. Keith woods rugby and sex. You mean you weren't listening to His Ryle Highness? Blasphemy!   You lack fibre. He said he needed a piss not a shit. Lacking fibre would actually slow down the rhythm, rather than speed it up.\n\nWhat /u/ferfecksakes lacks is a pot to piss in.\n\n/u/ferfecksakes is officially poor. You heard it here first. He said he needed a piss not a shit.", "url": "http://www.reddit.com/r/irishproblems/comments/17r4ci/i_cant_stop_watching_the_rugby_and_i_have_to_pee/", "id": 39, "title": "I can't stop watching the rugby and I have to pee."}, {"snippet": "I met all the relations. But they all have the same fecking name. There were at least 20 \"John Smiths\", and me in my drunken state got awful confused. Is this just an Irish thing?  [Were they Mormons?](http://en.wikipedia.org/wiki/Joseph_Smith) Maybe they are and are trying to get me into their cult. [I'd start getting worried if I were you](https://www.google.ie/search?hl=en&amp;sugexp=les%3B&amp;gs_rn=2&amp;gs_ri=hp&amp;tok=tfVcsBoYEd9CZuc08vfKcw&amp;cp=8&amp;gs_id=u&amp;xhr=t&amp;q=mormon+underwear&amp;bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&amp;bvm=bv.41867550,d.ZGU&amp;biw=1600&amp;bih=813&amp;um=1&amp;ie=UTF-8&amp;tbm=isch&amp;source=og&amp;sa=N&amp;tab=wi&amp;ei=3gsNUcexIdKShgfxtYHoDw#imgrc=u_6CNezoICz0DM%3A%3BpS4DLQPP2bp9dM%3Bhttp%253A%252F%252Fcdn.ebaumsworld.com%252FmediaFiles%252Fpicture%252F666971%252F81731946.jpg%3Bhttp%253A%252F%252Fwww.ebaumsworld.com%252Fpictures%252Fview%252F81731946%252F%3B640%3B480) Ha, if the boyfriend saw me in that he run a mile!  From you or to you? [Were they Mormons?](http://en.wikipedia.org/wiki/Joseph_Smith)  I suppose in the long run it doesn't really matter. \nBy the time you meet them again, they'll reintroduce themselves. \n\nBest thing is to just be with your Boyfriend.  True, but oh god was I drunk. \n\nBut I still don't understand why they all have the same name? Fathers and sons and nephews and the other cusions and they all look alike. Maybe I was seeing double. \n They did it just to confuse you. ", "url": "http://www.reddit.com/r/irishproblems/comments/17osk5/i_went_to_the_boyfriends_uncles_funeral/", "id": 40, "title": "I went to the boyfriends uncles funeral."}, {"snippet": "I was going to buy dinner in Tesco with that!  just be aware of whats in the burgers Well I can't buy any now can I? Fussy eaters always make up excuses.\n\nYou never question the ingredients of shepherds pie. I suppose you'll want them tested next. Here leave me alone you I'm starving here, I'd literally eat a horse, no fuss made. Anyway, how did the government take your fiver? *Stamp duty* thieving bastards. And did you actually get the stamps?  Yeah but they're German.  You should be thankful. That miney is being put to good use.\n\nWhat else will bankers light their cigars with?", "url": "http://www.reddit.com/r/irishproblems/comments/17mxl0/fucking_government_took_my_last_fiver_out_of_my/", "id": 41, "title": "Fucking government took my last fiver out of my account."}, {"snippet": "I was in with Teagasc earlier this afternoon speaking to an advisor and the planting of Ash trees is no longer allowed in Ireland. Ash timber is/was the most valuable and profitable timber in Ireland especially for the hurley making market (€5 million p/a and the Ash tree butts sold for €400 per m^3 in situ). My folks own a bit of land in Wicklow that I want to plant with broadleaf trees amongst other things. Teagasc give loads of grants, but without the Ash trees... I'm fucking defeated in my long and short term by *a fucking fungus*.\n\nFeckin' fungi coming here from abroad and messing with our forest plantations!\n\nThe Teagasc advisor was highly amused when I told her that my agricultural experience was limited to a 3m^2 vegetable patch in my folk's back garden. In my defense I have to say that my courgettes were very prolific and damned tasty.  &gt; I'm fucking defeated in my long and short term by a fucking fungus.\n\nThis is clearly revenge on you for thinking about breeding fungi to sell.\n\n\nSounds like they might open it up again by May: http://www.agriculture.gov.ie/press/pressreleases/2012/december/title,67933,en.html Thanks for the link. I'm looking at the possibility of truffles, shittake and chanterelle mushrooms. None of that magick mushroom stuff, but then again.... We don't want none of your fancy stuff here, button mushrooms all the way. Broaden your tastebud horizons you heathen!\n\nIrish truffles currently sell for €400p/kilo. Money for jam except I'll have to get a truffle dog and train the feckin' thing. Do truffles grow in Ireland? A certain \"celeb\" chef has a pig for truffle hunting. So my son told me.  They do. Truffle dogs are better as they don't eat the truffles. With truffle pigs you have to grab the truffles before the pig eats them. Can you explain to our gentle readers which part of the pig, when grabbed, is most effective in dissuading the pig from eating the truffle and your resultant reticence at engaging with the pig in the truffle hunt. Dear gentle somnulent readers:\n\nWhen dealing with a rampant truffle pig you need to grab the greedy feckin' bastard by its snout and direct it away from the black/white gold that are truffles. The porcine snout is the most sensitive of man's domestication of farmyard animals (I'm making this up as I go along, I have no facts to substantiate my claims).\n\n\nEdit: In two years I'll have to buy a feckin' truffle dog and train it. You have pig snout phobia ? They do. Truffle dogs are better as they don't eat the truffles. With truffle pigs you have to grab the truffles before the pig eats them.  I'm more upset about the ash trees dying. Kinda sad.  What did you do with all the courgettes?  What did you do with all the courgettes? ", "url": "http://www.reddit.com/r/irishproblems/comments/17lqav/fuck_you_chalara_fraxinea_i_hate_you_you_wanky/", "id": 42, "title": "Fuck you 'Chalara fraxinea' I hate you, you wanky bastarding Ash tree killing fungus."}, {"snippet": "  The sister put this up. My god.  Hahaha. But what does the pope tweet? Popey things I suppose.\n\nHis nicknama is @pontifex, which kinda sounds like an evil hacker in a kids movie I read that as \"Poopey things\"\n\n\n\n\nMy durty little head. Holy crap!  Hahaha. But what does the pope tweet? ", "url": "http://i.imgur.com/qh3bEay.png", "id": 43, "title": "r/21stCentuaryIrishMammyProblems"}, {"snippet": "iPod, bed, blankets.\n\n\n\nOh shite yeah, Mocks tomorrow too. Oh well..  I'll light a candle for you in front of the child of Prague. That's like Irish-catholic winchester-type hoodoo for good luck,in case you didn't know Atheist me is super thankful. \n\n\nI'm sure if you stuck the child of Prague outside tonight, it'd be blown away! You're an atheist of mocks age? Well damn...I'm 25 and I'm still pretty undecided. I always want a WHY but I can't why entropy. Or fucking caterpillars \n\nAh you'll be grand, if you're such a decisive character I'm sure study was no thing but a chicken wing for ya! ;)  I'll light a candle for you in front of the child of Prague. That's like Irish-catholic winchester-type hoodoo for good luck,in case you didn't know  'Tis only your Mocks. I did shite in mine and look where I am now! CEO of a multinational company listed on the NASDAQ. Oh wait..... that's someone else....   Good luck in your mocks, I have the upmost faith in you.\n\nThe weather? Feck it, you'll be grand. ...But, how am I supposed to get out of bed tomorrow morning if its still like this? \n\n\nYour sendings of luck are much appreciated and well needed. I just want to melt into my duvet. Taking back what I said about the weather. The ariel had fallen down and is hitting the roof at the moment and my bedroom window seems to be creaking. \n\n My lights are blinking. \n\n\n\n\nI am sleeping in fear.  Our light are doing the same. I'm schcared. The telly is skipping like a mad yoke too.  Turn it off. Telly is only pretending, he wants to be cool like the lights.  Galway is diabolical, [everytime I try to go outside...](http://i.minus.com/iHRt8JDFTc3pk.gif)  Haha mocks. Fuck that. I'm saving my prayers to satan for something important. Good man. They might come in use. Good luck anyway. You'll be grand. I hear the exams down there involve colouring in and wordsearches.  English Paper 1 I'm guessing. You'll be grand, just bullshit your way through it. It's only the mocks. The most annoying part is waiting for your results. Nah, it's not following the pattern of the LC at all! I've German tomorrow... I think. \n\n\nBe grand. (Ps. I don't \"bullshit\" anything ;) English is all about bullshitting though.\n\nAh German, never did it, I did OL French so it was one of the nicer exams. I'm a straight A English student. I don't know what I'm doing, but I'll keep at it.\n\n\n\nI regret not doing French. Tres sexy. [Yeah but once you can say this your grand](http://www.youtube.com/watch?v=RQa7SvVCdZk)\n\nOh fuck that thunder!I see why you're scared. That and a whole lot more of French filth ;)\n\n\n\nI need a thunder buddy.  :( [Fuck you thunder, you can suck my dick](http://www.youtube.com/watch?v=qVb2vkfw6bw)\n\nI'll be your thunder buddy :) Yay, thunder buddies! How did it go? English is all about bullshitting though.\n\nAh German, never did it, I did OL French so it was one of the nicer exams. I got an NG on my LC for German, all I wrote on the exam paper was my name. My folks were none to happy at paying IR£75 for me to get my Matric to get into UCD. What you used to have to write your name??  \n\nWhat's the Matric? I tried Googling it but I was just finding llinks to some New Zealand exam. In ye ancient olden times of yore we had to write our names and answer questions on parchment using a quill and ink. 'Twas before anonymous student numbers you young'uns have now. It was also the era of corporal punishment 'for your own good'. I got thumped the odd time but I was wise and smart enough to avoid it mostly. I saw some serious violent shit in my time in school.\n\nThe 'Matric' was/is(?) the Matriculation exam for universities. You'd get it automatically if you passed all your LC exams. I didn't, hence the IR£75, which was a fortune back in '85. Ah yeah my auld wan is always going on about how the nuns used to slap her wrists and palms with a ruler if she took too long bringing the coal in from the shed back when she was a babby.\n\nI think that still exists?Not sure, but it sounds familiar.  Your Mam got off easy. I have a horror story to tell from when I was ~7 years of age. Thinking back on the incident now still traumatises me.  You are a girl and should be fine.\n\nWhen I was a lad a friend of mine got the mocks and his glands swelled up very painfully and he had to stay in a dark room.\n\n Ice and heat, ice and heat.", "url": "http://www.reddit.com/r/irishproblems/comments/17l9l7/the_weather_is_scaring_me/", "id": 44, "title": "The weather is scaring me..."}, {"snippet": "What is wrong with the man, who volunteers to go to Kilkenny? Now I have to get tickets because the Bf loves him. Fucking Kilkenny. They will probably will the all Ireland again this year. Will I burst into flames going onto their holy ground?   So the rumours are true that he has become a showband.Is it to coincide with his next release *its a long way to Tipperary*  ? The rumours are true, I think he is going to be the new Kilkenny mascot. He's not tough enough to be the Limerick mascot.  He's not tough enough to be the Limerick mascot.  Who needs tough when you've got a knife. But is he tough enough to eat a Tesco burger. \n\nBig Tom would eat a Tesco burger. Is he as tough as a Tesco burger? He's not tough enough to be the Limerick mascot.  Who is?  Lady Gaga    [deleted]", "url": "http://www.reddit.com/r/irishproblems/comments/17ilm3/so_bruce_springsteen_has_announced_2_dates_in/", "id": 45, "title": "So Bruce Springsteen has announced 2 dates in July in bloody Kilkenny"}, {"snippet": "My head is cold.       Oh god, everyone knows only Walter White can pull that shit off.", "url": "http://www.reddit.com/r/irishproblems/comments/17gx3w/i_watched_too_much_breaking_bad_and_thought_it/", "id": 46, "title": "I watched too much Breaking Bad and thought it was a good idea to shave my head"}, {"snippet": "I don't even know why. But I'm dealing with it in the healthy Irish way. Silently seething with hatred.\n\nEverything's bollocks. Enda Kenny is a system of wood blocks connected by well oiled hinges and manipulated carefully through a sequence of strings. David Cameron as well. They're all wood.\n\nNorthern Ireland's shite.\n\nWeather's shite.\n\nI've no real job so I have to work for my da for peanuts a day.\n\nI live in the backarse of nowhere.\n\nUniversities are too slow sending me offers.\n\nI don't know where my life is going, but I'd quite like to end it in a brawl with someone.\n\nI have no friends, but I do have a lot of people who like to pretend they're my friends in order to get things off me.\n\nI'd like to be a soldier, but the only armed forces I can join are Brits. Feckin' Brits.\n\n\nMy best friend's a woman, but she's met some bollocks and I'm that jealous a knobhead I can't get past the fact she's seeing someone. I don't even understand why I'm jealous. Also she lives in another country. Bollocks.\n\nI can't get drunk without whinging about my problems. \n\nWorst of all, I know all my problems are insignificant as christ, and I still can't get over them.\n\nSo aye. Beat that there. \n\n  This...this *beautiful* rant right here...*this* is why these very halls of Irish misery were constructed. I would make you a personalised flair if I wasn't completely hammered out of my trousers.\n\nWe that are here to piss and moan *Salute You*! *To complain and serve.*  If you're interested in a military career you could always join the [French Foreign Legion](http://www.legion-recrute.com/en/) though:\n\n&gt; If your candidature is upheld, the first contract is minimum for 5 years\n\nI've met quite a few Irish Legionnaires and they're really sound blokes.  Thanks, but I've already considered the FFL, and I've weighed it up against the Royal Marines, but they just don't come out on top.\n\nI want to get my degree before I commit a chunk of my life to military service, so I might as well use it to apply to become an officer, rather than enlist. Better pay, and the Brits will give me a bursary for part of my student loan. Also, the RM new officers minimum commitment is only three years, so if it turns out to be a balls then I won't have wasted too much time.\n\nPlus it's harder to get in, so if I do make it through application and training then I'll have a serious sense of achievement. What would your mammy say about you running of and joining the British army? Navy, actually, and she's probably be none to amused, but I don't care. Tut tut Meh. I'll be 22 by the time I apply, I think my mammy will just be glad I'm not moving back in with her. \n\nAs for the fact that it's the Brits... I don't really mind. As long as it's not the parachute regiment. If anything I'm following in the footsteps of a ton of republicans. Tom Barry was in the British expeditionary force in Mesopotamia. James Connolly fought in the British Army. It's not a big deal for me.\n\n No no no all British people are oppressive tyrants whose very existence is consumed by the need to rape and pillage our lands. Didn't you do history in school?  I think most of the top half of your comment would apply to most people our age.\n\n&gt;My best friend's a woman, but she's met some bollocks and I'm that jealous a knobhead I can't get past the fact she's seeing someone. I don't even understand why I'm jealous\n\nHave you considered the fact that you might have feelings for her?\n\n&gt;I can't get drunk without whinging about my problems.\n\nAgain that's most people.\n\n&gt;I have no friends, but I do have a lot of people who like to pretend they're my friends in order to get things off me.\n\nI know that feel bro. I have feelings, but they're going nowhere. It would never work out. I'd much prefer to keep my one decent friend. One who doesn't take my weed.\n\n\n\n Well being in another country would make that hard to do. You need to start saying you don't have any, everyone knows that. Aye, but I'm so generous when I'm drunk. Sometimes when I'm drunk I buy a bag of chips and just walk around feeding them to strangers. I just want to help people...\n\nThen I wake up poor and angry. I think you're just describing me at this point. Also I keep making people dinner and sandwiches, sober like, just want them to appreciate me :( Why don't people love us?\n\nSeriously... I buy rounds, bring the bag, I drag them out of fights, I make sure they get into taxis when they're covered in their own boke...\n\nYet at the end of the night it's always me wondering why I even bothered. I don't know, for me I think they used to like me and now they just *put up* with me, and reap the benefits of being my friends. I mean the people in college are grand, sure they let me cook dinner but they'll always return the favour but at home...No idk what changed but I constantly just feel like no one could give a shit if I was there or not. Sorry... I just... this is really weird. That's exactly how I feel.\n\nI didn't go to uni with everyone else, so I've basically become estranged from all my friends, but occasionally they come back, and although they're friendly and nice and all, I really feel like either they don't want me there or they don't care I'm there at all.\n\nIt sucks, because they have their new friends, but I have no one. So I end up trying to fill in the gaps with 'imaginary' friendships on the internet. I get deeply involved in my little subreddits, and for a while it feels like I really belong again, sharing the inside jokes, talking about things people outside those communities wouldn't understand, but at the end of the night I'm still lying in bed wondering how it all got so... pathetic.\n\nProbably why I'm avoiding lying in bed.\n\nPart of it is the rural thing. People talk about rural isolation and suicide like it's something that only happens to older people who can't go outside anymore. I'm 19 years old, not some old man from Kerry.  It's a horrible feeling, thinking people would just be happier if you stopped talking to them. The thing is I would understand if this happened when we all went off to college but this started like a year ago out of nowhere. It's like I did something to piss everyone off but no one told me what. \n\nYou avoid going to bed, I avoid getting out of it. You're never a loser in your dreams. Or at least you can try and pretend your life isn't falling to pieces. \n\nI'm not rurally isolated, just socially. But yeah I get that living in the back arse of nowhere would be hard. \n\nMain thing for YOU to remember is you'll be off to college next year, you can make all these new friends then.  The Roid rage is what spurned Lance Armstrong on to win 7 Tours de France and a place on the couch with Oprah but it can get out of control.\n\nFor gods sake lad , give the steroids up, you dont even own a bike.\n\n If there's one thing I've learned from Lance Armstrong, it's that taking drugs will make you famous, no matter how little anyone cares about your sport.  I think I love you. \n\n\n'Sall. I'll just casually continue about my day. Chin up love, it could be worse. You could be from Kerry. I swear to god, the next person who falls in love with me is getting a slap. ...a slap where?! ;)\n\n\nThis is the decider. Augh. *hugs*   In fairness these problems of yours are pretty first world, which is ironic as you have Cork for your flair. EDIT; my mistake, you're a Derry man, which as of the last couple of weeks, as everybody knows, is one of the cultural capitals of the western world. \n\nEdit: I thought this was a different thread.\n\nYeah Derry is nice and all. Not a job in it though.\n\n\n\n You could always just move down the road to Strabane.", "url": "http://www.reddit.com/r/irishproblems/comments/17ee1m/im_filled_with_rage/", "id": 47, "title": "I'm filled with rage"}, {"snippet": "  It'll pass. You will probably live  But the tea will die Green tea never die's. It's much too horrible for that. Green tea never die's. It's much too horrible for that.", "url": "http://www.reddit.com/r/irishproblems/comments/17e3k5/i_gorged_on_a_tub_of_sour_jellies_now_my_mouth/", "id": 48, "title": "I gorged on a tub of sour jellies, now my mouth stings and it's hard to drink tea"}, {"snippet": "This is an offense to my native vulture.   ", "url": "http://www.reddit.com/r/irishproblems/comments/17dpvb/autocorrect_wont_suggest_swear_words/", "id": 49, "title": "Autocorrect won't suggest swear words"}], "XmlDocumentSource.xml": {"absolutePath": "/home/ciara/Documents/programming/cs467/rtopics/r-topics/carrot2-cli-3.6.2/../data/irishproblems0_reddit.xml"}, "processing-time-algorithm": 1352, "processing-time-source": 48, "clusters": [{"documents": [1, 3, 4, 7, 15, 20, 25, 26, 33, 37, 38, 41, 42, 44, 45], "phrases": ["FUCKING"], "score": 36.943609732522134, "attributes": {"score": 36.943609732522134}, "id": 0, "size": 15}, {"documents": [13, 16, 19, 20, 31, 47], "phrases": ["Weeks"], "score": 27.387814986743606, "attributes": {"score": 27.387814986743606}, "id": 1, "size": 6}, {"documents": [4, 16, 21, 22, 41], "phrases": ["Horse"], "score": 34.3506431095418, "attributes": {"score": 34.3506431095418}, "id": 2, "size": 5}, {"documents": [6, 7, 20, 25, 27], "phrases": ["Self"], "score": 25.761346562687503, "attributes": {"score": 25.761346562687503}, "id": 3, "size": 5}, {"documents": [0, 2, 3, 42], "phrases": ["Money"], "score": 26.901920857464695, "attributes": {"score": 26.901920857464695}, "id": 4, "size": 4}, {"documents": [11, 37, 47], "phrases": ["Exact same Problem"], "score": 63.69717307695305, "attributes": {"score": 63.69717307695305}, "id": 5, "size": 3}, {"documents": [1, 12, 47], "phrases": ["Irish Problems"], "score": 40.086590845954504, "attributes": {"score": 40.086590845954504}, "id": 6, "size": 3}, {"documents": [29, 32, 44], "phrases": ["Mocks"], "score": 37.93851003301951, "attributes": {"score": 37.93851003301951}, "id": 7, "size": 3}, {"documents": [32, 33, 35], "phrases": ["Rain"], "score": 46.33373007225178, "attributes": {"score": 46.33373007225178}, "id": 8, "size": 3}, {"documents": [5, 47, 49], "phrases": ["Swear"], "score": 33.37484723350723, "attributes": {"score": 33.37484723350723}, "id": 9, "size": 3}, {"documents": [7, 8, 21], "phrases": ["Taken"], "score": 23.041492105001137, "attributes": {"score": 23.041492105001137}, "id": 10, "size": 3}, {"documents": [10, 15, 48], "phrases": ["Tea"], "score": 64.76950091320334, "attributes": {"score": 64.76950091320334}, "id": 11, "size": 3}, {"documents": [28, 36], "phrases": ["Bar"], "score": 32.64501974549905, "attributes": {"score": 32.64501974549905}, "id": 12, "size": 2}, {"documents": [18, 38], "phrases": ["Cat"], "score": 46.15713627956854, "attributes": {"score": 46.15713627956854}, "id": 13, "size": 2}, {"documents": [41, 45], "phrases": ["Eat a Tesco Burger"], "score": 46.92506206465068, "attributes": {"score": 46.92506206465068}, "id": 14, "size": 2}, {"documents": [21, 22], "phrases": ["Horse Meat"], "score": 54.0401445657542, "attributes": {"score": 54.0401445657542}, "id": 15, "size": 2}, {"documents": [21, 47], "phrases": ["New Job"], "score": 58.484657021371945, "attributes": {"score": 58.484657021371945}, "id": 16, "size": 2}, {"documents": [1, 15], "phrases": ["Reverend"], "score": 27.442917089108235, "attributes": {"score": 27.442917089108235}, "id": 17, "size": 2}, {"documents": [17, 21], "phrases": ["Section"], "score": 30.401131616397418, "attributes": {"score": 30.401131616397418}, "id": 18, "size": 2}, {"documents": [25, 34], "phrases": ["Sort"], "score": 27.08321519118319, "attributes": {"score": 27.08321519118319}, "id": 19, "size": 2}, {"documents": [25, 43], "phrases": ["Tweet"], "score": 33.50762887335094, "attributes": {"score": 33.50762887335094}, "id": 20, "size": 2}, {"documents": [9, 14, 23, 24, 30, 39, 40, 46], "phrases": ["Other Topics"], "score": 0.0, "attributes": {"other-topics": true, "score": 0.0}, "id": 21, "size": 8}]}