{
  "processing-time-total" : 2096,
  "clusters" : [ {
    "id" : 0,
    "size" : 10,
    "score" : 33.76210773523565,
    "phrases" : [ "State" ],
    "documents" : [ 5, 8, 20, 24, 27, 28, 33, 37, 38, 43 ],
    "attributes" : {
      "score" : 33.76210773523565
    }
  }, {
    "id" : 1,
    "size" : 9,
    "score" : 47.52047368208579,
    "phrases" : [ "Sounds Like she Just wants Stuff" ],
    "documents" : [ 0, 5, 16, 22, 34, 37, 38, 39, 46 ],
    "attributes" : {
      "score" : 47.52047368208579
    }
  }, {
    "id" : 2,
    "size" : 7,
    "score" : 123.10921135104611,
    "phrases" : [ "Young Girl" ],
    "documents" : [ 0, 1, 4, 18, 34, 37, 46 ],
    "attributes" : {
      "score" : 123.10921135104611
    }
  }, {
    "id" : 3,
    "size" : 6,
    "score" : 46.652895371606846,
    "phrases" : [ "Expect the Guy to Know" ],
    "documents" : [ 5, 16, 34, 38, 39, 43 ],
    "attributes" : {
      "score" : 46.652895371606846
    }
  }, {
    "id" : 4,
    "size" : 6,
    "score" : 49.10293808938744,
    "phrases" : [ "IFF" ],
    "documents" : [ 2, 3, 7, 11, 19, 21 ],
    "attributes" : {
      "score" : 49.10293808938744
    }
  }, {
    "id" : 5,
    "size" : 6,
    "score" : 50.93092736832142,
    "phrases" : [ "Valentine's Day" ],
    "documents" : [ 5, 12, 22, 24, 26, 43 ],
    "attributes" : {
      "score" : 50.93092736832142
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 63.16560289302754,
    "phrases" : [ "Making Jokes" ],
    "documents" : [ 0, 4, 12, 46, 49 ],
    "attributes" : {
      "score" : 63.16560289302754
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 88.2340796886653,
    "phrases" : [ "Pretty Awesome" ],
    "documents" : [ 0, 22, 33, 34 ],
    "attributes" : {
      "score" : 88.2340796886653
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 29.13818547890489,
    "phrases" : [ "Saw" ],
    "documents" : [ 0, 9, 17, 34 ],
    "attributes" : {
      "score" : 29.13818547890489
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 31.488340522216017,
    "phrases" : [ "Stop all Contact" ],
    "documents" : [ 0, 16, 23, 34 ],
    "attributes" : {
      "score" : 31.488340522216017
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 48.31141111274562,
    "phrases" : [ "Dad" ],
    "documents" : [ 2, 10, 34 ],
    "attributes" : {
      "score" : 48.31141111274562
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 42.86081186389344,
    "phrases" : [ "Hug" ],
    "documents" : [ 4, 8, 14 ],
    "attributes" : {
      "score" : 42.86081186389344
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 26.467642128879476,
    "phrases" : [ "Peace" ],
    "documents" : [ 1, 5, 46 ],
    "attributes" : {
      "score" : 26.467642128879476
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 84.48980911344958,
    "phrases" : [ "Single Mothers" ],
    "documents" : [ 0, 13, 31 ],
    "attributes" : {
      "score" : 84.48980911344958
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 73.13938213768624,
    "phrases" : [ "Years of Wearing" ],
    "documents" : [ 4, 8, 34 ],
    "attributes" : {
      "score" : 73.13938213768624
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 80.38600268090237,
    "phrases" : [ "Billion Rising" ],
    "documents" : [ 24, 47 ],
    "attributes" : {
      "score" : 80.38600268090237
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 86.59285342222782,
    "phrases" : [ "Birth Control Pill" ],
    "documents" : [ 30, 33 ],
    "attributes" : {
      "score" : 86.59285342222782
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 51.341610426981156,
    "phrases" : [ "Heart Attack" ],
    "documents" : [ 12, 24 ],
    "attributes" : {
      "score" : 51.341610426981156
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 34.61840947850551,
    "phrases" : [ "Shoot" ],
    "documents" : [ 15, 24 ],
    "attributes" : {
      "score" : 34.61840947850551
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 36.94243382677262,
    "phrases" : [ "Shop" ],
    "documents" : [ 5, 11 ],
    "attributes" : {
      "score" : 36.94243382677262
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 66.29948251042826,
    "phrases" : [ "Team" ],
    "documents" : [ 0, 6 ],
    "attributes" : {
      "score" : 66.29948251042826
    }
  }, {
    "id" : 21,
    "size" : 11,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 25, 29, 32, 35, 36, 40, 41, 42, 44, 45, 48 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 2001,
  "documents" : [ {
    "id" : 0,
    "title" : "The strangest attempted pickup I've ever seen",
    "snippet" : "One night, I forgot my phone at the bar. It was close to closing time but I wasn't too far away and went back to retrieve it. On the way, this guy fell in step with me and struck up a conversation. It didn't strike me as terribly unusual and the conversation was just small talk. He walked with me to the bar and was like \"I'll wait for you out here.\"\n\nI ended up seeing some friends and hanging with them for a while, thinking to rid myself of the guy and catch up with my friends a bit. When I went out ~15 minutes later, he was still out there. Then he got really uppity about me taking a long time and asked where I was going. I told him that I was going home and he was like \"yeah, that sounds good, I live just down the street\"\n\nI told him that in no way was I going home with him and he generated some lie about how I promised that I would before I went in the bar. At that point, I was both doubled over with laughter and slightly pissed. I basically gave him a lecture about respect and he walked away saying something like \"Whatever, there are plenty of other desperate looking girls out there.\"  \n\nIt was the strangest thing that has ever happened to me. It was funny because his physical presence was not at all threatening (I was a solid 8 inches taller), but it still made me feel like I must BE desperate if I looked desperate enough to be approached like that.\n\nI didn't know it was a pickup strategy to troll the bar sidewalks at closing time. \n\ntl;dr Creeper creeps on \"desperate looking\" girl. Ha.\n\n  He was putting you down to defend his own ego, do not take that bullshit personally! my ex and i used to go into bars and pretend we didn't know each other and 'pick each other up.' i know it's weird but it spiced up our sex life a good bit.\n\nanyways, one of my favorites was when one night i sauntered over to him at the bar and demeaned him like guys typically do to women, like in OP's case. it was hilarious watching everyone's reaction. like, wu-what? b-but the dude is supposed to be the dick, and the girl is the one who looks down and trots out like a beaten puppy! this actually sounds fun!\n\nside note, i have you tagged as \"has a gimpy papillon\"... now im wracking my brain trying to figure out what that means. why is your puppy gimpy?? :( haha! i asked about partially paralyzed dogs a while back. my mother was considering adopting a papillion that can't straighten her legs when initially standing, but can get around just fine. she ended up getting the dog, which i'm very glad for... the dog is wonderful! and surprisingly extremely mobile.\n\nexcept for stairs. oh god. it's so sad. the dog will do it, but it makes you want to cry, watching her clamber upstairs.....\n\n\nand yes, it is so much fun! one of my favorites would be when he'd hit on the typical sorority girl who's a stuck up, shallow, selfish bitch, then he'd turn to me and be like 'alright i'm taking you home.' and the girl would get all pissy (i'm not the traditionally 'hot' girl so the sorority bitch would get all offended) and he'd just clarify the situation by describing what a real woman was. aaaahh, the confidence boost. no wonder i gave him so many blow jobs....\n\nand there are so many other scenarios. it's good fun. sometimes i would just randomly start crying in walmart and ask why he never put it in my butt anymore ('i only pooped on you once! ONCE!') and other crazy things. i guess we were kind of exhibitionists.... aww good, a happy pappy story! :) also, my papillon has no mobility issues and still refuses to go up stairs.. silly dogs.\n\n\nand now im going to try to convince my boyfriend to pretend pick me up at bars. haha you totally should!!! it is so much fun. i like to sit there for a while, by myself, and get the attention of a few guys. maybe even start chatting with one. act really classy.\n\nthen have your bf walk up and say \"hey babycakes. how bout you let me holla at that booty hole?\" and look him up and down, and say \"...yea. sounds nice.\" and walk out. \n\nthe response is hilarious.  I really really really really hope to see this come across in a \"Field Report\" on /r/seduction some day. you totally should!!! it is so much fun. i like to sit there for a while, by myself, and get the attention of a few guys. maybe even start chatting with one. act really classy.\n\nthen have your bf walk up and say \"hey babycakes. how bout you let me holla at that booty hole?\" and look him up and down, and say \"...yea. sounds nice.\" and walk out. \n\nthe response is hilarious.  haha! i dont know how in the heck i wouldnt start laughing hysterically at him saying \"holla at that booty hole\".  aww good, a happy pappy story! :) also, my papillon has no mobility issues and still refuses to go up stairs.. silly dogs.\n\n\nand now im going to try to convince my boyfriend to pretend pick me up at bars. haha I have been babysitting a papillon for the past week and I think yesterday was the first day she would come upstairs without assistance. Weird little creature. haha! i asked about partially paralyzed dogs a while back. my mother was considering adopting a papillion that can't straighten her legs when initially standing, but can get around just fine. she ended up getting the dog, which i'm very glad for... the dog is wonderful! and surprisingly extremely mobile.\n\nexcept for stairs. oh god. it's so sad. the dog will do it, but it makes you want to cry, watching her clamber upstairs.....\n\n\nand yes, it is so much fun! one of my favorites would be when he'd hit on the typical sorority girl who's a stuck up, shallow, selfish bitch, then he'd turn to me and be like 'alright i'm taking you home.' and the girl would get all pissy (i'm not the traditionally 'hot' girl so the sorority bitch would get all offended) and he'd just clarify the situation by describing what a real woman was. aaaahh, the confidence boost. no wonder i gave him so many blow jobs....\n\nand there are so many other scenarios. it's good fun. sometimes i would just randomly start crying in walmart and ask why he never put it in my butt anymore ('i only pooped on you once! ONCE!') and other crazy things. i guess we were kind of exhibitionists.... &gt; sometimes i would just randomly start crying in walmart and ask why he never put it in my butt anymore \n\nMy boyfriend and I have the same deadpan sarcastic sense of humor, and I'm sure we've freaked out a few people in public while having perfectly calm conversations about ridiculous scenarios that never actually happened. Not quite as exhibition-y but entertaining all the same. :P haha! i asked about partially paralyzed dogs a while back. my mother was considering adopting a papillion that can't straighten her legs when initially standing, but can get around just fine. she ended up getting the dog, which i'm very glad for... the dog is wonderful! and surprisingly extremely mobile.\n\nexcept for stairs. oh god. it's so sad. the dog will do it, but it makes you want to cry, watching her clamber upstairs.....\n\n\nand yes, it is so much fun! one of my favorites would be when he'd hit on the typical sorority girl who's a stuck up, shallow, selfish bitch, then he'd turn to me and be like 'alright i'm taking you home.' and the girl would get all pissy (i'm not the traditionally 'hot' girl so the sorority bitch would get all offended) and he'd just clarify the situation by describing what a real woman was. aaaahh, the confidence boost. no wonder i gave him so many blow jobs....\n\nand there are so many other scenarios. it's good fun. sometimes i would just randomly start crying in walmart and ask why he never put it in my butt anymore ('i only pooped on you once! ONCE!') and other crazy things. i guess we were kind of exhibitionists.... do you have any more scenarios? those are hilarious, and good ideas too this actually sounds fun!\n\nside note, i have you tagged as \"has a gimpy papillon\"... now im wracking my brain trying to figure out what that means. why is your puppy gimpy?? :( This was seriously confusing as a French speaker... \"why are they talking about dogs??\" -googles- \"oooooh\" because in French papillon means butterfly. thats why they are called papillons! their ears are shaped like a butterfly! is phalene french too? thats what they are called when they have floppy ears. i think it means moth.\n\n\nim a papillon obsessed nerd. This was seriously confusing as a French speaker... \"why are they talking about dogs??\" -googles- \"oooooh\" because in French papillon means butterfly. my ex and i used to go into bars and pretend we didn't know each other and 'pick each other up.' i know it's weird but it spiced up our sex life a good bit.\n\nanyways, one of my favorites was when one night i sauntered over to him at the bar and demeaned him like guys typically do to women, like in OP's case. it was hilarious watching everyone's reaction. like, wu-what? b-but the dude is supposed to be the dick, and the girl is the one who looks down and trots out like a beaten puppy! This is one of my favorite fantasies. Stranger danger + guaranteed to get some + knows how you like it = super fun times. my ex and i used to go into bars and pretend we didn't know each other and 'pick each other up.' i know it's weird but it spiced up our sex life a good bit.\n\nanyways, one of my favorites was when one night i sauntered over to him at the bar and demeaned him like guys typically do to women, like in OP's case. it was hilarious watching everyone's reaction. like, wu-what? b-but the dude is supposed to be the dick, and the girl is the one who looks down and trots out like a beaten puppy! Ok, so, my boyfriend and I aren't exactly normal people, and this is something we would totally do. I'm going to call him and ask him to meet me at a bar after work. normal people don't have as much fun.  my ex and i used to go into bars and pretend we didn't know each other and 'pick each other up.' i know it's weird but it spiced up our sex life a good bit.\n\nanyways, one of my favorites was when one night i sauntered over to him at the bar and demeaned him like guys typically do to women, like in OP's case. it was hilarious watching everyone's reaction. like, wu-what? b-but the dude is supposed to be the dick, and the girl is the one who looks down and trots out like a beaten puppy! I have done this multiple times with people I'm dating and it is amazing. We even got a waitress to send notes back and forth for us.\n\nShe was well-tipped. He was putting you down to defend his own ego, do not take that bullshit personally! Maybe so. But I had a friend who was in the pickup business. It's a thing called \"negging\". It is when you say a playful negative comment which is supposed to \"make the girl self conscious\". A bit disrespectful if you ask me.  [Handling it like this, however, is awesome.](http://xkcd.com/1027/) Maybe so. But I had a friend who was in the pickup business. It's a thing called \"negging\". It is when you say a playful negative comment which is supposed to \"make the girl self conscious\". A bit disrespectful if you ask me.  Maybe so. But I had a friend who was in the pickup business. It's a thing called \"negging\". It is when you say a playful negative comment which is supposed to \"make the girl self conscious\". A bit disrespectful if you ask me.  It's more than just a bit disrespectful. I agree. I was just saying that it's disrespectful. I did downplay it by saying \"a bit\"  sorry.  Maybe so. But I had a friend who was in the pickup business. It's a thing called \"negging\". It is when you say a playful negative comment which is supposed to \"make the girl self conscious\". A bit disrespectful if you ask me.  Maybe so. But I had a friend who was in the pickup business. It's a thing called \"negging\". It is when you say a playful negative comment which is supposed to \"make the girl self conscious\". A bit disrespectful if you ask me.  [deleted] [deleted] Yeah, but the whole PUA thing is just manipulation, and you usually wind up with girls who have low self-esteem if it actually works. I doubt a strong, confidant woman would ever fall for such BS. He was putting you down to defend his own ego, do not take that bullshit personally! When I see you, all I think is how beautiful those gleaming eyes twitch as my heart beats through the wind. I run to you, chasing the hold of your hand, never to release from my grasp. I adore you. Why can't we devour time together, passionately while I clench your lips with mine?\nYou give color to my soul. You're beautiful and my fire will never dwindle amidst of this white winter. I cherish a moment with you, among my fire and yours. The moonlight is young and the stars illuminate the contour of your face. I want to kiss you this night.\nI love you. He was putting you down to defend his own ego, do not take that bullshit personally!  I love how the first reaction of those people is something along the lines of, \"That's cool, you're fat/ugly anyway!\" I love how the first reaction of those people is something along the lines of, \"That's cool, you're fat/ugly anyway!\" Aesop wrote a fable about a fox trying to get grapes off the vine but when he can't reach them he says that's fine because they are probably sour anyways.  This comment of self comfort by the fox is the birth of the phrase \"sour grapes,\" when you can't get something you wanted so you instead insult it's integrity to pick yourself back up. I love how the first reaction of those people is something along the lines of, \"That's cool, you're fat/ugly anyway!\" Happened to me, I was walking downtown this past summer with a friend of mine. We were both lookin' pretty awesome in cute summer dresses and these drunk younger boys (either late high school or freshmen in college) stumbled by. They started cat calling us and saying things like \"where you ladies goin'? Come hang out with us! Ow Ow!!\" When we kept walking and not paying attention they started yelling \"Oh You're too fat for us anyway! You see the one in the red (Me) shes too fat for us!.... cute sundress though! HA!\" \n\nIt was pretty good. Total Bros saying mean things to cover up for their depleted ego.  Yeah, didn't you know? Any girl who's outside after 2 a.m. is looking for some D. I would have laughed, too. He's clearly the desperate one and he knows it. I ended up feeling kinda sorry for the little guy. Like \"chin up, buddy! I believe in you!\" but then I remembered that I wasn't on his team haha Ohjesus, you should have said that as he walked away. A big 'ol grin and swingin' arms. I'm laughing at the thought.... :) Good heavens, that reminds me of this: http://i.imgur.com/v4uaT.gif  \n*Time to turn the tables, ladies!* Do you know the actual source of that?  I'm dying to see it.... Good heavens, that reminds me of this: http://i.imgur.com/v4uaT.gif  \n*Time to turn the tables, ladies!* This is amazing. I must know what this is from, please. Good heavens, that reminds me of this: http://i.imgur.com/v4uaT.gif  \n*Time to turn the tables, ladies!* Yeah, didn't you know? Any girl who's outside after 2 a.m. is looking for some D. I would have laughed, too. He's clearly the desperate one and he knows it. I used to work a few blocks from my apartment and I didn't have a car, so I walked to and from work. I got off work at midnight and I lived very close to a popular bar, so you can iimagine the kinds of comments I got.  \n\nBut in about four years, I only had one actually scary incident.  \n\nA car wth four guys stopped and one of them asked me if I knew where any clubs were. I said \"No\" but mentioned the bar. Then he offered me $100 to party with them. I said \"No\" and then they started shouting things at me - \"I want you to suck my dick\" - \"you're an ugly bitch anyway,\" etc.  \n\nThey followed me as I walked to my apartment so I just kept walking until I got to a gas station. They parked and waited for me. I told the clerk and he said I could hang out there. They stayed for a few minutes, then I waited 30 minutes before I went home.  \n\nBut every damn time I saw headlights I nearly threw up. Yeah, didn't you know? Any girl who's outside after 2 a.m. is looking for some D. I would have laughed, too. He's clearly the desperate one and he knows it. Yeah, didn't you know? Any girl who's outside after 2 a.m. is looking for some D. I would have laughed, too. He's clearly the desperate one and he knows it.   Sounds like some weird Pick Up Artist strategy BS. My thoughts exactly! I sometimes go read their \"field reports\" on /r/seduction for shits and giggles and I once saw one that was pretty similar to this. Basically, this guy was whining that he didn't get the girl after following (read: stalking) her and asking weirdo questions like where her house was. If I remember correctly, the dude was baffled that she called the cops on him but totally defended his \"methods.\" This PUA stuff is one of the weirder things to come out of the 2000's. I'm sorry you had to experience it OP. My thoughts exactly! I sometimes go read their \"field reports\" on /r/seduction for shits and giggles and I once saw one that was pretty similar to this. Basically, this guy was whining that he didn't get the girl after following (read: stalking) her and asking weirdo questions like where her house was. If I remember correctly, the dude was baffled that she called the cops on him but totally defended his \"methods.\" This PUA stuff is one of the weirder things to come out of the 2000's. I'm sorry you had to experience it OP. My thoughts exactly! I sometimes go read their \"field reports\" on /r/seduction for shits and giggles and I once saw one that was pretty similar to this. Basically, this guy was whining that he didn't get the girl after following (read: stalking) her and asking weirdo questions like where her house was. If I remember correctly, the dude was baffled that she called the cops on him but totally defended his \"methods.\" This PUA stuff is one of the weirder things to come out of the 2000's. I'm sorry you had to experience it OP. I've seen threads on there about how to avoid getting *accused of* rape because it would totally wreck your hot pick-up career if you went to prison. But never anything about how to avoid *actually* raping anyone, or any hint that they cared about the emotional well being of women--or anything at all besides their own damn selves. &gt;how to avoid actually raping anyone\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\n...\n\nIt's not fucking difficult. You'd think so. Until they start talking about \"overcoming last minute resistance\" and the whole thing turns to fuzzy edges. Seriously? If they're just resorting to rape anyway, why do they bother with the rest of the game? Seriously? If they're just resorting to rape anyway, why do they bother with the rest of the game? you don't know what rape is... If a girl becomes hesitant at the last minute and you change her mind, that's not rape.  That's just changing her mind about having sex. But, wait, if she changes her mind about having sex, and you go ahead and do it anyway, how is that not rape?\n\nUnless you are being sarcastic, I can't tell. the important part is that you change her mind before actually having sex.   You'd think so. Until they start talking about \"overcoming last minute resistance\" and the whole thing turns to fuzzy edges. No.\n\n Hey guys! We got some last minuet resistance over here! No means yes, and yes means anal! You'd think so. Until they start talking about \"overcoming last minute resistance\" and the whole thing turns to fuzzy edges. Rape requires either force, behaviour altering substances or blackmail of some sort.\n\nNone of those are PUA tools. Saying no and changing your mind to yes doesn't make it rape. Regretting sex doesn't make it rape either. Pressuring someone until they give in still makes you an incredibly shitty person, even if they do *technically* give in. And if you load the pressure on someone until they fold and then they regret it immediately afterwards and *you don't care or realize that you did something wrong*, you're a pretty big fucking scumbag and shouldn't be trusted to own genitals. Most popular method of defeating LRM is responding to a \"no\" without causing a scene or being impacted, instead getting up, grabbing a sandwich, checking your email and doing something entirely ordinary and non-sexual. Shifting your attention away and not caring.\n\n80% of time the woman will actually respond to this by getting up and re-initiating sex.\n\nThat's not putting on pressure. If you claim it is you shouldn't be trusted with a brain. I don't owe you my attention, nor will I give it to you unless you deserve it. That's actually giving the choice over to the woman. It is perfectly acceptable (and occasionally happens) to simply leave. That's what Sedditors in other subreddits tell me over and over again. But whenever I go to the subreddit and look at the advice people seem to be giving, a LARGE portion of it seems to be \"escalate and poke holes in all of her excuses for saying no.\"\n\nIf you're treating women with respect and honoring their right to FREELY decline if they do not want to have sex then good for you. But I fear for the things that very shy and socially awkward men are being told is right and fine to do. That I *SEE* them being told to do. Rape requires either force, behaviour altering substances or blackmail of some sort.\n\nNone of those are PUA tools. Saying no and changing your mind to yes doesn't make it rape. Regretting sex doesn't make it rape either. I've seen threads on there about how to avoid getting *accused of* rape because it would totally wreck your hot pick-up career if you went to prison. But never anything about how to avoid *actually* raping anyone, or any hint that they cared about the emotional well being of women--or anything at all besides their own damn selves. I've seen threads on there about how to avoid getting *accused of* rape because it would totally wreck your hot pick-up career if you went to prison. But never anything about how to avoid *actually* raping anyone, or any hint that they cared about the emotional well being of women--or anything at all besides their own damn selves. Ugh I saw this a lot there, as well as on Men's Rights, and it really ticked me off. There's a lot of, \"If a girl says no, you should stop, you don't want her to accuse you of rape,\" when it should really be, \"If a girl says no, you should stop, because you don't want to rape her.\" I can't tell if it's because these guys care less about the possibility of raping someone than about the possibility of getting caught, or if it's because they really don't think it would be rape, but are worried about some crazy feminist claiming that it is. My thoughts exactly! I sometimes go read their \"field reports\" on /r/seduction for shits and giggles and I once saw one that was pretty similar to this. Basically, this guy was whining that he didn't get the girl after following (read: stalking) her and asking weirdo questions like where her house was. If I remember correctly, the dude was baffled that she called the cops on him but totally defended his \"methods.\" This PUA stuff is one of the weirder things to come out of the 2000's. I'm sorry you had to experience it OP. Source? Source? Yeah this was dumb to ask for a source, but I actually commented in this thread so it was easy for me to find so I went ahead and found it. Because it's a pretty hilarious read.\n\nhttp://www.reddit.com/r/seduction/comments/15n1x5/on_aa_just_approach_whats_the_worst_that_can/ Sounds like some weird Pick Up Artist strategy BS. Sounds like some weird Pick Up Artist strategy BS. As a proud PUA myself, let me reassure you that no PUA would wait for you 15 minutes like the dude OP met did.\n\nAnd no good PUA would flip out over a rejection. Handling rejection is the first thing you learn.\n\nIf he was a PUA he would have went in with her, chatted up her friends, got their numbers in an effort to make himself look more attractive and then potentially move towards taking OP home. Right. Because when a random guy meets a group of friends, asking for all of their phone numbers is a great strategy.  Right. Because when a random guy meets a group of friends, asking for all of their phone numbers is a great strategy.  Right. Because when a random guy meets a group of friends, asking for all of their phone numbers is a great strategy.  Sounds like some weird Pick Up Artist strategy BS. it definately isn't [Yes, it's called negging](http://xkcd.com/1027/) [deleted] The fact that it was a poorly-executed attempt at negging doesn't mean it wasn't an attempt at negging. [Yes, it's called negging](http://xkcd.com/1027/) [Yes, it's called negging](http://xkcd.com/1027/) Sounds like some weird Pick Up Artist strategy BS. [deleted] So, we should not be nice.\n\nOh, wait. Then we're bitches.\n\nNinja disclaimer: I'm not directing sarcasm at you. Just in general. [deleted] From my experience, off the top of my head, most (a very large majority, even) guys that hit on me only to have me turn them down *do not* react nicely in any way. I've grown to simply prefer avoiding contact with them and removing myself from the situation as fast as possible.\n\nGranted, I'm only speaking of those that are rude about hitting on me, commenting on my various assets out-of-the-blue or trying to touch me. So on and so forth. Which also tend to be the vast majority of guys that hit on me. I can count on one hand the number of times that any dude has attempted to be charming in the process, but cannot even begin to estimate the number that make me feel squicky and/or unsafe.\n\nBut, again, this is my experience. Maybe there's just something about me that simply attracts humongerous douche missiles. I remember one guy, we danced, drank, did a few lines in his car, made out a bit (lots of chemistry there), and then he asked me 'how would I feel about dating a married man?'\n\n60 to zero in seconds (I don't do married men). I give the guy props for being up-front about his situation (cold wife, kids he adored, no sex, yada yada). But he took the rejection so gracefully that I felt really bad for him. But not so bad that I would sleep with a man with a wife and kids.\n\nI prefer to think the guy was genuine, that he really was a hurt and confused guy just looking for a bit of warmth and a little action. But who knows? Maybe he was a pu artist, just playing the part of a hurt and confused guy? Maybe a different woman would have felt bad enough to sleep with him (and really ladies, it's not like this will kill you. We do it all the time, and it's fine when it's our choice).\n\nBut he was cute, and charming, and immediately backed off the moment I said 'no'.\n\nEdit: And that's the bottom line: \"No\" means **no**. Tying to push back at that 'no' is when it gets creepy.\n [deleted]  Hold on to your hats, gals. Gaslighting is the new black.  Hold on to your hats, gals. Gaslighting is the new black.  What is \"gaslighting\"?  Gaslighting is when you try to get someone to doubt their own memory, or, as could well have been the case in this situation, sanity.\n\nIt's a film reference. http://www.imdb.com/title/tt0036855/ What is \"gaslighting\"?  Basically when someone tries to make you [doubt your own memories and even sanity.](http://en.wikipedia.org/wiki/Gaslighting)\n\nSee [also](http://thecurrentconscience.com/blog/2011/09/12/a-message-to-women-from-a-man-you-are-not-%E2%80%9Ccrazy%E2%80%9D/). Basically when someone tries to make you [doubt your own memories and even sanity.](http://en.wikipedia.org/wiki/Gaslighting)\n\nSee [also](http://thecurrentconscience.com/blog/2011/09/12/a-message-to-women-from-a-man-you-are-not-%E2%80%9Ccrazy%E2%80%9D/). What is \"gaslighting\"?  Hold on to your hats, gals. Gaslighting is the new black.  \"Once you go gaslighting, you never go backslighting.\" -- PUA handbooks everywhere this spring? \"Once you go gaslighting, you never go backslighting.\" -- PUA handbooks everywhere this spring? If you go to /r/seduction right now, how many of the posts do you find offensive? I love how you guys come into these threads that talk about how awful PUA attempts are and still try to defend that shit. Are you completely oblivious? Have you so thoroughly bought into the PUA/seduction line that you're incapable of actually acknowledging how women feel about it? I love how you guys come into these threads that talk about how awful PUA attempts are and still try to defend that shit. Are you completely oblivious? Have you so thoroughly bought into the PUA/seduction line that you're incapable of actually acknowledging how women feel about it? I don't think HammerMeat was defending the guy in OP's post, just the /r/seduction community in general. I'm female and read seddit, and while there is some awful stuff there, most of it is about how to improve you social skills - not about being dishonest or disrespectful.  You're also defending that shit? I hate to tell you this, but those aren't social skills that they're teaching in there. It's straight up manipulation and degradation. I'm not defending the community as a whole, just the decent parts of it. Not everyone on seddit does degradation. \n\nAnd I hate to tell you this, but manipulation is an important social skill. It's only wrong if you use it to convince someone to do something that they definitely don't want to do.  &gt; And I hate to tell you this, but manipulation is an important social skill. It's only wrong if you use it to convince someone to do something that they definitely don't want to do. \n\n[In other words, it's always wrong.](http://en.wikipedia.org/wiki/Psychological_manipulation) You're obviously conflating persuasion with manipulation. Hold on to your hats, gals. Gaslighting is the new black.  Hold on to your hats, gals. Gaslighting is the new black.  Hello, Internet friend. I am impressed by your hilarious and awesome use of the term \"gaslighting.\" Please enjoy this upvote.  In no way is gaslighting ever hilarious. I'm pretty sure Jedi was referring to the *use of the word* inserted into a common colloquialism, not the actual act. Hence\n\n&gt;use of the term Thank you! Yes, this. You know, this subreddit is supposed to be a safe place to talk about stuff, but I find myself getting downvoted to oblivion for semantics and misunderstandings more often here than elsewhere. It's extremely discouraging.  Yeah, me too. You just have to resist the urge to be lighthearted, because everything here is very serious That should not be necessary, especially for a subreddit that claims to be a \"safe place\" to discuss difficult topics. \n\nI am seriously so fed up with 2X lately that I'm thinking of unsubscribing. I come here to be able to talk candidly, and I get shot down more often than not. It really is the opposite of a safe place, this is one of the most judgmental subreddits I've been to.  In no way is gaslighting ever hilarious. In no way is gaslighting ever hilarious. But you *just* said it was. Wat.  &gt;I told him that in no way was I going home with him and he generated some lie about how I promised that I would before I went in the bar.\n\nBUT YOU PROMISED ME PUSSY!!!!!1!\n\n But I was so nice and gentlemanly, YOU MUST SUBMIT NOW BECAUSE I'M NICE!  It's called the sidewalk sale Ick!  What a disgusting concept.  Gross dudes are gross. And desperate dudes are desperate. And desperate dudes are desperate. What is so wrong with masturbation?   haha. i met a really good friend like that. some guy at a concert came up to me and told me i promised him a ride home. i figured he was wasted and just confused, and told him someone else that looked like me must have promised him... but he kept at it telling me it was me. this went on for some time, and i realized he wasn't wasted at all! he was really just trying to convince me i was the one that was confused. it was so funny that he would think something like that would work, that i decided he must not really think that... that instead he was trying to pressure me into giving him a ride so he wouldn't have to walk.\n\ni know that this must seem like this guy was a jerk, but really he wasn't. he was more entertaining than anything. and he wasn't hitting on me... he just needed a ride was all. i was going that way, so i turned it around on him and THEN offered him a ride, making clear that i know i hadn't done so already. he and i ended up becoming as close as brother and sister after that. \n\nhe's gone now... unfortunately he ended up with a major drug dependence and overdosed and died... but i still remember him fondly and with smiles despite his misgivings. \n\ni'm sure the dude OP had to deal with was not at all as charming as my old friend, but it was nice to be reminded of my friend and how we met :) Sorry about your friend.  I've been puking my ass off drunk sitting in an alley and had a guy wrap his arm around me mid chunder and try to pick me up. Some men are disgusting as shit. I'm sorry you had to deal with one of the bad breeds.\n Please, *please* tell me you turned toward his shoes mid chunder and finished. I've been puking my ass off drunk sitting in an alley and had a guy wrap his arm around me mid chunder and try to pick me up. Some men are disgusting as shit. I'm sorry you had to deal with one of the bad breeds.\n  Hmm, I haven't checked out Seddit for a while. Sedditors keep showing up in threads and insisting that the creepy techniques are outdated. Let's see if they've learned to be less rapey yet.\n\n&gt;[1.Give an excuse (even a weak one) to get into her room.  \n2. Start the escalation ladder. Ignore Last Minute Resistance.  \n3. ????  \n4. SEX!](http://www.reddit.com/r/seduction/comments/18fpwi/story_about_last_night_and_how_terrible_i_am_at/c8eh1fj)\n\nOH FUCK NO. Hmm, I haven't checked out Seddit for a while. Sedditors keep showing up in threads and insisting that the creepy techniques are outdated. Let's see if they've learned to be less rapey yet.\n\n&gt;[1.Give an excuse (even a weak one) to get into her room.  \n2. Start the escalation ladder. Ignore Last Minute Resistance.  \n3. ????  \n4. SEX!](http://www.reddit.com/r/seduction/comments/18fpwi/story_about_last_night_and_how_terrible_i_am_at/c8eh1fj)\n\nOH FUCK NO. Hmm, I haven't checked out Seddit for a while. Sedditors keep showing up in threads and insisting that the creepy techniques are outdated. Let's see if they've learned to be less rapey yet.\n\n&gt;[1.Give an excuse (even a weak one) to get into her room.  \n2. Start the escalation ladder. Ignore Last Minute Resistance.  \n3. ????  \n4. SEX!](http://www.reddit.com/r/seduction/comments/18fpwi/story_about_last_night_and_how_terrible_i_am_at/c8eh1fj)\n\nOH FUCK NO. Hmm, I haven't checked out Seddit for a while. Sedditors keep showing up in threads and insisting that the creepy techniques are outdated. Let's see if they've learned to be less rapey yet.\n\n&gt;[1.Give an excuse (even a weak one) to get into her room.  \n2. Start the escalation ladder. Ignore Last Minute Resistance.  \n3. ????  \n4. SEX!](http://www.reddit.com/r/seduction/comments/18fpwi/story_about_last_night_and_how_terrible_i_am_at/c8eh1fj)\n\nOH FUCK NO.  If you think that is strange, you should pay a bit more attention at the bars. This is how most drunken women I've seen get picked up by sober guys. The insult at the end was probably just that though, not an attempt at \"negging\" (I believe the term is called).  Huh, who knew?  It is incredibly bizarre and kinda disturbing.  I once had a little too much to drink and was emptying my stomach in the bushes outside a house part (not my classiest moment), I wasn't in the bathroom because the line was too long.\n\nAnyway... some dude comes strolling by and stops and acts all concerned.  He's like \"Oh honey, you don't feel well.  Why don't you come with me to your apartment and I can get you some water and you can lay down.\"  At the time it just seemed silly because I could get water inside and I was planning on crashing on the couch of a friend who lived nearby.  It wasn't until the next day it occurred to me how utterly creepy and predatory that dude had been. Huh, who knew?  Most men trolling bars at 2:00AM looking for \"desperate looking girls\" :-p As for why I was there? To pick up a friend in the exact same position you found yourself in. It is really more depressing than I can convey in text, so good on you for how you handled the situation.    i read that as though you had doubled over with laughter and pissed slightly... confused me a bit.\n    OP, I am inferring from your tone (of writing) / description of reaction that you thought this was ridiculous. And because you took an uncomfortable situation and (again, inferring) seamlessly was able to articulate how disrespectful / uncomfortable / abnormal (whatever you lectured him about) without feeling victimized or using it as an example of the war against ladies and men and whatever else, I am super inspired and have a shit load of respect for you. Thanks! I know we all get in shitty or weird experience with creepers all the time but I get so down when people say they were freaked out or humiliated by situations like this.      You might enjoy this, I hope you guys do. When I was a senior in high school I had the strangest attempt at a pick up. It hasn't been topped and it's been a decade and I've gotten married.\n\nSo I was out on a weekend afternoon with some female friends and I was driving and needed gas. At that time I had weird quirks and one was a pair of billy bob teeth that I often wore around. You now have the set up. So I pull in and start pumping my gas and we're laughing and making jokes about my costume teeth. There were guys on the other side of the pump getting gas and our girly giggles got their attention. So one of them from behind me cat calls, teeth still in, I turned and looked at him. He shrugged and ask my name and if I was single. Being young and out with my friends I continued my bit and drooled a little and said Sally (not my name) and added a giggle.  The rest of the story is him trying to get my number while I go full cliche redneck. Once I was done fueling up I hopped in without giving him my number, took the teeth out, and drive away waving. The guy was also much older than me so I truly wasn't interested and just enjoyed messing with them.\n\nI still enjoy telling this story and used those teeth on my husband so much he asked me to marry him, that's a lie. He stole those teeth and threw them away. So which part was strange? Talking to you while getting gas or that he would try and hook up with someone with bad teeth?    yea some guys do that...they try to belittle you into being with them, its weird.  Yeah, because we women like to be abused that way.  Do you feel safe alone until the bars close?  None of my business but that is when all the bad guys are all juiced up and looking for trouble to get into.  Stay safe!   His comment about being \"desperate looking\" was unacceptable.  \n\nHowever, why didn't you tell him you weren't interested?  You were having a good conversation, he was under the impression that you would be out in just a moment to get your phone, he told you he'd wait, you didn't object to him waiting, and then you stayed in the bar hoping he'd go away.  I think a good response to \"I'll wait for you out here\" would be to say, \"No, that's alright, I'm not really interested\" and be done with it.  \n\nNow, his reaction after you came out wasn't appropriate.  I understand that he'd be a little \"uppity\" about you being gone that long, I'd feel the same way, but calling you desperate was mean.  Though, I find it a little rich that you lectured him about respect when you wouldn't even give him the courtesy of being upfront with him.  And laughing at him was a low blow.  \n\nI don't think he's a creeper, he just didn't handle the rejection well. But honestly, I think you both messed up.  Please be more straightforward next time, you'll spare yourself a headache and you'll spare him hurt feelings.     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18j8ao/the_strangest_attempted_pickup_ive_ever_seen/"
  }, {
    "id" : 1,
    "title" : "Thought I'd share this soothing and pretty little song about a young girl. It makes me feel very at peace.",
    "url" : "http://www.youtube.com/watch?v=Y4akL4eG03Q"
  }, {
    "id" : 2,
    "title" : "[IFF]My favourite picture from graduation, my dad and I",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/h4sIVNA.jpg"
  }, {
    "id" : 3,
    "title" : "[IFF] A collection of my first comic series AKA my dream come true",
    "snippet" : "  Nice.  Are 4 and 5 being the same a joke about memory loss?  Aww, I like these! Is it a webcomic and if so, where is it hosted? I'd love to read more of them.       [deleted]",
    "url" : "http://imgur.com/a/201og"
  }, {
    "id" : 4,
    "title" : "DAE feel really fucking tired of being 'nice'?",
    "snippet" : "All my life I have felt this uncontrollable urge to please others, to be the perfect daughter. I went through my entire childhood with a smile on my face. I hid a pretty serious bout of depression throughout my adolescence because I knew it would make others feel uncomfortable. I yearned for male attention to validate me and accepted it wherever I could get it, even when it made me feel uncomfortably sexualized and even when I was too young. Most of all, no matter how I was feeling as a young girl, I constructed myself in a way that would be inoffensive and pleasant for other people.\n\nI'm 19 and I'm really fucking tired of it all. I shouldn't have to laugh at rape jokes. I shouldn't have to swallow casual misogyny with a smile. I shouldn't have to let strangers touch me, call out lewd things, speak about my body, and when they do, I shouldn't have to act like those things are a form of flattery. \n\nAnd when I refuse to tolerate these things, I shouldn't be called a bitch.\n\nI guess this post is coming off as a rant, but I'm hoping to generate some discussion. Does anyone else relate?  I got tired of being nice too. As the nice girl, I was usually expected to mummy everyone at work; help them to fill in the right forms, keep track on important dates and inform others, take charge in organizing social events and so on. And no, I was not hired to do that. I was hired to do the same job as everyone else.\n\nSo I decided to not do it. When someone asked me about a form I told them the instructions etc could be found on the internet, when it was time for social events I told everyone I was busy with my project and would not be taking the main responsibility. \n\nFeels good. You are very smart for doing this. These little favors will eat away your time and attention, and performance reviews do not take these into account when evaluating your core duties. Don't let yourself become just a step on someone else's ladder. I got tired of being nice too. As the nice girl, I was usually expected to mummy everyone at work; help them to fill in the right forms, keep track on important dates and inform others, take charge in organizing social events and so on. And no, I was not hired to do that. I was hired to do the same job as everyone else.\n\nSo I decided to not do it. When someone asked me about a form I told them the instructions etc could be found on the internet, when it was time for social events I told everyone I was busy with my project and would not be taking the main responsibility. \n\nFeels good.  &gt;I'm 19 and I'm really fucking tired of it all. I shouldn't have to laugh at rape jokes. I shouldn't have to swallow casual misogyny with a smile. I shouldn't have to let strangers touch me, call out lewd things, speak about my body, and when they do, I shouldn't have to act like those things are a form of flattery.\nAnd when I refuse to tolerate these things, I shouldn't be called a bitch.\n\nYou're absolutely right.  You shouldn't and don't have to put up with any of that shit.   \n\n And none of these are examples of \"being nice.\" Nice people don't expect you to laugh at jokes you don't like, or make you accept being treated in ways you're not comfortable with. Nice people don't call you a bitch for standing up for yourself.  And none of these are examples of \"being nice.\" Nice people don't expect you to laugh at jokes you don't like, or make you accept being treated in ways you're not comfortable with. Nice people don't call you a bitch for standing up for yourself.  And none of these are examples of \"being nice.\" Nice people don't expect you to laugh at jokes you don't like, or make you accept being treated in ways you're not comfortable with. Nice people don't call you a bitch for standing up for yourself.   ...Are you me? Seriously. I think we're the same person. I'm going to lurk here for people's comments as well. We're triplets! Except I had a rebellious phase mid-high school, but then I quickly snapped out of being myself and turned into *whatever* again. What a load of horse shit, me. ...Are you me? Seriously. I think we're the same person. I'm going to lurk here for people's comments as well. [deleted] [deleted]  I literally remember the day I stopped caring, I stopped giving a fuck about what people expected from me all the time. I had this friend who just took and took and took and completely made me feel like shit if I wasn't hanging on to her every word. Meanwhile, my mom was dealing with cancer and my family was falling apart. It's like I woke up and said to myself... \"You know what? I don't give a fuck anymore. It's time to do what I want and think for myself\"\n\n\nI have never looked back to feeling like I have to please everyone. \n\nOnce you realize that wanting pleasing others is ultimately a false and TEMPORARY sense of happiness, the clarity and reality of everything around you will be overwhelming. You are the only one who is letting people make you think that you have to live up to their standards. &gt;I had this friend who just took and took and took and completely made me feel like shit if I wasn't hanging on to her every word. \n\nI can relate to this. It sounds like you're a really strong, confident woman and better off without her.\n\nOne thing I struggle with, though, is that I kind of feel like I'm being selfish by putting my own happiness first. How do you find a balance of being empathetic and making others happy but protecting yourself, too? &gt;I had this friend who just took and took and took and completely made me feel like shit if I wasn't hanging on to her every word. \n\nI can relate to this. It sounds like you're a really strong, confident woman and better off without her.\n\nOne thing I struggle with, though, is that I kind of feel like I'm being selfish by putting my own happiness first. How do you find a balance of being empathetic and making others happy but protecting yourself, too? I literally remember the day I stopped caring, I stopped giving a fuck about what people expected from me all the time. I had this friend who just took and took and took and completely made me feel like shit if I wasn't hanging on to her every word. Meanwhile, my mom was dealing with cancer and my family was falling apart. It's like I woke up and said to myself... \"You know what? I don't give a fuck anymore. It's time to do what I want and think for myself\"\n\n\nI have never looked back to feeling like I have to please everyone. \n\nOnce you realize that wanting pleasing others is ultimately a false and TEMPORARY sense of happiness, the clarity and reality of everything around you will be overwhelming. You are the only one who is letting people make you think that you have to live up to their standards. I seriously saved your comment. I had this recent realization too with the help of therapy and other life circumstances.  I was always the go-to person for my families issues and after years of this, I'm not letting their problems become my problems any longer. It's a step by step process but its getting easier as time goes on and I continue my therapy. Wow, I don't even know you but I'm really proud of you. I say I woke up and decided not to care but like you said, it's a step by step process of letting go and moving forward. Like you, I was always the one to come too. We may look and sound strong to others but we hurt and feel it all as they do. Thats part of who we are and that's why our friends and family sought after us, because we let ourselves feel the pain too. I sought counseling during the time as well. My whole family did really. I remember the time very vividly. It's a time of growth, embrace it and cherish it.  I literally remember the day I stopped caring, I stopped giving a fuck about what people expected from me all the time. I had this friend who just took and took and took and completely made me feel like shit if I wasn't hanging on to her every word. Meanwhile, my mom was dealing with cancer and my family was falling apart. It's like I woke up and said to myself... \"You know what? I don't give a fuck anymore. It's time to do what I want and think for myself\"\n\n\nI have never looked back to feeling like I have to please everyone. \n\nOnce you realize that wanting pleasing others is ultimately a false and TEMPORARY sense of happiness, the clarity and reality of everything around you will be overwhelming. You are the only one who is letting people make you think that you have to live up to their standards.  I let my bitchness, cranky, or irritation (call it what you will) slip out a little bit all day. So I come across as someone who is a little sassy/honest/witty (semantics). \n\nNever have been a people-pleaser, in fact, for the longest time I was just an asshole. I have since learned you catch more flies with honey and I truly do like people, so I try not to just be a dick for the sole purpose of being a dick.\n\nI think the middle ground is the best place to be. Don't let people walk all over you, and don't walk all over people. Read/feel out people and try to accommodate as best you can but without putting yourself out. \n\nAnd remember change comes through baby steps.     I'm 22 and I still can't stop being nice. I have a super sensitive guilty conscious and I would feel terrible for not giving a fuck. It sucks because this attitude is wearing me away. Have you considered seeing a counselor or a therapist? I had/have a similar problem and mine has helped quite a bit. This is good advice, I'll def look into it. Thanks!  No problem! Best of luck. :) I'm 22 and I still can't stop being nice. I have a super sensitive guilty conscious and I would feel terrible for not giving a fuck. It sucks because this attitude is wearing me away. Ahh me too (except I'm 24). I have slowly gotten better at being assertive but my first instinct is to be a doormat so I don't upset anybody. I have to remind myself to put myself first, that I don't need to sacrifice for every single person who comes along. Obviously I will help my friends out, but I don't need to make myself uncomfortable or worse just to please a stranger. But it is so hard. The instinct to not make a fuss, to roll with it, is so strong. But the long-term emotional benefits of standing up for yourself do pay off. \n\nBut damn if it isn't a long journey!   No. Because I am nice when I want to be nice and not when I don't feel like it.  If someone is pissing me off, I tell them to fuck off. This doesn't mean I'm rude, it means that I can look at someone and tell them that their comment is inappropriate, like a disappointed teacher.  Of course, I suffer from Chronic Happy Voice which means that even when I'm really angry it sounds like I'm pissing rainbows, so I often sound nicer than I mean.  However, if someone touches me when I don't want them to, I quite firmly take their hand off and say \"NO\", like you do to a recalcitrant dog.  It usually works.     I can really relate to this, _particularly_ when I was 19. Here's my two cents: it's not an easy path learning how to stand in your own integrity. Some people will tell you to just \"avoid these people\" but the truth is, they're nearly impossible to avoid ('these people' being the ones who make rape jokes, speak misogyny, touch you, say lewd things, etc) so don't beat yourself down on it. Esp if they're coming from your family, which was my case.\n\nTry to avoid them gently and also learn to cope with them simultaneously. It's a careful dance... Also, don't just shut down and \"not care\". I feel that most of the times people do this, it is just repression. It won't make the hurt go away, it will just shove it deeper. Feel fearless about expressing how you feel. That's the only solution. Don't be ashamed of your being offended. Tell others how they make you feel with their jokes. Don't expect them to take you seriously, but trust that you did your part and they have noted it on some level.\n\nYou can't force others to wake up, or change when you want them to. What helped me so much, was to realize _that I didn't need them to change_.... all I needed what to express myself clearly so that I felt good about _who I was_.\n\nAnd being strong doesn't necessarily mean that you show no emotion... or that you become fiercely angry... or that you are sharp and witty... or call them out... being strong has no face. It's whatever it looks like when you feel good about yourself. Good luck!    I literally remember the day I stopped caring, I stopped giving a fuck about what people expected from me all the time. I had this friend who just took and took and took and completely made me feel like shit if I wasn't hanging on to her every word. Meanwhile, my mom was dealing with cancer and my family was falling apart. It's like I woke up and said to myself... \"You know what? I don't give a fuck anymore. It's time to do what I want and think for myself\"\n\n\nI have never looked back to feeling like I have to please everyone. \n\nOnce you realize that wanting to please others is ultimately a false and TEMPORARY sense of happiness, the clarity and reality of everything around you will be overwhelming. You are the only one who is letting people make you think that you have to live up to their standards.           Nope, because I am not \"nice\".  Even at my lowest self-esteem, I was not that brand of \"nice\" - I was mostly just withdrawn and shy, and if anyone acted inappropriately to me, I looked and acted so uncomfortable that people got the message.  Interestingly, people tend to assume that I am a lot more prudish than I actually am, even now.  Those who do not know me well tend to avoid any kind of comments that can even remotely be construed as inappropriate.  I've had people apologize for swearing in my presence.  People are hesitant to touch me, even if they are friends or casual acquaintances wanting to hug.  Somehow, without meaning to, I set my boundaries really well - and I really have no idea how.\n\nI've outgrown the low self-esteem, went to law school (which was great assertiveness training), and learned to stand up for myself, and you know what?  No one calls me a bitch.  I am treated with respect.  No one makes rape jokes around me - in fact, until I got on TwoX, I didn't even know rape jokes were a thing.  I didn't know that casual misogyny was a thing.  This never happens to me.  \n\nSeriously, try to stand up for yourself.  Don't be \"nice\".  What you're describing is not being nice, anyway - it's being submissive.  Don't be submissive.     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18k4h8/dae_feel_really_fucking_tired_of_being_nice/"
  }, {
    "id" : 5,
    "title" : "Why do I let it bother me that my bf won't buy me gifts?",
    "snippet" : "I know it's petty and he's always been honest since the day we met that he does not buy \"occasion gifts\" and this was something I accepted as the price of admission to this relationship. But now that we've been together over two and a half years it's bugging me.\n\nHe has bought me various practical things here and there and he does a lot of work around my house. He's good at fixing things. He's a good boyfriend, even a great one, on a day to day basis. He tells me he loves me often. We have great times together. But every time an occasion rolls around I'm secretly hoping he'll surprise me with something, anything, I don't even want an expensive or elaborate gift. (He is a much younger than me college student so he doesn't have money to spend on gifts, I admit, but he could buy me a box of candy for what he spends on beer any given day.)  So every birthday, Valentine's, whatever, I'm disappointed and hurt and he picks up on it and gets angry and gives me the \"you know I don't believe in that crap\" speech. \n\nNormally I think I'm very rational but this time it's 2/15 and I'm still irritated. My roommate's roses are like, mocking me! \n\nI know it's dumb. I am lucky to have anyone at all. Right? Tell me to quit whining. \n\nEDIT: Thank you all for the comments/advice. I feel much better about the whole thing. I am going to get myself something today. I work at a restaurant and this week has been totally draining in general so that probably played into my getting all emo. I also am going to get him a gag gift for his birthday which is pretty soon because I'm pretty sure he would be ok with that. I do like giving and I'll do it however I can. Thanks again. Reddit people are the coolest.  Do you mind clarifying what exactly it is that he does for you on special occasions?  Or does he just refuse to acknowledge/celebrate them at all besides a \"Happy Birthday\"?  Does he understand that you're not expecting diamond earrings?  To me, a gift is meaningful because it means my boyfriend was thinking of me, and he pays attention to me and thinks of me when we're not together.  Many of my favorite gifts from my boyfriend are things I mentioned in a one off, or that filled an annoying I need I had that I was too lazy or cheap to fill myself.\n\nI think it's one thing if he shows his care in other ways.  If in lieu of gifts, he plans ahead and makes you a nice dinner, or gives you the day off of cleaning, something like that.  But if he's just not really doing anything, I'd say it's more lazy.  And more than that, he's being stubborn.  My boyfriend thinks flowers are so stupid and has always made fun of me when I've said I wanted some, yet we weren't together yesterday for Valentine's day and he surprised me with roses.  They were the first flowers from him in the 3 years we've been dating, and somehow the fact I know how dumb he thinks flowers are makes them even more special to me.  He certainly didn't have to do that, but because he loves and cares about me, he was willing to make an exception to his principles and do something he knew I would like.  Wrong. It isn't dumb. It's one of the ways how people in our society express their love - through gifts. He's refusing to participate in that aspect of how people relate to each other, and while that's okay, it's not okay when it affects you. You *do* want to participate in that aspect of relationships. Why does he get to control this part of your relationship; why doesn't what *you* want in this regard matter? \n\nThe answer is that what you want *does* matter. You need to sit him down and say (in your own words): \"I know you've always told me from the beginning that you don't do occasion gifts. I was never okay with it, but I accepted it because I wanted to be with you so badly. But now that it's been two years like this I realize that what I want matters too, and I *do* want to exchange gifts with you. It may not be important to you but it *is* important to me. I understand that you don't believe in it, but I do. Can you please meet me in the middle here? We don't need to do huge extravagant gifts, but to me a small gift is a token of love, and I do want tokens of love from you.\" \n\nIn situations such as this, it isn't actually the topic at hand that is the issue. It isn't actually the gifts that is the issue between you and him. It's him refusing to fulfill your needs. It's him ignoring your feelings, needs and desires and only caring about his own. If and when you express that to him, and once he clearly understands that this is about your needs, then if he continues to not care about your needs and refuses to fulfill them, then you might have a bit of a problem on your hands. But first you need to clearly explain to him how this *does* matter to you and how it isn't about \"gifts\" but about \"your needs.\" She mentions that it was a personality trait that she knew about early on. If she can't accept this aspect of his personality then that sounds like her issue, not his.  It's not a personality trait though; it's a stubborn cynical refusal to participate in a tradition. And yeah, it's fine for people to refuse to participate in something like that, but not when it hurts their partners. It's not \"her issue\" just like it isn't \"his issue;\" it's \"*their* issue.\" If one or both cannot accept the other or bend a little for the other, then the relationship might not last because of it.  &gt;It's not a personality trait though; it's a stubborn cynical refusal to participate in a tradition.\n\nPlease explain to me the difference you're creating here, because it sounds like the same thing, just outlined in purposefully subjective and negative words.\n\nNot everything in a relationship is shared. Simply being on the \"bad end\" of something, as OP thinks she is, doesn't make that person right--that's an insane stance to champion. She knew that he didn't buy occasion gifts *right from the start*. And she was fine with it, *for two and a half years*. It doesn't all of a sudden become \"their problem\" when she decides to randomly become not-so-fine with his stated and previously totally-hunky-dory habit of not buying gifts. \n\nRelationships require compromise, yes. But not on everything, not on every single instance that brings about a disagreement. That's a childish thought. I would agree with you if OP's SO was blowing that money on stuff for himself, or neglecting her birthdays, but it sounds like he's otherwise a supportive, helpful, and loving man. I would agree with you if OP made it clear that she comes from a family where gift-giving is highly valued and an earnest expression of love, but it sounds like she just wants stuff because she's used to getting stuff on these days. The problem is *absolutely* hers. She needs to either rectify her feelings as the \"price of admission\" as she put it, or decide that price is too high and leave. She hasn't been fine with it for 2 and half years. She said she winds up disappointed every holiday. She's put up with it because she loves him, but that's not the same thing. She can continue to put up with it, or she can talk to him and he can put in an effort to make her happy, even if its not something he agrees with or likes doing.  I would encourage you to re-read the first graph again. And then, I would encourage you to re-read the last three sentences of my post above, because they address exactly what you've said here and another post would be redundant. Regardless of what her first paragraph says - if you actually read the rest of her post, she clearly hasn't been fine with it. She just hasn't said anything because no one wants to be that girl who complains because she didn't get a present. Should she have said something sooner? Yes. But I also don't think she should just have to shut up about it and suck it up. \n\nI'm certainly not advocating she dump him over this, you're right, he does otherwise seem to be a caring person. \n\nAnd I swear your last 3 sentences weren't there when I replied to you.  &gt;It's not a personality trait though; it's a stubborn cynical refusal to participate in a tradition.\n\nPlease explain to me the difference you're creating here, because it sounds like the same thing, just outlined in purposefully subjective and negative words.\n\nNot everything in a relationship is shared. Simply being on the \"bad end\" of something, as OP thinks she is, doesn't make that person right--that's an insane stance to champion. She knew that he didn't buy occasion gifts *right from the start*. And she was fine with it, *for two and a half years*. It doesn't all of a sudden become \"their problem\" when she decides to randomly become not-so-fine with his stated and previously totally-hunky-dory habit of not buying gifts. \n\nRelationships require compromise, yes. But not on everything, not on every single instance that brings about a disagreement. That's a childish thought. I would agree with you if OP's SO was blowing that money on stuff for himself, or neglecting her birthdays, but it sounds like he's otherwise a supportive, helpful, and loving man. I would agree with you if OP made it clear that she comes from a family where gift-giving is highly valued and an earnest expression of love, but it sounds like she just wants stuff because she's used to getting stuff on these days. The problem is *absolutely* hers. She needs to either rectify her feelings as the \"price of admission\" as she put it, or decide that price is too high and leave. Cynicism and stubbornness would be the personality traits. A refusal to do something isn't a personality trait; it's an action - or rather a lack of action.\n\nRegarding your second paragraph: people can change their minds. People can suppress their real feelings and then later decide not to suppress them anymore. People can think they're okay with something and later realize they're not. All of those things could have happened here with OP.  And you are somehow privy to the fact that this man is cynical (stubborn I'll grant you) *and* that his lack of gift-buying is motivated by laziness and thoughtlessness rather than an honest philosophical disagreement? Because, to me, that all just seems wildly speculative and judgmental, you know, since OP didn't mention any single detail per why he doesn't buy gifts.\n\nAnd yes, people can change their minds, that was never up for debate, nor does it qualify as a rebuttal to my argument. It's just sort of a statement like, \"people sleep.\" What matter is, OP is an adult, and suppressing your feelings for 2.5 years only to willy-nilly no longer suppress them is *not* adult and *not* a productive method of building rapport with one's partner. I'd be pretty frustrated with my girlfriend if she was all of a sudden upset that I didn't take her out for Valentine's Day and ran to a message board looking for advice rather than talking to me face-to-face about it.  &gt;an honest philosophical disagreement\n\nIn my opinion, philosophy should end where it hurts those you love and doesn't benefit anyone in particular.  You aren't dumb. Look up the \"Five Love Languages.\" It turns out that my love language is gifts. I told my husband, and he immediately stepped up.\n\n(His is quality time -- and I immediately started fulfilling that more diligently, too)     [deleted] No, he has been very clear that he'll be very angry if I do.  [deleted] [deleted] When this relationship began, I was 37 and he was 26. I was recently widowed and horribly lonely and depressed. I didn't think he was relationship material at all and kind of thought we would just have a fling. He has a great sense of humor and we had such great laughs together. I just thought he was a bit of fun. But we fell in love with each other. So now I'm sad that he won't buy gifts. Also sad, truth be told, that he won't ever marry me. But that's a whole different post.  [deleted] \"Had\" was just a typo. We still do have great times. I have changed my attitude considerably. He has changed his a little. I don't think it's time for the big talk yet. I can't stand the thought of being without him, honestly.  [deleted] No, he has been very clear that he'll be very angry if I do.  [deleted] OP this sounds like a great idea and I would advocate doing it. Just because he dislikes gifts in general you are no longer allowed to give them either? I know I looovvve giving just the right gifts to people, and my SO is terrible at picking out presents, though he doesn't have the aversion yours does. If my SO ever told me \"I'm terrible at picking out gifts, and so I won't be buying any more, and you're not allowed to either.\" I would be crushed. Giving even a small gift that is thoughtful is one of the ways I express my affection for people, it's basically me saying \"I know you well enough to get you something you will really like\". [deleted] &gt;Honestly? Do it anyway. Everyone I've ever encountered who's been anti-gift or anti-Holiday is doing it as a defense mechanism\n\nThis is my FATHER. Holidays are like walking on eggshells around him because he is so anti-holiday, no matter what holiday it is! But on those gift giving holidays, I still always get him a gift and he always loves it and is appreciative and I can tell he is genuinely happy.\n\nI am 23 years old and just found out this past Christmas why he was so anti-holiday (not really anti-gift giving, but definitely anti-gift receiving). Not going to go into full story mode but let's just say his mom did something to him that was pretty traumatizing on a Christmas day when he was a kid. He admitted the reason he is so anti-gift receiving is because it IS a defense, he doesn't want to be disappointed or hurt if someone he loves doesn't get him anything or think of him during these times. Brings back harsh memories for him. \n\nSO OP, Go with this suggestion, there is no harm done. [deleted]   &gt;I am lucky to have anyone at all.\n\nNo. You deserve to have a (more or less) great relationship with a loving person. And you're lucky that you do in fact (more or less) have one of those.\n\nI'm sure it's just a wording thing, and you don't mean to suggest that you feel you should be grateful to be in a relationship that you find relatively unsatisfying, but just in case. You shouldn't settle for a relationship that isn't working for you just because it's just so much worse to be single. Because... being single isn't always that bad.\n\nAnyway, it's perfectly valid to want to exchange gifts on certain days. Presents are a fun activity that people do to show their love together and the experiences are pretty enjoyable, and then you have a token afterwards that reminds you of the person and how you feel about them. Sometimes it gets carried away like when it's Christmas and you have to find gifts for every relative or every relative's child and you don't know them really well and then it becomes a little artificial and a hassle. But exchanging small gifts with a significant other on a few days out of a year isn't really like that. \n\nI think the issue is that you're having a difficult time explaining to him - and yourself - why you feel the way you do. Instead, you're trying to dismiss your own feelings as irrational and stupid, because this is how you think he probably feels about them. (Or, at least that's how I read your post.) \n\nIt's okay that he's not into giving gifts, and it's okay that you are. I hope you can get him to understand how you feel. Perhaps present it as an activity that you enjoy, that would mean a lot to you if he would join you in. \n\nPerhaps you can come up with some kind of compromise, where instead of insisting that you exchange gifts for every occasion, you pick one or two days out of the year (birthdays and anniversary, for example, instead of that plus Christmas and Valentine's and whatever else). \n\nAnd if he completely refuses to budge...do you have a close girl friend who might be up for exchanging platonic gifts with you on these sorts of holidays? That might be fun and rewarding. I know it would still hurt a little that you couldn't do it with him, but maybe some good could come out of it.\n\nDo you guys go on dates? I know he didn't get you anything, but did you do anything special yesterday? Does he celebrate holidays and gift-giving occasions in ways besides giving gifts, or ignore them altogether?\n\nIn the meantime, maybe buy yourself some flowers.  &gt; I'm disappointed and hurt and he picks up on it and gets angry and gives me the \"you know I don't believe in that crap\" speech. \n\nHe shouldn't be lecturing or punishing you for feeling sad. You were left out of a big cultural tradition - and he's mocking you for it? Rude. &gt; I'm disappointed and hurt and he picks up on it and gets angry and gives me the \"you know I don't believe in that crap\" speech. \n\nHe shouldn't be lecturing or punishing you for feeling sad. You were left out of a big cultural tradition - and he's mocking you for it? Rude. It's a tradition? Until this post I didn't even know gifts were a \"thing\" for V-day. Flowers, chocolates, romantic night out... sure. But *another* day where we have to buy gifts? Geez. To have that kind of money... &gt;Flowers, chocolates,\n\nWhat do you think those are if not gifts?  ehh... this is one case where I think \"I don't believe in that crap\" equals lazy, insensitive, and cheap.  Good luck to him finding a girl who is *really* cool with no thoughtfulness being displayed ever...  ehh... this is one case where I think \"I don't believe in that crap\" equals lazy, insensitive, and cheap.  Good luck to him finding a girl who is *really* cool with no thoughtfulness being displayed ever...  That's just offensive. He clearly seems like a good person and shows his love in many other ways. Just because he doesn't like this one way of showing love (which in my opinion, is the lowest form), it most definitely does not mean he's lazy, insensitive, and cheap. \n\nI'm a girl who does not like being bought things. I don't think it's thoughtful at all. What is thoughtful to me? Cooking a meal for the two of us, massaging my back when it really hurts, giving me space when you can tell I need it, offering to drive me to a doctor's appointment. I'm almost disgusted at the vision of a guy clicking a few buttons on a florists website and thinking \"I'M SO THOUGHTFUL\" and then his girlfriend receiving flowers and thinking \"HE'S SO THOUGHTFUL.\" When you could make the same gesture to literally any girl on the planet with no further thought, it's not showing you care about her as a person.  ehh... this is one case where I think \"I don't believe in that crap\" equals lazy, insensitive, and cheap.  Good luck to him finding a girl who is *really* cool with no thoughtfulness being displayed ever...  Yes because giving gifts is *the only* way to be thoughtful. Did you even read the post?\n\n&gt;He has bought me various practical things here and there and he does a lot of work around my house. He's good at fixing things. He's a good boyfriend, even a great one, on a day to day basis. He tells me he loves me often. We have great times together. But every time an occasion rolls around I'm secretly hoping he'll surprise me with something\n\nThe problem stems from OPs distorted view of what \"I don't buy occasional presents\" means. It's immature and lazy to know something is important to your partner and refuse on some lame ass principle.  He could draw something for her or write up a card or turn a piece of stray wire into a ring, the spirit of giving is thoughtful and abstaining on your SO's birthday or anniversary just because is rude. So any opinion, personality trait, belief, habit, or tradition that I have, that I make explicitly clear to my partner from the onset of our relationship is inherently lazy, rude, disrespectful, or negligent if it doesn't coincide with my partners worldview? That's easily the most selfish, self-centered thing I've heard all week. \n\nI find the belief that \"you feel wronged = you're right\" to be childish and wholly out of sync with reality ...Not what I said at all but okay.  Point is, if your partner expresses that something really matters to them, that they feel left out, and it's easily changeable, why the fuck not?  You only benefit from pleasing your partner, male or female, gift or no gift.  On this issue, or any other one, aiming to please in a relationship is how you keep it together and make it last.  Going against the grain at the cost of your partner's feelings is winning a battle maybe, but losing a war overall. Except you don't know that it's easily changeable. You don't have any idea why this guy doesn't buy gifts. You aren't in any sort of place to make a claim of ease or simplicity. And no, aiming to please is not the way to perpetuate a mature, adult relationship. It's a fantastic track to subservience. Being yourself, and finding a partner who will put up with you at your worst and still love you is how you maintain a lasting engagement. \n\nAnd you're still missing the point. Which is, to be as explicit as possible, that OP said she was fine with this *and went along with it* for years! Yeah, she'd get upset when he didn't buy her anything, but it doesn't sound like she made *any* attempt to confront this issue head on. She just sort of waited in the wings for him to change. This. Is. Her. Problem. Idunno, read OP's comment history, guy sounds like a prick imho, but if that's your type we'll just never agree then.  You don't have to sacrifice yourself to love someone but occasionally compromises are made in most healthy adult relationships, are they not?  Loving someone at their worst and vice versa is swell, but not even trying to get better as individuals while being part of a couple is a good way for things to turn to shit.  Example, he could try getting her a gift once and seeing her joy might just make him happier.  Both people win.  I don't see how that's subservient or bad in any way.\n\nAnyway, you're right, her problem, not ours.  Peace out :) Except you don't know that it's easily changeable. You don't have any idea why this guy doesn't buy gifts. You aren't in any sort of place to make a claim of ease or simplicity. And no, aiming to please is not the way to perpetuate a mature, adult relationship. It's a fantastic track to subservience. Being yourself, and finding a partner who will put up with you at your worst and still love you is how you maintain a lasting engagement. \n\nAnd you're still missing the point. Which is, to be as explicit as possible, that OP said she was fine with this *and went along with it* for years! Yeah, she'd get upset when he didn't buy her anything, but it doesn't sound like she made *any* attempt to confront this issue head on. She just sort of waited in the wings for him to change. This. Is. Her. Problem. ehh... this is one case where I think \"I don't believe in that crap\" equals lazy, insensitive, and cheap.  Good luck to him finding a girl who is *really* cool with no thoughtfulness being displayed ever...   I like how this is being spun as him not showing love because he doesn't give gifts. I like how the majority of the people posting here have totally bought into rampant consumerism. Totally convinced that something is wrong with him or unhealthy about the relationship if he's not buying her things.  I kept reading, waiting to see you say how that from time to time you buy him stuff. But you didn't.\n\n I kept reading, waiting to see you say how that from time to time you buy him stuff. But you didn't.\n\n I kept reading, waiting to see you say how that from time to time you buy him stuff. But you didn't.\n\n  [deleted] So it's shallow to spend time, effort, and money to get something that will make someone you love happy? It's shallow to see something in a shop that reminds you of your loved one and buy it just because? Some people like giving and receiving gifts. Just because you don't express love that way doesn't make it shallow and dumb.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18l4qk/why_do_i_let_it_bother_me_that_my_bf_wont_buy_me/"
  }, {
    "id" : 6,
    "title" : "Life is a team sport",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=e_6-Xcp5eDg"
  }, {
    "id" : 7,
    "title" : "[IFF] I go to an art school for Game Design, but here's my favorite non-digital piece of mine.",
    "snippet" : " ",
    "url" : "http://imgur.com/bzyxJCX"
  }, {
    "id" : 8,
    "title" : "Need a little help, nothing too serious, details inside",
    "snippet" : "So, when I was a teenager I started wearing low-cut tight bikini briefs and low cut jeans too small for me. I'm very slim, but my hips and butt are well padded. But not well rounded. Yep, from the years of wearing tight, too small for me bikini briefs and pants, it's pushed an indent into the tissue on my hips. I've been wearing underwear and pants that actually fit me now for just over a year, but I hate wearing figure hugging dresses because of the obvious indent in my hips and it's not going away at all. Is there a way to eventually get the tissue to its natural state? It drives me nuts. It's the only thing I dislike about my body and if I had known that wearing what I did when I was younger would do this to my hips I probably would've worn what I wear now. So does anyone else have this? Has anyone managed to get rid of it?\n\nEdit: [A simple diagram](http://i.imgur.com/rzzxmK0.jpg) to clear up any confusion. The first line is how the outline of my hip basically looks at the moment. The second isn't exactly anatomically correct either and probably not *exactly* what it should look like but it gives you an idea of what I mean.   It's not necessarily from years of wearing too small underwear/pants. *Everyone* has that. It's how the body looks. Yours might be emphasized from your old wardrobe habits, but you'll never be rid of it completely.\n\nThat being said, shapewear can help smooth that out for figure-hugging clothes. We're can I find shape wear?  You mean [this](http://dkm80tng5uqm9.cloudfront.net/full/caca4d99f3edbe53fd2427c2c707be55/705526-917375.jpg)?  Take a look at your [bone structure](http://www.mainlinehealth.org/stw/images/125826.jpg) underneath.  It's just the way women are shaped.  Some women store more fat around it than others.  No big deal.  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18m2o0/need_a_little_help_nothing_too_serious_details/"
  }, {
    "id" : 9,
    "title" : "My Reluctant Pixie Dream Girl, an amusing short critique of that silly archetype [3:33]",
    "snippet" : "   My friend John, the director, said he thought of this when wondering if MPDG's were self aware, and for instance, if they saw a moped were like \"Ugh, now I've gotta fuckin' buy that moped too.\" It's not that they're cute, cheerful, and quirky that's the problem. I know a lot of women who fit that description, sometimes, because it's just who they are in the moment, and they maybe walked a long road that took them there. The problem is that too many men think that's all they are, 24/7. As if they were put on the Earth only to answer someone else's needs. \n\nWho can keep it up?  It's not that they're cute, cheerful, and quirky that's the problem. I know a lot of women who fit that description, sometimes, because it's just who they are in the moment, and they maybe walked a long road that took them there. The problem is that too many men think that's all they are, 24/7. As if they were put on the Earth only to answer someone else's needs. \n\nWho can keep it up?  &gt;The problem is that too many men think that's all they are, 24/7. As if they were put on the Earth only to answer someone else's needs.\n\nAnd how do you substantiate that? Reading the back of DVD cases. Hanging out on Reddit, when male posters imagine what a woman like that's real life must be like. Listening to my friends complain about what it's really like, and comparing notes... Soo...anecdotal evidence? Sounds viable, I'll just take your interactions as evidence of the way that we all think and behave.   ",
    "url" : "http://vimeo.com/59715820"
  }, {
    "id" : 10,
    "title" : "Am running out of options with dealing with my dad. Just lost all of my money and possibly my job, and the semester I was about to start. Lost in despair.",
    "snippet" : "I had to apply for a bonded title when I bought my car because the man who sold the car sold it under someone else's name.  I called the people on the title and they refused to sign the registration title paper.  So I had to go and get a bonded title. I told my dad all of this,  and showed him the papers,  he still would not listen.  He's still not listening. \n\nShowed him that if we don't do this in under thirty days we would have a huge fine. Went to the dmv and took out the title, the worker there told me the steps and I told my dad the steps and he just kept insisting that I am wrong. Even after I directly translated the papers to him.  He kept dwalling on the idea that if I get on his insurance plan it woild be another extra 90$. \n\nTold him I had put in a two week notice at work and that I just wanted to complete it or talk to my manager before I left and he refused to take me there. I've been pleading that he teach me to drive since we bought the car, but he tried,  got frustrated, and quit. \n\nThese are some strange legal boundaries that I am not really understanding.  \n\nHe does not want to teach me or my mom how to drive in fear that we'll leave him or the house.  He's incredibly possesive of my mom and very jealous. Constantly inspecting her for marks from other men etc. \n\nI'm to blame too because I have spent way too much of my money on others and myself not realizing that this would happen.  I don't know. I'm just vey confused,  sad,  afraid that I won't be able to pick up the pieces again and with the way ny dad has me and my mom chained to him,  I'm not sure how I can rebuild. I was so close to moving out and starting my own life and he just got in the way. \n\nI also have some mental health issues that my psychiatrist ignored to inform me of even after I kept calling him. Just seriously need a lot of advice right now. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18ly8j/am_running_out_of_options_with_dealing_with_my/"
  }, {
    "id" : 11,
    "title" : "[IFF] This was at the 'Adelaide Fringe' festival. A clothing shop inside an old bus.",
    "snippet" : " ",
    "url" : "http://imgur.com/07xsGMi"
  }, {
    "id" : 12,
    "title" : "The best Valentines I could ask for",
    "snippet" : "To make a long story short, my long term boyfriend broke up with me in November. Needless to say, I was devastated. I became depressed and I felt pretty worthless.\n\nI thought I would have a crummy Valentines Day without him, but it turns out, I found out one of my friend's friends had been interested in taking me on a date for some time. I happily agreed, and we are now going out for coffee on Saturday. We talked for almost two hours, and he basically told me he was really into me, and wanted to tell me for some time.\n\nSo don't worry if you spent Valentines alone, ladies. You'll find your stroke of good luck too. :3  Whenever someone says 'stroke of luck' I expect a heart attack to come my way.\n\nNice little story :) I'm really sorry if I come across as a know-it-all, but I just wanted to point this out. A stroke isn't actually a heart attack. A stroke happens when blood supply to the brain is cut off. A heart attack happens when blood supply to the heart is cut off. :)\n\nBut hey, that doesn't ruin your joke; I laughed!  You know what I mean. :x",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18l2bk/the_best_valentines_i_could_ask_for/"
  }, {
    "id" : 13,
    "title" : "All the Single Mothers: Vietnamese village breaks from the mold, made from opt-in single motherhood",
    "url" : "http://www.nytimes.com/2013/02/15/world/asia/in-vietnam-some-chose-to-be-single-mothers.html?hp&amp;_r=0&amp;pagewanted=all"
  }, {
    "id" : 14,
    "title" : "Hey TwoX I just broke up with my bf and I need some hugs",
    "snippet" : "Its 3am where I am and I cant talk to anyone :(    This is a giant hug! This is another one!\n\nI know, I know, I know this sucks. Sleep this off a little, then some more. \n\nMy ex and I broke up on New Year's Day and my best friend gave me really great advice. It's okay to mourn and cry, but mostly, the next thing you do is just keep doing whatever you were doing and keep being whoever you were being from before you two were together or from when you were alone. Keep on keepin' on, lady! ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18l6sq/hey_twox_i_just_broke_up_with_my_bf_and_i_need/"
  }, {
    "id" : 15,
    "title" : "ARE YOU KIDDING ME? Sports Illustrated defends its decision to shoot Kate Upton nearly naked in Antarctica. ",
    "snippet" : "   I don't understand what the big deal is here. Shooting a swimsuit cover in Antarctica is a cool idea. If the model was so cold that she ended up impairing her hearing and eyesight, it's on her that she didn't speak up. And this is Kate Upton we're talking about. She could easily get other jobs or request a shoot in a different location. Even if she didn't speak up, *someone* should have when she couldn't *move* on her own. Instead they just kept going when it was obvious that her health was in danger. The whole situation is despicable. I guess I'm saying that *she's* the one who decides if it was horrible or not. She's the one who experienced it. She absolutely has the right to sue Sports Illustrated or seek other remedies for what she went through. But she doesn't seem terribly upset about it and I think it's presumptuous for the rest of us to act like she was victimized by Sports Illustrated. She did it voluntarily. And I'm saying there should be standards in place to protect the health of one's employees.    This is fucking ridiculous. I always had the feeling models are considered more attractive coat hangers than people, and this really solidifies my feelings. \n\nHow are they supposed to care about models' health and body image when they don't even care about fucking *hypothermia?*\n\nAlso, **no one** who reads SI would have cared if it were shot on a green screen instead of actually in Antarctica. NO ONE.",
    "url" : "http://www.slate.com/blogs/xx_factor/2013/02/15/kate_upton_s_sports_illustrated_swimsuit_cover_the_costs_of_filming_naked.html"
  }, {
    "id" : 16,
    "title" : "EX of 4 years still can't let go - what to do?",
    "snippet" : "This is going to be a wall of text. In order to try limit that, I've tried to break it down into simple points, if something seems odd to you, please ask and I clarify.\n\nProblem: He keeps calling me, messaging me on facebook, writing letters, sending cards etc. Luckily not that often, but just when I think to myself that it's over he contacts me again\n\nSo far I have: \nTold him I don't want to meet up. \nHe got very, very upset about that and yelled at me for quite some time in the telephone. He said we would either be friends or enemies and I would have to pick. I refused to answer that question and kept repeating I would not discuss this until he calms down. In the end he hung up on me.\n\nTold him I have a stable long term relationship that I am happy in.\nHe cuts contact for a while. But resumed it again apologizing how he  behaved and explaining himself. Now he does *this* regularly, saying the same things over and over again.\n\nI avoid replying to his messages, I have blocked him on facebook and changed my number. Now he contacts me with letters. I have not replied.\n\nI never initiate contact. When and if we talk/text I am polite but very private and distant. I don't give away any details of my life and never go beyond \"I'm fine, and you?\"-stage. I end the contact as quickly as possible. \n\nWhat am I worried about?\nI am afraid this will never stop and that he might level up, so to speak, and possibly harm me or my SO.\n\nDo I have reason to believe this could happen?\nI'm not sure. When we started dating he seemed very well-balanced and nice. I later found out he had been convicted for two (that I know of) cases of violence. He was very, very jealous of me when we were together and that escalated. The last months together he would get so angry if it took me say 15min longer to shower at the gym than what he thought was suitable. Or if I didn't answer his texts within an hour. He also  started with some weird mind games, like testing my memory of things he had told me.\n\nThe event that made me to break up with him was as follows. We were supposed to meet at a tram station. I get there, look for him but can't see him. So I go and stand at a spot where we usually meet. I stand there, playing with my phone and suddenly I get an angry phone call from him. He asks what kind of stunt am I trying to pull of? I have no idea what he talks about. Turns out he had been standing at the station all along, observing me. Apparently I couldn't love and respect him because I didn't spot him there. \n\nWe go to his car where the fight gets worse. He is yelling and accusing me of a lot of things that don't even make sense. I try to explain my side of the story but he won't listen. Eventually he got tired of me trying to talk and said \"One more word and I will...\" then quiet. I kept my mouth shut and when I got home and locked my door I called him and broke it off.\n\nFor about a year from that he would frequently call me, accuse me of sleeping around and cheating (how ever it could be cheating if we weren't together). I met up with him a few times on his request but it wasn't fun for me. So I eventually stopped that, saying no to any offer.\n\nHe keeps up making excuses to meet me. And recently I got a letter with my home key. I remember that I gave him a reserve key while we were dating, in case I would lock myself out of my apartment and when no red flags were visible. He gave it back to me before we split up. So how the hell did he have that extra key unless he made a copy?\n\nHe recently called me (before I changed my number) and informed me that he'd found pretty embarrassing/private emails I've written, with stuff I wouldn't want everyone to know. He then said he would destroy them. Not sure if this was supposed to imply that I'd better be friendly with him or not.\n\nA threat? Possibly.\n\nSo what do I do?\nI am afraid of saying I want no contact at all, because of his... creepy tendencies and the \"friends or enemies\" attitude. At the same time, I don't want to meet him or have regular contact. I don't think its horrible if we text each other once a year or so, but I can't see the point why we should keep in contact. We don't have anything to talk about, no common friends or same interests. \n\nI wish he could just lose interest, find a new girl and forget about me.\n\nSo.. how would you deal with this? I am just paranoid for feeling uneasy, right? Have you been in a similar situation?\n\nI am really thankful for advice and support!\n\nEDIT: Wow! After posting, I went to bed and then straight to work. Just came home to all these replies, thank you!  You need to be blunt, being polite isn't working.  Stop calling me.  Don't answer the phone, don't reply to his messages, stop all contact.  Change the lock on your apartment so you know exactly who has a key.  Head over to your local police station, and tell them what you've written here.  Explain that you don't expect them to do anything, but you do want it all officially logged, so if things escalate, it's all been noted.   You need to be blunt, being polite isn't working.  Stop calling me.  Don't answer the phone, don't reply to his messages, stop all contact.  Change the lock on your apartment so you know exactly who has a key.  Head over to your local police station, and tell them what you've written here.  Explain that you don't expect them to do anything, but you do want it all officially logged, so if things escalate, it's all been noted.   If I understand you correctly I should bluntly tell him off and then cut the contact? That is what I would like to do, but I worry about him getting angry and start causing trouble. I do realize this might be my only choice of course...\n\nI feel pretty ok. I grew up in a bad neighbourhood and am used to making sure no ones following me, double locking my door + small precautions that could be useful. I am mostly worry for my partner who is kinda sheltered and does not take much care of him self. He even frequently forgets to lock the door! Ok, sorry to babbling. I would tell him once that he is not to contact you again, you will not be responding again, then cut him off. Your SO may need a bit of a kick to get him thinking defensively, but you don't know how your ex will react yet. It may be that he slinks off never to be heard of again. It's worth logging it all with the police early on, just to strengthen your case if it comes to that.   Every time you respond to him, you are giving him attention. That's all he wants: attention. Stop giving it to him. He will go away.\n\nIt may escalate before it gets better. You need to be strong and not respond, no matter what he says. If he threatens you, the police need to be contacted ASAP. Like /u/LittleMissP said, change your locks. Today. Now. The fact that he sent back a copy of your key would scare the shit out of me. Who knows how many more copies he made???\n\nI've dealt with a situation like this in the past. Very similar. Thankfully, he went away without much hassle once I stopped responding and blocked all ways he could contact me. With my cell phone provider, I could only block up to three months. For about a year, if I let it lapse, he messaged me almost the same day as the lapse. But only in the middle of the night (when he was drunk). Thankfully, it's been almost three months of no blocking and no messaging.\n\nMoral of the story is it takes time. But I promise, be persistent and he will go away. Thank you for sharing some of your personal experience. I had not really thought about this in the atenttion perspective. I thought that if I rarely reply and when I do I don't give him any reason to believe we could be he would realize it and move on.\n\nMay I. ask you how you did it? Did you contact him and tell him to leave you alone or did you just cut all contact without mentioning anything? Was thete a initisl aggression phase or so? \n\n  At this point he's not an ex-boyfriend, he's a creepy, manipulative stalker. Four years this has been going on?? If you can gather enough evidence you should try to get a restraining order. If you can't do that, cut off all contact -- if he's as crazy as he sounds he'll give you enough evidence. Reading the title I was thinking it was going to be a story about a guy who now is a mutual friend so you're at the same outings and every time he sees you there he starts crying or something. \n\nThis definitely sounds like someone that would not be afraid of escalating it further. I think the key he sent is showing that he made copies and is willing to come into your house (or maybe he already does!). The OP seriously needs to get her locks changed if she has not already. &gt; I think the key he sent is showing that he made copies and is willing to come into your house (or maybe he already does!).\n\nIt's a not so thinly veiled threat.   You might want to read The Gift of Fear by Gavin de Becker. He writes about how when you reply to contact (even just by answering the phone) you extend the time a person will keep trying.\n\nEdit: Also you don't want to assume he will handle anything like a reasonable person. Clearly a reasonable person would have stopped by now. I would at least mull over something like a restraining order. And ABSOLUTELY change your locks.  Stop talking to him. Period. He's not getting the hint because you are allowing small convos here and there. No texting. Get a new number. New locks too for your door. \n\nThis guy is controlling and has anger issues. Red flags across the board to qualify as a stalker based on what you said.\n\nYou were smart to leave. Continue staying smart by cutting off allcontact completely from your end--no matter how \"harmless\" a text seems. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18krb0/ex_of_4_years_still_cant_let_go_what_to_do/"
  }, {
    "id" : 17,
    "title" : "Saw this on my school's campus a few months ago. Though it would be appropriate for a day like today. ",
    "snippet" : "   ",
    "url" : "http://i.imgur.com/gN50yQt.jpg?1"
  }, {
    "id" : 18,
    "title" : "I want to put a book together for my niece about influential women throughout history. Who should I include?",
    "snippet" : "   I've been brainstorming about this project for a few months now, and I'm finally starting to put some serious thought into it. My niece is 1, and I'd love to start working on a fabric book for her and have it done in a few years. My idea is to make a book of embroidered portraits, fabric layering, some watercolors, and some small notions/embellishments. The theme is influential women throughout history. I've never seen this done before, so I'm really just using inspiration found in a few different places such as:\n\n[embriodered portraits](http://365luckydays.blogspot.com/2012/07/im-back-days-273-280.html)\n\n[watercolor portraits](http://i.imgur.com/FHAK0qu.jpg)\n\n[cartoonish portraits with felt](http://www.etsy.com/listing/73389241/queen-of-hearts-embroidery-wall-art-hoop)\n\n\nI'm hoping 2x can help me with suggestions as to who should be in my book! I don't think I can manage more than 15-20 pages (back and front) and I want to make sure I have a wide range of accomplishments, ethnicities, and time periods featured. \n\n\nWho do you think young girls should be learning about? Who inspired you as a kid?\n\n\nALSO, if anyone has actually made a successful fabric book and has any tips for me, they would be greatly appreciated!\n    A few more, mainly American-leaning:\n  \n* Harriet Beecher Stowe (Abolitionist, author of Uncle Tom's Cabin)  \n* Elizabeth Blackwell (Paved the way for women in medical fields, founded the Women's Medical College in the mid-1800s)  \n* Sojourner Truth/Isabella Baumfree (Black abolitionist, women's rights activist who fought for gender equality in the early to mid-1800s)  \n* Elizabeth Cady Stanton (Abolitionist, helped the women's rights movement gain traction, leader in women's suffrage)  \n* Jane Goodall (For her studies on chimpanzees, and I think this would be fun for a children's book)  \n* Dian Fossey (For her studies on gorillas, same comment from me on Goodall) \n\n\n      Alice Paul and Lucy Burns!  Responsible for the 19th amendment and women's suffrage!  Don't forget Susan B. Anthony too! Was looking for this exact response. Thank you!  It's amazing how many people don't know about them.  Have you seen Iron Jawed Angels?      So many great historical suggestions! A couple of more modern women who are influential in my opinion are Oprah and Ellen. \n\nRegardless of how you feel about Oprah personally, she built an empire out of practically nothing, changed the face of daytime talk tv, has changed the view of African American women on tv and has done a lot of charity work through her Angel Network. \n\nEllen was one of the first openly gay people on tv, coming out on Oprah. She has changed the way a lot of people look at people who are gay and the face of beauty. She has proven that you don't have to be curvy and busty with long flowing hair and plump lips and a face full of makeup to be beautiful.\n\nAs a Canadian I'd also like to mention [Nellie McClung](http://en.wikipedia.org/wiki/Nellie_McClung) a social activist who was a key player in Canadian women being granted the ability to vote.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18l8vx/i_want_to_put_a_book_together_for_my_niece_about/"
  }, {
    "id" : 19,
    "title" : "[IFF] I broke my femur playing baseball in September, had my 5 month x-rays yesterday. Here's a before and after!",
    "url" : "http://imgur.com/2FUN59O"
  }, {
    "id" : 20,
    "title" : "So I basically roofied myself on a first date last night",
    "snippet" : "Not my proudest moment. \n\nBackstory: I met this guy at a bar last Saturday and exchanged phone numbers with him. He asked me out and we made plans to meet up Wednesday after work to grab drinks. \n\nSo I've been having a stressful week, and I am prone to panic attacks so I have been taking .5mg of Ativan (an anti-anxiety medication) a few times over the week. Wednesday afternoon rolls around and I'm feeling anxious, panicky, not really about our date, just about unnamed worries rolling through my head constantly. So instead of freaking out at work I take an Ativan around 3:30. \n\nFlash forward to 5pm, we just met up and got a drink. I completely forgot I had taken anything and am feeling fine. So I get another mixed drink (dark &amp; stormy *so good*). 2 drinks- not a lot for me. We eat some dinner so I've got some food in my stomach then we go to another bar for a beer. I am feeling really loopy but good, unconcerned about anything, this guy is really sweet and gorgeous to boot. \n\nHe realizes I am in no state to drive so I let him drive us in my car back to his place where I try to make out with him then pass out snoring on his couch. \n\nI wake up early for work in the morning and open his apartment door and realize I have no idea where I am. \n\nI go home and get ready for working kicking myself for being a drunk asshat. Now I'm sitting at work and it hits me- I had fucking roofied myself. Ativan +alcohol exacerbates the effects and can lead to memory loss. \n\nyup. so that happened. \n\nTL;DR I forgot I took an anti-anxiety med you aren't supposed to mix with alcohol...then mixed it with alcohol. on a first date.       I'm surious as to what happened with said gorgeous man. I know it's embarrassing...but, I GOTSTA KNOW! we're still texting and he said he wants to hang out again...so good things I hope!  we're still texting and he said he wants to hang out again...so good things I hope!  Think about the fun story you can tell years down the road to the kids.... Kids this is the story about how I made a fool out of my self on drugs and met your father. ;)\n\nbut in all seriousness, I'm glad you're okay and safe, and I'm glad you're still texting :)   You have to be responsible if you're taking meds. It's not that hard. I know, I am really disappointed in myself. Never again.  I know, I am really disappointed in myself. Never again.  I know, I am really disappointed in myself. Never again.  You have to be responsible if you're taking meds. It's not that hard. Thanks, mom. In all seriousness, she's right. It would be one thing if the side effects of mixing benzodiazepines with alcohol were simply a cute little story about essentially getting roofied or a little memory loss. If OP had taken more than just that half milligram, this could be a very different story.\n\nAlcohol and Ativan basically interact and their effects are increased twofold. Though there are plenty more pharmacological resources, this is at least a good summary of *why* you should be careful:\n&gt;One of the greatest concerns in mixing lorazepam and alcohol is that both drugs are central nervous system depressants and they impact the rate of breathing. In worst case scenarios, people who combine the two in large amounts may be prone to sleep apnea or stop-breathing episodes. As breathing speed slows, it may stop altogether. The person may be too sedated to wake up enough to reinitiate breathing. In these instances, death can occur.\n\nSource: http://www.wisegeek.com/what-are-the-risks-of-combining-lorazepam-and-alcohol.htm#did-you-know Thanks, mom #2. If I'm interpreting this right, you seem to be implying my comment was condescending with your post. This was not the case and I don't believe anything I wrote could be interpreted as such.\n\nThis is not a common sense thing like drinking and driving: I didn't know this myself when I was prescribed some, I also thought it just made the hangover worse but I was never a drinker. Regardless, it is something I think my doctor should have told me and the misconception seems common in people I have known. I only learned this because I happened to take a course relating to psychopharmocology.\n\nTl;dr: I was sharing information that some people (i.e., in general here, not just the OP) may not aware of in the case of benzodiazepine and alcohol use *for valid safety reasons* because I didn't know it at one point either.  You're getting trolled. Thanks, mom. I'm speaking from the perspective of someone who has anxiety and depression issues and takes a number of meds. It's not that hard to not be an idiot with  paying attention to the health warnings attached to your medication. I'm speaking from the perspective of someone who has anxiety and depression issues and takes a number of meds. It's not that hard to not be an idiot with  paying attention to the health warnings attached to your medication. yes everyone knows how to take medication but shit happens and sometimes you have a bit of a slip up. you don't have to be a jerk about it, it's not like she can go back in time and change it No, but it might make her be slightly more aware next time if she realizes that she could, ya know, DIE? [deleted] [deleted] Thanks, mom. If this advice was so obvious, you think OP would have followed that advice before making an ass of herself, doncha think? Well I'm gonna make an pretty reasonable assumption it says right on the bottle not to drink.  You have to be responsible if you're taking meds. It's not that hard.   High five for the dark and stormy!\n\nThat sounds like an awkward morning. I've been to similar places by intentional intoxication, it's always a little bit dark.  I gotta ask, what's in one of those? I don't know a lot of drinks' names. Dark rum (sometimes blackstrap), ginger beer (the more burn the better), and a lime wedge. \n\nAnd since this is my draaaaaank... How I make them personally is Kraken, Brinley's Shipwreck ( or Gold) or Goslings rum 2-3 shots, Goya or Reeds ginger beer fill rest of (large) cup, A small pour of Domaine de Canton Ginger Liquor, and a 2 squeezed lime wedges. \n\nCruzan rum also does well, if you're looking for something cheap that won't give you a hangover. Dark rum (sometimes blackstrap), ginger beer (the more burn the better), and a lime wedge. \n\nAnd since this is my draaaaaank... How I make them personally is Kraken, Brinley's Shipwreck ( or Gold) or Goslings rum 2-3 shots, Goya or Reeds ginger beer fill rest of (large) cup, A small pour of Domaine de Canton Ginger Liquor, and a 2 squeezed lime wedges. \n\nCruzan rum also does well, if you're looking for something cheap that won't give you a hangover. What's ginger beer? I'm assuming you're from the UK? What's ginger beer? I'm assuming you're from the UK?   Wow so what happened afterward??? Are you alright? This sounds like a potentially dangerous story (not like the guy was dangerous, just concerned for your health). I'm not terribly familiar with anxiety medication but I've had friends who've been on depression medicine and watched them mix up, and been alarmed by the result. And what happened afterward with the gorgeous dude? Did he laugh it off? I'm sure he'd understand.   You should maybe be honest with him and let him know it was accidental! \n\nEDIT: Of course, if you're comfortable doing so!  Yeah I definitely let him know what happened when I figured it out. He said I wasn't acting that weird and he thought I was fun...?   This is nothing at all like roofie-ing yourself. You were just being irresponsible.  If you had ever been roofied, you wouldn't have said that. Except those are the same effects as a roofie. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jk5d/so_i_basically_roofied_myself_on_a_first_date/"
  }, {
    "id" : 21,
    "title" : "(IFF) How to look kick ass and pretty in pink. I'm in love with this pair of Doc Martins. Complete with a Ramones tee, leather, and shredded jeans.",
    "snippet" : "  Dr Martens- pretty much the only shoes I ever buy. Those are fabulous!  I found this pair for 9 bucks! Surprisingly, they weren't thrifted. The store didn't see the brand on the bottom.  Kickass Docs, don't know if I'd really call the jeans \"shredded\" though. Haha, I couldn't think of the right word!   ",
    "url" : "http://imgur.com/nkcMLyR"
  }, {
    "id" : 22,
    "title" : "Got dumped recently, but he hasn't ruined my V-day.",
    "snippet" : "It doesn't matter that my boyfriend left me.\nIt doesn't matter that he's got a new girlfriend. \nIt definitely doesn't matter that I'm single.\nWhat matters is me, I'm gorgeous and sweet, and the whole world's missing out on me. Missing out on being loved like only I can. \nAlso I give killer V-day gifts. Ask my exes. \nSo I'm a happy lass today, I'm moving forward, and maybe when someone else strikes my fancy, they can experience the love that only I can give.\nHappy Thursday!  Same here (although it was a mutual leaving in my case), and I'm not always great at this sort of attitude but I try. Thanks so much for the example and reminder!\n\nAlso... my best friend texted me last night, \"are you excited about tomorrow?\" She, of course, is well aware that I am newly single and heartbroken. \"Why would I be?\" \"Oh, I don't know, but I like Valentine's Day. I just really like to eat chocolate.\" So there's always that too! :) I'm more excited for the day after, when said chocolate goes on super sale! Right? This is why I love Valentine's Day (and Easter). On-sale chocolate! Same here (although it was a mutual leaving in my case), and I'm not always great at this sort of attitude but I try. Thanks so much for the example and reminder!\n\nAlso... my best friend texted me last night, \"are you excited about tomorrow?\" She, of course, is well aware that I am newly single and heartbroken. \"Why would I be?\" \"Oh, I don't know, but I like Valentine's Day. I just really like to eat chocolate.\" So there's always that too! :)  Well, what do you do when your boyfriend refused to take off even though you did, isn't getting out until 9, asks you what you wanna do and when you tell him there's nothing to do because everything will be closed, he tells you to go fuck yourself and that you're a bitch.  Well, what do you do when your boyfriend refused to take off even though you did, isn't getting out until 9, asks you what you wanna do and when you tell him there's nothing to do because everything will be closed, he tells you to go fuck yourself and that you're a bitch.  That sounds really hard to deal with, I'm sorry dear! It's ok. At least someone is actually saying fuck Valentines Day, I'm beautiful with of without a man. I wish i could say the same.  Well of course you are! I hope he was just having a bad day and doesn't say things like that regularly? :( No, it's pretty much regular. One minute he loves me then the next minute he hates me. I don't understand :-\\  I hope you find the strength to put your needs before his mood swings.   Yeah, me too. Thank you.  Well, what do you do when your boyfriend refused to take off even though you did, isn't getting out until 9, asks you what you wanna do and when you tell him there's nothing to do because everything will be closed, he tells you to go fuck yourself and that you're a bitch.  Well, what do you do when your boyfriend refused to take off even though you did, isn't getting out until 9, asks you what you wanna do and when you tell him there's nothing to do because everything will be closed, he tells you to go fuck yourself and that you're a bitch.   Way to stay positive and DEGAF instead of throwing a pity party   This is so great to read today, I've been having a bit of a hard time! My ex and I split up awhile back, this is my first V-Day without a boyfriend in a really long time. While we have been talking and seeing each other occasionally, and I still have feelings for him, I don't think he feels the same and I can't help but miss him and what we used to have, especially on this day :( I was hoping to hear from him today, and I know I could contact him too, but I don't want to push it or anything. So I've just been trying to be ok on my own and have a good day. This cheered me up, so thanks :)  Happy Thursday to you! Enjoy not having to spend ridiculous amounts of money on someone else today. Go out and treat yourself! You deserve it!   I wish I read this post 4 years ago, it probably could have opened my depression-crusted eyes to the truth. \n\nI became a better person when I figured all the stuff in your post out. My SO and I are so compatible and I'm so happy, but I honestly believe I wouldn't ever be as happy as I could be without believing in myself. It took a long time to get to that point, but it was worth it. Self worth is the only thing everyone has, no matter what.   You sound awesome and confident. Always stay that way, never lose those traits!   I'm glad you have a great outlook! I was a bit bummed at first about today, but then I realized I got to spend a good few hours with my crush! (Petty high school reasons to rejoice!) And now I'm ecstatic because I had a wonderful day, I actually kicked myself in the ovaries to get over my fear and had an awesome time, all while drooling over him in my head!  Congratulations!  Best of luck :3   wow. someone is sure full of herself. Someone loves herself and there isn't anything wrong with that. :) OP, keep on doing you. \n transpose the genders and repost that narcisistic drivel someplace else and see what happens.  I still fail to see what is wrong with someone having self-worth, especially on a day that seems to be marketed to make one full of self-doubt if you don't happen to be in a relationship.  going and making a post about how awesome you are is not \"having self worth\". It's narcissism.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18ja9s/got_dumped_recently_but_he_hasnt_ruined_my_vday/"
  }, {
    "id" : 23,
    "title" : "If you have a significant other do you casually mention it in otherwise platonic conversation with guys you don't already know?",
    "snippet" : "Why or why not?\n\nI ask because I like to talk to strangers... but when I talk to women I get the sense that they think I am hitting on them. Is there such thing as platonic conversation with strange boys when you are in a relationship with someone?\n\nI feel like this:\n\n\"I'm afraid if I talk to this boy / girl, I will be too polite and he will think he has a chance with me. \"\n\nIs becoming an all-pervading constant in our culture, possibly the central loop of the gordion knot that is *the friend zone*, and worrisome because so much emphasis is placed on sexual relationships that two random strangers, all other things being equal, can't have a conversation without sexual tension. Even if both parties have completely non-sexual intentions.\n  I have started to. Why? [Because of this.] (http://www.youtube.com/watch?v=VXEUltZvJKs)\n\nEDIT: I am kind of awkward in that I *never* think a guy is trying to hit on me. Hence quite a number of uncomfortable \"but I thought you liked me that way\"-situations. Now I'm taking precautions even though it makes me feel like wearing a tinfoil hat to prevent the government from reading my mind. I have started to. Why? [Because of this.] (http://www.youtube.com/watch?v=VXEUltZvJKs)\n\nEDIT: I am kind of awkward in that I *never* think a guy is trying to hit on me. Hence quite a number of uncomfortable \"but I thought you liked me that way\"-situations. Now I'm taking precautions even though it makes me feel like wearing a tinfoil hat to prevent the government from reading my mind.   I tend to mention my husband a lot when I talk to others, but he's both very interesting (I think) and very different from me, so he is a topic that makes sense in a lot of conversations. I suspect that is probably the majority of the case.   Sometimes. \n\nSometimes because it is relevant to the topic at hand and sometimes because I feel that the specific goal of the conversation has become to scope out my availability for a romantic entanglement in which I am not interested.   Yes, and I think everyone should put in that information.  Are you involved?  Are you looking?  You should make that clear.  That should enable the friendship to flourish, because both parties understand that it's not a potential relationship, just a friendship.  It's awkward if one person thinks there may be more there, while the other one does not.  It's nice to get that cleared up, up front. While I agree with you For the most part, every single time I bring up my boyfriend unprompted I either lose contact with the person (read: guy) because he doesn't even want to TRY being friends, or I am made to feel  like some narcissistic bitch for assuming he wanted more than just friendship. It is totally lose lose in my experience :( Why is this a lose/lose?  People who have no interest in being friends with you stop interacting with you, and jerks who think you are a bitch for talking about one of the most important people in your life also stop interacting with you.  Sounds like a win/win to me. I guess it is just a shame that they don't want to even try being friends. I like having friends, and I like to think I'm a pretty good friend myself. I don't know... it makes me question my worth when I'm getting along well with someone and we have fun and then the moment I make it clear I'm not available for sex they never talk to me again. It makes me feel like I'm 1. Only good for sex and 2. Very bad at knowing who is being genuine and who just wants to sleep with me.\n\nIt makes me more cautious meeting new people because I don't want to piss people off by being unavailable. And I don't like having my personality rejected because my vagina is closed for outside business, regardless of who is doing the rejecting- it wears on a girl after a while.  I guess it is just a shame that they don't want to even try being friends. I like having friends, and I like to think I'm a pretty good friend myself. I don't know... it makes me question my worth when I'm getting along well with someone and we have fun and then the moment I make it clear I'm not available for sex they never talk to me again. It makes me feel like I'm 1. Only good for sex and 2. Very bad at knowing who is being genuine and who just wants to sleep with me.\n\nIt makes me more cautious meeting new people because I don't want to piss people off by being unavailable. And I don't like having my personality rejected because my vagina is closed for outside business, regardless of who is doing the rejecting- it wears on a girl after a while.  While I agree with you For the most part, every single time I bring up my boyfriend unprompted I either lose contact with the person (read: guy) because he doesn't even want to TRY being friends, or I am made to feel  like some narcissistic bitch for assuming he wanted more than just friendship. It is totally lose lose in my experience :( While I agree with you For the most part, every single time I bring up my boyfriend unprompted I either lose contact with the person (read: guy) because he doesn't even want to TRY being friends, or I am made to feel  like some narcissistic bitch for assuming he wanted more than just friendship. It is totally lose lose in my experience :( Personally, I think that's for the best.  Think about how you'd feel if your SO had tons of female friends who all had major crushes on him?  I don't know, personally I find if they're not interested in just being friends with me, we probably wouldn't have had a good friendship anyways.   Okay, this is going to go off topic a bit and for that I apologize to the OP.\n\nBut speaking of bringing up significant others in casual conversation; I cant help but wonder what rule applies in a situation in which someone has a boyfriend or girlfriend whom theyre not monogamous with. Im in such a relationship, though neither of us has been with anyone else yet since deciding to open up.\n\nIf I bring up my girlfriend in casual conversation with a woman I just met, they will most likely assume that means Im not available, even though I actually am. If I bring up my girlfriend but mention that were open, I feel like thats too forward or maybe even weird to most people. If I dont being up my girlfriend at all (at least at first) and flirt with them, I feel like Im being dishonest. So Im kind of at a loss for what to do now if I want to meet new women to date/hook up with.\n\nThoughts?    ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18knjl/if_you_have_a_significant_other_do_you_casually/"
  }, {
    "id" : 24,
    "title" : "Why I Won't Support One Billion Rising",
    "snippet" : "  &gt; In asking women to dance in order to overcome violence and rape, focus is displaced and root causes are overlooked, it completely diverts the world's attention away from the real issue of gender based violence and rape with a pleasing-to-the-eye coordinated dance. \n\nThis speaks volume to my heart.  Unless there is something I am missing, *One Billion Rising* sounds like:  Look at us, we're dancing, we're happy, we're still being used to entertain you, so there can't really be a too big of a problem.   &gt; In asking women to dance in order to overcome violence and rape, focus is displaced and root causes are overlooked, it completely diverts the world's attention away from the real issue of gender based violence and rape with a pleasing-to-the-eye coordinated dance. \n\nThis speaks volume to my heart.  Unless there is something I am missing, *One Billion Rising* sounds like:  Look at us, we're dancing, we're happy, we're still being used to entertain you, so there can't really be a too big of a problem.     This is the stupidest objection I have ever read. Because it doesn't go far enough, she's going to reject it completely? My-way-or-the-highway isn't going to actually help anyone and her refusal to do *anything* (but complain that is) is far worse than participating in a gesture of good intent.  I wouldn't call it a rejection. I think she raises a good point in that there is certainly a difference in what feminism and violence against women means in different places. Maybe that point shouldn't be glossed over, and I think it's a fair argument that many women fail to consider deeply these differences because the illusion of a united feminist front is all too alluring. Differences and a frank assessment of privilege and social location aren't the death of feminism.\n\nThe solutions and methods that we employ to deal with the varied issues that face women should always be conscious of the context in which these issues occur, right? Raising awareness may not necessarily be what a country in the so-called Global South needs, because women there have very different problems than what I may face in the United States. \n\nI don't think the point was to shoot down the movement. I think the point was to introduce another voice into the, as of yet, one-sided conversation that white privileged feminists like Eve Ensler have the power and resources to make widespread. I think the point of awareness raising is to produce conversation, and hasn't it done that? I agree that dancing isn't actually going to solve anything. I agree that it doesn't address all of the various factors. Refusing to participate because it doesn't do everything she would like to see it do, it just was... really small-minded. It did actually come across as an attempt to demean the participants and shoot down the awareness campaign.  Examine what you're saying. She is expressing her opinion, speaking personally, and I don't think she ever tries to impose or apply negative judgment more than explain her own personal reasons for not participating. It *is* called \"Why **I** Won't Support...\"\n\nIs it possible that the feeling she's shooting it down because she's critiquing it is motivated by unnecessary defensiveness? Why can't she express her own viewpoint? I think reacting to this emotionally starts to veer into silencing her, and that's a far more problematic reaction than just disagreement. Of course it's her personal opinion. *My* personal opinion is that she's being ridiculously petty.\n\nAs for imposing negative judgement, she says, *\"The primary problem with One Billion Rising is its refusal to name the root cause of women's inequality; its outright refusal to point the finger at a patriarchal system which cultivates masculinity and which uses the control and subjugation of women's bodies as an outlet for that machoism.\"* \n\nWell, it's a global dance campaign to raise awareness. Does it *have to* point that out?\n\nThen she says, *\"It's like saying to survivors 'Ok, you've been raped, but you can overcome it if you come together and dance for 20 minutes on Valentine's Day... Eve Ensler says so...'. It's patronising and it denies not only the causes of violence, but also the devastating and long lasting effects. \"*\n\nClearly that's a negative (and wholly unfair, btw) judgement because the campaign *isn't* saying any such thing. \n\nShe goes on to bash awareness-raising exercises, saying they do nothing. Well, that's her opinion, if she doesn't like it, she doesn't have to participate. Publishing a rant that says that awareness campaigns like this are without merit and somehow insulting to people who have been victimized is not only useless, it constitutes an attack on the campaign itself. I think you're missing the point that this is her opinion. Why is it okay for you to tell her to shut up because you don't like her talking about her opinions about awareness raising campaigns? \n\nI think also the point she was trying to raise was that awareness raising campaigns may not be useful to women who live a different experience in different places. For example, slut walks in certain places make no sense because they attract harm and negative attention to women and there is a question of what that campaign should hope to accomplish for those specific women. More than anything, the point I read into this editorial was that we should never fail to consider the context of the radical actions we push for, because in assuming and promoting a \"global\" action or movement, we run the risk of erasing or silencing other people.\n\nOn that note: also consider that women in developing countries may not need or want awareness raising campaigns brought about by a wealthy white western woman that's meant to shallowly raise awareness for issues she doesn't even understand.  Whoa there! At what point did I *ever* tell her to \"shut up?\" I said her objections were *stupid and petty,* which they are. \n\nFor some reason it's ok for her to have an opinion, but not me? \n\n&gt;On that note: also consider that women in developing countries may not need or want awareness raising campaigns brought about by a wealthy white western woman that's meant to shallowly raise awareness for issues she doesn't even understand. \n\nKind of negatively judgmental, isn't that?\n\nThanks for the conversation.  &gt; Of course it's her personal opinion. My personal opinion is that she's being ridiculously petty.\n\nOkay, ad hominem attack...\n\n&gt; Well, that's her opinion, if she doesn't like it, she doesn't have to participate. Publishing a rant that says that awareness campaigns like this are without merit and somehow insulting to people who have been victimized is not only useless, it constitutes an attack on the campaign itself.\n\nAren't you saying she shouldn't publish a \"rant\"? Isn't that silencing? I don't think you need to reaffirm for her the fact that she's entitled to her own opinions or the fact that she should feel free to not participate. She already titled her editorial \"Why I Won't Support One Billion Rising\".\n\nMoreover, why can't she \"attack\" (really, I would call it more of an impassioned, personal critique that's informed by her own personal experiences) this movement? It's flawed, and this critique is not an uncommon one, if you study feminist theory. One Billion Rising falls into the same problems with intersectionality and utility... \n\nWhat about calling Eve Ensler a wealthy, white, western woman is untrue or insulting? ",
    "url" : "http://www.huffingtonpost.co.uk/natalie-gyte/one-billion-rising-why-i-wont-support_b_2684595.html"
  }, {
    "id" : 25,
    "title" : "Don't know what's right or wrong...",
    "snippet" : "I'm 18, and a female college Freshmen at a really techy male dominated school. Before coming to college, I had only ever been in one relationship, which I ended upon arriving at college. I never dated in high school because I was nerdy, awkward, and a bit chubby.\n\nThe problem is now, I date TOO much. \n\nIt seems like all of my dreams have come true now that I'm at college. I'm in the best shape of my life, skinniest and most fit I've ever been. I feel beautiful, I know I'm beautiful. I'm smart, and dedicated. My GPA, body, and video game collection reflects this.\n\nI've already had 3 boyfriends and the year is only half over. I feel dirty. I feel like I jump in too quickly and then when things don't work out (no bad break ups yet thank god) I'm left with another notch in my belt. Which to me, is shameful. \n\nI have had sex with every boyfriend I've dated for over two weeks (it didn't always take that long to start having sex) and now that I've had 4 total bfs and partners, I'm starting to feel very downcast and ashamed of myself, even though I know I shouldn't.\n\nThe big thing I think is, the length between my relationships here is always short. I broke up with my last bf (we dated for about 3 weeks, still good friends) about two weeks ago, and just recently I started hanging out with a NEW DIFFERENT guy friend, who likes me, and we have had like 2 make out sessions... this is pretty much the pattern of my time here.\n\nBut now I'm scared. This most recent interest, I don't know if he's even looking for a relationship. We've talked about sex (after the first time we made out) and he told me he's a virgin. Which doesn't matter to me, since I've been at college I've taken 2 guys' virginitys, and even though the relationships were kinda insignificant, I was glad knowing I gave them some skills to pass on. \n\nBut this guy. I don't want this to be an insignificant fling. I don't know exactly how interested he is in me, but I don't want to be used by him to just loose his virginity. He know's I put out. I don't want him to date me just for that. But I do want to date him! And I really like sex! I don't want to be unreasonable and demand he wait a certain amount of time, or take me on a certain amount of dates before he's \"worthy\" of me having sex with.\n\nI just want some advice. I really like this guy, but if he wants to date me, should I turn him down or tell him to wait because of my recently ended relationship, even though I WANT to be with him?\n\nI'm just afraid of him thinking less of me for giving him sex too soon, which will probably happen if we end up dating. But on the flip side,  I'm also afraid of loosing him and making myself unhappy by not dating him yet, and/or witholding sex. I just don't want to be a slut.  Remove the word slut and it's negative connotations from your vocabulary.  The word was only invented to control and shame women for their sexuality. Humans are sexual creatures, and there should be nothing shameful about two adults having consensual sex. \n\nYou're young. Go sew your wild oats.  And \"he knows I put out\" is the same kind of shaming way of looking at yourself.\n\nHonestly, at your age in your situation, having lots of sex with lots of guys is actually really normal. And in some ways it's just going to take living through some more, well, life, and time, and experimenting a bit with all of this, to figure out what your own guidelines and boundaries are.  \n\nThat will probably involve once in a while hurting somebody or getting hurt, and probably also doing at least one or two things that you later regret.\n\nI mean, if you were my daughter, I would say:  be careful, in the sense of \"avoid psychopaths and STDs and pregnancy and other women's men\".  Be thoughtful and cautious about your own and others' emotional wellbeing.  Communicate as openly and fully and honestly as you possibly can, with your partners. Find some good sex-positive friends and websites (Good Vibrations is a place to start) to help you learn to frame your budding/exploding sexuality as healthy and fun and normal, just like how it is for guys your age, not extreme or \"slutty.\" \n\nAnd be prepared to stumble from time to time, maybe get a skinned knee or two, but know you'll be fine. You're off to a great start for a lifetime of LOTS OF FUN, and you're not going to be sorry about THAT. Remove the word slut and it's negative connotations from your vocabulary.  The word was only invented to control and shame women for their sexuality. Humans are sexual creatures, and there should be nothing shameful about two adults having consensual sex. \n\nYou're young. Go sew your wild oats.   \"Hey so-and-so, I really like you, like a LOT.  And know you know I've had some flings, but I really don't want to do that with you.  I feel like this is different, and I'm looking for something more.  How do you feel?\"\n\nIf he stops seeing you, you get that over with before it becomes an insignificant fling.  If he's interested and says he wants to be with you too, look you've got yourself a relationship.  Win/win.  Don't feel bad about how things have gone. Just change for the future if that's what you want and feel comfortable with :)\n\nHow about just tell this new guy you like that you'd like to take it slow if things start going that way? I guess it really could be that simple... asking to go slow is one thing, but when things get heated, do you know of any ways to shut down advances without ruining the mood? I guess it really could be that simple... asking to go slow is one thing, but when things get heated, do you know of any ways to shut down advances without ruining the mood? ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18lbtw/dont_know_whats_right_or_wrong/"
  }, {
    "id" : 26,
    "title" : "My friend wrote a hilarious and scathing \"letter to her future husband\" for Valentine's Day ",
    "snippet" : "  I will probably be downvoted into oblivion but.. I didn't think this was that funny. In fact, I thought it was pretty immature and juvenile.  I will probably be downvoted into oblivion but.. I didn't think this was that funny. In fact, I thought it was pretty immature and juvenile.  I think it's written pretty subtly...it seems like an angry tirade at first but it's actually a really cool commentary on gender roles and the importance we place on things like Valentine's Day. Judging from the rest of her writing I think it's pretty tongue-in-cheek.  I will probably be downvoted into oblivion but.. I didn't think this was that funny. In fact, I thought it was pretty immature and juvenile.   ",
    "url" : "http://winterswinters.wordpress.com/2013/02/14/an-open-letter-to-my-future-husband-on-valentines-day/"
  }, {
    "id" : 27,
    "title" : "In a first, VA approves request by Oregon woman to bury same-sex spouse in national cemetery",
    "snippet" : "  May it be the first of many! Our same sex military couples deserve to be laid to rest next to each other &lt;3 I know, right?  I'm proud to say that this is my home state.  Now if we can just un-amend our state constitution, so that marriage equality is a reality here, we'll be all set...",
    "url" : "http://blog.oregonlive.com/oregonatwar/2013/02/in_a_first_va_approves_request.html"
  }, {
    "id" : 28,
    "title" : "NC State Rep. Tim Moore Advises Women to Duct Tape Nipples to Avoid Arrest",
    "snippet" : "   So... are guys required to duct tape nipples?        ",
    "url" : "http://www.opposingviews.com/i/politics/nc-state-rep-tim-moore-advises-women-duct-tape-nipples-avoid-arrest"
  }, {
    "id" : 29,
    "title" : "#HerNameWasReevaSteenkamp",
    "url" : "http://www.guardian.co.uk/commentisfree/2013/feb/15/reeva-steenkamp-body-on-front-page"
  }, {
    "id" : 30,
    "title" : "Monophasic birth control pill and moodiness?",
    "snippet" : "I'm starting to wonder if my mono-phasic birth control pill is the source of my monthly mood swings. I don't remember being this emotional on tri-phasic pills. Basically once a month for a few days to a week I'm an emotional wreck and I end up taking it out on my amazing boyfriend. Any thoughts or experiences to share?  Birth control affects everyone differently. It sounds like triphasic might work better for you. Why did you switch? I personally can't handle triphasic pills but do fine on other forms of BC. It really varies widely from woman to woman. I didn't switch on purpose. I was on a brand name tri-phasic and asked my doctor if I could switch to a generic. She prescribed the mono-phasic generic and I decided to try it. I didn't notice the mood swings at first but now they are affecting my life and my relationship. Just wanted to hear some stories of other women's experiences.  Well, the bottom line is that if you noticed the change after switching BC, it's probably the BC. Hormones can have a wide variety of bizarre effects on people and mood swings are one of the most common. So I'd recommend asking your doc if you can go back on a triphasic. If not a generic, maybe she has a brand name that's cheaper than what you were on.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18l6iw/monophasic_birth_control_pill_and_moodiness/"
  }, {
    "id" : 31,
    "title" : "In post-war Vietnam, a small village where some women broke taboo to be single mothers",
    "snippet" : " ",
    "url" : "http://www.nytimes.com/2013/02/15/world/asia/in-vietnam-some-chose-to-be-single-mothers.html?hp"
  }, {
    "id" : 32,
    "title" : "Slightly embarrassing question regarding sea sponge tampons",
    "snippet" : "So I've been using sea sponge tampons for my last few cycles now, and they're great. I've never had any problem removing them. Except, the other night, my significant other and I got a little tipsy and decided to have sex, and I totally forgot to take the sponge out. I couldn't find it all inside of me last night, and this morning I still couldn't find it no matter how hard I bore down, etc. Has this happened to anyone else? What do I do? Help :(  If you can't get it out on your own you might want to head over to a gyno and see if they can get it out. I know not fun but you don't want that to be stuck inside of you.  Sigh... you're right. I was trying to find any other possible way to do this, but it seems like that is my only option Sigh... you're right. I was trying to find any other possible way to do this, but it seems like that is my only option ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kyxb/slightly_embarrassing_question_regarding_sea/"
  }, {
    "id" : 33,
    "title" : "Today, I had my first experience with Planned Parenthood.",
    "snippet" : "And it was a good one!\n\nI'm currently between jobs (my new one starts on Monday). As a result, insurance was not an option and my birth control pill prescription ran out last Sunday, which I had forgotten about. So, I figured, why not give Planned Parenthood a shot? I've been wanting to see what my experience would be like and I figured now the time had come.\n\nThe initial call to set up the appointment was very quick, efficient, and imo, considerate. I appreciate the fact that they had asked me if it was okay for them to call me regarding the appointment if they needed to; I'm a 20-something, so it wasn't a big deal, but if I was 16, I'd definitely appreciate them asking. That was a few days ago on Monday.\n\nFor the appointment itself, they had me fill out some paperwork. The questions were very concise, and again, I appreciated the consideration. I was the first patient of the day. I waited a half hour to be seen while doing the paperwork. After that, the nurse took my vitals, remarked on my health, and was very thorough in providing education. Although I like to consider myself somewhat well educated on birth control, I still learned some things and they were really cool when I brought up the fact that I didn't intend on having children (unlike my previous nurse practitioner I had who dismissed that with saying I was young and would change my mind). She also offered me some condoms, which was pretty cool.\n\nAfter that, she had me discuss with a nurse practitioner via telecomm (I'm not sure the reason why, but I'm not complaining--I think it's pretty awesome! She also enjoyed it because it gave her the ability to talk with people across the country) about continuing the prescription I had. Because everything checked out, she was cool with doing that and it was less than a 3 minute conversation overall.\n\nAfter that, I paid $25 for the visit and my birth control came out to $8 (which was much cheaper than what I was paying for it previously, which was ~$30).\n\n**TL;DR:** Overall, I was really, really excited and I wanted to share my experience. The only complaint I have was that the visit took an hour, total--but for the service and consideration I was given, I think that's a fair enough trade for me.   I like Planned Parenthood. My only issue with my local one is that the wait times are huge; sitting in the waiting room for an hour before being seen is common. I think that's more from a lack of personnel, though, so I tend to let it slide.     That's great. My last experience left me in the parking lot crying hysterically. Not because anything was wrong with me but the way I was treated. I guess it all depends on who is working at the location.  What happened? I was in the States visiting family (I'm American but living overseas) and was having issues with my IUD. I thought I'd go to PP to get it removed as I had very little money and thought it'd be the best option. I waited for hours, the receptionists were very rude and seemed to had forgotten me (everyone coming after me was being seen). The nurse that was just taking my details was also very rude and wouldn't even look at me. When I was waiting in the exam room (for a very long time) the walls were paper thin. I could hear the doctor saying \"ok, so I'm going to give this person a perception for the pill, yank this IUD out, and (etc..)\". When she got to me she was very cold hardly spoke to me (and sure as hell didn't listen), literally used some tweezers and pulled it out. It was painful, but whatever, she just kept asking me about it because she'd never seen anything like it and that I had to find out the name of it and get back to her. Anyway, she was in and out 30 seconds. Then I go to pay, and they ask me for $300. I was visibly shocked and upset but they didn't care and insisted I needed to pay right away.\nI'm sure that doesn't sound too horrible, but I felt awful leaving there. The way everyone talked to me like I wasn't a person and that it would take so long to pay off something SO simple. \nIn New Zealand I got the IUD privately (I went to a private gyno but the IUD was covered under public healthcare) and it cost $100 for the appt but he spent so long talking to me, explained it to me on my level (as a medical professionally myself) and making sure I was comfortable. I didn't even real a thing. It was a great experience. That's great. My last experience left me in the parking lot crying hysterically. Not because anything was wrong with me but the way I was treated. I guess it all depends on who is working at the location.  :( I'm very sorry to hear this. Some people are just assholes and I'm really sorry you didn't get this experience. I'm not well versed in who to talk to about having a poor experience with them (I'm sure one of the ladies here would know, though!), but I hope no matter where you go, you're able to have a positive experience with your healthcare provider and they treat you well. Thanks, that's really nice. I live in New Zealand and have been to their version of PP and it's much better. It could all just be area though. I was in NY when this happened. I think smaller cities are always better for things like this but I may be over-generalizing.  Thanks, that's really nice. I live in New Zealand and have been to their version of PP and it's much better. It could all just be area though. I was in NY when this happened. I think smaller cities are always better for things like this but I may be over-generalizing.  Maybe it's a NY thing. I had the same experience. Everyone talking down to me like I'm a dumb slut because I asked for birth control Wow. I would expect that in a more conservative area of the country, but freaking NY?   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18joxd/today_i_had_my_first_experience_with_planned/"
  }, {
    "id" : 34,
    "title" : "Im A Black Female CosplayerAnd Some People Hate It ",
    "snippet" : "  My favorite part of this:\n\n&gt;Characters in my range? Comic book heroines and anime characters are typically about 6 feet tall, have basketballs for boobs, and probably weigh around 110 pounds. Theyre not in anybodys range. Lets be real, here: we are grown men and women pouring all of our disposable income into dressing up as cartoon characters on the weekend. It is not that serious.\n\n My favorite part of this:\n\n&gt;Characters in my range? Comic book heroines and anime characters are typically about 6 feet tall, have basketballs for boobs, and probably weigh around 110 pounds. Theyre not in anybodys range. Lets be real, here: we are grown men and women pouring all of our disposable income into dressing up as cartoon characters on the weekend. It is not that serious.\n\n My favorite part of this:\n\n&gt;Characters in my range? Comic book heroines and anime characters are typically about 6 feet tall, have basketballs for boobs, and probably weigh around 110 pounds. Theyre not in anybodys range. Lets be real, here: we are grown men and women pouring all of our disposable income into dressing up as cartoon characters on the weekend. It is not that serious.\n\n  The funny thing about this is that a lot of Japanese people feel the same way about white cosplayers, because a lot of the characters people go as are supposed to be Japanese. On the flip side I have heard the Japanese praise non-asian cosplayers because they have the huge eyes meant for anime. As an Asian guy who cosplays Jack Sparrow, I'm not sure what anyone thinks! The best Jack Sparrow I have ever seen [sans Johnny Depp himself] was asian! Absolutely stunning, he was.\n\n Where did you see him at? I'd like to meet another Asian Jack! What if it was you?? Where did you see him at? I'd like to meet another Asian Jack! Where did you see him at? I'd like to meet another Asian Jack! As an Asian guy who cosplays Jack Sparrow, I'm not sure what anyone thinks! I remember seeing your pictures in another thread! Your username is pretty unique, but I really should RES tag you as \"Captain Jack\" because that is excellent cosplay.  Haha thanks. The costume isn't much: it's really just a bunch of Sharpie pens and a strong possibility of marker poisoning. As an Asian guy who cosplays Jack Sparrow, I'm not sure what anyone thinks! As a Jewish girl who cosplays the robot from Lost in Space, I'm not sure what anyone thinks! You're a Jewish robot?\n\nEdit: What I meant to ask is, \"is your outfit just a straight up robot suit?\" The other question sounds like something out of Futurama. As an Asian guy who cosplays Jack Sparrow, I'm not sure what anyone thinks! Pictures? Please!? I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 Daaaaaym! [flicks notes off a stack a bills] Daaaaaym! [flicks notes off a stack a bills] I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 I'm at work and this is the only album accessible right now:\n\nhttp://imgur.com/a/gc1r1 As an Asian guy who cosplays Jack Sparrow, I'm not sure what anyone thinks! On the flip side I have heard the Japanese praise non-asian cosplayers because they have the huge eyes meant for anime. It's almost like one opinion doesn't represent an entire ethnicity! The funny thing about this is that a lot of Japanese people feel the same way about white cosplayers, because a lot of the characters people go as are supposed to be Japanese. Which I find odd, because a quite a bit of anime characters are illustrated as Caucasian.\n\n**EDIT**: To clarify, I'm putting emphasis on illustrated *as* Caucasian.  \n\nI watch enough anime to know that the majority take place in Japan, not in Europe, USA, etc. and therefore, it would be apparent they meant for those characters to be Japanese.\n\nWhat I am saying is I find it odd they would be offended by Caucasians dressing as anime characters with Caucasian features (blonde hair, blue eyes, etc.).\n\nAlthough the skin color in question here is black, I find it extremely appalling that there are people who are actually bothered by non-Asian cosplayers. Which I find odd, because a quite a bit of anime characters are illustrated as Caucasian.\n\n**EDIT**: To clarify, I'm putting emphasis on illustrated *as* Caucasian.  \n\nI watch enough anime to know that the majority take place in Japan, not in Europe, USA, etc. and therefore, it would be apparent they meant for those characters to be Japanese.\n\nWhat I am saying is I find it odd they would be offended by Caucasians dressing as anime characters with Caucasian features (blonde hair, blue eyes, etc.).\n\nAlthough the skin color in question here is black, I find it extremely appalling that there are people who are actually bothered by non-Asian cosplayers.  I've said it before and I'll say it again: \n\nOh, she can't cosplay as that character because she's not the same race as the character? Well, nobody's allowed to cosplay elves or hobbits or dragonborn or furries or Cthulhoids or aliens or monsters or Pokemon or muppets or My Little Ponies or...\n\nYOU'RE NOT ACTUALLY A PONY! YOU CAN'T COSPLAY AS APPLEJACK! FOR FUCK'S SAKE, YOU HAVE TWO LEGS AND ZERO HOOVES! See how fucking stupid that sounds?  I now would love to see someone go around a con and nit pick everything about everyone just to prove a point through satire. I can just imagine someone drilling a person dressed up as a pony. I've said it before and I'll say it again: \n\nOh, she can't cosplay as that character because she's not the same race as the character? Well, nobody's allowed to cosplay elves or hobbits or dragonborn or furries or Cthulhoids or aliens or monsters or Pokemon or muppets or My Little Ponies or...\n\nYOU'RE NOT ACTUALLY A PONY! YOU CAN'T COSPLAY AS APPLEJACK! FOR FUCK'S SAKE, YOU HAVE TWO LEGS AND ZERO HOOVES! See how fucking stupid that sounds?   I've never seen legs more qualified to be Sailor Venus's. For daaayyyss I've never seen legs more qualified to be Sailor Venus's. For daaayyyss SERIOUSLY.  part of Venus's \"thing\" was the legs, if my fuzzy memory is correct...and the lady in the post has that in ~~spades~~ high quantities.\n\nand now i'm told this is a racist term, so i feel like a shitball for it. :(   Yep. This. Magazines have to *photoshop* models legs to look as good as hers! SERIOUSLY.  part of Venus's \"thing\" was the legs, if my fuzzy memory is correct...and the lady in the post has that in ~~spades~~ high quantities.\n\nand now i'm told this is a racist term, so i feel like a shitball for it. :(   SERIOUSLY.  part of Venus's \"thing\" was the legs, if my fuzzy memory is correct...and the lady in the post has that in ~~spades~~ high quantities.\n\nand now i'm told this is a racist term, so i feel like a shitball for it. :(   SERIOUSLY.  part of Venus's \"thing\" was the legs, if my fuzzy memory is correct...and the lady in the post has that in ~~spades~~ high quantities.\n\nand now i'm told this is a racist term, so i feel like a shitball for it. :(   [deleted] [deleted] Holy cow, my privilege.  I didn't even *think* of that phrase as having another meaning until you pointed it out. It doesn't historically.\n\nhttp://sprachgefuhl.blogspot.com/2009/09/is-phrase-to-call-spade-spade-racist.html My parents are racist, and my dad in particular used that term for black people pretty frequently when I was growing up.  It's something that *should* have jumped out at me but did not.\n\nFaggot once referred to wood, but that doesn't take away the current negative meaning.\n\nI'm not saying that the phrase itself is automatically a problem, but using it when describing a black woman?  Much better to just avoid it.  This woman's legs are exactly like Venus' - her shoes show them off so beautifully - and there are probably one million ways in the English language to express that fact.  Why pick the one that could remind people of bad things (other than accidentally)?\n\nEDIT:  Naturally you wouldn't pick a different expression without knowing that the original had baggage attached.  The thought should have been more directed to those arguing that the phrase isn't inherently racist.  See: badly phrased argument in an argument about bad phrasing. [deleted] Same here - I've only ever heard of a spade to refer to a small garden trowel, so called because it's shaped like a spade.  [deleted] My parents are racist, and my dad in particular used that term for black people pretty frequently when I was growing up.  It's something that *should* have jumped out at me but did not.\n\nFaggot once referred to wood, but that doesn't take away the current negative meaning.\n\nI'm not saying that the phrase itself is automatically a problem, but using it when describing a black woman?  Much better to just avoid it.  This woman's legs are exactly like Venus' - her shoes show them off so beautifully - and there are probably one million ways in the English language to express that fact.  Why pick the one that could remind people of bad things (other than accidentally)?\n\nEDIT:  Naturally you wouldn't pick a different expression without knowing that the original had baggage attached.  The thought should have been more directed to those arguing that the phrase isn't inherently racist.  See: badly phrased argument in an argument about bad phrasing. Holy cow, my privilege.  I didn't even *think* of that phrase as having another meaning until you pointed it out. Holy cow, MY privilege, I didn't even KNOW that it can be a racist term. I was certain it was a poker expression. As in, not only having an amazing hand, but to also have it in spades. Meaning having to have the metaphorical 'it' and then some. I was certain it was a poker expression. As in, not only having an amazing hand, but to also have it in spades. Meaning having to have the metaphorical 'it' and then some. It is as used here, but \"spade\" is also used in derogatory ways toward African-Americans (as made famous by the song \"Colored Spade\" in the musical *Hair*).\n\n\"To call a spade a spade\" is, I *think*, referring to the derogatory term. It is as used here, but \"spade\" is also used in derogatory ways toward African-Americans (as made famous by the song \"Colored Spade\" in the musical *Hair*).\n\n\"To call a spade a spade\" is, I *think*, referring to the derogatory term. holy Hannah, i didn't know that reference existed.  now i feel like an absolute shitball. Holy cow, MY privilege, I didn't even KNOW that it can be a racist term. [deleted] i was unaware this was a racist term, and now i feel like an absolute shitball for it.\n\nit wasn't meant that way. :(   I've never seen legs more qualified to be Sailor Venus's. For daaayyyss My first convention was Otakon back in... 2005? or '06?  I remember seeing a group of Sailor Moon cosplayers taking photos.  Then a Sailor Pluto came, represented by a young black girl.  This girl had put in so much more effort and consideration into her costume and had these leeeeeeeegs to pull it off.  Hottest Sailor Scout there.  I can't find my external hd where I had pics of her upstaging the entire group &gt;_&lt; We had a really awesome discussion on /r/sailormoon recently about possible [ethnic diversity]( http://imgur.com/a/mCL0N) in the next sailor moon, or had the show been made for a more international audience.\n\nSailor Pluto was ethnically different than the other girls in the group originally, but Takeuchi never said much of anything about it. We had a really awesome discussion on /r/sailormoon recently about possible [ethnic diversity]( http://imgur.com/a/mCL0N) in the next sailor moon, or had the show been made for a more international audience.\n\nSailor Pluto was ethnically different than the other girls in the group originally, but Takeuchi never said much of anything about it. I've never seen legs more qualified to be Sailor Venus's. For daaayyyss  Aren't most anime characters Japanese?\n\nIf that is the case, then white people shouldn't be cosplaying them either.\n\nOr everyone can just STFU because its costume play and people can dress up however they want.   I'll never understand how someone cosplaying in a way you don't like is 'ruining the character'. The original character stays exactly the same, the artists aren't going to go back and draw Sailor Venus as a black girl because someone wore a costume. There's no need to get all het up about it. I have dressed up as male characters before (namely characters from games, such as Ezio from Assassin's Creed), and the number of people telling me I was ruining the character due to being non-white and female was ASTOUNDING. I never knew people cared so much. I actually think people cosplaying as opposite genders is really interesting, it's fun to see a genderswapped version of a character I like. I just don't get why people are so precious about cosplay though. If you don't like someone's costume, you can quite literally look the other way. Problem solved. I have dressed up as male characters before (namely characters from games, such as Ezio from Assassin's Creed), and the number of people telling me I was ruining the character due to being non-white and female was ASTOUNDING. I never knew people cared so much. I get shit from people for dressing up as Reno from Final Fantasy 7, and I'm a girl. They can't tell I'm a girl and usually compliment me until I start talking, then people have made faces and walked away. I totally don't understand it.  I have dressed up as male characters before (namely characters from games, such as Ezio from Assassin's Creed), and the number of people telling me I was ruining the character due to being non-white and female was ASTOUNDING. I never knew people cared so much. I have dressed up as male characters before (namely characters from games, such as Ezio from Assassin's Creed), and the number of people telling me I was ruining the character due to being non-white and female was ASTOUNDING. I never knew people cared so much. I'll never understand how someone cosplaying in a way you don't like is 'ruining the character'. The original character stays exactly the same, the artists aren't going to go back and draw Sailor Venus as a black girl because someone wore a costume. There's no need to get all het up about it. I didn't even know there are rules to cosplaying. There are terrible cosplays that are bad just because they are low effort but it's just people having fun so why even care? I'll never understand how someone cosplaying in a way you don't like is 'ruining the character'. The original character stays exactly the same, the artists aren't going to go back and draw Sailor Venus as a black girl because someone wore a costume. There's no need to get all het up about it.  I once got shit for cosplaying as Arucard from Hellsing, as a black guy. Honestly the shit I got pretty much made me give up. when I was still fat, if an event called for cosplay I'd just throw on a red shirt and some jeans, walk around and yell... HELLO CHILDREN! Apparently black kids had to be black characters.\n\nMaybe I'll do Tuxedo Mask sometime, you've inspired me.  Interesting article!  I was always curious how minorities were treated at cons and cosplay events, but I never hear about it.\n\nSlightly unrelated,  but I really want to see her Storm costume.  Storm has the coolest costume. [After some googling.. :) ](http://www.facebook.com/PrincessMentalityCosplay)  Within any niche community like this it seems there are people who dislike those who stray from the their idea of what the niche should be. \n\nI've noticed that there exist people that follow cosplaying that are not fond ANY deviation from the authentic character's appearance. This includes ethnicity, body type, gender, age, and even sillier things, like doing a poor job (often due to being new to the hobby), or making changes to the costume design. \n\nI think it's a silly thing to care about and good on this woman for not letting it get to her and for talking about it in a rational manner. \n\nEdit: People are talking like the OP is actually this woman, but there's no evidence that's the case, it just seems like the OP copied the title of the article. Did I miss something?  I've seen hardcore cosplayers who'll look down on you if you don't get the *eye color* right - \"Oh my gawd, he/she's not even wearing contacts!\" Even if everything else is spot-on.\n\nThere'll be judgy people no matter what you do, sadly. And here I was feeling awful whenever I see kids running around in those cheap FX contacts that ruin your eyes. Care for your eyes, you foooools! How do they ruin your eyes?! D:  How do they ruin your eyes?! D:  Within any niche community like this it seems there are people who dislike those who stray from the their idea of what the niche should be. \n\nI've noticed that there exist people that follow cosplaying that are not fond ANY deviation from the authentic character's appearance. This includes ethnicity, body type, gender, age, and even sillier things, like doing a poor job (often due to being new to the hobby), or making changes to the costume design. \n\nI think it's a silly thing to care about and good on this woman for not letting it get to her and for talking about it in a rational manner. \n\nEdit: People are talking like the OP is actually this woman, but there's no evidence that's the case, it just seems like the OP copied the title of the article. Did I miss something?  Within any niche community like this it seems there are people who dislike those who stray from the their idea of what the niche should be. \n\nI've noticed that there exist people that follow cosplaying that are not fond ANY deviation from the authentic character's appearance. This includes ethnicity, body type, gender, age, and even sillier things, like doing a poor job (often due to being new to the hobby), or making changes to the costume design. \n\nI think it's a silly thing to care about and good on this woman for not letting it get to her and for talking about it in a rational manner. \n\nEdit: People are talking like the OP is actually this woman, but there's no evidence that's the case, it just seems like the OP copied the title of the article. Did I miss something?   I constantly get \"for a fat (sometimes they're nice and say \"larger\" or \"plus sized\") cosplayer, her outfits are nice\" so I know just how infuriating that statement (and especially, preface) is. Like, I have stopped doing cosplay all around because of it, even though I'm a professional costumer, and cosplay is what started me on a job I love. I love the friends I've made through it, but damn, people can be harsh!\n\nAnd, as I'm already ranting a bit, let me tell you - cosplaying is what you make of it. I just stopped caring, because I would return from conventions vowing never to go to another one again, crying my brains out. But like a drug addict, I'd go to the next one, only to hear that I looked \"nice\" in my outfit... For being fat. Screw you, judgmental people! Do you know how many layers of crap I have under this thing? I regularly wear (properly, custom fit and trained) corsets that take 12\"+ off of my waist, just to even remotely fit the perceptions that cosplayers need to be ... Something! I don't even know!\n\nSorry about this. It's a personal subject that I wish I could cope with better. I'm living overseas now, but I desperately want to get back into cosplay when I get home, but I just don't know. I think I've hit the limit my already abused self esteem can take with regards to people's opinions of me... Anyone in 2X land have any suggestions on how to fix a self image problem a cosplayer suffers from?\n\nAlso, related to the article - I remember seeing that Sailor Venus come up somewhere else and all I could think was \"damn! She has the legs for that!\"\n\nEdit for autocorrect not liking words like \"cosplayer\" :/ I constantly get \"for a fat (sometimes they're nice and say \"larger\" or \"plus sized\") cosplayer, her outfits are nice\" so I know just how infuriating that statement (and especially, preface) is. Like, I have stopped doing cosplay all around because of it, even though I'm a professional costumer, and cosplay is what started me on a job I love. I love the friends I've made through it, but damn, people can be harsh!\n\nAnd, as I'm already ranting a bit, let me tell you - cosplaying is what you make of it. I just stopped caring, because I would return from conventions vowing never to go to another one again, crying my brains out. But like a drug addict, I'd go to the next one, only to hear that I looked \"nice\" in my outfit... For being fat. Screw you, judgmental people! Do you know how many layers of crap I have under this thing? I regularly wear (properly, custom fit and trained) corsets that take 12\"+ off of my waist, just to even remotely fit the perceptions that cosplayers need to be ... Something! I don't even know!\n\nSorry about this. It's a personal subject that I wish I could cope with better. I'm living overseas now, but I desperately want to get back into cosplay when I get home, but I just don't know. I think I've hit the limit my already abused self esteem can take with regards to people's opinions of me... Anyone in 2X land have any suggestions on how to fix a self image problem a cosplayer suffers from?\n\nAlso, related to the article - I remember seeing that Sailor Venus come up somewhere else and all I could think was \"damn! She has the legs for that!\"\n\nEdit for autocorrect not liking words like \"cosplayer\" :/ &gt; I constantly get \"for a fat (sometimes they're nice and say \"larger\" or \"plus sized\") cosplayer, her outfits are nice\" so I know just how infuriating that statement (and especially, preface) is.\n\nUgh, I'm also plus-sized and I get this as a compliment on my everyday clothes all the time from well-meaning but ultimately condescending relatives. \"Oh, you really know how to dress well *for your body.*\" Like what the hell is that even. Do most fat girls dress badly? Are they surprised that I take pride in my appearance? Ha! As into clothes as I am, I can tell you that there is a certain proportion of the populace - regardless of size - that has no idea how to dress. It's all about silhouette!\n\nIt is ridiculous, though. I know many times it is indeed well meaning, but geeze ;) there's just as much odds that  you'd dress good at a size 2 as a 20! &gt; I constantly get \"for a fat (sometimes they're nice and say \"larger\" or \"plus sized\") cosplayer, her outfits are nice\" so I know just how infuriating that statement (and especially, preface) is.\n\nUgh, I'm also plus-sized and I get this as a compliment on my everyday clothes all the time from well-meaning but ultimately condescending relatives. \"Oh, you really know how to dress well *for your body.*\" Like what the hell is that even. Do most fat girls dress badly? Are they surprised that I take pride in my appearance? Although I can see how it sounds condescending, I would take \"You dress well for your body\" to mean \"You choose clothes that flatter you very well.\" I hear the exact same sentence said to stick-thin girls or big-chested women who can look 'top-heavy' in the wrong clothes. Of course, obviously people can say things with different intents, it's possible they meant it how you think, but I do think there's a biiiig difference between \"You dress well for your body\" and \"You dress well for a fat girl.\"   *Everyone* has to choose the right styles for their body. I constantly get \"for a fat (sometimes they're nice and say \"larger\" or \"plus sized\") cosplayer, her outfits are nice\" so I know just how infuriating that statement (and especially, preface) is. Like, I have stopped doing cosplay all around because of it, even though I'm a professional costumer, and cosplay is what started me on a job I love. I love the friends I've made through it, but damn, people can be harsh!\n\nAnd, as I'm already ranting a bit, let me tell you - cosplaying is what you make of it. I just stopped caring, because I would return from conventions vowing never to go to another one again, crying my brains out. But like a drug addict, I'd go to the next one, only to hear that I looked \"nice\" in my outfit... For being fat. Screw you, judgmental people! Do you know how many layers of crap I have under this thing? I regularly wear (properly, custom fit and trained) corsets that take 12\"+ off of my waist, just to even remotely fit the perceptions that cosplayers need to be ... Something! I don't even know!\n\nSorry about this. It's a personal subject that I wish I could cope with better. I'm living overseas now, but I desperately want to get back into cosplay when I get home, but I just don't know. I think I've hit the limit my already abused self esteem can take with regards to people's opinions of me... Anyone in 2X land have any suggestions on how to fix a self image problem a cosplayer suffers from?\n\nAlso, related to the article - I remember seeing that Sailor Venus come up somewhere else and all I could think was \"damn! She has the legs for that!\"\n\nEdit for autocorrect not liking words like \"cosplayer\" :/  But she looked so cute as Venus.\n\nI couldn't get through the article, that is the most fucking stupid reason ever to have a \"DEBATE\" SRSLY.\n\nMost anime characters are ASIAN, so if they wanna drop the race card, white people shouldn't be Asian characters. \n\nEDIT: Everyone else is saying the same thing, lol. I'm original.\n  Loved the article, very well written. This is a problem in geek culture even outside cosplaying though. Often when people of color get cast in parts originally imagined as white, not only does the Comic Con crowd get up in arms, but they justify it with \"accuracy\".\n\nI saw this when Sam Jackson was cast as Nick Fury (despite Ultimate Nick Fury being black). I've seen it around the recent casting of Jamie Foxx as Electro. Heck, you could see it in how people felt about Ultimate Marvel's new (black and Hispanic) Spider-Man.\n\nNot that every comic fan is like this, far from it. But it's a problem and one that's exasperated by racist fams thinking that \"accuracy\" is a valid reason to believe what they do. And the double edged sword of this is that no one in the mainstream seems to mind when traditionally POC characters get cast as white people... it's always \"oh, well Jennifer Lawrence was just the best for the part!\" (even though the casting call for Katniss ASKED FOR WHITE GIRLS ONLY... ugh). To the credit of geeks, they stood up when people got super racist about how they wished Rue had been white. And a lot of fans got very justifiably angry when, in addition to being overall terrible, The Last Airbender completely whitewashed their cast.\n\nBut overall yes. I agree. And the double edged sword of this is that no one in the mainstream seems to mind when traditionally POC characters get cast as white people... it's always \"oh, well Jennifer Lawrence was just the best for the part!\" (even though the casting call for Katniss ASKED FOR WHITE GIRLS ONLY... ugh). Don't forget that any POC can play any other POC role.\n\nThe Jungle Book with Jason Scott Lee confused me because I could swear they were in an Indian Jungle... Loved the article, very well written. This is a problem in geek culture even outside cosplaying though. Often when people of color get cast in parts originally imagined as white, not only does the Comic Con crowd get up in arms, but they justify it with \"accuracy\".\n\nI saw this when Sam Jackson was cast as Nick Fury (despite Ultimate Nick Fury being black). I've seen it around the recent casting of Jamie Foxx as Electro. Heck, you could see it in how people felt about Ultimate Marvel's new (black and Hispanic) Spider-Man.\n\nNot that every comic fan is like this, far from it. But it's a problem and one that's exasperated by racist fams thinking that \"accuracy\" is a valid reason to believe what they do. Loved the article, very well written. This is a problem in geek culture even outside cosplaying though. Often when people of color get cast in parts originally imagined as white, not only does the Comic Con crowd get up in arms, but they justify it with \"accuracy\".\n\nI saw this when Sam Jackson was cast as Nick Fury (despite Ultimate Nick Fury being black). I've seen it around the recent casting of Jamie Foxx as Electro. Heck, you could see it in how people felt about Ultimate Marvel's new (black and Hispanic) Spider-Man.\n\nNot that every comic fan is like this, far from it. But it's a problem and one that's exasperated by racist fams thinking that \"accuracy\" is a valid reason to believe what they do. I remember the uproar when they cast Idris Elba as Heimdall in Thor even though he was FREAKING AWESOME in it.  I can't get over how perfect her Sailor Venus shoes are...                    There are two kinds of cosplaying out there:1 for fun. You change the character as you like it anyway so skin colour shouldn't be to much of a problem (unless it clashes with your outfit but than it's more you choosing a poor outfit than your skin colour). The second one is the more professional cosplaying ,and yes like any part of your body skin colour matters here. Your skin is the biggest visible part of your body, and whether people want to admit it it is a big part of your appearance. The thing about professional cosplaying is that you want to be as close as possible to your character. But having a different skin colour isn't a death sentence though. You can still make a costume look awesome, it's only harder to do.  Interesting article and I'm happy to hear she didn't buckle under the pressure but strode forward and set a positive example for others.\n\nThat said, I have to mention that I always cringe a bit when women cos a male character but make their attire \"sexy\" or \"flashy\".\n\nIt's up to them and if they enjoy it, all the power to them but to me it just feels silly. Why would a female Captain America wear a miniskirt and a corset instead of a proper suit? Again I emphasize, this is just my personal opinion.\n\nI understand that a part of the whole cos-thing is to make your own interpretations of the character you are cossing but personally I'm just not a fan of this style and here's why. Well, partly anyhow.\n\nAt the same time many complain how female characters are often oversexualized, which in all honesty, is a valid point but then they make oversexualized versions of the male characters as well.\n\nLike I said, if it rocks their jellybeans, go for it. If it makes you and your friends happy, even better, but one shouldn't be completely surprised if they were to receive criticizm over it.\n\nBeing black, asian, hispanic, caucasian, male or female doesn't have a damn thing to do with it, though, as it shouldn't. Skin colour is something we can't and shouldn't change. Sure, a black guy might be more convincing as Black Panther than a white guy just like a white guy might be a more convincing Superman but does the world end if superman is asian or Black Panther is hispanic?\n\nNow I am aware of the hypocrisy in what I'm saying, how skin colour shouldn't matter but how I've problems with \"sexyfying\" outfits. I mean it shouldn't matter, right? And like I said, in a way it doesn't, if it makes the cosser happy and they enjoy it, good. I'm happy for them. But if they were to ask my honest opinion, well, it's probably not going to be what they expected. Wouldn't say it to their faces though or at least in a constructive way, no need to be a dick after all.\n\nAn example, Jessica Nigri doing [Assassin's Creed ](https://sphotos-a.xx.fbcdn.net/hphotos-prn1/541933_10151419886542533_499906820_n.jpg)cos.\nOkay, she has a good body, she has nice boobs and a nice tummy but how do they make the cos any better? Imagine if a guy would cos the same character but instead [this ](http://cosplaycouture.com/wp-content/uploads/2013/01/assassins-creed-cosplay-costume-10.jpg) (I know, I know, another AC but was the best I could find) he would have a hole in his shirt to show off his abs? It's just silly, that's all.\n\nSorry for the rant, got a bit derailed here.\nAlso, once more, this is just my opinion. If someone *wants* to be a sexy Cpt. America, well, good on ya. Everyone's got the freedom of choice to be a rugged Aragorn or a sexy Aragorn (although some might think they go hand in hand ;P), a tough Ripley or a sexy Ripley. IIRC the male characters aren't sexualized, they're exaggerated male power fantasies. The whole \"rippling muscles and skintight costume\" thing isn't necessarily sexy, it's meant to be showing off the character's physical power.\n\n^(Disclaimer, this is according to my friends who are more into comics than I am) Interesting article and I'm happy to hear she didn't buckle under the pressure but strode forward and set a positive example for others.\n\nThat said, I have to mention that I always cringe a bit when women cos a male character but make their attire \"sexy\" or \"flashy\".\n\nIt's up to them and if they enjoy it, all the power to them but to me it just feels silly. Why would a female Captain America wear a miniskirt and a corset instead of a proper suit? Again I emphasize, this is just my personal opinion.\n\nI understand that a part of the whole cos-thing is to make your own interpretations of the character you are cossing but personally I'm just not a fan of this style and here's why. Well, partly anyhow.\n\nAt the same time many complain how female characters are often oversexualized, which in all honesty, is a valid point but then they make oversexualized versions of the male characters as well.\n\nLike I said, if it rocks their jellybeans, go for it. If it makes you and your friends happy, even better, but one shouldn't be completely surprised if they were to receive criticizm over it.\n\nBeing black, asian, hispanic, caucasian, male or female doesn't have a damn thing to do with it, though, as it shouldn't. Skin colour is something we can't and shouldn't change. Sure, a black guy might be more convincing as Black Panther than a white guy just like a white guy might be a more convincing Superman but does the world end if superman is asian or Black Panther is hispanic?\n\nNow I am aware of the hypocrisy in what I'm saying, how skin colour shouldn't matter but how I've problems with \"sexyfying\" outfits. I mean it shouldn't matter, right? And like I said, in a way it doesn't, if it makes the cosser happy and they enjoy it, good. I'm happy for them. But if they were to ask my honest opinion, well, it's probably not going to be what they expected. Wouldn't say it to their faces though or at least in a constructive way, no need to be a dick after all.\n\nAn example, Jessica Nigri doing [Assassin's Creed ](https://sphotos-a.xx.fbcdn.net/hphotos-prn1/541933_10151419886542533_499906820_n.jpg)cos.\nOkay, she has a good body, she has nice boobs and a nice tummy but how do they make the cos any better? Imagine if a guy would cos the same character but instead [this ](http://cosplaycouture.com/wp-content/uploads/2013/01/assassins-creed-cosplay-costume-10.jpg) (I know, I know, another AC but was the best I could find) he would have a hole in his shirt to show off his abs? It's just silly, that's all.\n\nSorry for the rant, got a bit derailed here.\nAlso, once more, this is just my opinion. If someone *wants* to be a sexy Cpt. America, well, good on ya. Everyone's got the freedom of choice to be a rugged Aragorn or a sexy Aragorn (although some might think they go hand in hand ;P), a tough Ripley or a sexy Ripley. Come on now, the vast majority of female comic book characters wear completely ridiculous outfits. If Captain America was originally envisioned as a woman, you can be damn sure she'd be wearing something akin to what was portrayed by the cosplayer.\n\nHer vision of Captain America is fine; you immediately recognize who she is supposed to be without her having to say it. &gt;Come on now, the vast majority of female comic book characters wear completely ridiculous outfits. If Captain America was originally envisioned as a woman, you can be damn sure she'd be wearing something akin to what was portrayed by the cosplayer.\n\nYou are very right about that. I mean all you need to do is to look at Wonder Woman and see for yourself that yeah, those costumes ARE ridiculous. But you know what, both Wonder Woman and Cpt. America were created in the early 40's.\n\nI'd like to imagine we've moved on a bit in the last 70 or so years. But truth to be told, when you look at most female superheroes they're not doing that much better, tight spandex, ridiculously revealing clothing etc. In all honesty, however, it doesn't really look like we've gotten much further but that doesn't mean we can't try.\n\nI'm fine with showing some skin if it fits the character.\nImagine [Beast ](http://comicattack.net/wp-content/uploads/2011/06/007Beast.jpg)for example, he's wearing nothing but a pair of briefs (and wouldn't even need those to be honest) because he's a big, blue, hairy beast. A similar female character wouldn't need that much either, why? Because it fits the character: they're a half beast with a damn fur coat. But 99% of the female superheros just happen to choose [revealing](http://images4.fanpop.com/image/photos/24100000/Female-X-Men-x-men-24111725-640-450.jpg), [almost nonexistent clothing ](http://images2.fanpop.com/images/photos/7000000/x-women-x-men-women-7096518-1600-690.jpg)or a [bodysuit ](http://api.ning.com/files/OXyoXDk7d8rIDzpq1KQCmP0yC57QJ2GV*mSaZKLpqzUOKrA9z07t462laYi5M2CPSG6fYwMRXUGjWZrILlDQ909yZb%20SAaORY/Catwoman73.jpg)which doesn't leave anything to imagination? Yeah, sure..\n\nBut my point was and is, does it make it any better if you turn even the male outfits in to sexy and flashy? Again, if it makes the person wearing it happy, go ahead, it's not not going to affect me one way or another. It's just that I *personally* don't much care for it.\n\nWhy not for a change do the reverse. Cos a female character and make their outfit more practical, more suitable for what the character does/is?\n\nLike I said, if it brings happiness and joy in your life, if it is what you want to do, even if you do it just for laughs, do it. I'm happy for you, I'll encourage you, but it doesn't mean I have to be of the same opinion. I just don't see the beauty of skimpyfying outfits but like I said, that's just me and just my opinion.\n\nMaybe you like Spielberg movies and dislike Cameron movies, maybe you like books over movies, perhaps you prefer going to the gym instead of sitting down and having a brew with your friends, the same applies to cossing. Different people, different strokes.\n\nedit: As a bonus, eferoth replied and provided with a picture of the new female protagonist for AC which looks like [this](http://i.imgur.com/z2Caldi.jpg). I guess we *are* making some small improvements. Hooray! Come on now, the vast majority of female comic book characters wear completely ridiculous outfits. If Captain America was originally envisioned as a woman, you can be damn sure she'd be wearing something akin to what was portrayed by the cosplayer.\n\nHer vision of Captain America is fine; you immediately recognize who she is supposed to be without her having to say it. Interesting article and I'm happy to hear she didn't buckle under the pressure but strode forward and set a positive example for others.\n\nThat said, I have to mention that I always cringe a bit when women cos a male character but make their attire \"sexy\" or \"flashy\".\n\nIt's up to them and if they enjoy it, all the power to them but to me it just feels silly. Why would a female Captain America wear a miniskirt and a corset instead of a proper suit? Again I emphasize, this is just my personal opinion.\n\nI understand that a part of the whole cos-thing is to make your own interpretations of the character you are cossing but personally I'm just not a fan of this style and here's why. Well, partly anyhow.\n\nAt the same time many complain how female characters are often oversexualized, which in all honesty, is a valid point but then they make oversexualized versions of the male characters as well.\n\nLike I said, if it rocks their jellybeans, go for it. If it makes you and your friends happy, even better, but one shouldn't be completely surprised if they were to receive criticizm over it.\n\nBeing black, asian, hispanic, caucasian, male or female doesn't have a damn thing to do with it, though, as it shouldn't. Skin colour is something we can't and shouldn't change. Sure, a black guy might be more convincing as Black Panther than a white guy just like a white guy might be a more convincing Superman but does the world end if superman is asian or Black Panther is hispanic?\n\nNow I am aware of the hypocrisy in what I'm saying, how skin colour shouldn't matter but how I've problems with \"sexyfying\" outfits. I mean it shouldn't matter, right? And like I said, in a way it doesn't, if it makes the cosser happy and they enjoy it, good. I'm happy for them. But if they were to ask my honest opinion, well, it's probably not going to be what they expected. Wouldn't say it to their faces though or at least in a constructive way, no need to be a dick after all.\n\nAn example, Jessica Nigri doing [Assassin's Creed ](https://sphotos-a.xx.fbcdn.net/hphotos-prn1/541933_10151419886542533_499906820_n.jpg)cos.\nOkay, she has a good body, she has nice boobs and a nice tummy but how do they make the cos any better? Imagine if a guy would cos the same character but instead [this ](http://cosplaycouture.com/wp-content/uploads/2013/01/assassins-creed-cosplay-costume-10.jpg) (I know, I know, another AC but was the best I could find) he would have a hole in his shirt to show off his abs? It's just silly, that's all.\n\nSorry for the rant, got a bit derailed here.\nAlso, once more, this is just my opinion. If someone *wants* to be a sexy Cpt. America, well, good on ya. Everyone's got the freedom of choice to be a rugged Aragorn or a sexy Aragorn (although some might think they go hand in hand ;P), a tough Ripley or a sexy Ripley. Isn't Nigri getting paid by companies to do her stuff?\n\nBut yeah, I agree with your point. Sure, if you want to reinterpret a character as \"sexy\", be my guest, but I probably won't like it. When I heard they'll make an Assassins Creed with a female protagonist I immediately started to wonder how revealing her coat would be. Sometimes it's good to be wrong, cause they absolutely nailed it.\n\nhttp://i.imgur.com/z2Caldi.jpg\n\nAlso this: http://i.imgur.com/phhM8L1.jpg Interesting article and I'm happy to hear she didn't buckle under the pressure but strode forward and set a positive example for others.\n\nThat said, I have to mention that I always cringe a bit when women cos a male character but make their attire \"sexy\" or \"flashy\".\n\nIt's up to them and if they enjoy it, all the power to them but to me it just feels silly. Why would a female Captain America wear a miniskirt and a corset instead of a proper suit? Again I emphasize, this is just my personal opinion.\n\nI understand that a part of the whole cos-thing is to make your own interpretations of the character you are cossing but personally I'm just not a fan of this style and here's why. Well, partly anyhow.\n\nAt the same time many complain how female characters are often oversexualized, which in all honesty, is a valid point but then they make oversexualized versions of the male characters as well.\n\nLike I said, if it rocks their jellybeans, go for it. If it makes you and your friends happy, even better, but one shouldn't be completely surprised if they were to receive criticizm over it.\n\nBeing black, asian, hispanic, caucasian, male or female doesn't have a damn thing to do with it, though, as it shouldn't. Skin colour is something we can't and shouldn't change. Sure, a black guy might be more convincing as Black Panther than a white guy just like a white guy might be a more convincing Superman but does the world end if superman is asian or Black Panther is hispanic?\n\nNow I am aware of the hypocrisy in what I'm saying, how skin colour shouldn't matter but how I've problems with \"sexyfying\" outfits. I mean it shouldn't matter, right? And like I said, in a way it doesn't, if it makes the cosser happy and they enjoy it, good. I'm happy for them. But if they were to ask my honest opinion, well, it's probably not going to be what they expected. Wouldn't say it to their faces though or at least in a constructive way, no need to be a dick after all.\n\nAn example, Jessica Nigri doing [Assassin's Creed ](https://sphotos-a.xx.fbcdn.net/hphotos-prn1/541933_10151419886542533_499906820_n.jpg)cos.\nOkay, she has a good body, she has nice boobs and a nice tummy but how do they make the cos any better? Imagine if a guy would cos the same character but instead [this ](http://cosplaycouture.com/wp-content/uploads/2013/01/assassins-creed-cosplay-costume-10.jpg) (I know, I know, another AC but was the best I could find) he would have a hole in his shirt to show off his abs? It's just silly, that's all.\n\nSorry for the rant, got a bit derailed here.\nAlso, once more, this is just my opinion. If someone *wants* to be a sexy Cpt. America, well, good on ya. Everyone's got the freedom of choice to be a rugged Aragorn or a sexy Aragorn (although some might think they go hand in hand ;P), a tough Ripley or a sexy Ripley.  I think it is the same kind of racism that is exhibited when those Super Bowl photos of Beyonce are floating around (I saw a post yesterday where someone had turned her into an actual monster).  They are taking Beyonce in a crazy pose, making a crazy face and totting it as proof she is ugly.  Is anyone beautiful in every pose?  I can't help but think is she were white we would never have seen photos like that.\n\nThen we had the Rihanna photos that were going around, where someone drew her with exaggerated lips and neck.  It wasn't even really a picture of her, yet it was proof she was ugly. \n\nIt is a weird kind of fury that a lot of Redditors seem to express.  You can't be beautiful, unless you are a thin, young, white female.  It is crazy to me, because I thought society was more open to ethnic women being beautiful, too.  Then you come here and it is like you are transported back to the 50's.                                      ",
    "url" : "http://www.racialicious.com/2013/02/12/im-a-black-female-cosplayer-and-some-people-hate-it/#more-27748"
  }, {
    "id" : 35,
    "title" : "Need Support, please. :-/",
    "snippet" : "So I just got the call that I had an abnormal pap and they want to do a colposcopy for mild dysplasia and possible HPV but they can't get me into the dr until 3/13.....but until then I'm freaking out. \n\n I made the mistake of google-ing and that led me to being terrified and I lost it and started crying to the poor receptionist when I was making the appointment.  \n\nI'm just really really scared and don't know who to talk to and figured I've seen this subreddit support women before so I thought I'd give it a shot.  Thanks in advance. xoxo  Doctor Google is evil. He would diagnose of cold ad cancer. The dr even told me to resist the urge to Google, but I wanted to know the definitions of all of the terms that she used.....mistake! IMO if the doctor didn't want you to use google, she should have done a better job explaining what the terms meant, and about the procedure and why she wanted to do it, including liklihoods.  I've gotten the *same exact diagnosis* before, and it freaked me out, too, so you're not alone there!  After the first abnormal pap smear, they had me come in every three months for additional smears, just to diagnose it and make sure of what was up.  Turns out, it was fine.  These things happen!  Chances are, you're going to be fine, too :)\n\nJust know, this is not uncommon.  You aren't the only person that's gone through this.  Breathe in, breathe out, and hope for the best.   Thank you so so so much for letting me know that you've been in these crappy shoes, too!  It really does feel like you're the only one when it's happening, so just thank you. \n\nWhen they start throwing around words like pre-cancerous and HPV (a STI), you REALLY freak out, even if they're such gentle and loving doctors (I love that office), especially if you were a conservative religious chick until you hit about 23! lol   I've been there as well including the hysterical crying freak out after the doctor's visit.  \"I'm 23, I can't have cancer!\"  \nThe thing is, like 70%+ of the population has some form of HPV.  The doctors just want to make sure it's not cancerous or pre-cancerous (very, very likely it isn't) and remove the abnormal cells.  \n\nMaybe you could think of it like getting a nasty mole removed, except it's on your cervix...\n\nGood luck, I'm sure you'll be fine. And of course I jumped to the worst conclusions of it must be cancer (even though the dr was very adament about saying that wasn't what she was saying!) and then my mind wandered to 'but I wanted kids someday!' and then 'I'm too young to die!'\n\n.....the receptionist originallysaid there weren't any appointments, which is when I cried....then she suddenly found one a month from now.  I think I scared her because I was so scared that I lost it!\n\nBut thank you for the pep talk, I really needed it. :)  HEY THIS JUST HAPPENED TO ME TOO! Except I went in last week to be ob/gyn for my SECOND colposcopy since my abnormal HPV cells were still lingering after a year. I was was super freaked out, just like you, but the thing is that these are PREVENTATIVE measures and it doesn't mean that you have/will have cervical cancer. There are many many steps to that, and your doctor is just taking the extra precautions. SO MANY WOMEN get a strain of HPV in their lifetime- it's very common!! Anyways my doctor called me yesterday and the results were normal- YAY! Sorry for being so enthusiastic- it's only because this was me last week that I wanted to help reassure you! My sister sent me some really helpful/calming websites, too: http://thehairpin.com/2012/01/a-scenic-guide-to-your-abnormal-pap-smear and http://thehairpin.com/2011/09/the-best-time-i-found-out-i-had-hpv ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kyg6/need_support_please/"
  }, {
    "id" : 36,
    "title" : "\nVictorias Secret Teen Lingerie Lures Ever-Younger Girls",
    "snippet" : "      ",
    "url" : "http://www.bloomberg.com/news/2013-02-14/victoria-s-secret-teen-lingerie-lures-ever-younger-girls.html"
  }, {
    "id" : 37,
    "title" : "Mentally handicapped Long Island girl's gang sexual assault deemed 'consensual' by police because attackers too have low IQs ",
    "snippet" : "  This might be slightly off topic, but I have a bit of a background with this kind of stuff. My sister is intellectual and speech impaired (code for we have no idea). She is incapable of consent - we can't even get her to understand periods. Now, she goes to respite care daily (basically, a centre where young adults go to engage in community activities and stay occupied instead of bored at home). She goes there with other kids who vary on the understandability level of sex and related acts. \n\nShould my sister and a guy, randomly end up working out sex, there isn't much we can do, even if she's screaming the whole time. Firstly, we have no way of proving consent or lack of consent. Secondly, the boy could very well not understand anything to do with it, I mean sex isn't really that hard to figure out. So that leaves us in a pretty bad place, can we really even think to press charges on someone who doesn't have the mental capacity to figure out right/wrong in regard to these things.\n\nEither way, it is less of an issue. Most female assault/rape/etc happens from the people caring for them. It is incredibly sad, because they mostly know they can get away with it. A lot of young adults are dropped in facilities and forgotten about.  I've been a case manager for people with developmental disabilities(mainly M.R.) for over a year and it is disheartening to me how often the scenario you are describing occurs. On my caseload of ~40 people, 3 of them have been sexually assaulted by other people with developmental disabilities within the past year. For two of the instances, the instigators involved were too low-I.Q. for there to be legal consequences (although I did push for having the instigators moved to an institutional facility instead of the group homes, but no dice). \n\nFor the other, it only occurred at a respite/day program. The instigator was toward the high end of the spectrum and would frequently harass my client and on multiple times would corner him in the bathroom and demand sex. I brought this to the attention of the facility providing the program, but nothing was done, so I got in touch with the police and an officer came down to investigate. Nobody was arrested, but the instigator was kicked out of the program and the facility implemented new policies on how to handle stuff like that. \n\nI don't remember if I was trying to make a point, but at least I'm depressed now. Definitely is depressing. In fact, this entire scenario is why it took years for my mother to even consider putting my sister into respite programs. My mother was scared out of her mind that something would happen. Since doing it, it is the best damn thing we ever did. My sister goes sailing on Mondays, on Tuesdays she does yoga and water aerobics, on Wednesdays she does community service (they do meals on wheels, and other charitable work), on Thursdays she goes out to play pool and has a dance program and Fridays is learning to play in a band. Every second Saturday she meets up with the other kids and they do stuff together. I darn well think she has a better social life than I do! It is one of the best ways to alleviate strain and give folks some breathing room, but those concerns still plague us. Holy crap, what state is that in? The respite/day programs my clients are in aren't bad per se, and the clients enjoy it well enough, but it is just a lot closer to daycare for adults. Indoor activities, worksheets, videos and such. \n\nI'm happy to hear things are working out so well for her!  Put down your pitchforks, people.\n\n- Police aren't judges, they don't \"rule\"\n- Charges were filed by the school, who then wanted to drop them.\n- Police dropped charges because they were unable to get enough evidence to make a conviction likely, taking into account limited metal capacity of both the victim and attackers, as well as the position of the school\n- In any event, as they are underage none of this is a matter of public record so we don't know the full story.\n- The actual documents don't imply it was consensual, that was a statement by the detective to a reporter, possibly out of context or a poor choice of words. Or perhaps they actually did think it was consensual -- remember, we don't have all the evidence they looked at, only the statements of the girl's attorney/mother.\n- \"The sick brutes also tried to anally sodomize her while one of them danced on her desk  all without attracting the attention of her teachers, said lawyer Madeline Bryer.\"  Does this sound like the unbiased truth to you? Read more: http://www.nydailynews.com/new-york/girl-15-gang-raped-class-suit-article-1.1238721#ixzz2Ku2cDoBf\n- This whole thing smells like posturing for a civil lawsuit rather than a genuine outrage over a criminal matter. Note mom never reported or filed charges, the school/social worker did. To me, this looks like lawyer looking for a judgement, not victim looking for justice.\n\nTL;DR -- Let's not get too hyped up over what amounts to an opinion piece with half information posed as advocacy. Why was there a teacher in the room though? That seems to be a major issue. Put down your pitchforks, people.\n\n- Police aren't judges, they don't \"rule\"\n- Charges were filed by the school, who then wanted to drop them.\n- Police dropped charges because they were unable to get enough evidence to make a conviction likely, taking into account limited metal capacity of both the victim and attackers, as well as the position of the school\n- In any event, as they are underage none of this is a matter of public record so we don't know the full story.\n- The actual documents don't imply it was consensual, that was a statement by the detective to a reporter, possibly out of context or a poor choice of words. Or perhaps they actually did think it was consensual -- remember, we don't have all the evidence they looked at, only the statements of the girl's attorney/mother.\n- \"The sick brutes also tried to anally sodomize her while one of them danced on her desk  all without attracting the attention of her teachers, said lawyer Madeline Bryer.\"  Does this sound like the unbiased truth to you? Read more: http://www.nydailynews.com/new-york/girl-15-gang-raped-class-suit-article-1.1238721#ixzz2Ku2cDoBf\n- This whole thing smells like posturing for a civil lawsuit rather than a genuine outrage over a criminal matter. Note mom never reported or filed charges, the school/social worker did. To me, this looks like lawyer looking for a judgement, not victim looking for justice.\n\nTL;DR -- Let's not get too hyped up over what amounts to an opinion piece with half information posed as advocacy. Put down your pitchforks, people.\n\n- Police aren't judges, they don't \"rule\"\n- Charges were filed by the school, who then wanted to drop them.\n- Police dropped charges because they were unable to get enough evidence to make a conviction likely, taking into account limited metal capacity of both the victim and attackers, as well as the position of the school\n- In any event, as they are underage none of this is a matter of public record so we don't know the full story.\n- The actual documents don't imply it was consensual, that was a statement by the detective to a reporter, possibly out of context or a poor choice of words. Or perhaps they actually did think it was consensual -- remember, we don't have all the evidence they looked at, only the statements of the girl's attorney/mother.\n- \"The sick brutes also tried to anally sodomize her while one of them danced on her desk  all without attracting the attention of her teachers, said lawyer Madeline Bryer.\"  Does this sound like the unbiased truth to you? Read more: http://www.nydailynews.com/new-york/girl-15-gang-raped-class-suit-article-1.1238721#ixzz2Ku2cDoBf\n- This whole thing smells like posturing for a civil lawsuit rather than a genuine outrage over a criminal matter. Note mom never reported or filed charges, the school/social worker did. To me, this looks like lawyer looking for a judgement, not victim looking for justice.\n\nTL;DR -- Let's not get too hyped up over what amounts to an opinion piece with half information posed as advocacy. And here I thought that incendiary, misleading titles were confined to [/r/politics](http://www.reddit.com/r/politics).  \"Studies have shown that 80 percent of developmentally disabled women have been the victims of sexual assault\".  \n\nWow. That makes me feel sick. I too hate it when news organizations put out numbers without context that I can't viably follow up on.  Every day I just want to throw furniture across the room.        WHAT CAN WE DO ABOUT THIS???\n\nI'm not sure who to call or write, but something must be done. This is unacceptable.  School administration who didn't want people involved. The police department who decided it wasn't a crime. The parents of those boys whom were involved.\n\nI can't believe they're saying these boys didn't know they were hurting this child or even what rape is. I call absolute bullshit.  ",
    "url" : "http://www.nydailynews.com/new-york/shrt-article-1.1262564"
  }, {
    "id" : 38,
    "title" : "Help. I'm extremely upset and I don't know if I made a bad decision.",
    "snippet" : " Tonight around 10:30pm I made a noise complaint to police about loud neighbors in my complex..   I kept on hearing very loud music in my apartment and people screaming \"whooooo!!\" And \"ahhhhhh!!!\" I walked around outside to see if I could hear where it was coming from, I wasn't sure. So I walked out on my balcony and I could hear it even louder. So I called my boyfriend and asked what I should do, since he was out of town he couldn't deal with it himself. So since it was past 10 at night, he said I should call noise complaint. This was the very first time I had ever done this, I've heard the same things going on before, but I never did anything, just waited till it stopped. But Im tired, I'm trying to get ready for bed, and on top of that I'm 38 weeks pregnant. I just don't have a whole lot of patience to wait for it to go away.\n\nWell I called and said I was on the second floor and that I thought the noise might be coming from the apartment below. Not positive. The operator asked if I wanted them to tell them to shut it down or just turn it down some. I told her I just wanted it to be turned down some and for the screaming to stop. \n\nAround 11:30 I get a knock on my door.. It was the husband and wife. These are an older couple 46 and 47. I am only 19. The woman asks me if I called the cops. I said \"yes ma'am I did for a noise complaint.\" She started to bitch me out.. Pretty much telling me that she never made a noise complaint when my laundry and dryer were going on at 11 at night.. (I had no clue it would even be that loud) that was the only thing she said that had to do with me making noise and that I stomp sometimes.\n\n I apologized and explained to her I wasn't trying to get anyone in trouble and that I stated that I wasn't even positive where the music was coming from and I didn't jus want to go knocking on neighbors doors at 10:30 at night trying to tell everyone to quiet down. And that i wouldnt do laundry so late anymore because i didnt realize it was loud enough to hear...\n\nThen her husband jumps in and starts telling me I made a grave mistake and we were now going to have bad neighbors.. I apologized again, almost in tears because I had no idea if I got these people in trouble and gave them a ticket or something. He simply told me that there was nothing I could say or apologize for what I had done.. And what I did was not smart..\n\nI feel like I did something horribly wrong when I wasn't even trying to be malicious or ugly. I just wanted it to not to be so loud and I didn't know where it was coming from. Did I do any thing wrong, did I deserve for them to come at me the way they did?   The only thing you did wrong was admitting to calling the cops.\n\nAvoid them and be quiet late at night. If they want to be psychos about this, well, there's nothing you can do about it. \n\nBut I very strongly recommend that you call your landlord and tell them about them coming to your door close to midnight and threatening to be \"bad neighbors\" because you were forced to call the cops over their noise violation. It would help if you had a file number from the police to verify that they had been called by you. Heck, you might even want to call the police and tell them what your neighbors did.\n\nDocument this incident! If they do start acting like psychos you need to be able to prove everything and, if it's necessary, get them kicked out.  Thank you for this advice. I will definitely do this tomorrow. \n\nI have a feeling they are going to try make a big deal out of anything I do up here now..  So I will definitely need it to be documented.  You might want to call up the cops and tell them about it asap. Come morning if you're anything like me you'll have yourself convinced that it'll all be Ok and that maybe you should just let it slide. It's always better to do it sooner rather than later.  \n\nBe safe, keep everything locked, and avoid the shit out of these jerks.   You didn't do anything wrong.\n\nAnd they don't sound like the kind of people you'd want to hang around anyway, if they'll get their knickers in a twist over something so small. I've never even talked to them before, not even a hi... We are fairly new neighbors here. We've been here for 2 months total so far..I've only met the neighbors across from us because they are very friendly and introduced themselves first. \n\nI get super nervous in these situations because I've never had to do them before an I'm afraid of things happening like with what just happened to happen. I was super reluctant to even call the cops when my boyfriend told me to do so. I just feel guilty :( [deleted] There's nothing wrong with me asking about what I should do. Especially since I am inexperienced. That also doesn't mean I'll make a bad mother just because I've never had to deal with noise complaints or pissed off neighbors. So of course I'm weary of this situation. Its my first time dealing with it. So why shouldn't I ask for advice? Because your tone in the OP is of a wounded puppy.  Yes, it's fine to ask for advice, but you're \"extremely upset\" and \"made a bad decision\" and \"Did I do any thing wrong, did I deserve for them to come at me the way they did?\" in this kind of mundane situation.  You can just ask what the protocol is for this type of situation, and how you should proceed, like a mature adult, instead of going straight to questioning yourself and being so agitated. Well, I was very unsettled with it when I wrote this. I thought I did something wrong and when they came up to my door and talked to me, they made me feel really bad. After asking around about it I realized I wasn't. And I did call my manager and she is going to speak to them. They made something big out of a small deal that I was trying to get solved. They got butt hurt over it and tried bullying me for something they did wrong. \n\nI was confused and upset last night and didn't know if I made the right choice since it being my first time. I did what anyone else would have done. Of course I'm going to sound naive about it. I had no idea.   I think you should cut yourself some slack and just try to relax. In general it's considered common courtesy to try to talk in person first, but I certainly think your actions were understandable. Your neighbors' response was very rude and that guy has no right to threaten you. From personal experience with bad neighbors, all you can do is try to be as courteous as you can and not give yourself a hard time when other people are being unreasonable. :) even if you're the one who made a mistake, all you can do is learn from it and move on.  Thank you. I guess Im beating myself up because this is my first time doing this and also being confronted. I get super nervous about stuff and my anxiety takes over, especially when dealing with other people.      Bad neighbours suck, and I am a horrible person to threaten :P Now, I understand you're pregnant and new to the building, so I definitely understand if you don't want to take on any of the passive-aggressive behaviors *I* would, but oh man, would I have fun with this. *No one* tries to threaten me when they were the assholes. Some ideas:\n\n- Call the cops again, letting them know what happened, letting them know your neighbours threatened you, you feel unsafe, and you'd like a restraining order while you work out whether or not moving to a new location is an option for you (you don't actually have to look for a new place, just say it to make it seem like you're being pro-active about taking yourself out of the situation)\n- Do laundry as late and as loudly as possible. It usually takes police a while to respond to noise violations, so even if they do report it, you'll likely be done and there will be no way to prove you were making any noise, and the neighbours will look like vindictive assholes. \n- Stomp around and \"accidentally\" drop things as often as reasonably possible (for the same reason as above)\n- Call your landlord and let them know these tenants threatened you. \n- Sign then up for tons of spam mail (hey, you know their address)\nEtc., etc., etc...\n\nAgain, I'm not actually saying you *should* do these things. Do what makes you comfortable and happy! I'm just a horrible and vindictive person, haha.   &gt; Calling the police before attempting to resolve the issue on a first-time incident.\n\nYou dun goofed.  I suggest getting them a trinket as a token of apology and explaining that you are young/ignorant.  The police are not your personal mediators and you can expect them to show up for you unless you fix things. I sure as hell wouldn't suggest that a young woman go and try to confront a group by herself, to ask them to turn down the noise level.  She did nothing wrong here, and the neighbors behaved in a way that was absolutely unacceptable.  Threatening her with being \"bad neighbors\" from now on?  And you think SHE is the one with the issues?",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18ki0l/help_im_extremely_upset_and_i_dont_know_if_i_made/"
  }, {
    "id" : 39,
    "title" : "Hey TwoX. I've had a rough few weeks. I just need someplace to gather my thoughts.",
    "snippet" : "I'll preface by saying that I think I know you guys well enough to know what kind of replies I might get, so I don't think I'm looking for advice as much as just someone to talk to. I don't have any girl friends.  \n\nI've been dating this guy for about three years now. We dated for a year and he broke it off before I went off to college, telling me the reason was so he could focus on getting his shit together. He got into an accident while uninsured and now has a 9,000 dollar settlement to pay off. He did some bad stuff in that part of our relationship. Excessive flirting with other girls. Dick pics to some Russian girl he met while staying at his friend's one night. My first semester of college was hell. I ended up becoming a borderline alcoholic, drinking more often than not. Even on days before exams. I slept with more guys than I care to admit, never when sober. I was just trying to move on. \n\nWe got back together my second semester and it was the absolute best part of our relationship. The next semester I went back to my college a few hours away. The next week I got a phone call from him. He had cheated on me with his ex. I told him there was no way we would get past that living so far away. So he dropped everything and moved to my new town.  \n\nWe got an apartment together in October. Things had gotten much better. But he lost his job in December. I've been paying for **everything** since then. Alone. With a minimum wage job. Rent, utilities, food, his cigarettes every other day. I haven't really been feeling appreciated. I just wrote it off to his depression.   \n\nA few weeks ago I just started thinking that maybe I wanted our relationship to end. My boyfriend asked me why I love him. And I didn't have an answer for him. I have reasons for why I started loving him, but lately my relationship has been shit. I hate being single. I hate the thought of life living in my apartment without him. But I've found myself being more flirty with guys than I usually am. Before I never gave any guy a second thought and got love surges for my boyfriend all the time. That has changed.  \n\nThat week we were drinking at my best friend's house [he is a guy, but is more than happy with his girlfriend]. My boyfriend flipped out and started bitching at everyone. Telling my best friend that he can't have me and that my boyfriend is a better boyfriend than my best friend. I caught myself thinking, *no you're really not.* My boyfriend left in a huff. \n\nThat night we got into a huge fight and broke up. He called everyone he could think of to come get him. But no one was available. I stayed the night at my friend's house. I went home the following morning and he was telling me he will do whatever it takes to keep me. He had already given up everything to come live with me, but he said he would do even more if that's what it took. We had worked things out, I thought.  \n\nThis is where it gets interesting. We had been fine since that fight. My friend, and coworker, came into work tonight and said he needed to talk to me. He told me that he had had the biggest crush on me since he started working there. He looked me straight in the eyes and told me that it drives him insane because I deserve way better than my current boyfriend. If I pay the bills I basically deserve to be worshipped, or the least my boyfriend could do was clean the house while I worked forty hours a week.  \n\nThis guy was standing there telling me that he has never thought very much if himself, yet he was so sure that he could give me so much more than my current boyfriend. That I deserve to be appreciated and that he cares about me so so much. Honestly, I had a minor crush on this guy when he first started working with me. And he is a real cutie.  \n\nI just had \"girl talk\" with my best friend. We talked about the fact that my boyfriend has pretty much nowhere to go. His mom's house I suppose. No one has ever cared about this guy or loved him as much as I do. I really love and care about this guy. But I really think that our relationship has run its course, as much as I hate to think about it. I have never loved *anyone* as much as I love this guy. I feel guilty and upset and brokenhearted and unappreciated. But I love him. I don't know what to do, TwoX. I don't want to go through this whole conversation about breaking up again.  \n\n**Edit:** I don't know how to make better paragraphs on mobile. So I'm sorry for the wall of text!   So in the past this guy has cheated on you once, tried to cheat on you another time, and has disrespected your (what I assume to be a monogamous) relationship multiple times.  And he currently has no job and doesn't help out around the house.\n\n&gt; That night we got into a huge fight and broke up. He called everyone he could think of to come get him. But no one was available. I stayed the night at my friend's house. I went home the following morning and he was telling me he will do whatever it takes to keep me. \n\nYou do realize that he's probably not fighting for you out of love, right?  IMO, he's doing it because you're his only option.  \n\nYou may love him, but sometimes love is not enough -- and this is one of those times.  Move on.  I know, I know.. not looking for advice. You can tell me to shaddup. But..\n\nYou really need to break up with your current boyfriend. It sounds like the relationship has been on it's last legs for a while now. If I might offer a suggestion though - please do properly break up with your boyfriend before pursuing a relationship with the new guy.\n\nOf course it is worth mentioning the whole grass is greener on the other side stuff - even if you enter into a relationship with the new guy, things may not be remotely like you expect - but the core of the matter will still be the same; things sound pretty bad between you two currently and even without other suitors around, breaking up still sounds like a really good idea. I think you're right. I didn't specifically mention it, but when I tried breaking it off a few weeks ago it was before this guy mentioned anything at all. The main reason that I included the talk I had with this guy today [although I failed to mention it] is because this is what I've been needing. Any advice I had gotten about my relationship before was basically \"I don't particularly like this guy, but you love him. Do what you think is right/what will make you happy.\" But this guy just came out and said what we had all been thinking. He told me straight up that my boyfriend isn't good enough, he is probably using me, blah blah blah. I can't even comprehend the thought that I'm being used. Can someone use their partner unintentionally? I mean, am I really so naive or is my boyfriend unintentionally freeloading? Maybe he denies it to himself. When I tried breaking up with him before, he ended up conversing with a friend of his about suicide. I don't know if he was drunkenly overreacting, trying to get sympathy, or really considered suicide.  I think you're right. I didn't specifically mention it, but when I tried breaking it off a few weeks ago it was before this guy mentioned anything at all. The main reason that I included the talk I had with this guy today [although I failed to mention it] is because this is what I've been needing. Any advice I had gotten about my relationship before was basically \"I don't particularly like this guy, but you love him. Do what you think is right/what will make you happy.\" But this guy just came out and said what we had all been thinking. He told me straight up that my boyfriend isn't good enough, he is probably using me, blah blah blah. I can't even comprehend the thought that I'm being used. Can someone use their partner unintentionally? I mean, am I really so naive or is my boyfriend unintentionally freeloading? Maybe he denies it to himself. When I tried breaking up with him before, he ended up conversing with a friend of his about suicide. I don't know if he was drunkenly overreacting, trying to get sympathy, or really considered suicide.  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18ktbk/hey_twox_ive_had_a_rough_few_weeks_i_just_need/"
  }, {
    "id" : 40,
    "title" : "Ladies, I need help getting what I deserve.",
    "snippet" : "Sorry if this is painful to read, English is not my specialty \n\nDon't get me wrong, I love my boyfriend, but I know we need to break up. Last night, while he was grabbing a shower I thought it would be funny to change his facebook profile picture from his iPhone to an embarrassing picture, just to be silly. Going through his pictures to find a one that would be perfect for this, i stumble upon something i really didn't expect at all, a recently saved naked pictures of some girl we both know. I brought it up and he said they were there because he wanted to make fun of this girl and it meant nothing. Even if this were true, its still incredibly immature to mock a girl for her body, its a sensitive subject to everyone, and so even if these pictures meant nothing to him its still not right regardless. In the end we talked it out and i ended up forgiving him, but I know that wasn't the right choice. He's told other girls he'd have sex with them if he were to be single. I'm not a complete idiot and I know I need to leave him, but I cant bring myself to do it. I love him, but I know I don't deserve that. I need motivation ladies, lots of it.  &gt;I know we need to break up.    \n\nIt seems like you've made up your mind already. But I'll still give my opinion, since you posted. :)    \n\nI think men should be allowed to explore their sexuality just as we so often encourage women to do on this subreddit. HOWEVER, having nude pics of a mutual friend &amp; suggesting to other women that he is interested in sex totally crosses the line.     \n\nI went through almost this exact situation with an ex. I was trying to find a photo of myself on his computer from a wedding we both went to, and found recent nude pics of someone we knew. I then found a document (also by accident), a letter actually, to an ex of his, suggesting he wanted a sexual relationship. That got my interest, so I went into his email (THAT was on purpose) and found several emails of him soliciting women on craigslist for sex. That was it. I dumped him on the spot.    \n\nI guess what I'm saying is that you will probably get to a point where you are just done putting up with his bullshit. Are you there yet? That's what I mean, I completely realize he will find other women attractive and I wouldn't be offended by porn at all, but that's what's killing me is that it's someone we know. \n\nI just don't know how to bring myself to do it, I don't want to hurt his feelings, and I really don't want to be without him but I know what's best  &gt;I just don't know how to bring myself to do it, I don't want to hurt his feelings\n\nThere is no reason you should be sparing his feelings at the expense of your own, especially when he's never shown you the same consideration. Lying to you about the nude photo, telling other women he'd have sex with them if he were single. . . being in a relationship does not make one blind, but the only reason I can see for admitting that to someone -- or multiple someones -- is if he was hoping that he'd be 'pushed' into it, to hear or receive something (such as with the nude photo) from these women that he thought he could feel guilt-free about since he wasn't crossing any physical boundaries, or to procure some sort of backup.\n\nHe might be insulted if you break up with him, but I highly doubt that he'll be crushed. If he tries to guilt you over it, tell him you're doing him a favor and he's free now to act on the things he said he wanted to do with these other women. Thank you for putting it into better perspective for me, it helped a lot! :)   Having a naked photo of someone he knows so he can be vile to her makes him an asshole.  \n\nHow did he even get these pictures? My bet is he doesn't have it to make fun of her.  That was the excuse he gave OP because in a panic he assumed that, \"I have them to jerk off to\" would have caused greater drama than, \"Oh haha I just like to laugh at her.\" Oh yeah, but his excuse doesn't make him sound better than \"I asked for is so I could touch myself while looking at it\". Having a naked photo of someone he knows so he can be vile to her makes him an asshole.  \n\nHow did he even get these pictures? He said she sent them to him without him asking. Hahahahah I don't believe it And he saved them because....?\n\nTo be honest, he sounds like an idiot.  Do you want to date an idiot?  Um, okay, yes, all the above. But also: it takes two people to have a relationship, and two people plus mutual respect and caring to have a good one.  And going through somebody's personal collection of photos on his private device is a violation of privacy.  As is changing somebody else's Facebook photo.  \n\nI know this isn't what you're asking for exactly.  But your request says \"I need help getting what I deserve.\" And I think you deserve to be loved and respected and happy.\n\nIf you want to have success and happiness in relationships in the future, I would suggest that you think more about how to treat your partner respectfully.  You are both grownups now and need to treat each other that way.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18l2qz/ladies_i_need_help_getting_what_i_deserve/"
  }, {
    "id" : 41,
    "title" : "Today...",
    "snippet" : "I feel pretty.(:  So pretty! I feel pretty and witty, and briiiiiight! So pretty! I feel pretty and witty, and briiiiiight!   Feel pretty everyday, because you are. :) ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18ldky/today/"
  }, {
    "id" : 42,
    "title" : "Amazing cosmetics/skin care review site (a huge help for those of us with sensitive skin &amp; a budget)",
    "snippet" : " ",
    "url" : "http://www.paulaschoice.com/beautypedia-skin-care-reviews/brands/"
  }, {
    "id" : 43,
    "title" : "I became that girl I hate yesterday, and I don't know what to do",
    "snippet" : "Yesterday I got my bf a small token gift. He's affectionate and very generous with his time, so I was expecting a card or something (I mean in my judgement as to what would be appropriate to give to him), but he got me nothing. \n\nIn the evening he texted me to say he missed me and wanted to tell me because he'd seen many facebook posts about V-day... so I teased him about the lack of flowers. In hindsight this was stupid and immature, but bear with me it gets worse.\n\nSo he apologises and says that I'm worth more than cliches which is pretty much what every loser boyfriend I've dated has said an an excuse for not doing anything for my birthday or Christmas, despite major efforts on my part for them on special dates. So despite this guy being great the rest of the time I judged him according to the other guys in the past - unfairly so - and told him what I thought of that. \n\nSo he reveals that he was planning to get me something specific that he could only get on his trip to the city today, and then surprises me with flowers and candy at 11pm. \n\nI cannot believe what I let myself be - a manipulative bitch. I didn't stop to think clearly, and just let that horrible side out. Of course I told him that I don't need a special gift, I just wanted a small token like the one I'd given him, but now he's insisting. \n\nI'm such a bitch. \n\nWhat can I do to make it up to him and learn to change this horrible side of me?  You're not manipulative, you gently let him know that you felt bad about being left out of Valentine's day and he busted ass to rectify it. Good for both of you - you communicated a need and he met it.\n\n&gt; he was planning to get me something specific that he could only get on his trip to the city today\n\nHe should've let you know that ahead of time, instead of leaving you wondering why you were left out.  Just apologise to him, he may say it doesn't matter but make sure he knows you're sorry for doing what you did. I'm really not sure what sort of physical thing would help in this situation. \n\nThe best way to prevent yourself from doing things like this that I've found is to look at each thing you do and see what it will come across as to other people and how they might react to it. Of course you won't catch yourself 100% but everyone isn't perfect all the time. If you keep on trying to make a concious effort to being better in your mind then you will probably just start thinking that way without having to remind yourself.  I think I honestly don't know how to behave. I use one logic and guys treat me like a doormat, I use this logic here and end up being a bitch. What's the middle ground? To me the middle ground is to tell the person who disappointed or hurt me. Not yell, not hint, not tease or anything else. Plain and simple \"I like celebrating Valentines day. I would want to receive flowers on that day and make some time for each other. This is important to me.\" or \"It does hurt me that you forgot/didn't bother to get me flowers today. You are great most of the time and I assume your intention was not to make me sad. I would, however, like you to acknowledge me on Valentines in the future.\".\n\nThis way you avoid being a doormat (disregarding your feelings and wishes) but also avoid being that girl (bitching about things or putting up with passive-aggressive behaviour). In my experience most guys do want to make their girlfriends happy, but unfortunately no one can read minds. Women are taught somehow to not express their needs clearly and to only expect the guy to know what to do. To avoid drama: communicate clearly. State that YOU want flowers, not vaguely \"flowers are nice...\" or \"girls like flowers...\". \n\nLast but not least. Everyone falls and becomes that girl/guy sometimes. People are afraid to speak up their mind in fear of being laughed at or ridiculed. Kudos for you to having recognized what you did and wanting to improve. To me the middle ground is to tell the person who disappointed or hurt me. Not yell, not hint, not tease or anything else. Plain and simple \"I like celebrating Valentines day. I would want to receive flowers on that day and make some time for each other. This is important to me.\" or \"It does hurt me that you forgot/didn't bother to get me flowers today. You are great most of the time and I assume your intention was not to make me sad. I would, however, like you to acknowledge me on Valentines in the future.\".\n\nThis way you avoid being a doormat (disregarding your feelings and wishes) but also avoid being that girl (bitching about things or putting up with passive-aggressive behaviour). In my experience most guys do want to make their girlfriends happy, but unfortunately no one can read minds. Women are taught somehow to not express their needs clearly and to only expect the guy to know what to do. To avoid drama: communicate clearly. State that YOU want flowers, not vaguely \"flowers are nice...\" or \"girls like flowers...\". \n\nLast but not least. Everyone falls and becomes that girl/guy sometimes. People are afraid to speak up their mind in fear of being laughed at or ridiculed. Kudos for you to having recognized what you did and wanting to improve. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kqcd/i_became_that_girl_i_hate_yesterday_and_i_dont/"
  }, {
    "id" : 44,
    "title" : "Helsinki now accepting \"anonymous\" job applications",
    "snippet" : "  thought this was an interesting way to see how personal preferances towards people helps or hinders the applicants. I'm keen to see their results and what sort of people get hired on skills alone (even without equality hiring quotas) \n\nA flaw I can see though is that it goes out the window with the interview stage however if people get to the interviews where they wouldn't before...  Yes, it is interesting. Heh, interview them from behind a curtain with a voice changer. Or via instant message. maybe they could be interviewed by someone who's blind? Accent and thus national origin would still be an issue. I could say Deaf and Blind but we're getting into the completely ridiculous XD thought this was an interesting way to see how personal preferances towards people helps or hinders the applicants. I'm keen to see their results and what sort of people get hired on skills alone (even without equality hiring quotas) \n\nA flaw I can see though is that it goes out the window with the interview stage however if people get to the interviews where they wouldn't before... ",
    "url" : "http://yle.fi/uutiset/helsinki_now_accepting_anonymous_job_applications/6496815"
  }, {
    "id" : 45,
    "title" : "Helpful Tips for Victims of Revenge Porn",
    "snippet" : "  I didn't realize there were actually groups that gathered information about this. I'm going to bookmark this page since the topic comes up every now and then in this (and other) subs. Thanks a lot for posting. ",
    "url" : "http://rcjlawgroup.net/2013/02/12/helpful-tips-for-victims-of-revenge-porn/"
  }, {
    "id" : 46,
    "title" : "How do I deal with male friend who constantly makes sexist remarks? He says he's joking, but I can't see the funny side. Please help, 2X!",
    "snippet" : "Hello lovely community!\n\n\nI have a friend, Mark, who regularly makes comments that make me uncomfortable. One example occurred last night- we were watching a movie, when a man hit a woman and she fell to the ground. He laughed, and said 'putting her in her place!'. He says things like this regularly and seems to be joking- he's got a very dark sense of humour in general. I called him out on this one and the women in the room backed me up, but he just moved the conversation along. Once or twice when I've said something, he's made a remark about how of course men and women are equal, he's just joking around. \n\n\nI can't just stop being friends with him- he lives with two of my close friends, and he's been a part of my friendship group for 4 years. He is typically kind-hearted, funny and a good guy to hang out with- until he comes out with a sexist comment. He dismisses me when I call him out on it as me being sensitive/unable to take a joke. I never hang out with him one-on-one or go out of my way to talk to him, but I can't avoid him in group situations. I work in a male-dominated field (engineering) and it's really demoralizing to hear that my place is in the kitchen/beneath men etc.- it's affecting my confidence at work. \n\n\nSo, 2X, what's the best way for me to talk to him about this? As I see it, my options are to: make more of a stand when he says something like this, and get a few more friends on my side to make it clear it's not me- or take him aside one-on-one and try to get him to see how it effects me.  \n\n\nThe worst part is that often the other guys in the group will laugh along with him- and our friends are mostly guys, so it can seem a bit like it's them vs me. I've tried talking to a few of them and they agree he takes it too far, but 'that's just Mark, it's what he does'. \n\n\nPlease help! \n\n**TLDR: male friend constantly makes sexist remarks and doesn't take me seriously when I'm offended. Can't avoid him- but it's starting to affect my confidence at work. How do I make him stop?**\n\n  Tell him that jokes don't give him license to be an asshole Also, there's a difference between taking \"*a* joke\" and repeatedly listening to a variation of the same joke again and again and again.\n\nIt's like the various reddit posts of \"Make me a sandwich! LOLzorz1!!\" Yes, we got it, women belong in the kitchen making sandwiches. Even if I thought it was remotely funny the first time I heard it 20 years ago, you just sound like a retarded parrot repeating it at this point. Tell him that jokes don't give him license to be an asshole [deleted] [deleted] Knowingly hurting sometimes feelings makes you an asshole, doesn't it? [deleted] What does 'actually' wrong mean to you? Doing something harmful to another person for your amusement isn't wrong? [deleted] [deleted] [deleted] What's up all with the snarky insults today?  Reported [deleted] [deleted] I've seen you in like 3 separate threads tonight just getting downvoted. You're either a troll or just completely dense when it comes to women. Just leave, man. [deleted]  &gt;He dismisses me when I call him out on it as me being sensitive/unable to take a joke.\n\n[Hey, lighten up...](http://i.imgur.com/VaJzwnI.jpg)\n\n[A remark intended to shut you down like, Calm down, youre overreacting, after you just addressed someone elses bad behavior, is emotional manipulationpure and simple.](http://thecurrentconscience.com/blog/2011/09/12/a-message-to-women-from-a-man-you-are-not-%E2%80%9Ccrazy%E2%80%9D/)\n\n Thanks for the links!  You should totally say that to him next time he says \"hey calm down\" or \"geeze, can't take a joke?\" Just be all \"yeah, right, 'geeze, I'm just being a total asshole.'\" &gt;He dismisses me when I call him out on it as me being sensitive/unable to take a joke.\n\n[Hey, lighten up...](http://i.imgur.com/VaJzwnI.jpg)\n\n[A remark intended to shut you down like, Calm down, youre overreacting, after you just addressed someone elses bad behavior, is emotional manipulationpure and simple.](http://thecurrentconscience.com/blog/2011/09/12/a-message-to-women-from-a-man-you-are-not-%E2%80%9Ccrazy%E2%80%9D/)\n\n [deleted] The key here is \"after you just addressed someone else's bad behavior.\" Telling someone you aren't comfortable with sexist jokes and them telling you that you are over-reacting is emotional manipulation and completely different from telling someone you will kill them for cutting in line.\n So anytime somebody does something you consider \"bad\" - and you yell at them for it, that's never overreacting? I didn't read anything about her yelling. Ok well i guess you missed her comment somewhere in this thread where she said she'd get back at him for sexist jokes by making fun of the fact that he's unemployed while she has a job Ok well i guess you missed her comment somewhere in this thread where she said she'd get back at him for sexist jokes by making fun of the fact that he's unemployed while she has a job She said that she would consider making that joke because there's nothing else the dude responds to. And then only to get the point across that making jokes that hurt other people is not something that friends do. \n\nIf he thinks that it's okay for him to be denigrating towards others, maybe he'll learn that it's not when he gets to be the butt of jokes for a while.  The difference is that he's making general jokes directed at nobody in particular, and not with bad intentions.  She, on the other hand, wants to purposely hurt his feelings by making a personal joke and ridiculing him.   Two approaches I use:\n\"You sound like an idiot.\" (With a smile)\n\nOr I'll explain the joke,\"I get it! It's hilarious because that really happens to women all the time and everyone tells them it's their own fault. Haha, get it?\"\n\nIf he's doing it on purpose to get a rise out of you, you have to be willing to get up and leave. If your friends get annoyed because you won't stay tell them \"oh well you know me, that's just the way I am!\" \n\nI mean even if he doesn't understand WHY you're upset by these jokes. he should at least be able to knock it off when you're around because it's crappy to do something you know upsets a friend. If he hated dogs and was scared around them, you wouldn't need to understand it to think not to bring your Great Dane to his house whenever you visited. This is basic friends kind of stuff here.  Timing is everything here.\n\nI think you should talk to the other other friends one-on-one ahead of time, and talk to everybody in a group when it happens next.\n\nThink about what you'll say ahead of time. Have canned responses ready in your mind as to why this is unacceptable, why this isn't just you \"not being able to take a joke,\" why this is sexist, and why you demand that it stops. When the time comes to talk to them, remain calm at all times. Never raise your voice. Never squeal. Never show anger. You must be calm and mater of fact about it. It *is* a matter of fact: he's being sexist and it is not tolerable. \n\nHe lives with two of your close friends, so next time you're alone with one or both of them, and the timing is right, say \"hey, you know, I want to ask you about NAME. Do you think his sexist remarks are okay? I think they're offensive and disgusting. **I'd really like your support on putting our foot down as a group and asking him to stop.** He says I just can't take a joke but come on, they aren't jokes, they're flat out sexist remarks against women. I really hate it and it makes me very uncomfortable and it's disrespecting me and other women right to our faces. Obviously he doesn't listen to me when I've asked him repeatedly to stop - maybe because I'm a woman - but **maybe he'll listen to you guys** if next time you simply don't laugh but tell him that maybe it's time he knocks it off.\" Bolded a key emphasis part. You're asking for their support on this. Thanks, this is a good idea. I don't like admitting he might not be taking me seriously because I'm a woman, though, but it might be true. Unfortunately, most of these guys just want to be part of the group- not make things awkward over small passing comments. I guess if I show that they're a big deal to me they might be willing to make the effort.   Get your digs back on him however you can... unfortunately that's the only thing I've ever found to work. This could work too *if* OP is exceedingly clever and has a very thick skin. The one good thing is that we've both graduated from similar degrees, and whilst I managed to secure a job in a good firm, he hasn't found anything. It can be a good come back if he gets too personal ('they even gave me a JOB, can you believe it?') but whilst I can be witty, I'm not as cool/calm/collected about it as I'd like to be.  Maybe you could try taking his remarks personally, and highlight that he is talking about *you* when he talks about women. When he makes some slur about women in general, describe yourself in that situation.\n\nLet's see... so if he said, 'Women deserve to be beaten', you could say, 'Okay, Mark, so you think I deserve to get beaten?' in a friendly and enquiring tone. On a similar note: 'Did you want me to leave and go to the kitchen?' 'Do you think that I don't deserve this job?' 'Are you saying that if I was brutally raped, you think that I'd enjoy it?'\n\nHopefully, by seeing how they're attacking *you* with their hurtful remarks, they'll care enough about you to stop. If instead they say, 'hurr hurr yes' then I don't think they seem like good friends or want you around. \n\nA guy I know used to append 'stupid woman/girl' to his remarks to me, quite casually. I just said to him one day, 'do you really think I'm stupid? i'm studying to be a vet, and you just dropped out of university,' and he stopped. YMMV, obviously. Thank you! I love this advice. Going to have to work on a few things I can say in a group situation that are confronting enough for him to take seriously.  Maybe you could try taking his remarks personally, and highlight that he is talking about *you* when he talks about women. When he makes some slur about women in general, describe yourself in that situation.\n\nLet's see... so if he said, 'Women deserve to be beaten', you could say, 'Okay, Mark, so you think I deserve to get beaten?' in a friendly and enquiring tone. On a similar note: 'Did you want me to leave and go to the kitchen?' 'Do you think that I don't deserve this job?' 'Are you saying that if I was brutally raped, you think that I'd enjoy it?'\n\nHopefully, by seeing how they're attacking *you* with their hurtful remarks, they'll care enough about you to stop. If instead they say, 'hurr hurr yes' then I don't think they seem like good friends or want you around. \n\nA guy I know used to append 'stupid woman/girl' to his remarks to me, quite casually. I just said to him one day, 'do you really think I'm stupid? i'm studying to be a vet, and you just dropped out of university,' and he stopped. YMMV, obviously. The one good thing is that we've both graduated from similar degrees, and whilst I managed to secure a job in a good firm, he hasn't found anything. It can be a good come back if he gets too personal ('they even gave me a JOB, can you believe it?') but whilst I can be witty, I'm not as cool/calm/collected about it as I'd like to be.  &gt; It can be a good come back if he gets too personal ('they even gave me a JOB, can you believe it?') \n\nUmmm, that could get really ugly, really fast.   http://captainawkward.com/2013/01/02/419-my-friends-jokes-are-the-worst-also-why-do-we-talk-about-ending-friendships-forever-so-much-on-this-blog/\n\nObligatory Captain Awkward link? Remember that it isn't necessarily your responsibility to make this guy into a guy who respects women, or even make him understand that he's an ass. You are perfectly fine if you just say 'Hey, don't say that crap around me', or 'I don't want to listen to this'. You're not a one-on-one friend with this guy, but you are in your rights to set up boundaries even when you're hanging out in a group. http://captainawkward.com/2013/01/02/419-my-friends-jokes-are-the-worst-also-why-do-we-talk-about-ending-friendships-forever-so-much-on-this-blog/\n\nObligatory Captain Awkward link? Remember that it isn't necessarily your responsibility to make this guy into a guy who respects women, or even make him understand that he's an ass. You are perfectly fine if you just say 'Hey, don't say that crap around me', or 'I don't want to listen to this'. You're not a one-on-one friend with this guy, but you are in your rights to set up boundaries even when you're hanging out in a group.   I know I am late, but hopefully a few people will see this.\n\nHere is the problem, masculine men have grown up in the world of putting people down and making people look bad. This is normal to us. We have been doing it since we could talk. We call it giving each other shit. Some take pride in being an asshole. And when we do it to women, it comes across as WTF? Why is being an asshole? There is no reason, this is how many men are. This is our/their world. \n\nOf course, this does not make it right or acceptable. A large part of becoming a successful adult as a man is to transition from this locker room type mentality to a more mature and professional outlook on life. This is not easy for many men. And some may be nice and professional at work and then regress when they are at home with friends.\n\nYou have to let him know that you see him as a jerk and that if he wants to hang out with you, that this shit won't stand.  You have to hit him in the nose verbally. He will then realize that you are not to be fucked with and you will make him look bad if does this shit again. \n\n1) Never disagree. Start with a \"yeah, OK.\" then go into the comeback.\n\n2) Make him look young and stupid and immature. This is key.  \nSomething like, \"it's amazing how you can look like an adult, yet you sound like a little boy\". Or \"Wow, I can see how girls are just jumping into your pants\". Or \"Please, could you teach me more of your game. I really want to know how to be celibate for a while\". \n\nHe may respond with \"haha, I get a lot of chicks\". Then you say \"really, where are they?\". And \"is this like the summer girlfriend who was a model and no one ever met?\" \n\n3) Have the attitude of \"don't fuck with me and I won't drop an A-bomb on your ass\". \n\n4) Do not get emotional. This is not about how he makes you feel. This is about respect. If he wants to be around you, he will respect you. Period. \n\n5) If he respects you, you will respect him. \n\n\nIf he gets angry, then just be relaxed. He needs to know not to fuck with you by saying sexist shit around you. If he yells, just calming say, \"If you can't hang with me, don't say shit like that\".  \n\nIf he goes crazy, your friends will side with you.\n\nRemember, this is about respect, nothing more. \n\n    [deleted] &gt; ...if you ONLY complain about the gender jokes, you don't have a strong argument. \n\nI... don't think OP is making an 'argument'. She came here asking for support and advice for a situation that was making her feel uncomfortable. What's with all the hostility? :/ No, she made a thread looking for the \"best way\" to talk to her friend about this.  I am saying that it will sound mighty hypocritical to complain about his sexist jokes and nothing else if he is also making racist jokes, dead baby jokes, 9/11 jokes, etc... &gt;No, she made a thread looking for the \"best way\" to talk to her friend about this.\n\nWell... yes. 'Looking for the best way' = asking for support/advice, and 'this' = the situation. That's what I said, so I'm not sure why you're disagreeing with me.\n\nI'm don't know what issues are troubling you so much that you're strutting around here, looking for a fight. The OP is not asking to become the PC police, she's just trying to figure out how to deal with an uncomfortable situation that affects her personally. Please leave her in peace. :) &gt;No, she made a thread looking for the \"best way\" to talk to her friend about this.\n\nWell... yes. 'Looking for the best way' = asking for support/advice, and 'this' = the situation. That's what I said, so I'm not sure why you're disagreeing with me.\n\nI'm don't know what issues are troubling you so much that you're strutting around here, looking for a fight. The OP is not asking to become the PC police, she's just trying to figure out how to deal with an uncomfortable situation that affects her personally. Please leave her in peace. :) No, she made a thread looking for the \"best way\" to talk to her friend about this.  I am saying that it will sound mighty hypocritical to complain about his sexist jokes and nothing else if he is also making racist jokes, dead baby jokes, 9/11 jokes, etc...",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jse6/how_do_i_deal_with_male_friend_who_constantly/"
  }, {
    "id" : 47,
    "title" : "Today I participated in One Billion Rising,and it was a great experience",
    "snippet" : "I'm a survivor of multiple rapes and sexual molestation, and to be a part of something like that was very empowering and healing.Do any of you other redditors have stories about participating in the One Billion Rise V-day march?  Some people I know started a new location where I live.  It was a small group but very energetic!! It's great for raising awareness, and I hope next year will be bigger!  \n\nI'm so happy to hear you had a great experience as well :)",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kdxq/today_i_participated_in_one_billion_risingand_it/"
  }, {
    "id" : 48,
    "title" : "My first Valentine ever, and he made today perfect!",
    "snippet" : "   He's a cutie ;)",
    "url" : "http://i.imgur.com/wLductb.jpg"
  }, {
    "id" : 49,
    "title" : "I'm proposing to my boyfriend this weekend! Tips?",
    "snippet" : "Hi lovely ladies,\n\nI'm going to propose to my boyfriend this weekend. We've been joking about it for months, and we know we want to spend the rest of our lives together. We won't be able to have a big wedding for about five years (navy life, family issues, et cetera). I'm thinking I'll propose now and we can have a small ceremony, then in a few years have a bigass party when we can afford it. \n\n\nMy plan is to take him out for dessert on Sunday night and sneak it in there somewhere at our favourite restaurant. I need tips and advice and feedback from you beautiful creatures!  Have you actually had a real serious talk about getting married soon? Because a proposal should never be an actual surprise (except, you know, \"how are you going to do it\"). It shouldn't be out of left field. You should discuss discuss and discuss some more all of the details about being married  before you pop the question, and make sure it's wanted now instead of 5 years down the line, you know?\n\nAlso a public proposal is often not a good idea. I thought at first this said \"take him out to the desert\" at night which sounds really freaking romantic (yeah a little cold but, seriously, alone, at night, under the stars...)\n\nI would much prefer it to be an intimate moment shared between just me and my future partner than in a public setting. Make sure he's not planning on proposing first, too!! (my friend's parents did this actually. she proposed to him and after he said yes he took out his own ring... he was going to propose that night too!)\n\nI would say just discuss this and try to do it somewhere private and intimate with just the two of you instead of in public at a restaurant. You can go out to eat afterwards to celebrate but I think you could think of a more romantic and intimate setting I also 2nd the not a public proposal thing. I have no idea how comfortable he's going to be with a girl proposing in the first place (kinda making some assumptions since you mentioned the navy which is usually a bit more conservative/traditional) and even if he is a lot of people won't be.  Have you actually had a real serious talk about getting married soon? Because a proposal should never be an actual surprise (except, you know, \"how are you going to do it\"). It shouldn't be out of left field. You should discuss discuss and discuss some more all of the details about being married  before you pop the question, and make sure it's wanted now instead of 5 years down the line, you know?\n\nAlso a public proposal is often not a good idea. I thought at first this said \"take him out to the desert\" at night which sounds really freaking romantic (yeah a little cold but, seriously, alone, at night, under the stars...)\n\nI would much prefer it to be an intimate moment shared between just me and my future partner than in a public setting. Make sure he's not planning on proposing first, too!! (my friend's parents did this actually. she proposed to him and after he said yes he took out his own ring... he was going to propose that night too!)\n\nI would say just discuss this and try to do it somewhere private and intimate with just the two of you instead of in public at a restaurant. You can go out to eat afterwards to celebrate but I think you could think of a more romantic and intimate setting Yes, we absolutely have had real serious talks. We've also joked about eloping recently but the jokes have gotten less and less joke-y. I know he's not planning on proposing within the next year so I'm not worried about that (the reason he hasn't proposed yet is due to a timeframe I said would fit my comfort zone best). I do think you're right about the setting though. I might get dessert for pickup and then take him to the waterfront to watch the sunset.   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18k33x/im_proposing_to_my_boyfriend_this_weekend_tips/"
  } ],
  "processing-time-source" : 95,
  "processing-result.title" : "twoxchromosomes14_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/twoxchromosomes14_reddit.xml"
  }
}