{
  "processing-time-total" : 2529,
  "clusters" : [ {
    "id" : 0,
    "size" : 9,
    "score" : 40.788156711188954,
    "phrases" : [ "Period" ],
    "documents" : [ 6, 16, 26, 32, 33, 37, 40, 43, 46 ],
    "attributes" : {
      "score" : 40.788156711188954
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 85.53685693801957,
    "phrases" : [ "Happy V-day" ],
    "documents" : [ 7, 25, 33, 34, 38, 42 ],
    "attributes" : {
      "score" : 85.53685693801957
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 109.71395007670505,
    "phrases" : [ "New Name" ],
    "documents" : [ 29, 32, 39, 42, 43, 47 ],
    "attributes" : {
      "score" : 109.71395007670505
    }
  }, {
    "id" : 3,
    "size" : 6,
    "score" : 35.58728430658222,
    "phrases" : [ "Old People Love Love" ],
    "documents" : [ 22, 27, 29, 42, 43, 47 ],
    "attributes" : {
      "score" : 35.58728430658222
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 71.16739878800136,
    "phrases" : [ "Ask the Question" ],
    "documents" : [ 8, 22, 37, 39, 43 ],
    "attributes" : {
      "score" : 71.16739878800136
    }
  }, {
    "id" : 5,
    "size" : 5,
    "score" : 39.48267383511106,
    "phrases" : [ "Girl Hate" ],
    "documents" : [ 18, 27, 43, 47, 48 ],
    "attributes" : {
      "score" : 39.48267383511106
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 82.65266228809101,
    "phrases" : [ "Look Forward" ],
    "documents" : [ 7, 11, 27, 32, 33 ],
    "attributes" : {
      "score" : 82.65266228809101
    }
  }, {
    "id" : 7,
    "size" : 5,
    "score" : 89.98256378178706,
    "phrases" : [ "Valentine's Day Gifts" ],
    "documents" : [ 1, 7, 32, 34, 42 ],
    "attributes" : {
      "score" : 89.98256378178706
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 28.152752539714267,
    "phrases" : [ "Dad Told" ],
    "documents" : [ 27, 29, 40, 43 ],
    "attributes" : {
      "score" : 28.152752539714267
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 53.53391732179576,
    "phrases" : [ "Flowers" ],
    "documents" : [ 3, 7, 34, 42 ],
    "attributes" : {
      "score" : 53.53391732179576
    }
  }, {
    "id" : 10,
    "size" : 4,
    "score" : 61.24068372185052,
    "phrases" : [ "Gaining Weight" ],
    "documents" : [ 6, 27, 43, 49 ],
    "attributes" : {
      "score" : 61.24068372185052
    }
  }, {
    "id" : 11,
    "size" : 4,
    "score" : 72.43094435626986,
    "phrases" : [ "Great Valentine's Day" ],
    "documents" : [ 32, 33, 34, 36 ],
    "attributes" : {
      "score" : 72.43094435626986
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 80.04255779455346,
    "phrases" : [ "Applying for Jobs" ],
    "documents" : [ 11, 27, 43 ],
    "attributes" : {
      "score" : 80.04255779455346
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 65.45802450757397,
    "phrases" : [ "Right to Judge" ],
    "documents" : [ 16, 22, 27 ],
    "attributes" : {
      "score" : 65.45802450757397
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 59.13246574758042,
    "phrases" : [ "Black" ],
    "documents" : [ 12, 43 ],
    "attributes" : {
      "score" : 59.13246574758042
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 54.21550416715329,
    "phrases" : [ "Football" ],
    "documents" : [ 0, 24 ],
    "attributes" : {
      "score" : 54.21550416715329
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 47.999813158776476,
    "phrases" : [ "Fun that lets me Relax" ],
    "documents" : [ 19, 47 ],
    "attributes" : {
      "score" : 47.999813158776476
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 42.72950468516563,
    "phrases" : [ "Global" ],
    "documents" : [ 10, 23 ],
    "attributes" : {
      "score" : 42.72950468516563
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 38.74653508831266,
    "phrases" : [ "Husband Noticed" ],
    "documents" : [ 27, 34 ],
    "attributes" : {
      "score" : 38.74653508831266
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 36.92851364125919,
    "phrases" : [ "Pill for eleven Months" ],
    "documents" : [ 32, 43 ],
    "attributes" : {
      "score" : 36.92851364125919
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 95.52366509767604,
    "phrases" : [ "Plan on Getting an Abortion" ],
    "documents" : [ 14, 43 ],
    "attributes" : {
      "score" : 95.52366509767604
    }
  }, {
    "id" : 21,
    "size" : 16,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 2, 4, 5, 9, 13, 15, 17, 20, 21, 28, 30, 31, 35, 41, 44, 45 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 2476,
  "documents" : [ {
    "id" : 0,
    "title" : "'More than able to hold her own,' girl gets boot from Catholic football league",
    "snippet" : "    Title IX suit waiting to happen? Title IX suit waiting to happen? They'll claim their Invisble Menz In Deh Skiy sez No Girlz Allows.. \n\noh, wait, wrong subreddit... \n\nBut the key about Title IX is that they have to be receiving federal monies in some way. Few if any parochial schools do. While one can make the argument that they indirectly receive support in the form of tax exempt status, I don't believe that plane exactly flies in court at the moment.  &gt;Invisble Menz In Deh Skiy sez No Girlz Allows..\n\nThe invisible sky man can kiss my white ass. \n\nOh, wait, wrong sub...\n\nAre they playing on town or city fields (like the public high school or a park)? Wouldn't that be enough of a case? If my first name were Counsellor and my last name was JD or Esquire, I'd be more than happy to try to find out.  That's a fancy way of saying I AM NOT A LAWYER, right? Yes. (I love playing with language... but at the same time, I've had a fascination with the law. I am amazingly good at navigating the bureaucrazy... going from there to the courts is a leap, but not that big a leap..)     This breaks my heart (all over again). I played football in 7th and 8th grade before getting forced out by a particularly physical bully and his dad. I really loved playing, and I was pretty good compared to some. The coach was obviously uncomfortable giving me play time, though, so I was benched almost always... After finishing up 8th grade I decided not to play in high school because I was too scared of getting (more) death threats from this particular bully and not having any support from my coach or other players. \n\nI can't believe that this kind of shit is still happening 10 years later. Women in football is not unprecedented (http://en.wikipedia.org/wiki/List_of_female_American_football_players)! It's no more dangerous for her to play than any other kid... \n\nThey don't offer a girl's football option, so I don't see why they're allowed to keep her out. Someone should tell her to get into rugby. Women's rugby teams are growing in popularity and it will be an olympic sport in 2016 (well, rugby 7's will). I had a blast playing in college and only wish it had been around when I was under 15.  ",
    "url" : "http://www.cnn.com/2013/02/14/us/philadelphia-archdiocese-boys-only-football/index.html?hpt=hp_c4"
  }, {
    "id" : 1,
    "title" : "I acted rather rudely to a boy from my school who gave me a few balloons for Valentine's day. ",
    "snippet" : "A bit of backstory on my dating history; I recently got out of a year long relationship with a guy who was verbally abusive and severely controlling. I mean, controlling to the point where he would cry when I hung out with friends without him and he got angry when I left the room for more than five minutes, even if it was just to go to the bathroom. After we broke up, he would leave threatening notes in my locker (he had already graduated and should not have had access to the school). I broke up with him six months or so and now I would like to enter a relationship with someone new. So for valentine's day, my school offers balloons for people to buy and will be delivered by someone else. So when I saw someone walking up to me with balloons bumbling behind them, I feared this was one of his many attempts to lure me back in. My heart was pounding, my palms sweating, and a familiar fear of him contacting sat like a rock in my stomach. But when I saw they were from a boy from school, I found myself becoming so angry, judgmental thoughts racing through my head. *How dare he scare me? How dare he buy me something when I barely new him? Did he think buying me some cheap gift would win me over? Did he think I owed him something now, like a date?* But as the school day passed, I began calming down, and realized what he did must've been a very hard thing to do, just putting his feelings out there like that. But every time I saw him glance at me, I felt so afraid of... something. Fear of starting to like him, going out with him, and falling back into an unhealthy relationship where it took months to gather myself together and get out. I told my mother about it after school, and she told me I had to be nice to the boy. I had to thank him and tell him it was a sweet gesture. But I'm still angry at him and afraid of going back to being controlled and screamed at for everything. We have only talked a few times, all being about a year ago. I'm afraid if I talk to this boy, I will be too polite and he will think he has a chance with me. But at the same time I don't want to be so rude and crush him just because he bought some balloons for me. I don't really know how to feel about this or why I'm so angry at him over some Valentine's day gift.\n**TLDR; A boy bought me balloons and my problems from my past relationship are stopping me from enjoying it.**    ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18k47d/i_acted_rather_rudely_to_a_boy_from_my_school_who/"
  }, {
    "id" : 2,
    "title" : "...and now I can never go back to my grocery store",
    "snippet" : "I have a two year old daughter that has a leappad2 that just burns through batteries. It died mid-game and she got really upset. Her dad and I started pillaging other electronics around the house for AA batteries and came up with only 3, while 4 were needed. By this point, she was completely over it and had moved onto something else. But I was still set on getting her game up and running again right away. \nSo, I went to the grocery store. At 10pm. On Valentine's Day. \nFor rechargeable batteries. \nHow this would look to others didn't hit me until I was impatiently checking-out and the cashier looked at the batteries, my only purchase, and then back up at me with this funny look. I suddenly got what he was thinking and felt my face go fuschia out of shock and embarrassment. I couldn't even try to explain. I knew it would just look worse. Most kids are asleep by 10pm and it would just sound like b.s.\n&lt;_&lt; \n4-pack of rechargeable AA batteries..late at night...Valentine's day... \nIf it had been my husband picking some up, nbd. I'm sure. Gah.  I think it'll be okay. If you're embarrassed to buy batteries, I imagine you're a nervous wreck buying condoms and the like. Probably. I wasn't at all a nervous or shyness thing. It was just that it didn't even occur to me until I was non-verbally confronted about it and then I was caught off-guard by the implication, you know? That's the point at which you, whilst staring the cashier down, reach for the condoms or cigarettes at the side of the counter. Then wink.      ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18k8ej/and_now_i_can_never_go_back_to_my_grocery_store/"
  }, {
    "id" : 3,
    "title" : "The Compromise Flower (Short Fiction)",
    "url" : "http://whatshihsaid.com/2013/02/15/the-compromise-flower-by-irene-shih/"
  }, {
    "id" : 4,
    "title" : "Make Valentine's Day special with suspicious-looking handmade pasta!",
    "snippet" : "     ",
    "url" : "http://www.seriouseats.com/2013/02/valentines-day-video-heartbeet-pasta-filled-w.html"
  }, {
    "id" : 5,
    "title" : "Not your usual thong question.",
    "snippet" : "So I've been wearing things for about two weeks now. Now, I started wearing them at the suggestion of my friend who uses them for avoiding vpl, which is all well and good, but that's all she gets out a things, meaning she'd probably think I was crazy if I told her what I'm about to tell you \n\nI guess Ive always been a butt type girl, enjoying when boyfriends would squeeze my ass and such. I guess what I'm trying to say is there are certain areas (that my friends wouldn't consider going near) with a lot of nerve endings (ahem) that thongs happen to rub against... And while I expect this is something most girls deal with or ignore, I'm actually turned on by it &gt;.&lt;\n\nI'm something of a miss manners, I've only been sexually active less than 6 months, and Im still trying to figure all of this out\n\nPLEASE 2x, are any of you in the same boat? If this is something that I like and that's that, what would be the next thing to try?\n\nTHANK YOU THANK THANK YOU. There's nobody else I could talk to about this.\n\nLove you!    ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kybw/not_your_usual_thong_question/"
  }, {
    "id" : 6,
    "title" : "I hate myself and I've never had a boyfriend.",
    "snippet" : "I can't believe I am admitting this. I am 19 and I have never been kissed. People don't know I've never had a boyfriend because I lie to everyone about it and say that I have and I can get away with it because I have hung out with guys who had an interest in me. I know I should own up to it, but I can't because I'm so paranoid about people realizing I am so self-consicous and they'll think something is wrong with me. OF course there is, though, I just don't want to make it any obvious.\n\n\n\n\n\nI have so many issues with myself and accepting my body. I feel disgusting and fat, which is why I can't get myself to be close to a guy. I hate myself. I do and I feel so lonely. I just want someone to hold and to love me, but I hate my body so much that I cannot allow it. I can't even wear clothes that show too much skin because I have some dark areas and it is so depressing to see everyday. I hate my skin and I hate myself. I think I have PCOS and I cry everyday. I want to just look normal. I want to someday be a beautiful bride, but I am so scared I will end up being alone.     /r/PCOS\n\nYou are not alone, dear. PCOS wrecked my skin (I ended up taking Accutane), made me gain 60 lbs, and makes me shave *everywhere*. Do this right now: if you're not menstruating (common symptom), get on the pill or Metformin (go see a good endocrinologist for a diagnosis-- GYNs often don't know what they're talking about). The worst thing that can happen is endometrial hyperplasia from not having a period, which can be a cancer risk. \n\nFor the weight-- first of all-- you're beautiful. You don't see it, but somebody does. My current SO fell in love with me when I was 55 lbs heavier than I am right now, and he's drop-dead gorgeous. Please believe me, even if you're not buying it yet. Check out /r/BodyAcceptance. Look at the beautiful bigger women all around you. \n\nSecondly, PCOS (if you have it) will make it nigh-impossible for you to lose weight unless you reduce carbs. /r/keto can help you a lot here, or you can do something less drastic, like paleo or slow-carb. Reducing carbs even got rid of all my dark skin problems. It's worth a shot.\n\nFeel free to PM me if you need someone to talk to.     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kjmk/i_hate_myself_and_ive_never_had_a_boyfriend/"
  }, {
    "id" : 7,
    "title" : "[IFF] The first time I've been given gifts for Valentine's day",
    "snippet" : "  I think V-Day haters are downvoting you just because they don't like V-Day so no one else can like/celebrate it either.\n\nVery pretty flowers and the puppy looks snuggly and wonderful :D im noticing this too. Honestly I look forward to IFF because it breaks up the monotony of the same (mostly negative) posts I see every single day. Im not a fan of V-day either but I am a fan of seeing some positive happy posts and images today. Congrats to you for feeling good and getting something special! To the people down voting these posts... Why not just move along and don't down vote someone's happiness. Bitterness is ugly. im noticing this too. Honestly I look forward to IFF because it breaks up the monotony of the same (mostly negative) posts I see every single day. Im not a fan of V-day either but I am a fan of seeing some positive happy posts and images today. Congrats to you for feeling good and getting something special! To the people down voting these posts... Why not just move along and don't down vote someone's happiness. Bitterness is ugly. I think V-Day haters are downvoting you just because they don't like V-Day so no one else can like/celebrate it either.\n\nVery pretty flowers and the puppy looks snuggly and wonderful :D",
    "url" : "http://imgur.com/a/8t4nD"
  }, {
    "id" : 8,
    "title" : "UK TV show Daybreak asks \"Controversial question - can women who are drunk or flirty ever be blamed for being attacked?\"",
    "snippet" : "  This is so stupid and offensive to women and men.  Are they seriously suggesting that if a woman flirts with a guy he won't be able to control himself and must rape her immediately?  How ridiculous is that?  I ask an equally \"controversial question\" -- can reporters who get kicked in the nuts for being assholes be blamed for being attacked?  After all, they were asking for it, with their shitty reporting.\n\nThis is gross. I ask an equally \"controversial question\" -- can reporters who get kicked in the nuts for being assholes be blamed for being attacked?  After all, they were asking for it, with their shitty reporting.\n\nThis is gross. [deleted] Actually, NO I would not consider it OK to kick a man or woman in the crotch for being an asshole.  I also would not consider it acceptable to blame a victim for a crime.  Hence the analogy.   [deleted] I don't understand what second point you are trying to make.\n\nThe asserted equation, by the reporters is \"woman behaves sluttily, someone commits a crime and sexually assaults her, it's her fault for being slutty.\"\n\nThe analogy I made is \"reporter behaves shittily, someone commits a crime by physically assaulting him, it's his fault for behaving shittily.\"\n\nYes, in both cases the assault is a crime.  Yes, in both cases blaming the victim is unacceptable.   [deleted] The phrasing of the question implies the answer.  You cannot ask the question in this way, without sounding like an asshole.  \n\nNo question should be ruled out, but if someone asks \"When did you stop beating your wife?\" or \"Can the Jews be blamed for the Holocaust?\" or \"Can the rape victim be at fault for being raped?\" the question itself shows their intent, and proves their assholery. [deleted] Being called out as an asshole for framing a question a particular way != not being permitted to ask the question.  ",
    "url" : "http://twitter.com/daybreak"
  }, {
    "id" : 9,
    "title" : "I wrote an article on feminism for a school publication--one of the scariest yet most rewarding things I've ever printed. I couldn't have done it without the wisdom of this community.",
    "snippet" : "  ",
    "url" : "http://www.therockatbc.com/2013/02/13/the-f-word-and-me-why-we-need-feminism/"
  }, {
    "id" : 10,
    "title" : "Today is the day for One Billion Rising: a coordinated global event of public danse and celebration to draw attention and stop sexual violence.",
    "snippet" : "    Damn, I want to go but I'm ill and can't leave the house. :(      ",
    "url" : "http://www.aljazeera.com/indepth/opinion/2013/02/201321474341875982.html"
  }, {
    "id" : 11,
    "title" : "21 and finally got my first job! So super happy right now! (Story inside)",
    "snippet" : "First post to this sub, so I apologize if it's out of place. But this is one of my favorites and I'm so super happy right now I just can't contain myself! \n\nOkay, so I just turned 21 in January and I've never had a job. Pathetic, right? I have mild/moderate social anxiety and have always felt so embarrassed that the years would pass by and I still wouldn't have anything to put on my resume or in the \"work history\" box on applications. I think this embarrassment also exacerbated the anxiety. I'd stutter and stammer when they would ask \"why\" I didn't have any experience. In addition to that, I live in a single parent household that has always suffered financially, lived paycheck to paycheck, and seemed to run into a mess of problems when it came to cars. We also live in a more spread out area with no buses or other convenient means of transportation. I wasn't able to get a car until just a year ago. That meant that I was stuck in my house all day with nothing to do except school work (did online study for a year). However, I did get a lot of time to meditate and reflect on my anxiety issues. When I finally got my car and began applying for jobs, I either never heard from them or got an interview but it never went further. Some of the positions I applied for were ones of high turn over so there were sure to be some openings. Alas, nothing.\n\nFast forward to last week. I inquired about a job listing on my community's job market website. I noticed that the listening had been made in January, so I was pretty sure it had been filled but I had already inquired and just assumed they would ignore it. This past Tuesday, I had a missed call/voice mail from the company saying they'd like for me to come in for an interview. I prepared my resume as best I could and pumped myself up for the interview that would happen the following day. I thought it went really well. It was actually more relaxed than any of my previous interviews and I think that really helped me to feel more like myself and genuine. When I got home though, I felt anxious about my lack of work history. I almost felt that my application would for sure be tossed out. I felt like crap all throughout the night and into today. As I pulled in my driveway after school though, I got a call. They were going to offer me the position! ME! You are looking at (or rather reading about) the new animal caretaker for a supplemental science academy for kids. I get to interact with all sorts of animals and teach kids more about them and other related science stuff. When I was younger I wanted to work in a zoo, so this position really hits home for me. :)\n\nTL;DR: 21 and never had a job due to social anxiety and a bunch of other crap. Inquired about a position and got an unexpected call from the company. Interviewed. Later anxiety over lack of \"work history\". Received a call a day later offering me the position! Moral of the story? We all have circumstances in life that seem to block our way, but through perseverance and taking chances (even if they don't seem in our favor) we open the door to so many opportunities. All you can do is try.  That's fantastic. I'm 23 with anxiety and haven't gotten a job yet, but I am looking to get one soon (As soon as I finish this really stressful accelerated class I have). I know how awesome that must feel; not only that, but that job sounds freaking awesome! \n\nGreat job. :) :)  Congrats! :D \nWorrying about getting a job in the future is a main source of anxiety for me, even though I know I shouldn't worry! Opportunities are everywhere!  Nice. I too didn't get a job until I was 21 because I had(have?) social anxiety. I always wanted to do it sooner, but the anxiety (and people in my life facilitating anxious behaviour) kept me postponing it. The moment I did get the job though I couldn't stop thinking 'why haven't I done this sooner?' Sure it was stressful, but the rewards were so much more. I'm more confident than I've ever been.  Congrats!! I know how you feel - I didn't get my first job until I was 20 because I struggled with severe chronic insomnia as well as dealing with a member of my family with substance abuse problems. When I finally did start applying for jobs I was incredibly nervous at having no experience on my resume at my age. Like you, I figured it would just be tossed out, and how would I even explain why if I did manage to land an interview? \"I have trouble sleeping and then there's family stuff I can't tell you about\"? In my mind they would probably assume I was lazy and point me to the door. \n\nIt didn't help that my first boyfriend dumped me and blamed it partially on my lack of a job - not that he had to pay my way or anything, my parents supported me, but he assumed that I was lazy or had no ambition or something. Lo and behold, shortly after that I got a job offer for a position I'd applied for even before he dumped me, and shortly after *that* I was offered *another* job and took that one as well. Both were seasonal positions, one ended and the other I was kept on as a full-time key-holder because I performed so well, and from there became assistant manager, and was even in line to be future manager of the store. I quit for other reasons, but all the people who didn't believe in me, including my ex can SUCK IT! Just because someone may have a slower start it doesn't necessarily reflect their future success.\n\nI truly hope you enjoy your new job, it sounds awesome and it will build your confidence so much! Good luck! :)",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jerh/21_and_finally_got_my_first_job_so_super_happy/"
  }, {
    "id" : 12,
    "title" : "U.S. Capitol gets its first statue honoring a black woman",
    "url" : "http://www.speaker.gov/press-release/house-senate-leaders-announce-dedication-rosa-parks-statue"
  }, {
    "id" : 13,
    "title" : "the coolest thing about menopause (for me)",
    "snippet" : "  Okay, now I get it.  I could have posted it here, which was where I wanted to put it.\n\nBut how do you get an URL to put into the URL box? I would say PM me with the instructions but I don't yet know how to find my PMs. \n\nHopeless, I know. But like so many of the other myriad ways in which I fall short of perfection--not something I have enough fucks left to give, about. \n\nSo should I put the piece in here in comments also, or do you think people will read it over there and comment on it here? It's earthshakingly wonderful, I want everyone to be sure to get to read it... Hi there! I figured I'd try to help you out a bit (sorry if any of this comes across as patronizing, I just don't know how much you don't know, and I'm not sure if I'm completely understanding your question)\n\nTo get a URL, while on the site that you want the URL of, just go to the bar in your browser that has a web address in it (www.blah.com/lakjflsdhgljsdfk or whatever), then highlight the whole address, right click and select \"Copy\", then right-click \"paste\" into the box for your reddit post. Does that help?\n\nI think people will find the post over there and comment here if they want to. I thought it was cool :) I'm a long way from menopause but it was nice to hear there are some highlights!  Wishing you were Asian?   How is that relevant to anything?",
    "url" : "http://prhii.squarespace.com/journal/2013/2/15/the-coolest-thing-about-menopause-for-me.html"
  }, {
    "id" : 14,
    "title" : "If you’re in the US and ever need help paying for an abortion",
    "snippet" : "  No North Carolina.= :-(  no louisiana, either. ah, the deep south.  Nor Alabama. :( I need to move. Not because I plan on getting an abortion, but because it's indicative of the close-mindedness of the south.  Nor Alabama. :( I need to move. Not because I plan on getting an abortion, but because it's indicative of the close-mindedness of the south.  yea, the south is rather smothering. not only with gravy, but with close mindedness too. If only we could keep the food the same and change everything else. No North Carolina.= :-(  No North Carolina.= :-(   My \"win the lottery\" thing would be to start a fund like this. I live in Northern Ireland where abortion is illegal but you can go to England and get it done, but only privately, so its a lot of money. I really believe that it is wrong to be unable to access medical treatment simply because you can't afford it. So many young girls can't afford to go England and are too scared to say to their parents or their parents can't afford it either and resort to buying dodgy pills online or trying to do it as cheaply as possible which can be very dodgy, or even trying to abort themselves e.g falling down the stairs. The predominately Unionist government is who stopped abortion being available here, which is just so ironic as they are apparently so proud of their \"Britishness\" yet won't accept UK law.  i love this idea. i've thought if i was to get rich, i'd offer money for people to get their tubes tied/ tubes clipped, and nip that problem in the butt.  Thankfully contraception is free here, but still you one mistake is all it takes.  My \"win the lottery\" thing would be to start a fund like this. I live in Northern Ireland where abortion is illegal but you can go to England and get it done, but only privately, so its a lot of money. I really believe that it is wrong to be unable to access medical treatment simply because you can't afford it. So many young girls can't afford to go England and are too scared to say to their parents or their parents can't afford it either and resort to buying dodgy pills online or trying to do it as cheaply as possible which can be very dodgy, or even trying to abort themselves e.g falling down the stairs. The predominately Unionist government is who stopped abortion being available here, which is just so ironic as they are apparently so proud of their \"Britishness\" yet won't accept UK law.    No Connecticut :/ how does that make sense?       I have always assumed (without proof) that there is far more than enough private money to assist women who can't afford abortions that there is no need for public money. Do doubt the overwhelming vast majority of the public money is lost to waste and corruption.\n\nHowever, I am open to the idea that the above assumption is incorrect and looking at this list it seems my assumption may be true in some areas but not others.  These organizations provide help, but they can seldom cover the full cost of an abortion. More often, they just provide an extra $50 or $100 for women who just need to scrape together the rest of the cost (often after selling many possessions, or going without groceries for a few weeks). \n\nYou should read some of the [stories](http://fundabortionnow.org/learn/how-are-womens-lives-affected) written by women who received assistance from the National Network of Abortion Funds. They go through hell trying to find enough money, and charities like the NNAF can only ease their struggle a little. If their health insurance was allowed to cover the cost, then this wouldn't be a problem. ",
    "url" : "http://fuckyeahfeminists.com/post/35216037769/abortion-funds-by-state"
  }, {
    "id" : 15,
    "title" : "Anyone want to share Spotify playlist? ",
    "snippet" : "I listen at work and would like to hear other peoples playlists if anyone is interested. I don't think we can link directly to them, but if the have a unique name and are public they might be searchable. \n\nThe most interesting play list I have is a \"sexy time\" one. We only have a few songs and are open for suggestions if anyone has any. It is called:\n\n\"just mo and abby\" \n\n\n**OK if you right click on your playlist you get a link. Nice!\n\nhttp://open.spotify.com/user/125548252/playlist/2ddFCRbygKkxeRTZJPBSi3\n\n  http://open.spotify.com/user/1231189592/playlist/6s8yoeQpq6ijEywzZAimWV\n\nMy 'Doomsday' playlist. I first made it on December 21st, when I was taking the piss out of the whole 'world ending' thing. \n\nEnjoy! (People can right-click their playlists in Spotify and select 'copy HTML link. It should work) Nice. Subscribed!  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18k34m/anyone_want_to_share_spotify_playlist/"
  }, {
    "id" : 16,
    "title" : "Has anyone had any experience with using norethisterone to push their cycle back by a week or two? How difficult is it to obtain in the US?",
    "snippet" : "Hiya ladies,\n\nI'm going on a trip to Europe next month from the 9th to the 31st and judging by my tender boobs, my period this month will likely come within the next week and my next period will probably fall right in the middle of my trip. Since my period lasts about a week with heavy bleeding (forcing me to empty out my mooncup 3-4 times a day for the first few days) and heavy cramping, I'd love to push it back. \n\nI'm not on hbc because I had a ton of issues in the past with them triggering recurring BV. I'm curious about 2X's experiences with norethisterone since it seems like it's pretty commonly prescribed in the UK. How bad were the side effects for you and how easy is it to get in the states? How has it affected your periods in later months -- that is, does it permanently shift your cycle back? I was thinking about taking it this month to push it back to the week before my trip. \n\nThanks much for any input!",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kgne/has_anyone_had_any_experience_with_using/"
  }, {
    "id" : 17,
    "title" : "[x-post from xxfitness]  I know a lot of girls wonder about the right amount of working out.  \"Getting the Right Dose of Fitness.\"",
    "snippet" : "  Hmmm. I just want to point out that this study involved only women of post-menopausal age. Would the results not be drastically different for younger women?",
    "url" : "http://well.blogs.nytimes.com/2013/02/13/why-four-workouts-a-week-may-be-better-than-six/?src=me&amp;ref=general"
  }, {
    "id" : 18,
    "title" : "Unpaid Internships Are a Rich-Girl Problem—and Also a Real Problem ",
    "snippet" : "  I hate unpaid internships.  Only nonprofit should have unpaid internships.  for profit companies should definitely pay.  I really do think this \"unpaid\" work for experience is total nonsense.\n\nI have never been unpaid for the service I provide. Even after my freshman year, I worked at consulting firm as a paid intern for 6 months doing CAD work.  By the time I graduated, I had 4 engineering jobs on my résumé and getting royalty checks from a patent.\n10+ years later, I have interns of my own and pay them for doing entry level work/research for half the price and no benefits. I can understand not wanting to take an unpaid internship. I just think that if an adult is willing to do something for no money then there shouldn't be laws against it. Similar to the idea that if someone wants to make money by selling sex they should be able to. The problem is that it normalizes offering unpaid work with illusory promises of later paid work whenever the economy is bad. I agree that we shouldn't require soup kitchens to pay their volunteers, or whatever, but allowing corporations to offer \"work in exchange for one line on a resume,\" which is what it amounts to, just opens up all sorts of possible abuses. I don't think I've ever heard of an internship that comes along with a promise of a job after it is over. It happens often enough, but there is no promise.\n\nThe entire idea behind an internship (either paid or unpaid) is to get experience, and make yourself a more marketable job candidate. If someone is willing to work for X number of hours, or Y number of weeks in exchange for a \"line on their resume\" I don't think that it should be disallowed.\n\n&gt; just opens up all sorts of possible abuses.\n\nI'm not really sure what you are referring to here. If someone decides they want to do something for free, because they think the potential rewards from it (in this case a better chance at a job) are worth the costs to them, why shouldn't they be able to do that? &gt; I'm not really sure what you are referring to here. \n\nI'm referring to the real world. ***Nobody*** decides they want to empty the trash at Dunder-Mifflin for free. They do it because there aren't any actual jobs available to them. Pretending it's about personal choice ignores the massive power imbalance between individuals and businesses — an imbalance which only government intervention seems able to correct. &gt; Nobody decides they want to empty the trash at Dunder-Mifflin for free.\n\nIf they take the free trash collecting job, then I would have to disagree.\n\nI think the key difference here is that we are approaching the issue from different sides. You seem to be coming from the position that companies should be forced to pay a certain amount to have a person working for them. I am coming from the position that if a person is willing to work for a certain amount, they should be able to.\n\nMy general thought process is, if nobody is willing to do a job for a certain amount, then the company will either:\n\nA) Offer more money to someone to do that job.\n\nor\n\nB) Not hire anyone to do the job because they would be spending more than on the person doing the job than it is worth to them.\n\nEither of those are acceptable outcomes in my mind. &gt; if a person is willing to work for a certain amount, they should be able to.\n\nThe problem comes when people work for nothing when they think they're getting something. That is, when they're misled about the actual value of the experience they're getting. If you empty trash for no pay (usually having been told that you would \"learn the ropes of a fast-paced office environment\"), then what you have at the end of it is just a line on your resume that (dressed up in resume jargon) says, \"I emptied trash for no pay.\"\n\nIt doesn't add anything to your hireability, but it was very easy for the intern recruiters and your own desperation to join the middle class to make you think that it would. So unless the economy has improved, you're back at square one, looking for another unpaid internship. That's why such internships are toxic. It's not about willingness; it's about exploiting desperate graduates through information asymmetry. I don't think it is the role of the government to dictate how much value people think they will get from emptying the trash for free. I agree that it doesn't really add anything substantial to your heritability, however that doesn't mean someone else might not think so. However, if someone improperly values something because their judgement was clouded by something else (say desire to move into a higher social class with more money), I don't think anybody needs to intervene to make sure they don't do something they may later regret.\n\nIf your issue is with false advertising, that is an entirely different discussion. If an advertisement or recruiters tells someone that they are going to get to experience a fast paced work environment, and they do by having to empty lots of trash for free, I think that is on them to find out what they are getting into before they agree to do something. &gt;  If an advertisement or recruiters tells someone that they are going to get to experience a fast paced work environment, and they do by having to empty lots of trash for free, I think that is on them to find out what they are getting into before they agree to do something.\n\nHow would they actually do that? If you ask the company, they'll simply lie. And nobody else has enough information to answer. I think the onus should be on the government to prosecute the companies that commit the crime of false advertising (though I'm aware it's probably a legal gray area in this case). Unpaid internships would be much less of a problem if they actually, reliably taught useful skills and led to paid work. I can understand not wanting to take an unpaid internship. I just think that if an adult is willing to do something for no money then there shouldn't be laws against it. Similar to the idea that if someone wants to make money by selling sex they should be able to. Nice. Associating those who wants to be paid for doing relevant work with prostitution.  Only in 2X   &gt;&gt;There is a law in this country that says that internships must resemble an education and that interns cannot work in the place of paid employees, nor be of \"immediate benefit\" to an employer. \n\nFrom another article.  Did anyone else have problems with the tone of the article?  There were a few really big implications that I thought it glanced over in favor of using the rich girl theme.  For example, what about middle class and low income families that lack the ability to support their kid's quest for a decent job? What happens to those kids? I read one of the comments that was pretty thought provoking. The commenter was saying that unpaid internships are a way that industries can eliminate most low income individuals (either intentionally or not).\n\nHe made a very valid point. I have my own opinions on wages, unpaid internships etc. but it was a very interesting point that I hadn't considered, and seemed like it would have been a good thing to include in the article. It's true.  If you want to get a job in Congress, for example, you are pretty universally required to do an internship first.  This (usually) unpaid internship is going to cost a minimum of $800 in rent, plus food, transportation, proper clothes and miscellaneous expenses.  Per month.  Most families cannot afford to shed out that sort of money- especially when there is no guarantee of a job at the end of the experience. It is certainly true. I still don't think we should require internships be paid though. I think that if someone is willing to do something for less, then that is a fair thing for them to decide, and they shouldn't be denied the fact the potential to be better off because they are willing to make sacrifices before getting potential rewards. Are you also in favor of abolishing minimum wage? There are probably people who are desperate enough to work for less.   I suppose the points this article makes are very relevant- especially for people in business internships and especially with the troubled job market. It's probably hard to compete with free.\n\nAt the same time though, I'm currently in training at an unpaid internship and I feel totally fine about it. I'm interning at a domestic violence service that basically wouldn't be able to function without their volunteers and interns. I'm getting 45 hours of training and the ability to give back to my community. I'm not getting paid for it, but I feel like I'm getting valuable experience.\n\nI guess I'm just in a different kind of situation than the the fields this particular article is focusing on. \n\nEdit: Oh and I guess I'm not a \"rich-girl\". :\\  How are you able to support yourself if you work 45 hours a week unpaid? 1) It's not 45 hours a week. It's a 45 hour training in all. So for the three weeks of training it's only 15 hours a week.\n\n2) I'm married and my husband helps me out. We're not rich, but I'm fortunate enough to have a spouse to help me while I'm in school. I realize that it's similar to the idea of the \"rich girl\" having support. I guess I just don't feel rich most of the time.\n\n3) I'm a full time student and I'm on financial aid. Ah, I gotcha, 45 hours over a quarter/semester makes a lot more sense. I suppose the points this article makes are very relevant- especially for people in business internships and especially with the troubled job market. It's probably hard to compete with free.\n\nAt the same time though, I'm currently in training at an unpaid internship and I feel totally fine about it. I'm interning at a domestic violence service that basically wouldn't be able to function without their volunteers and interns. I'm getting 45 hours of training and the ability to give back to my community. I'm not getting paid for it, but I feel like I'm getting valuable experience.\n\nI guess I'm just in a different kind of situation than the the fields this particular article is focusing on. \n\nEdit: Oh and I guess I'm not a \"rich-girl\". :\\  I've done a lot of unpaid internships at government and \"giving back\" type jobs too, but I think the problem isn't that the internships aren't fulfilling and rewarding. Sometimes they're very fulfilling and rewarding, and even educational things or at the very least sound good on a resume. Otherwise people wouldn't do them. I'm 90% sure I won't get a job at any place I interned at, but having a good resume'll hopefully get me the experience I need to get one of those jobs that requires some sort of experience.\n\nI think the scary thing isn't the working for free for a bit, it's the idea of working for free forever. And the fact that 75% of the people who put up with this system are women was probably the most shocking thing. I don't think I'm a super rich girl either, but I know if I were living in actual poverty or had worse hardship, working for free wouldn't be an option to begin with (or at least I'd have to work way more on the side at paid jobs), so that's why people don't really pay attention to the issue. Like education, unpaid internships are still classified as a privilege. I suppose the points this article makes are very relevant- especially for people in business internships and especially with the troubled job market. It's probably hard to compete with free.\n\nAt the same time though, I'm currently in training at an unpaid internship and I feel totally fine about it. I'm interning at a domestic violence service that basically wouldn't be able to function without their volunteers and interns. I'm getting 45 hours of training and the ability to give back to my community. I'm not getting paid for it, but I feel like I'm getting valuable experience.\n\nI guess I'm just in a different kind of situation than the the fields this particular article is focusing on. \n\nEdit: Oh and I guess I'm not a \"rich-girl\". :\\  I think everyone is OK with unpaid internships at a non-profit (it's basically formalized volunteer work). It's when you do an unpaid internship answering phones at Sony or whatnot - learning nothing at all *and* contributing to their bottom line - that it becomes problematic. Yeah, that stuff makes me feel pretty uncomfortable.  I suppose the points this article makes are very relevant- especially for people in business internships and especially with the troubled job market. It's probably hard to compete with free.\n\nAt the same time though, I'm currently in training at an unpaid internship and I feel totally fine about it. I'm interning at a domestic violence service that basically wouldn't be able to function without their volunteers and interns. I'm getting 45 hours of training and the ability to give back to my community. I'm not getting paid for it, but I feel like I'm getting valuable experience.\n\nI guess I'm just in a different kind of situation than the the fields this particular article is focusing on. \n\nEdit: Oh and I guess I'm not a \"rich-girl\". :\\  It's kind of different if it's for an non-profit/charity, but when it's a business that would normally pay people, I think it's shitty. I'm glad that internships are paid wehre I live.    ",
    "url" : "http://www.theatlantic.com/sexes/archive/2013/02/unpaid-internships-are-a-rich-girl-problem-and-also-a-real-problem/273106/"
  }, {
    "id" : 19,
    "title" : "How does a single 28 y/o PhD student stop taking herself so seriously and start having/being fun again?",
    "snippet" : "I’m a PhD student in my late 20s, and I feel like my career is taking over my personality. I go to school in a smallish community; the places I go out, I’m likely to run into someone from my program or a closely related program. When I was younger, I used to be wild, carefree, and as I remember it, a lot more fun. I really liked my personality, and I think other people enjoyed it too! Now I’m too hung up on my reputation and maintaining professionalism to ever let loose. I’ve internalized everyone’s advice about what it requires to be taken seriously—including what I should/n’t wear, how to balance work/social life, etc. (And, yes, I do feel a lot of this advice is agist and gendered.)  But recently I went on an OKC date with a guy who observed that I seem reserved. The guy was a dud, but the last thing I want is for people to think I come off as reserved! I’m a million miles from reserved—I’ve been going to festivals since I was 18; I’m pierced and tattooed; I’m a recreational drug user; I like flirting, partying, dancing. But I feel like I’ve lost that sparkle since I’ve started grad school. I know a lot of it has to do with getting older, and a lot of it has to do with not having as much time for that kind of lifestyle. But honestly, I miss myself. How do I start to regain some of that old me? How do I stop caring about how others may perceive me, and start privileging my opinion of myself?  How do I find that balance between being a serious scholar and a seriously fun person—a balance that I respect, not that someone else has determined for me?\n\nThanks, TwoX!  Do you have any out of the house hobbies? Is there a bigger city close enough to hang out in? I would probably try to find somewhere to run into strangers who won't care how you are dressed or how professional you are.\n\nAlso, how important is it that you remain professional 100% of the time? Surely your colleagues understand that you have a life outside of work? I've never been in a PhD program though so maybe not...  I'm a (almost) 26 year old PhD student.  You need a hobby that work can't get in the middle of.  After my 2nd year, I took up belly dancing.  It is something fun that lets me relax.  I now have friends who aren't also grad students and I can get away from work two nights a week.  You need a place where you can get away from work and let your hair down so to speak. I'm a (almost) 26 year old PhD student.  You need a hobby that work can't get in the middle of.  After my 2nd year, I took up belly dancing.  It is something fun that lets me relax.  I now have friends who aren't also grad students and I can get away from work two nights a week.  You need a place where you can get away from work and let your hair down so to speak.   Drive down to Denton (2.5 hours?) and join us for 35 Denton in March! I know that there are many festivals that you can go to in OKC, if it's not too far from you, and that's a large enough place that you can get away from departmental folks/colleagues/etc.\n\nI'm hopefully about to start my PhD (I'm 26), and I've found that you can balance a carefree spirit and professionalism. I was lucky enough to find good friends through my MA program, and we would get together and drink too much, listen to great music, and cook together at least once a week. We were able to blow off so much steam that way. \n\nAlso, if I might ask, what is your field? \n\nEDIT: So OKC probably means OK Cupid and not Oklahoma City. D'oh!  I think OKC means \"OK Cupid\" Drive down to Denton (2.5 hours?) and join us for 35 Denton in March! I know that there are many festivals that you can go to in OKC, if it's not too far from you, and that's a large enough place that you can get away from departmental folks/colleagues/etc.\n\nI'm hopefully about to start my PhD (I'm 26), and I've found that you can balance a carefree spirit and professionalism. I was lucky enough to find good friends through my MA program, and we would get together and drink too much, listen to great music, and cook together at least once a week. We were able to blow off so much steam that way. \n\nAlso, if I might ask, what is your field? \n\nEDIT: So OKC probably means OK Cupid and not Oklahoma City. D'oh!       ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18iscm/how_does_a_single_28_yo_phd_student_stop_taking/"
  }, {
    "id" : 20,
    "title" : "Most unconventional Valentine's gift/story: OK, GO!",
    "snippet" : "    ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jv9t/most_unconventional_valentines_giftstory_ok_go/"
  }, {
    "id" : 21,
    "title" : "Getting Implanon inserted on Monday. Nervous as fuck.",
    "snippet" : "Hey girls. I am getting the contraceptive rod inserted on Monday as I have the worst memory for the pill. I felt this was similar to the pill (of which I had no serious side effects) so I decided to get it done. Can anyone give me some personal experience stories of it? Is it good? Does it hurt? I have read stories from women who say \"Holy shit I nearly died from that fucking implanon\" to \"Oh my God it was the best thing I ever did!\"\n\nHALP.\n\nEDIT: Thanks for the helpful comments! I had it done about an hour ago and it was fine. The local was the most painful part and even that was a sting at most. I feel much better now it is over. :)  I'm on my second implant now. Here's a quick list of what happens.\n\n* Doctor draws a '.' or a 'x' where they're going to insert the rod.\n\n* Anaesthetic needle in arm - you'll lose feeling in your upper arm. (After the usual alcohol swab over area, of course)\n\n* Doctor gets scalpel and cuts a tiny hole in your arm.\n\n* Needle goes in hole, implant gets 'injected' into your arm.\n\n* Doctor puts stitch-like tape directly over the hole in your arm, a bandaid (or cotton wool/gauze) over that, and wraps it up in a bandage - keeping the bandage on for 24 hours is recommended, but it's okay if you don't.  Really.\n\nAaaaand you're done. The whole process will take about 15 minutes. [It will look like this for a few days, the colour of the bruise depends on how much you poke/knock it/how easily you bruise. That was taken the night after I had it put in.](http://i.imgur.com/mZqXBaX.jpeg)\n\nYour arm - where the implant is - will be a bit tender, and maybe even sore if you position it a certain way. This is normal. Just take a painkiller and it's all good. Thanks for that. I was a bit freaked as I saw a girl getting it done on YouTube and the doc inserted two needles and jiggled the second one inside her arm and it looked pretty bad :\\\n\nEDIT: The bandage was fairly snug on my arm, but it moved slightly and I saw this pretty blue bruise so I took it off, now I can't get it back on. Meh. The worst part for me was the anesthetic- it was a mild burning sensation that lasted less than a minute. I felt no pain after that, not even in the days afterward.      My insertion was slightly different from MaxisDiedForYourSims, for me they gave me a local anasthetic, then used the applicator thing directly, put a bandage round my arm and sent me on my way.  \n\nThings you need to know. \n\n* Don't look at the applicator, it looks terrifying.  It's really not as scary as it looks, but it is a big needle.\n\n* My arm swelled like a mother fucker.  I couldn't put my watch on for 2 days.  It was not painful though, it was just annoying.\n\n* There was a fair amount of bruising, but not so much that people commented on it.\n\nFor 3 years worth of birth control, a couple of days of discomfort (and it was discomfort, not really pain) was totally worth it. Is it possible for me to go to work after? I'm worried if I swell I won't be able to work. (I work in an office) Oh god yes, I could use my arm and if you didn't know it wasn't obvious, it was just irritating because I couldn't do my watch up! Oh good. Thanks so much, I am so happy to get great advice on this thread :) I'm now just going to close my eyes until it's over, haha",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kewu/getting_implanon_inserted_on_monday_nervous_as/"
  }, {
    "id" : 22,
    "title" : "My boyfriend told me last night he judges me for my past... And how I take care of my dog!?",
    "snippet" : "Hey girls and guys. I have to use a throwaway for this post since my boyfriend is a redditor. \n\nI'm a 22 year old woman. When I was younger, about 14-15, I had a very sexually active youth. I was going through a time where I was discovering my sexuality, and although I didn't have an exorbitant number of partners, I did participate in occasions where I was the third person involved. It didn't bother me, we practiced safe sex and caused me no emotion grief. I'm still friends with the people today. \n\nCut to 16-present. I moved out on my own and smartened up about a lot of things, and I took only three partners in this time. I'm happy. As a consequence, I tend to not associate sex with emotion unless I'm being sexually intimate with someone I love. Being intimate with my boyfriend is both pleasurable and emotionally fulfilling, and I don't see a problem with that. \n\nHe, on the other hand, although having sexual encounters, remained a virgin until we started dating. He tends to associate sex with a more emotionally intimate act, and is appalled at my previous experiences. Even though I've told him that his knowledge of my past doesn't make me a different person than I was at any other point in our relationship doesn't seem to help. \n\nIt's now been a few months since that topic came up. I thought he had become okay with it, but last night he told me he judges me for it. I let him know that it hurt that he could base his opinion of me on something that happened 7 years ago, and that my sexuality history wasn't really there for him to judge. \n\nHe also told me he judges me for how I treat my dog. For perspective, my boyfriend and I have been in a long distance relationship for 8 months (please don't lecture me about this), and before we were friends for three years. We have had visits, and he's been to my house multiple times. I live alone and away from my family, so I adopted a dog. He's a bit of a clingy pup and sometimes I treat him like my baby-he sleeps on the bed with me, ill give him some people food etc- but nothing crazy. I don't understand why this is a point of judgement for my boyfriend... \n\nI love him very much, but sometimes I feel like my boyfriend is very self-righteous and sheltered. Whereas I've lived on my own for years, he's lived with his family and now at school (which he attends for free including room and board). We have our differences (last week he said I was silly for buying bulk meat at a low cost to portion and freeze because it wasn't \"fresh\" and he would never do that), but I love him very, very much. However, his judgement hit me hard and I wonder if this is going to cause rifts between us. What is your opinion? \n\nTL;DR My relatively sexually inexperienced boyfriend judges me for my sexual escapades of my early teenage years when we didn't know each other. What gives?\n\nEdit: Thank you for the outpouring of responses here. I needed these different perspectives on this issue to consider it from different angles. Thank you so much again, you guys are always so helpful!   Your boyfriend *is* very self-righteous, sheltered, and dare I say even a bit elitist. The question is, do you want to stick around long enough for him to figure out these things himself? Because nothing you can say will convince him otherwise, these are things he needs to learn himself. He will become less of a pompous jerk when he has to pay for those meat portions himself. I think this sounds right. I know when I started out life on my own, it knocked me down quite a few pegs, and I had to grow up. Since he hasn't had the option to experience that, and although he's a genuinely good and generally mature person, I think he is severely lacking in maturity for these issues. We have planned to move in together in the future, should that happen I think it could either make or break our relationship.  Definitely have separate living spaces when you guys live closer together before you move in together, and be sure he deals with growing up and his own finances before anything else big happens. You don't want to end up with someone who is financially irresponsible and ends up taking money from you to make their own ends meet! More like ENDS MEAT. Bought bulk and packaged. \n\n...\n\nI logged on after a few weeks just to write this.  I think this sounds right. I know when I started out life on my own, it knocked me down quite a few pegs, and I had to grow up. Since he hasn't had the option to experience that, and although he's a genuinely good and generally mature person, I think he is severely lacking in maturity for these issues. We have planned to move in together in the future, should that happen I think it could either make or break our relationship.  I think this sounds right. I know when I started out life on my own, it knocked me down quite a few pegs, and I had to grow up. Since he hasn't had the option to experience that, and although he's a genuinely good and generally mature person, I think he is severely lacking in maturity for these issues. We have planned to move in together in the future, should that happen I think it could either make or break our relationship.  I think this sounds right. I know when I started out life on my own, it knocked me down quite a few pegs, and I had to grow up. Since he hasn't had the option to experience that, and although he's a genuinely good and generally mature person, I think he is severely lacking in maturity for these issues. We have planned to move in together in the future, should that happen I think it could either make or break our relationship.  Your boyfriend *is* very self-righteous, sheltered, and dare I say even a bit elitist. The question is, do you want to stick around long enough for him to figure out these things himself? Because nothing you can say will convince him otherwise, these are things he needs to learn himself. He will become less of a pompous jerk when he has to pay for those meat portions himself. &gt; He will become less of a pompous jerk when he has to pay for those meat portions himself.\n\nMaybe, maybe not. I've been living on my own for years and I'm still very weird about food and food safety. Granted, I would never make someone else feel bad for what they wanted to do...but living on your own doesn't necessarily change stuff like that. Freezing food is hardly a food safety issue - if anything it keeps it from spoiling!  Mmm.. yeah, it does seem like there might be the potential for more issues down the track.\n\nThe way that he treats you seems to point towards a lack of respect towards you on his part - being appalled at your sexual history, questioning how you raised your dog.. it does seem a bit more like he doesn't seem think particularly highly of you in some ways and that is never good for a relationship.\n\nHas he told you in more detail why he judges you for your sexual past? Just that he thinks that it makes me view sexual acts as normal and not something that can be intimate between two people. I've told him I feel otherwise, but it may be something I'm going to have to reiterate to him.   This guy is so immature it's not even funny. You really need to address this with him.   I guess [this](http://youtu.be/XFw7Myb34zw) is highly relevant...       I was in a relationship like this at the same age as well. He started using my past as ways to manipulate me and turned me from an outgoing, happy person to someone who was depressed, insecure and private. I battle with it even today. I say get out of that relationship now! There is nothing wrong with sex and when you meet someone who loves YOU, they probably wont even ask how many and/or doesn't care. Sexual experience is nothing to feel ashamed of. Ever.  Neither is self respect.\nAnd yes, any self respecting man, aka a man that is capable of also returning that respect to you, is going to want to know your track record. Continue with this opinion though and watch how many times you get burned because guys will be glad to use a girl like this but never settle with one.   Why is it wrong for him to not like the fact that you've slept with other people? Whether it's wrong or not is debatable, but regardless of that point it suggests that they may not be compatible on a pretty basic level. If he can't move past this, it sounds like he needs to be with someone of a similar background as himself. He clearly values the fact that he remained a virgin until he found a partner he cared about so he should probably be with someone who holds the same value. Then tell OP to dump him. Let's remember, he isn't the one posting here about being discontent with his partner. It makes no sense for him to dump her if he is comfortable where he is (even if that means judging/putting OP down). It is messed up, but can't be helped. She should leave if she has an issue, because she isn't going to be able to undo her past.  So if your girlfriend had an issue from, say, a fight you had a long time back...maybe you forgot her birthday or something, and she mentioned it to you over and over and over again, never forgiving you for it, bringing it up whenever you get angry at her or whenever she has a bad day, it's totally okay for her to treat you like that?\n\nHer past isn't even a wrong she committed against him. It is a fact of something that happened before they met. If he can't get over it, he should leave. But if he doesn't have the backbone to - or if he considers her past a weapon he can use against her, then yes, SHE should get the backbone and leave because that's abusive behavior on his part. In my relationship, we don't bring up old shit because we respect each other. &gt;it's totally okay for her to treat you like that?\n\nI (who is OP's analogous) would leave the relationship if I was treated like shit for something I find to be completely harmless. OP isn't leaving and I think she is making a silly decision staying. It doesn't really make sense to say what is \"okay\" because being \"not okay\" doesn't prevent the boyfriend from using it against her. That label has no real-world value to me.\n\n\nI agree, she should leave, because he clearly doesn't want to. He wants to manipulate his girlfriend by bringing up her past. Or he wants to continue feeling morally superior to her. It doesn't really matter what he derives out of the situation, so long as he isn't the one complaining about wanting to leave, suggesting that to him through OP is silly. \"Backbone\"? If that is what you think it takes then yes, give OP some backbone. \n\n&gt;In my relationship, we don't bring up old shit because we respect each other.\n\nAnd if he decided to stop respecting you and judge you harshly for some random act, I think you'd be smart enough to dump him. I don't think you'd be saying \"well then just break up with me over it\". Particularly if he kept mentioning it to you with no sign of wanting to break up anyways.  It's weird though, isn't it, that someone would treat someone like that and not break up with them? But yes, the person who should do the dumping is the one being disrespected, and in this case, it's her, not him. Why is it wrong for him to not like the fact that you've slept with other people? Because that is an unchangeable fact from her past. He can not particularly like it, but he doesn't really have a right to judge her for it, particularly when he's dating her. \n\nIf it's such a big deal for him, then he probably shouldn't be with her instead of sticking around and putting her down about something that hasn't hurt him or anyone and that can't be changed. I think he has every right to judge whomever he chooses (we all do). OP wants to stick it out, that's her problem. I wish people would spend more time fixing themselves than trying to force others to fit their ideals. If she has this big issue with being judged for her past, given she can't change her past, she should find some other dude that won't judge her. It is not that hard.  Of course you have the legal right to judge whomever you want, but that doesn't mean that your judgments are logical, reasonable, beneficial, or correct.\n\nI agree that she should consider leaving, though, if he's going to be cruel or obnoxious about it. I think he has every right to judge whomever he chooses (we all do). OP wants to stick it out, that's her problem. I wish people would spend more time fixing themselves than trying to force others to fit their ideals. If she has this big issue with being judged for her past, given she can't change her past, she should find some other dude that won't judge her. It is not that hard.  If he judges her so much for it, he can leave. No one has him on a leash here. But what I see is someone who has found a weapon - her past - that he can now take out and use whenever he wants his way. It isn't fair and it isn't okay. \n\nThere is nothing I judge my husband for. And anything that has happened in the past remains there and doesn't get dragged out in arguments. Ever. That is a great way to ruin a relationship. We know he can leave, but since he hasn't I don't see the value in repeating that idea. What can happen is OP leaves, because of his choice of weapon. If he wanted to leave because his girlfriend had a slutty past, I would be the first one here saying \"then leave her\". But he's not here she is. So the advice in turn becomes, OP should leave. It isn't complicated and there are no brownie points for saving face here. OP's relationship is shitty, and given the BF has the better end of the deal (his weapon manipulates her to do what he wants) OP should leave.  I wouldn't say that's a 'better end of the deal' - I'd say it's 'being a horrible person.' It's a crappy deal all around. I agree OP should leave.  Because that is an unchangeable fact from her past. He can not particularly like it, but he doesn't really have a right to judge her for it, particularly when he's dating her. \n\nIf it's such a big deal for him, then he probably shouldn't be with her instead of sticking around and putting her down about something that hasn't hurt him or anyone and that can't be changed. &gt;hasn't hurt him\n\nThat's jumping to a conclusion. How do you know it doesn't hurt him?\n\nI agree that he shouldn't be making her feel bad about it and putting her down (though she hasn't mentioned specifics at all, just vague generalities). That achieves nothing.\n\nBut to jump to the conclusion that he's not hurt by it is a leap no one should be making since we're not inside his head. But if it's messing with his head, that's *his* problem. It's not a personality trait or behavior that she can change, and it has no real bearing on their relationship. He can dislike it all he wants, but assuming she's been tested for STIs and is clean and she isn't having sex with anyone else right now, she isn't hurting him. He's hurting himself with whatever hang ups or personal issues and associations he may have with it. In other words, it's 100% **him** causing whatever pain he has. Not to mention I shared this information with him in an open and honest way after he asked me to, assuring me there would be no judgement. I can understand if he's upset, and would and have consoled him about it. But for him to judge me on something that I've learned from, did safely, occurred many years before we met and I have no power over now seems a bit absurd to me.  Why is it wrong for him to not like the fact that you've slept with other people? You know, it really isn't. I never understood the mentality that tried to force someone else's ideals onto those with a different value set. He doesn't like her past, and that's fine. She is choosing to stay with him in spite of his stated judgement. It is illogical for her to complain about it while staying in the relationship. Clearly it isn't a big enough issue for her to dump him over. If it becomes one, then she should dump him over it. Otherwise, let the man judge as he sees fit (and I assume OP is free to do the same). So, if OP decided to tell her boyfriend that she's judging him for the fact he remained a virgin, that'd be an okay behavior? If she said or implied she thought he was a weak or foolish person for making that choice that affects her in no direct way, she wouldn't be out-of-line?\n\nIf you judge people for unchangeable facts from their pasts that physically have no bearing on the present, you're probably pretty self-righteous, and if you choose to express your distaste for their past and suggest that it reflects poorly on their character, you're probably a conceited jerk. She runs the risk of being dumped for it, but yes she is free to feel however she wants. Hell, coupled with her past I'm sure that might be enough for him to leave her. As for your second part, I don't care about being labeled as such. Doesn't change who I judge at all. I know what I value and what I don't. If that makes me a conceited jerk, I'm sure I'll manage.  If you hold your views as absolute and correct always with no room for doubt or futher evaluation of your judgments, then, yes, you probably are conceited and foolish, though I suppose it is possible that you are just so wise that your judgments truly are completely accurate.   I agree about the dog thing. I'm no trainer or dog expert, but people who are overly fond of pets is something that really is a pet peve. I loved my dogs too, but I'd never let them sleep in the same bed as me, that's just gross, dog hair everywhere and all that. My sister would feed one of our dogs off the table and it drove me insane because it drove that dog to beg for food all of the time. Women generally show their affection to pets more outwardly than men do though.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18j6ft/my_boyfriend_told_me_last_night_he_judges_me_for/"
  }, {
    "id" : 23,
    "title" : "In December 2012, the United Nations General Assembly passed a resolution - ‘Intensifying global efforts for the elimination of female genital mutilation’ - calling for greater joined-up efforts from governments to end FGC globally...We need to ensure that governments are not just talking the talk.'",
    "url" : "http://orchidproject.org/"
  }, {
    "id" : 24,
    "title" : "'More than able to hold her own,' girl gets boot from Catholic football league - CNN.com",
    "snippet" : "  It is really unfortunate, but that is the age they start segregating sports based on sex in almost everything.  I don't think that's true everywhere. There are plenty of co-ed leagues around the country and world, and I'm almost positive my high school in the Midwest had a girl on our football team. A tiny minority of the programs allow that.",
    "url" : "http://www.cnn.com/2013/02/14/us/philadelphia-archdiocese-boys-only-football/"
  }, {
    "id" : 25,
    "title" : "Would anyone be willing to listen?",
    "snippet" : "Hello ladies! Happy V-day!\n\nNot sure if i'm posting in the right place. I'm just a kid. Well, I'm a teenager, just another girl in high school. I complain about homework, play an instrument, and like...\n\n*boys.* (cue gasp) Even I'm not exempt from the great and horrible aspects of being a young girl gushing over guys. I'm a shy girl; I've had two boyfriends in the past, with the longest lasting three days. \n\nUnfortunately, I'm the type of person that just *itches* to tell people things like this. I feel bad telling my friends, because, quite frankly, they don't seem to care much. I completely understand why, and don't blame them. \n\nI'm just wondering, is there anybody that would mind PMing me or talking about these things with me? I'm not exactly looking for advice, but I guess I just want to tell somebody! I would post about some things, I didn't want to hinder the community here with walls upon walls of text that a lot of people probably don't want to see. \n\nThank you so much! : )  You are welcome to post here, but you might also enjoy keeping a public diary on LiveJournal. If you aren't familiar with LJ, there's a fun social aspect to it and you can post walls of text or whatever you want. People who want to talk about guys with you can follow and comment, and you can set up privacy groups so only certain people can see certain posts. It's sort of like facebook + blogging. :-) You are welcome to post here, but you might also enjoy keeping a public diary on LiveJournal. If you aren't familiar with LJ, there's a fun social aspect to it and you can post walls of text or whatever you want. People who want to talk about guys with you can follow and comment, and you can set up privacy groups so only certain people can see certain posts. It's sort of like facebook + blogging. :-)",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18kc41/would_anyone_be_willing_to_listen/"
  }, {
    "id" : 26,
    "title" : "The problem with lumpy boobs. ",
    "snippet" : "Hello ladies! I was just doing a bit of a self breast exam and came upon what felt like a lump. I will be honest with you all, I freaked the hell out. That was until I moved to the other side of my breast and found... more lumps. Other boob? Same deal. \n\nI have always had very large lumpy boobs (that are of course only noticeable when you are really pushing around in there and checking stuff out) and I was looking for some advice from my fellow lumpy ladies, how do you tell normal lumps from abnormal lumps?   [deleted]     Get a mammogram, I'll wager. That's the thing, in Australia they tend to recommend mammograms for women over 40, I'm only 26. I don't know if I would be overreacting to have something like that done while I'm so young?  Get a mammogram, I'll wager.   I also have lumpy boobs. It is probably a good idea to bring it up at your next exam (probably no need to make an appointment unless they hurt or you have discharge or they feel \"rough\"), and you might ask about getting an ULTRASOUND (NOT mammogram!!). Be aware of what is \"normal\" for you- they may grow/shrink along with your menstrual cycle, and go in if they are suddenly different from what you'd expect. It's pretty common / normal, especially if you are bustier than average.   I have always had small, lumpy boobs. In pregnant now and they are a bit lumpier and larger. I told my ObGyn that my lumps were normal but she insisted that I go for a boob ultrasound to get them checked out. Official verdict from the ultrasound: I have lumpy boobs. The doctor at the radiology clinic told me this was normal, and it was normal for lumps to increase before your period and during pregnancy. \n\nAnyway, I just make sure to know my lumps, to be familiar with what feels normal to me. Are you able to get a boob ultrasound to have them checked out? That can give a good baseline in case you notice anything new in the future. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18k143/the_problem_with_lumpy_boobs/"
  }, {
    "id" : 27,
    "title" : "My Thoughts on Being a Fat Girl, and Why That's Okay.",
    "snippet" : "My thoughts on being a Fat Girl, and why it's Okay.\n\nIn the shower last night, I thought of an upside to being a Fat Girl.\n\nThere are a few girls out there who automatically dislike pretty girls. This is due to subconscious insecurity and the unconscious feeling that these pretty girls are a threat to their own self worth, femininity and attractiveness.\n\nHowever, as a fat girl, I do not pose such a threat.\n\nI am automatically non-threatening because I don’t fit standard beauty definitions of facial symmetry and low body fat percentage.\n\nWhich is an upside. I’m generally pretty shy, so I don’t need anything that prevents people from talking to me. ‘Cause god knows how unlikely it is for me to start a conversation.\n\nThinking about this lead me to think about what it is to be a Fat Girl in general.\n\nNow. Don't tell me that I'm not fat.\n\nDude, I own mirrors. Also a scale and a tape measure if you want some empirical numbers.\n\nI am not within the average weight range for my height, age or gender. Nor have I ever been, really.\n\nI know that my friends who tell me I'm not fat do it because they care about me. They don't want me to feel poorly about myself and I appreciate that. But, it's a lie. And lying to me doesn't help me. Especially because knowing I'm fat doesn't make me feel bad about myself.\n\nBecause it's not necessarily a Bad Thing.\n\nI am healthy. I can run if I have to. I enjoy the elliptical machine if I have an audiobook. I look forward to my 45 minute walk to school every morning. I love hot yoga.\n\nBut, I doubt I will ever have a flat stomach. My thighs will probably always touch. My hips will always be rounded. My arms will never be completely toned.\n\nMaybe I don’t have enough self control.\n\nI’ve tried diets. The low carb one worked pretty well. But I’m still trying to decide if the 10 lbs I lost were worth me coming near to tears in the grocery store because I couldn’t even find soup that didn’t have carbs. I denied myself so many simple things that made me happy.\n\nRight now, while I’m worrying about school and my future, It’s not worth it. So, I’m not on any diet, aside from the poor student on campus budget. Maybe I’ll try again in April. But not now.\n\nAnd even so, it doesn’t matter.\n\nI may be fat, but I’m happy.\n\nMy boyfriend loves my “thick thighs” and nuzzles into my slightly pillowy stomach whenever I will let him. He still thought I was sexy when I was at my heaviest.\n\nBut more importantly, I think I’m sexy. I love my body. I like myself. My body is not just an aspect of me, it is me.\n\nI am strong. I am sturdy. I am balanced.\n\nI am fat.\n\nI know this. I accept this as an objective fact. It is not a slight against my character. It does not make me less than others.\n\nIt makes me who I am. Growing up in this specific body, learning to love and accept myself as is, has given me a unique perspective on the world that no one else has.\n\nWhen I say this out loud, and people tell me that I’m not fat, it takes a bit of that journey away from me.\n\nI know exactly who and what I am, and it took me a long time to get here.\n\nI am a Fat Girl. But that does not mean that I cannot also be a Pretty Girl.\n\n\n_____________________________________________________________\n\n\n\nEDIT: Holy balls. I put this up just so I didn't feel so much like I was talking to myself, and it blew up while I was at work!\n\nThis was originally posted on my tumblr and it was mostly ignored because no one follows me. (HIGHLY NSFW. SERIOUSLY I POST PORN SOMETIMES) http://embersinmyeyes.tumblr.com/\n\nI love this community. Everyone is so supportive and loving and wonderful. Thank you so much to /u/DylanMcDermott who bought me some reddit gold! &lt;3 It's really cool actually! &lt;3\n\nTo the people who don't feel so great about their looks: you're beautiful. No matter what you look like, I'm willing to bet money that there's something about you that another person would kill for.\n\nIt took me a while to figure out how I could be happy. And it mostly involves mentally telling the people who put me down to go fuck themselves with a cactus.\n\nAnd I want to be clear that I am all for dieting and exercising and all that wonderful weight loss stuff, as long as it makes you happy. I know a lot of people who get extreme joy out of the time they spend working on their bodies, and all power to 'em! \n\nMy comment was simply that it did not make me happy. So much so that dieting actually brought me legitimate despair.\n\nI don't overeat, aside from the odd celebratory buffet after a semester ends. I eat healthy foods. I don't drink Coke anymore or other sugary drinks since I discovered tea. I get at least 45 minutes of some kind of exercise on most days. The issue with me is that I got fat as a child. My parents didn't really stop me when I wanted 2 Hungry Man dinners for lunch (900 calories each, by the way). I got fat long before I realized how terrible it could be for me.\n\nSo at this point, my exercise and eating habits mean I maintain my current weight without much consideration. It's the loss of weight that is hard for me. That's where I begin to feel like I'm no longer enjoying my life.\n\n'Cause that's all I want. I want to be happy. And hardcore keto diets do not make me happy.   \n\nThe TwoX community makes me happy. I love the discussions here and the kindness. I don't see as much kindness in the world as I'd like to, except when I'm here.\n\nPlus, I've only been called a cunt once this whole thread! Which is nice. Because I mean, who doesn't like vaginas? Cunts are all about depth, warmth, fun and life! \n\nHaters can take a step to the left. Healthy girls are beautiful, regardless of if you are tiny or large or any shape at all.  One of the best places I've found to feel value in your body as someone who is overweight: roller derby.\n\nThere's a place for everyone in that sport. If you're really short? Congrats, you now are able to slip by and even practically under people. Really skinny? You can slide between people. Overweight? You're a force to be dealt with - that skinny girl is just going to bounce off of you, but you're not going to bounce off of anyone else.\n\nReading this post of yours made me realize I need to really remember that and look at all the positives that come out of my extra weight. That I've been told by friends how other teams talk about how hard my hits are in the locker room. That I've heard great noises come from people when I've hit them, and even had a few flinch and squeal the moment they see me coming.  That I have found a way to apply what I have, and I should be PROUD of that.\n\nSo thank you for this. I may not be skinny. I may not be pretty. But I can still be a FUCKING FORCE. Holy shit, I am now more determined than ever to try derby. Thank you, internet stranger! Holy shit, I am now more determined than ever to try derby. Thank you, internet stranger! One of the best places I've found to feel value in your body as someone who is overweight: roller derby.\n\nThere's a place for everyone in that sport. If you're really short? Congrats, you now are able to slip by and even practically under people. Really skinny? You can slide between people. Overweight? You're a force to be dealt with - that skinny girl is just going to bounce off of you, but you're not going to bounce off of anyone else.\n\nReading this post of yours made me realize I need to really remember that and look at all the positives that come out of my extra weight. That I've been told by friends how other teams talk about how hard my hits are in the locker room. That I've heard great noises come from people when I've hit them, and even had a few flinch and squeal the moment they see me coming.  That I have found a way to apply what I have, and I should be PROUD of that.\n\nSo thank you for this. I may not be skinny. I may not be pretty. But I can still be a FUCKING FORCE. I love the whole concept of roller derby. Tough chicks rolling around a rink where no one but other roller girls would ever dream to fuck with you. I wonder if there's a roller derby scene in Toronto...\n\nI'd love to do this. \n\nYOU ARE A FORCE TO BE RECKONED WITH. NOBODY FUCKS WITH YOU. Fuck yeah, you're awesome. There's a HUGE roller derby scene in Toronto!\n\n[Toronto Roller Derby](http://www.torontorollerderby.com/)\n\nEdit: And freshmeat@torontorollerderby.com is where you email to find out when the next tryouts are. One of the best places I've found to feel value in your body as someone who is overweight: roller derby.\n\nThere's a place for everyone in that sport. If you're really short? Congrats, you now are able to slip by and even practically under people. Really skinny? You can slide between people. Overweight? You're a force to be dealt with - that skinny girl is just going to bounce off of you, but you're not going to bounce off of anyone else.\n\nReading this post of yours made me realize I need to really remember that and look at all the positives that come out of my extra weight. That I've been told by friends how other teams talk about how hard my hits are in the locker room. That I've heard great noises come from people when I've hit them, and even had a few flinch and squeal the moment they see me coming.  That I have found a way to apply what I have, and I should be PROUD of that.\n\nSo thank you for this. I may not be skinny. I may not be pretty. But I can still be a FUCKING FORCE. I LOVE your post because you didn't say this: 'Really skinny? You'll be a great jammer!'. 'Overweight? You'll make a great blocker!'.\n\n\nI feel like these stereotypes often creep into roller derby. I am tall and skinny, and whenever I attend a scrimmage someone will hand me a helmet cover and say, 'You look like a jammer.' I am not a jammer. In fact, I may be the WORST jammer in the world, but I'm a great blocker because my long legs take up half the track.\n\n\nA lot of those really short or small girls are freakin' amazing in the pack, and I am terrified when I have to block against a larger jammer because, like you said, they're pretty much unstoppable. I think it's really important to let people know that their size shouldn't dictate the position that they play - and that is why our sport is amazing. \n\nWhat I'm trying to say is, thank you for the refreshing post :) And yay roller derby!  Yes, those are common stereotypes, and yes, they are bullshit.\n\nI am fortunate enough to be a teammate to Anya Heels, who is fairly well known in the sport. She's not small, and she's not skinny. She's one of the toughest blockers in the sport, and I count myself glad that I've never taken the full brunt of one of her hits. I've been sent flying by her when she holds back in practice.\n\nAnd she jams. Boy, does she jam. Not a lot, but enough - and she can absolutely shatter walls when she does. And the crowd loves her, blocking or jamming. You play for Rat City? Oh my gosh, you are my hero! Some of my teammates and I were just talking about Anya Heels today, and how much we love her. She is incredible. Well, actually your whole league is pretty incredible :) One of the best places I've found to feel value in your body as someone who is overweight: roller derby.\n\nThere's a place for everyone in that sport. If you're really short? Congrats, you now are able to slip by and even practically under people. Really skinny? You can slide between people. Overweight? You're a force to be dealt with - that skinny girl is just going to bounce off of you, but you're not going to bounce off of anyone else.\n\nReading this post of yours made me realize I need to really remember that and look at all the positives that come out of my extra weight. That I've been told by friends how other teams talk about how hard my hits are in the locker room. That I've heard great noises come from people when I've hit them, and even had a few flinch and squeal the moment they see me coming.  That I have found a way to apply what I have, and I should be PROUD of that.\n\nSo thank you for this. I may not be skinny. I may not be pretty. But I can still be a FUCKING FORCE. One of the best places I've found to feel value in your body as someone who is overweight: roller derby.\n\nThere's a place for everyone in that sport. If you're really short? Congrats, you now are able to slip by and even practically under people. Really skinny? You can slide between people. Overweight? You're a force to be dealt with - that skinny girl is just going to bounce off of you, but you're not going to bounce off of anyone else.\n\nReading this post of yours made me realize I need to really remember that and look at all the positives that come out of my extra weight. That I've been told by friends how other teams talk about how hard my hits are in the locker room. That I've heard great noises come from people when I've hit them, and even had a few flinch and squeal the moment they see me coming.  That I have found a way to apply what I have, and I should be PROUD of that.\n\nSo thank you for this. I may not be skinny. I may not be pretty. But I can still be a FUCKING FORCE. One of the best places I've found to feel value in your body as someone who is overweight: roller derby.\n\nThere's a place for everyone in that sport. If you're really short? Congrats, you now are able to slip by and even practically under people. Really skinny? You can slide between people. Overweight? You're a force to be dealt with - that skinny girl is just going to bounce off of you, but you're not going to bounce off of anyone else.\n\nReading this post of yours made me realize I need to really remember that and look at all the positives that come out of my extra weight. That I've been told by friends how other teams talk about how hard my hits are in the locker room. That I've heard great noises come from people when I've hit them, and even had a few flinch and squeal the moment they see me coming.  That I have found a way to apply what I have, and I should be PROUD of that.\n\nSo thank you for this. I may not be skinny. I may not be pretty. But I can still be a FUCKING FORCE. Fuck yes derby love!! All the bodies out on the track kick ass!\n\nOne of the greatest things that derby has done for me is motivate me to become stronger. Mentally because you have to learn so much and be so aware of what is going on as well as physically, to give and take hits and to have the speed to keep up with or pass the other skaters. Personally it has made me start getting more fit because I want to be so much stronger out there. And it really doesn't matter of you're big, little, skinny, or fat, all kinds of bodies have knocked my ass around the track. AND IT FEELS AMAZING!  I am skinny. I don't have curves or cleavage, but I am happy with who I am. I will never look traditionally 'sexy' but I am okay with that. I am strong and sturdy with my boyish figure, but it doesn't make me any less of a woman.  I'm 43, and way above my \"ideal weight\".\n\nUp until about the age of 39, I was slim-ish, maybe the curvy side of slim.  But then I felt bad that I was more curvy, even though I felt very sexy, and the boys let me know that I was pretty sexy.  And, oddly, my model-thin girlfriends bitched about me and I knew I was often disliked.\n\nNow, I'm older, and, frankly, fat.  I am not a perceived threat to younger women, or women my age.  I find women are so much more friendly to me, which I love.  \n\nTheir SOs don't hit on me.  Nor do my husband's friends.  It's awesome.  They just all like me, genuinely for me.\n\nAnd my husband (of one year) is obviously attracted to me, he also cuddles my belly, even though I still sometimes flinch in shame.  He just pulls me back and nestles in.  \n\nYour post made me weep, in a room full of people.  My husband noticed, read what I'd been reading and dropped a loving kiss on my head.  I feel like a beautiful woman.  \n\nThank you.  \n\n I'm 43, and way above my \"ideal weight\".\n\nUp until about the age of 39, I was slim-ish, maybe the curvy side of slim.  But then I felt bad that I was more curvy, even though I felt very sexy, and the boys let me know that I was pretty sexy.  And, oddly, my model-thin girlfriends bitched about me and I knew I was often disliked.\n\nNow, I'm older, and, frankly, fat.  I am not a perceived threat to younger women, or women my age.  I find women are so much more friendly to me, which I love.  \n\nTheir SOs don't hit on me.  Nor do my husband's friends.  It's awesome.  They just all like me, genuinely for me.\n\nAnd my husband (of one year) is obviously attracted to me, he also cuddles my belly, even though I still sometimes flinch in shame.  He just pulls me back and nestles in.  \n\nYour post made me weep, in a room full of people.  My husband noticed, read what I'd been reading and dropped a loving kiss on my head.  I feel like a beautiful woman.  \n\nThank you.  \n\n  I wish I could feel this way. Even at my smallest I had such poor body image. Thank you for sharing this.  I wrote a post earlier today about weight and body image that I feel is relevant here:\n\n&gt;Yeah, the turning point for me was looking back at my progression from underweight to overweight and realizing that at no point in the middle was I ever HAPPY. I mean, theoretically there should have been an \"about right\" somewhere in there, but there wasn't because I didn't at the time have the emotional tools necessary to be happy with myself. It made me truly and firmly realize that my body issues were not because there was anything wrong with my body, but they were all coming from inside my head and the messages I'd been given. I've lost weight since then, but my goal was to be healthy, not to get a certain look. And the rest of the work necessary for self-confidence--still in progress--is all mental.\n\nThe struggle is not about whether or not we are good enough, it's about whether or not we are able to *recognize* that we are good enough. And I think that that is something that can be learned. :) I wish I could feel this way. Even at my smallest I had such poor body image. Thank you for sharing this.  I was once extremely fit, and still felt too big all the time (140 lbs, size 8).  Then I had a horrible accident and gained 128 pounds in two years, including six months of bed rest.  Not being able to work out all the time, I had to learn to be happy without my body being perfect.  Which, honestly, it will never be and never was.  Being obese has taught me how to appreciate my body in a way I was never able to when I was fit.  The fact I can walk places without pain now amazes me, and I'm so grateful to my massive thighs and hips for carrying the rest of me.\n\nI hope you find a way to feel good about your body without having ten years of rehab, lol, but I do think people often overlook how hard it is to be happy with yourself no matter how \"ideal\" your body type is. I wish I could feel this way. Even at my smallest I had such poor body image. Thank you for sharing this.  I wish I could feel this way. Even at my smallest I had such poor body image. Thank you for sharing this.   &gt;I know that my friends who tell me I'm not fat do it because they care about me. They don't want me to feel poorly about myself and I appreciate that. But, it's a lie. And lying to me doesn't help me. Especially because knowing I'm fat doesn't make me feel bad about myself.\n\nI completely agree on these feelings. I'm fat, and I'm okay with that. It's more offensive to me when people tell me I'm not fat, because I hate being lied to.\n\nDude, I'm 5'3\" and 200 lbs, with hips almost 4 feet around. I'm fucking fat, but I'm fucking adorable, and I'm sure you are too. &lt;3 \"I'm fucking fat, but I'm fucking adorable\" would look good on a t-shirt.  Mhm, I would wear that shirt so hard :P Zazzle that today!  &gt;I know that my friends who tell me I'm not fat do it because they care about me. They don't want me to feel poorly about myself and I appreciate that. But, it's a lie. And lying to me doesn't help me. Especially because knowing I'm fat doesn't make me feel bad about myself.\n\nI completely agree on these feelings. I'm fat, and I'm okay with that. It's more offensive to me when people tell me I'm not fat, because I hate being lied to.\n\nDude, I'm 5'3\" and 200 lbs, with hips almost 4 feet around. I'm fucking fat, but I'm fucking adorable, and I'm sure you are too. &lt;3 [deleted] nooooooo it doesn't. Small hips=nice! Big hips=nice! Hips=nice! nooooooo it doesn't. Small hips=nice! Big hips=nice! Hips=nice! &gt;I know that my friends who tell me I'm not fat do it because they care about me. They don't want me to feel poorly about myself and I appreciate that. But, it's a lie. And lying to me doesn't help me. Especially because knowing I'm fat doesn't make me feel bad about myself.\n\nI completely agree on these feelings. I'm fat, and I'm okay with that. It's more offensive to me when people tell me I'm not fat, because I hate being lied to.\n\nDude, I'm 5'3\" and 200 lbs, with hips almost 4 feet around. I'm fucking fat, but I'm fucking adorable, and I'm sure you are too. &lt;3 &gt;I know that my friends who tell me I'm not fat do it because they care about me. They don't want me to feel poorly about myself and I appreciate that. But, it's a lie. And lying to me doesn't help me. Especially because knowing I'm fat doesn't make me feel bad about myself.\n\nI completely agree on these feelings. I'm fat, and I'm okay with that. It's more offensive to me when people tell me I'm not fat, because I hate being lied to.\n\nDude, I'm 5'3\" and 200 lbs, with hips almost 4 feet around. I'm fucking fat, but I'm fucking adorable, and I'm sure you are too. &lt;3  You have what I do not. I am a fairly fit girl (22% body fat) and I can't even appreciate the body I have. I've put way too much of my worth in my body that I can't appreciate *me* for *me* because now, almost everyone I meet immediately likes *me* for my *outer shell*. I feel so empty. Go stare at yourself in the mirror for a while. Stare until you feel like that girl isn't you. And then think about how she looks. I'll bet if you weren't inside that body, you would love it so much. You just can't get past the subjective. This is my favorite comment in all of the subthreads spawned by your post.  \n\nThere aren't a lot of things on this site that have inspired me to want to actually *do* something in particular, and this is one of those few that have. \n\nI have tried doing this before but I've never followed all the way through with it. Just sit, and stare. For a while. Like, set a timer. After a while it gets eerie, but you start to see yourself as a separate person, but one you've known all your life.\n\n I love myself the same way I love my oldest friends. Because while they have their flaws, they're gorgeous to me because of my love for them. It has to be that was for yourself too. You have what I do not. I am a fairly fit girl (22% body fat) and I can't even appreciate the body I have. I've put way too much of my worth in my body that I can't appreciate *me* for *me* because now, almost everyone I meet immediately likes *me* for my *outer shell*. I feel so empty. All of you is who you are.  The mind is not a separate thing from the body. It is, and it isn't. I've grown to accept my body because it holds my life force, it is the physical and energy representation of **me** but my body has nothing to do with my beliefs, morals, actions and so I am **me** I am contained in my body, but **I**, **me**, as I know myself, am not my body. I'm just here in it. It's hard to explain. It is and it isn't - I am and I am not - it's extremely dichotomous.  It is, and it isn't. I've grown to accept my body because it holds my life force, it is the physical and energy representation of **me** but my body has nothing to do with my beliefs, morals, actions and so I am **me** I am contained in my body, but **I**, **me**, as I know myself, am not my body. I'm just here in it. It's hard to explain. It is and it isn't - I am and I am not - it's extremely dichotomous.  You have what I do not. I am a fairly fit girl (22% body fat) and I can't even appreciate the body I have. I've put way too much of my worth in my body that I can't appreciate *me* for *me* because now, almost everyone I meet immediately likes *me* for my *outer shell*. I feel so empty. I can't remember where it was or in what context (I think it was a magazine interview, but I'm not sure), but I read about a woman who was stunning and I think did some part time modelling and everything, and then she got a problem (either medical or something like depression) and basically everything fell apart and she developed an eating disorder in the form of over eating. She became really quite heavy, very quickly, and was like that for years until she managed to sort herself out and lose some of it again to get to a stage where she felt healthy. The interview was interesting because she said she felt so much more \"her\" when she was fat than when she was fit/skinny, because everyone spoke to her like a person rather than like a \"pretty girl\" and she felt like she could explore who she was much more when she didn't care about how she looked.\n\nI wouldn't recommend rapidly gaining weight to anyone (obviously), but it did seem to be a bonus to a bad situation for her, because it taught her much more about how she was without her appearance and even thinking about it was interesting. It's a double edged sword though, especially for women. Remember that horrifying movie review calling Melissa McCarthy a \"tractor sized hippo\"? \n\nIf you're skinny, you're treated like a \"pretty girl\". \nIf you're fat, you're treated like a \"fat girl\". \n\nAnd for some reason, it's really tough to fall in-between. In high school, my anorexic friend would always say that everyone who is skinnier than her is \"too skinny\" and everyone fatter than her is \"too fat\". \n\nI often dream about a perfect world, where people and job recruiters and classmates didn't judge you by your looks first and foremost (and sometimes gender and race as well). But sadly it matters and many of us have to play the game in order to get employed these days. :(  It's a double edged sword though, especially for women. Remember that horrifying movie review calling Melissa McCarthy a \"tractor sized hippo\"? \n\nIf you're skinny, you're treated like a \"pretty girl\". \nIf you're fat, you're treated like a \"fat girl\". \n\nAnd for some reason, it's really tough to fall in-between. In high school, my anorexic friend would always say that everyone who is skinnier than her is \"too skinny\" and everyone fatter than her is \"too fat\". \n\nI often dream about a perfect world, where people and job recruiters and classmates didn't judge you by your looks first and foremost (and sometimes gender and race as well). But sadly it matters and many of us have to play the game in order to get employed these days. :(  You have what I do not. I am a fairly fit girl (22% body fat) and I can't even appreciate the body I have. I've put way too much of my worth in my body that I can't appreciate *me* for *me* because now, almost everyone I meet immediately likes *me* for my *outer shell*. I feel so empty. Pregnancy and body issues go together, but being \"pretty\" (Sort of...I dunno..I like my looks well enough) has always been something I was told to place importance on, and now I've got a belly and I'm totally excited about it, but the rest of me is getting all Texas sized and flubby and it is hard for me. \n\nAlways put to much into my looks, and now I gotta settle down and accept things about my body that don't look or feel good. It is easier some days than others.  My chubby belly keeps me warm on a cold night, and my pillowy ass is a great place to fall when life kicks me down.  I think you are fantastic, probably because we think the same way!  \n\nPretty women wonder where my secret lies.\nI'm not cute or built to suit a fashion model's size\nBut when I start to tell them,\nThey think I'm telling lies.\nI say,\nIt's in the reach of my arms\nThe span of my hips,\nThe stride of my step,\nThe curl of my lips.\nI'm a woman\nPhenomenally.\nPhenomenal woman,\nThat's me. My chubby belly keeps me warm on a cold night, and my pillowy ass is a great place to fall when life kicks me down.  I think you are fantastic, probably because we think the same way!  \n\nPretty women wonder where my secret lies.\nI'm not cute or built to suit a fashion model's size\nBut when I start to tell them,\nThey think I'm telling lies.\nI say,\nIt's in the reach of my arms\nThe span of my hips,\nThe stride of my step,\nThe curl of my lips.\nI'm a woman\nPhenomenally.\nPhenomenal woman,\nThat's me. My chubby belly keeps me warm on a cold night, and my pillowy ass is a great place to fall when life kicks me down.  I think you are fantastic, probably because we think the same way!  \n\nPretty women wonder where my secret lies.\nI'm not cute or built to suit a fashion model's size\nBut when I start to tell them,\nThey think I'm telling lies.\nI say,\nIt's in the reach of my arms\nThe span of my hips,\nThe stride of my step,\nThe curl of my lips.\nI'm a woman\nPhenomenally.\nPhenomenal woman,\nThat's me.  I'm fat. Fat is a descriptive word. Not an insult. It's not who I am and has no bearing on my personality (although one could argue being fat throughout my high school years is what led me to my fantastic personality, my sense of humor, and my amazing style). It's just the size of my body.\n\nAnd I have no problem with that. \n\nWhat does bother me is when people try to say \"Awww honey you're not fat\" after I simply say something like \"I'm too fat to wear this\" (because I am, it's physics, you can't cram my ass into a size 4 - it ain't gonna happen). If I'm not fat, why am I fat? If I'm not fat, what am I then?\n\nI'm smart. I'm funny. I'm talented. I'm me.  I love my slightly rotund girlfriend. A lot.  I really liked the bit about how you love your walk to campus, and yoga, etc. Healthy isn't a body type -- it's a lifestyle.  I used to be the super skinny girl and yes, total strangers found it okay to tell me \"I HATE YOU\" or openly accuse me of having an eating disorder in a hostile angry voice. The flip side was creepy attention. Not talking about guys flirting or asking me out (which was incredibly rare), I'm talking about lecherous professors or bosses my dad's age being weird and inappropriate -- that kind of attention. I really wanted to be taken seriously, and ended up switching to a freelance career to make that happen.\n\nNow I'm overweight and almost 40 and I have to say, it's really nice being slightly invisible. I'm working on losing weight just for health reasons but in the meantime I've made some amazing friendships with women who will love me no matter what I weigh.  You're also a good writer.  All of this being said, can we please keep in mind that exercising and having a decent diet are always things you should be doing, regardless of what kind of body type you have or desire to have? You can be healthy no matter what your natural body type is, as long as you live a healthy, and not sedentary lifestyle. All of this being said, can we please keep in mind that exercising and having a decent diet are always things you should be doing, regardless of what kind of body type you have or desire to have? You can be healthy no matter what your natural body type is, as long as you live a healthy, and not sedentary lifestyle. We all make choices every day about health VS happiness or fulfillment. Some people will choose health every time, and live a very spartan lifestyle, and they're okay with that. Others will go to the other extreme doing things they find fun or pleasurable that damage their health (heavy drinking, smoking, etc.). Most of us fall in the middle of this scale--if you eat red meat, you're upping your cancer risk, for example. Most of us find this an acceptable risk, because even if cutting it out would give us a chance of living longer, we prefer not to live without the pleasure of a good steak. \n\nBut wherever you fall on this scale, it's your own choice and you are beholden to no one but yourself, and perhaps your loved ones (who have a more personal investment in your health and longevity). \n\nI think it's perhaps better to frame these things as choices that are likely to lead to a healthier and perhaps longer life, rather than telling people that they *should* live that way. :) We shouldn't be seeing health and happiness as two separate entities, always separate and opposing each other.  A change of reference can help us see that health and happiness are intertwined and can be one in the same.   We all make choices every day about health VS happiness or fulfillment. Some people will choose health every time, and live a very spartan lifestyle, and they're okay with that. Others will go to the other extreme doing things they find fun or pleasurable that damage their health (heavy drinking, smoking, etc.). Most of us fall in the middle of this scale--if you eat red meat, you're upping your cancer risk, for example. Most of us find this an acceptable risk, because even if cutting it out would give us a chance of living longer, we prefer not to live without the pleasure of a good steak. \n\nBut wherever you fall on this scale, it's your own choice and you are beholden to no one but yourself, and perhaps your loved ones (who have a more personal investment in your health and longevity). \n\nI think it's perhaps better to frame these things as choices that are likely to lead to a healthier and perhaps longer life, rather than telling people that they *should* live that way. :) I will probably get downvoted for suggesting this, but I think if it concerns the health of society as a whole, then yes we should be putting some pressure on people to lead healthy lifestyles. Just from looking at the fact that we have an obesity problem in the US, which is indeed, a health concern. That doesn't mean that everyone has to go out and run five miles every morning, or completely cut out carbs from their diets, but perhaps encouraging less fast food, or making a weekly or bi-weekly gym trip or going for a jog. Health advocates are not telling people they need to be thin and fit, we're saying you should do this for your own health, as to not be overweight, which is unhealthy. It's ultimately for your own good, and I think that's a positive message that needs to be heard. People only ever seem to bother about this when it comes to weight, though. Many forms of risky behavior seem far more respected as individual choice, but being overweight seems to be viewed as *everyone's* business.\n\nEdit: It just bothers me when people make it their business what a total stranger does with his or her own body. We respect people's right to make their own choices about their body in so many other areas, but when it comes to weight it's like they're suddenly beholden to the whole world. I will probably get downvoted for suggesting this, but I think if it concerns the health of society as a whole, then yes we should be putting some pressure on people to lead healthy lifestyles. Just from looking at the fact that we have an obesity problem in the US, which is indeed, a health concern. That doesn't mean that everyone has to go out and run five miles every morning, or completely cut out carbs from their diets, but perhaps encouraging less fast food, or making a weekly or bi-weekly gym trip or going for a jog. Health advocates are not telling people they need to be thin and fit, we're saying you should do this for your own health, as to not be overweight, which is unhealthy. It's ultimately for your own good, and I think that's a positive message that needs to be heard.  You are healthy and happy - so what else needs to be said?\n\nYou have great self-confidence. Thumbs up.   You are an inspiration. I wish more women thought the way you did. I am also overweight, and I recently came to terms with the idea that my happiness and ability to do what makes me happy supersedes the numbers on a scale. It's pure happiness and freedom.\n\nGood for you; I'm really happy for you. You sound beautiful and I'm sure you are. \n     OP, I really, really admire your confidence. It's amazing and I'm so happy for you. I wish there were more people like you, especially how you can seemingly turn an insult in to a compliment/joke.\n\n&gt; Plus, I've only been called a cunt once this whole thread! Which is nice. Because I mean, who doesn't like vaginas? Cunts are all about depth, warmth, fun and life!\n\nHowever, if you do decide to modify your eating habits, a word of advice. Don't call it a diet. Diets are temporary, and you want to change your *lifestyle*. Make simple changes, and don't fret. Every day is another day, another chance. If you want to, eat the extra cupcake. Have the ramen. Do what makes you happy, because at the end of the day, any changes won't work if you're not happy. Small changes, like skipping the pizza crust, or an extra 5 or 15 minutes on the elliptical. Parking at the back of the parking lot instead of the front. Small changes, but what's most important is that *you're* happy. Don't forget that not all carbs are bad (complex carbs), so don't freak. If keto isn't your thing, that's fine. They are *your* eating habits, so you dictate what you do and don't eat. Don't follow someone else's rules when they weren't made for you. My fiance and I went to ihop earlier and we just had pizza for dinner, and screw it, because I can work tomorrow. Depriving yourself of things you want will only bite you in the ass. (You can't have a cupcake, so you have carrots.. and celery.. and chips.. and peanut butter.. and *then* have the cupcake.) Moderation is key.\n\nI wish you luck, happiness, and health!  Not eating soup because it has carbs is a very strict diet! I'm not judging your choice of diet but sometimes it takes a while to figure out what healthy, moderate diet works for you instead of feeling bad about not maintaining a crash diet. She was probably trying for ketosis. She was probably trying for ketosis. Yep. Some days were better than others, but by the end of like 3 months, I was just beaten down. Not eating soup because it has carbs is a very strict diet! I'm not judging your choice of diet but sometimes it takes a while to figure out what healthy, moderate diet works for you instead of feeling bad about not maintaining a crash diet.   I always see bigger girls trying to loose weight to get people (guys) to like them. What I think is, if he doesn't like you when you're fat, and won't give you a chance, why would you want him when you literally worked your ass off? I would never want a boyfriend after I got skinny unless I never met him before, because he didn't accept me for me at my heaviest. If a guy asked me out knowing I just lost a ton of weight, that means he's just with me for my body, and is too shallow to ask me out just for my personality. I'm lucky I have a boyfriend who loves me exactly the way I am. Not being attracted to someone because of weight is not necessarily shallow.  People can't control attraction.  I tend to be attracted to more muscular guys, but I don't *expect* them to be very attracted to me when I'm squishy. My boyfriend is muscular, he goes to the gym almost daily. He prefers girls that are my weight. Just because a person is attractive doesn't mean he won't find you attractive, it depends on the persons taste. I always see bigger girls trying to loose weight to get people (guys) to like them. What I think is, if he doesn't like you when you're fat, and won't give you a chance, why would you want him when you literally worked your ass off? I would never want a boyfriend after I got skinny unless I never met him before, because he didn't accept me for me at my heaviest. If a guy asked me out knowing I just lost a ton of weight, that means he's just with me for my body, and is too shallow to ask me out just for my personality. I'm lucky I have a boyfriend who loves me exactly the way I am. I always see bigger girls trying to loose weight to get people (guys) to like them. What I think is, if he doesn't like you when you're fat, and won't give you a chance, why would you want him when you literally worked your ass off? I would never want a boyfriend after I got skinny unless I never met him before, because he didn't accept me for me at my heaviest. If a guy asked me out knowing I just lost a ton of weight, that means he's just with me for my body, and is too shallow to ask me out just for my personality. I'm lucky I have a boyfriend who loves me exactly the way I am.  Yay! I've slowly been having this realization about myself, too, as a fat girl. It's inspiring to see other fat girls love themselves despite society. \n\nI'm glad you've got a man that loves you, even at your heaviest.  :) My boyfriend digs fat chicks and he thought that was weird. It's taken a lot of convincing from me to let him feel ok about that.\n\nKeep on rockin', pretty girl! You inspire me.    This post kind of made me tear up. I'm 54, always hovering around 200 pounds. I've been overweight since I can remember. My grandparents used to send me weight-loss books when I was in middle school. \nI never liked my body, but in a way that didn't seem so bad. I didn't spend hours thinking about how awful I look, I just didn't think about how I look. What I didn't really understand was that this was also keeping me from appreciating myself and my body. Only in the last year or so and I allowed myself to look at my curves, to look at the fat that I can see through the cute little dresses I try on and think I like this. I like my shake, I like my fat, I like the way my body moves and dips and curves and doubles over. I like it.\nThank you for sharing a beautiful reminder that I need to love myself every day and remind myself how much I like what I see.\nEdit: 5'4\" not 54 yrs old. I'm 22 This post kind of made me tear up. I'm 54, always hovering around 200 pounds. I've been overweight since I can remember. My grandparents used to send me weight-loss books when I was in middle school. \nI never liked my body, but in a way that didn't seem so bad. I didn't spend hours thinking about how awful I look, I just didn't think about how I look. What I didn't really understand was that this was also keeping me from appreciating myself and my body. Only in the last year or so and I allowed myself to look at my curves, to look at the fat that I can see through the cute little dresses I try on and think I like this. I like my shake, I like my fat, I like the way my body moves and dips and curves and doubles over. I like it.\nThank you for sharing a beautiful reminder that I need to love myself every day and remind myself how much I like what I see.\nEdit: 5'4\" not 54 yrs old. I'm 22          Yay! Thank Goddess for you! thanks for writing and posting this.\n\nI was obsessed with being thin when I was younger, working out all the time, constantly criticizing myself over my eating, dieting, etc.  Finally somewhere around my mid 30s to 40 I realized how much energy I had put into that whole thing and just said fuck that. I'm going to quit dieting. And I did. And the world did not end.\n\nThe only way we're going to change things so that women can just be whatever the fuck we are and we don't have to manipulate and shame ourselves to try to be good enough, \n\nis by doing what you're doing: just saying I. Am. Good. Enough.  Because I am. Because I say so. Oh and PS, I raised my daughters in New Mexico, and one of the coolest things about that is, there are a lot of fine fine ladies there who are not in the LEAST ashamed of their big round bodies, who wear tight dresses and show off every bit of it. They rock the fat. And men LOVE it. I am a curvy girl from New Mexico and I can sort of confirm this. I still don't think my jello-y thighs can pull of the super short dresses, but that's more a general modesty thing than an OMG MY THIGHS TOUCH I AM SO FAT!!! thing. I have this fantastic round Mexican ass and I still dare to wear skinny jeans.\n\n(Which, I'm sorry, maybe this is part of my NM-loves-curves upbringing, but is your thighs touching really a thing women get self-conscious about? I literally never heard of it before I started redditing; I can't remember a time when my thighs didn't touch, even as a little kid, and it's never been something I've had an aesthetic problem with. It's a pain to wear awkward friction-holes in my jeans so quickly, sure, but other than that... Is it supposed to be unattractive? Really?) I don't think its unattractive and I have never heard any men say anything bad about it. There's occasionally stuff on reddit about \"DAT GAP\" but nothing about how its bad when there's no gap. I hear women obliquely saying bad stuff about it all over the place though, especially here on 2X. Nothing so obvious as \"I'm fat and ugly and I hate myself because my thighs touch,\" but more like it being, say, a measure of a failed diet; or a weight loss goal; or a means of comparing oneself to skinnier, prettier women; or [a bullet point in one of my favorite image macros](http://i1262.photobucket.com/albums/ii603/quirkycookery2/2012%20-%2008/Doyouwanttostarveyourselforhavecake.jpg). It's like, I didn't even realize the thigh gap was part of the \"ideal figure,\" up there with a concave stomach, big tits, and no hips to speak of, much less that it's something I was supposed to be self-conscious about not having. It's *weird* to me. I hear women obliquely saying bad stuff about it all over the place though, especially here on 2X. Nothing so obvious as \"I'm fat and ugly and I hate myself because my thighs touch,\" but more like it being, say, a measure of a failed diet; or a weight loss goal; or a means of comparing oneself to skinnier, prettier women; or [a bullet point in one of my favorite image macros](http://i1262.photobucket.com/albums/ii603/quirkycookery2/2012%20-%2008/Doyouwanttostarveyourselforhavecake.jpg). It's like, I didn't even realize the thigh gap was part of the \"ideal figure,\" up there with a concave stomach, big tits, and no hips to speak of, much less that it's something I was supposed to be self-conscious about not having. It's *weird* to me. Oh and PS, I raised my daughters in New Mexico, and one of the coolest things about that is, there are a lot of fine fine ladies there who are not in the LEAST ashamed of their big round bodies, who wear tight dresses and show off every bit of it. They rock the fat. And men LOVE it.    thank you for writing this. I too was hit right in the feels with your last sentence.   You're my hero.  &gt;I am not within the average weight range for my height, age or gender.\n\nOn a somewhat side note, BMI (body mass index) is really not a reliable method of determining if you are fat nor not. It doesn't take into account bone density or muscle mass etc. You could be 5'9'' and 175lbs and obese or 5'9'' 175lbs and ripped as hell.  &gt;I am not within the average weight range for my height, age or gender.\n\nOn a somewhat side note, BMI (body mass index) is really not a reliable method of determining if you are fat nor not. It doesn't take into account bone density or muscle mass etc. You could be 5'9'' and 175lbs and obese or 5'9'' 175lbs and ripped as hell.  Unless you are a professional body builder, it's pretty reliable. Unless you are a professional body builder, it's pretty reliable. Unless you are a professional body builder, it's pretty reliable. Example of its super reliability: My very small friend who has a BMI of 30 (\"obese\") because of her high bone density. That's a pretty rare condition, and it should reduce with age as we all lose bone density over time, but a fair counter-example. Unless you are a professional body builder, it's pretty reliable.   Thank you for this.\n\nAs a fellow Fat Girl (who's husband loves her deeply), this rings so true to me. I'm still working on accepting me for who I am, but I'm getting there, and stuff like this helps so much.\n\n&lt;3.   You have such a rare and beautiful quality, I wish I had.\n\nI am the same in the sense of I say I'm fat all the time, and people retaliate and say I am not.\nBut I more or less use it as a defence mechanism, taking back the word so nobody can use that to hurt me.\n\nPeople, especially women need to love, and appreciate who they are, whether fat or skinny.\n\nThank you for sharing this amazing post, and always continue to love yourself, and never forget what an incredible and rare quality you are so lucky enough to have.     Okay, I know I am going to be downvoted for this, and please don't take this as a personal attack against you because it isn't, but I think it's important to differentiate between being okay with your weight and considering yourself to be healthy.\n \nIt's absolutely true that some people have an extremely hard time loosing weight and for one reason or another believe that they never will, and that it's okay to accept that and accept and enjoy their bodies the way they are. That's so important to your overall view of yourself. \n\nBut I think it becomes a problem when people start trying to justify being overweight and say that they're healthy or that being obese (which it does not at all sound like you are) isn't detrimental to your health. It's just not true, and it gives people a reason to stop trying to become healthier. I'm not saying that everyone should look a certain way or weight a certain amount (everyone knows that BMI and weight are terrible ways to determine healthy body sizes), but there is a point where being over or underweight does become a health problem. I think it is important to not use acceptance of self as a reason to stop trying to live a healthy lifestyle. \n\nI am not calling you out specifically - for all I know you could be eating incredibly healthy and you have realized that your weight just is what it is, which definitely happens. But it is a problem when people who are genuinely overweight and living in an unhealthy manner come to the same conclusion and begin to feel as if they should just accept it and not try to better themselves. Okay, I know I am going to be downvoted for this, and please don't take this as a personal attack against you because it isn't, but I think it's important to differentiate between being okay with your weight and considering yourself to be healthy.\n \nIt's absolutely true that some people have an extremely hard time loosing weight and for one reason or another believe that they never will, and that it's okay to accept that and accept and enjoy their bodies the way they are. That's so important to your overall view of yourself. \n\nBut I think it becomes a problem when people start trying to justify being overweight and say that they're healthy or that being obese (which it does not at all sound like you are) isn't detrimental to your health. It's just not true, and it gives people a reason to stop trying to become healthier. I'm not saying that everyone should look a certain way or weight a certain amount (everyone knows that BMI and weight are terrible ways to determine healthy body sizes), but there is a point where being over or underweight does become a health problem. I think it is important to not use acceptance of self as a reason to stop trying to live a healthy lifestyle. \n\nI am not calling you out specifically - for all I know you could be eating incredibly healthy and you have realized that your weight just is what it is, which definitely happens. But it is a problem when people who are genuinely overweight and living in an unhealthy manner come to the same conclusion and begin to feel as if they should just accept it and not try to better themselves.                            You are amazing, OP. I love your attitude! \n\nThis is an awesome article I would highly recommend you read: [Fat Shaming Doesn't Work-- Here's Why](http://www.huffingtonpost.com/brittany-gibbons/fat-shaming_b_2584298.html)\n\nI was shamed as a teenager for being overweight. My mom said I was obese because she followed the BMI like a bible, I was actually smaller than I am now. My dad would make comments about what I was eating and how much. They put me on diets. They made me ashamed to be curvy, to have muscle, to be bigger than most girls. It’s only been in the last 2 years that I’ve been able to say “fuck it” and not be ashamed of my curves, to not be ashamed and fear judgement of eating junk food in front of people (I’m still working on that one, but I’m almost there). In return, I’ve grown to love my body, to love my muscles and how powerful I am when I row hard and move the boat, run up a hill, or just walk up 4 flights of stairs. I’ve learned not to care what the scale says and instead pay attention to how my body feels, and I’m happier now than I’ve ever been. I've reclaimed my short skirts, not as a political statement but because I realized that I look awesome in them.\n\nI had a conversation with my dad about rowing the other day and how fit I’ve gotten (I have the beginning lines of a six-pack), and all he cared about, all he asked, was not how I felt or how lean I’ve gotten, but “are you below 200 lbs yet?” It killed me because no, I’m not below 200, I’m 206 lbs but I look great. It took everything within me not to yell at him about muscle weighing more than fat, mainly because it would have just gone in one ear and out the other. He then reminded me of what he said when I was 18, that once you get above 200 it’s hard to get below it again. He seems to forget about my total loss of control once I moved out and how I gained 50 lbs of bad weight and then lost it when I realized my self-worth, regardless of size. \n\nWomen are more than a number on the scale, and they should be able to eat without the cultural shame of not being thin enough, of taking up too much space.\n\nFor reference, [here’s](http://i.imgur.com/UbIlgDW.jpg) my most recent picture, taken a couple weeks ago. I’m the one on the left. \n    Girl you are amazing.  I love posts like these!  I'm happy to see women like you out there because I am the same way.  I don't think I would fit the societal perception of \"fat\" but I'm about 20 pounds overweight.  And you know what?  I DON'T CARE.  I too have rounded hips, thighs that touch, and a pillowy stomach.  But I'm happy with the way I look.  And my boyfriend is too.  If you're happy with how you look and feel, it's unnecessary to worry about what everyone else thinks.             I love you.  &lt;3   You are beautiful!    So which one is it?  You feel good because you're fat because women don't automatically dislike you for being pretty because you're not, but at the same time being fat doesn't mean you're not pretty?  so long as you are healthy and eating right, then yes, there is nothing wrong with being fat. but if you exercise and eat right, why are you fat? doesn't make much sense.     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18gg59/my_thoughts_on_being_a_fat_girl_and_why_thats_okay/"
  }, {
    "id" : 28,
    "title" : "My best friend sent this to me last year, and I think it's something to be shared and remembered",
    "snippet" : " ",
    "url" : "http://thoughtcatalog.com/2012/happy-valentines-day-to-my-best-friend/"
  }, {
    "id" : 29,
    "title" : "Have you ever changed your last name for reasons not due to marriage/divorce?",
    "snippet" : "I'm considering changing my last name... my \"identity\" has been somewhat up in the air due to many factors:\n\n- Parents divorced when I was young, mom gave me her maiden name\n- I got married (changed my name to his)\n- Got divorced (left it as my married name for now, because I'm not really that fond of my mom's maiden name...it makes my name rather long and seems to be difficult for people to spell)\n- Now partnered with someone excellent (but if I married him and took his name, the results would be pretty comical and many a joke made...)\n\nAnd most importantly:\nI don't think I personally believe in taking someone else's name anymore. Kudos to those who choose to for their own reasons...but for my own, I don't think I want to do it again.\n\n\nSo...has anyone ever changed their last name \"just because\"? For a fresh start? I do worry about how my family would react...how did you deal with that portion of the change? \n\nBTW, I have a last name in mind that correlates to my mother's first name. Been trying it on here and there for the past few months and really like it. Just contemplating if I should make it legal. Thanks all!   ...sort of. My wife and I (we are both women, for the record) both changed our last names to something completely new three years after our wedding. We had kept our original last names until then.\nShe had a complicated 15 letter hyphenated name that no one could pronounce. She wanted to get rid of it. I was raised by an abusive mother and giving my wife that name felt like staining her somehow. I couldn't do it, and thinking about it I realized that I needed a new name too. My name was poisoned, her name was too complicated, so we chose a new one together.\nNames used to indicate what you looked like, who your parents were, what you did, or where you were from.  We chose the last option and took the name of a local land formation.\nThis did not go over well with our families. Our siblings thought it was great. Her parents were dismayed and didn't really understand why we were doing it, but accepted it.  Mine...there has been drama since we told them. Christmas was the worst. But I have a new name, and it is right, and it is mine. that... is awesome. Thank you. I've taken so much flak from my familiy a little support, even from a stranger, gives me a big smile. ...sort of. My wife and I (we are both women, for the record) both changed our last names to something completely new three years after our wedding. We had kept our original last names until then.\nShe had a complicated 15 letter hyphenated name that no one could pronounce. She wanted to get rid of it. I was raised by an abusive mother and giving my wife that name felt like staining her somehow. I couldn't do it, and thinking about it I realized that I needed a new name too. My name was poisoned, her name was too complicated, so we chose a new one together.\nNames used to indicate what you looked like, who your parents were, what you did, or where you were from.  We chose the last option and took the name of a local land formation.\nThis did not go over well with our families. Our siblings thought it was great. Her parents were dismayed and didn't really understand why we were doing it, but accepted it.  Mine...there has been drama since we told them. Christmas was the worst. But I have a new name, and it is right, and it is mine. ...sort of. My wife and I (we are both women, for the record) both changed our last names to something completely new three years after our wedding. We had kept our original last names until then.\nShe had a complicated 15 letter hyphenated name that no one could pronounce. She wanted to get rid of it. I was raised by an abusive mother and giving my wife that name felt like staining her somehow. I couldn't do it, and thinking about it I realized that I needed a new name too. My name was poisoned, her name was too complicated, so we chose a new one together.\nNames used to indicate what you looked like, who your parents were, what you did, or where you were from.  We chose the last option and took the name of a local land formation.\nThis did not go over well with our families. Our siblings thought it was great. Her parents were dismayed and didn't really understand why we were doing it, but accepted it.  Mine...there has been drama since we told them. Christmas was the worst. But I have a new name, and it is right, and it is mine.  My brother changed his mainly for his art career -- he kept the same last name but added our mom's maiden name to the end. Our family freaked the eff out. Why do you hate your father? Why are you rejecting his name? And then when he had kids and gave them the new name OMG. You'd've thought he named them Adolf.\n\nI didn't see what the big deal was. Maybe this is a generational thing? To anyone older than 55 it was offensive. To anyone younger it was a nonissue. Your name is part of your identity and if you want to change it, it's your life.  My brother changed his mainly for his art career -- he kept the same last name but added our mom's maiden name to the end. Our family freaked the eff out. Why do you hate your father? Why are you rejecting his name? And then when he had kids and gave them the new name OMG. You'd've thought he named them Adolf.\n\nI didn't see what the big deal was. Maybe this is a generational thing? To anyone older than 55 it was offensive. To anyone younger it was a nonissue. Your name is part of your identity and if you want to change it, it's your life.  My brother changed his mainly for his art career -- he kept the same last name but added our mom's maiden name to the end. Our family freaked the eff out. Why do you hate your father? Why are you rejecting his name? And then when he had kids and gave them the new name OMG. You'd've thought he named them Adolf.\n\nI didn't see what the big deal was. Maybe this is a generational thing? To anyone older than 55 it was offensive. To anyone younger it was a nonissue. Your name is part of your identity and if you want to change it, it's your life.   My sister legally changed her entire name about 10 years ago (first, last, and middle). It was, and still is a little, weird calling her by a different name than I grew up calling her and it's weird when people ask about it (no she didn't get married; no she didn't get divorced), but it's her decision, her name. My dad is kind of dramatic and claims that it was because she never wanted to be like him but the rest of us are realistic and recognize that she just wanted a fresh start, like you said. Wow, that's quite a change. How old was she when she made the switch? (Just curious.)\n\nI had a friend from high school who changed her entire name too... it was really weird referring to her new name for awhile, but I almost forget her old one now.   I haven't, but my friend changed her last name from her father's name to her mother's (they were divorced), supposedly because it was easier to pronounce. Her father was Greek, and her mother English, and it *was* much easier to say. But I also understood from another friend that she was doing it because she wanted to disassociate herself with her twin and (primarily) her father, and taking the new name did this effectively. She is still on excellent terms with her twin, and while she doesn't speak to her father, twin still does. So I do think it caused a lot of tension there. \n\nI do love the idea of taking a new name for yourself though! Have you talked to your mother about it?   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jb1s/have_you_ever_changed_your_last_name_for_reasons/"
  }, {
    "id" : 30,
    "title" : "I need to rant. My friends abandoned me.",
    "snippet" : "So today, my 3 best friends suddenly decided to stop being my friends. I was sortof expecting it, because they have been trying to shut me out of everything for a few weeks. But, still, I don't really have very many friends around me due to my socially akwardness brought around by just this exact thing happening with different people from different schools.\n\nTo clear something up, I'm 14 and in high school. I'm also pretty sure who turned my pretty loyal and kind friends against me:\n\nShe calls herself \"Hank\". She is the typical steriotype of a scene kid. She wears giant hipster glasses (without lenses, naturally), wears retarded clothing, only likes \"random and obscure\" things (adventure time, dubstep, just about anthing in your local Hot Topic), and is 'totally not girly at all'. She enjoys drama. So far she has ripped apart a happy relaionship between a really nice girl and her boyfriend, been a general bitch to everyone, dadeda. I never really liked her, but I never imagined she would do this to me.\n\nBut yeah, now I feel sad and pretty betrayed, especially since they didn't say this to my face. I have no clue what I did.  This shit is typical for 14-year-olds. Don't take it too personally. You and your friends are at a point in your lives where acceptance is paramount. So your friends are following the whims of someone who fancies herself an Alpha female.\n\nIt's unlikely your friends really have anything against you, they're just not bold enough to go against Hank. But you shouldn't start shit with Hank, either. The tables turn fast at your age -- in a week, Hank might find herself in a different circle altogether. If you feel like it, be welcoming to the others, let them know you're still up for being friends (if you are). Otherwise, get to know more people in your school. I suggest start by saying Hi to people you kinda know.\n\nAnd while I, too, liked Hot Topic when I was younger, it's hardly \"random\" and \"obscure.\" It's a national chain, and they only sell popular things that sell wildly. I bought my prom dress there in the 90's. Trust me, Hot Topic ain't that edgy.\n\nAlso, please drop \"retarded\" from your vocabulary. Unless you are talking about something that is physically impeding something else from progressing at a faster pace. Rise above the bullshit and be the example to follow. This shit is typical for 14-year-olds. Don't take it too personally. You and your friends are at a point in your lives where acceptance is paramount. So your friends are following the whims of someone who fancies herself an Alpha female.\n\nIt's unlikely your friends really have anything against you, they're just not bold enough to go against Hank. But you shouldn't start shit with Hank, either. The tables turn fast at your age -- in a week, Hank might find herself in a different circle altogether. If you feel like it, be welcoming to the others, let them know you're still up for being friends (if you are). Otherwise, get to know more people in your school. I suggest start by saying Hi to people you kinda know.\n\nAnd while I, too, liked Hot Topic when I was younger, it's hardly \"random\" and \"obscure.\" It's a national chain, and they only sell popular things that sell wildly. I bought my prom dress there in the 90's. Trust me, Hot Topic ain't that edgy.\n\nAlso, please drop \"retarded\" from your vocabulary. Unless you are talking about something that is physically impeding something else from progressing at a faster pace. Rise above the bullshit and be the example to follow. &gt;Trust me, Hot Topic ain't that edgy.\n\nI think that's the point that OP was trying to make.\n\nAlso, I'm fine with \"retarded,\" and even \"gay\" in negative, informal contexts like the one OP used the former term in. Words have different meanings in different contexts, and trying to confine them to their past contexts in colloquial language is rarely successful nor necessarily beneficial. \n\nI can see the point of view about why such words are offensive to some, but I also know many people who you would expect to be offended who aren't. The fact that something is offensive to some or that it used to be used in a different is not a good reason on which to base censorship alone. I'm also against using \"gay\" as a derogatory epithet.\n\n*“Your beliefs become your thoughts, \nYour thoughts become your words, \nYour words become your actions, \nYour actions become your habits, \nYour habits become your values, \nYour values become your destiny.”* - Gandhi  I don't trust Ghandi as a source on morality. He did a lot of pretty awful things in his life, and he wasn't exactly a psychological or linguistic scholar specializing in he social-psychological implications of context and the evolving meaning of words.\n\nIf you have some studies showing a cause-effect relationship between using the words \"retarded\" or \"gay\" and the development of intolerance against mentally disabled people or homosexual people, I would be interested in seeing those Seriously, you're going to argue with me on this? \n\nIn a forum that frowns on body-snarking, slut-shaming and misogyny, *you'd* defend the use of insulting and derogatory language?\n\nSMH. I didn't realize that I was required to agree with every single popular idea on a given subreddit, and that making an assertion that goes against a popular idea was so terribly frowned upon.\n\nThanks for engaging seriously and thoughtfully in the argument and not simply trying to guilt me into being quiet. If you're thinking I'm leading the downvote parade, I'm not. I haven't downvoted you once in this discussion.\n\nBut Rule #1 of this subreddit discourages things like homophobia and disrespect towards others. I'd categorize the use of words like \"retarded\" and \"gay\" as insults as being disrespectful. Some people are not the least bit offended by far nastier epithets, but and I don't think that makes them acceptable either. I do think it's better if we scrub such negativity from our vernacular and try improve our collective morale.   InfernalWedgie really hit the nail on the head, but I just wanted to add... be NICE, genuinely NICE and polite to Hank any time you come into contact with her... and your other friends too. It's the exact opposite of what she wants - she wants to cause drama, she probably wants you to be a bitch to her so she can turn around to your other friends and say, \"see, I told you Golbert is a huge bitch!!\" and she may be so conniving as to want to see your relationships with your other friends crumble. So don't give it to her. As InfernalWedgie said, seek out friendship elsewhere, but continue to be really nice to the whole group whenever you run into them in the hallways, etc.\n\nBeing 14 sucks. It gets better! After a few seconds of \"HOLYCRAPEPIPHANY\", I realize that I can and will only be happy from this. I no longer have to worry about their opinions. I'am going to ask out the guy I like, do something to my hair that I was afraid of their opinion of, and enjoy my freedom. I'm going to smile at everyone, say hello to anyone, talk to people. Do the things my fears of their opinions prevented me from. Tomorrow will be amazing. I can focus on myself for once. It's amazing.  Same thing happened to me. Join the theater, plenty of misfits to befriend there.      You should poop in a bag and throw it at her car/house/locker. This sounds like something my sisters would have said/offered to do when I was 14. Completely inappropriate but good for a laugh, thanks!",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jq74/i_need_to_rant_my_friends_abandoned_me/"
  }, {
    "id" : 31,
    "title" : "I need help with ideas for activities or hobbies that me and my mom can do together!",
    "snippet" : "I'll try and keep this short.\n\nRecently my mom has a lot more time on her hands, and whenever she says how bored she feels, I feel bad that I don't have anything to suggest or some things we can do together. She has a Kindle and she's tried reading on it, but it's not the same as a physical book so she's not that interested. (She does, however, have like 50 games of Words With Friends and Draw Something going with coworkers/friends/family, so at least she's not the type who doesn't understand/is afraid of technology!)\n\nShe works an office job so she doesn't get a chance to be outdoors much, and I'd really like to find something we can do outdoors together. I mean \"besides go walking\" or simple stuff like that.\n\nI'm pretty crafty and love making things, but I'm not sure if that's what she's really interested in. Or at least not the same sort of things. She has started making basic little candies and I want to try and find her a couple of good books on how to make stuff like that. She's tried knitting and could not be less interested. I've started experimenting with making jewelry, I was going to take her shopping for supplies some time soon and see if she likes that too.\n\nSo... Can you help me out, TwoX? She's awesome, fun, intelligent, and lively. She's not an old lady. And I hate that she doesn't have anything to do with her time.  Can you enroll yourselves in a leisure class at your local community college? I take conversational Italian. I'm going to take sewing next. Then maybe photography. I highly recommend you two learn how to sew.  I totally need to. I'm tired of paying stupid prices for clothing and accessories that are obviously simple to assemble. Just for the record sewing is a hobby that will pretty much never save you money. There are a few things worth doing from an economic stand point (curtains, handbags and wedding gowns) but most things will be around the same price to sew.  Aww, don't tell me that. Then it just becomes work! ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jtvm/i_need_help_with_ideas_for_activities_or_hobbies/"
  }, {
    "id" : 32,
    "title" : "Have a great Valentine's Day! (and a great 9 months in the future!)",
    "snippet" : "Don't forget your birth control, and/or, go buy some condoms as a gift to your SO (assuming some of you might be heterosexual).  For those who are single, go rock the casbah with some single friends.  For my lesbian ladies -- have a great day as well!  (and if there's anyone I left out, my apologies; have a great day!)\n\nA PSA from your friendly neighborhood Labor and Delivery Nurse.    And for everybody who isn't trying to prevent pregnancy, good luck! I think it would be the funniest thing to end up with a kid who eventually discovers what happened 9 months before she/he was born! Ikea has a deal where kids born this year on November 14 get a free crib! I loved how the people in the comments for that post were suddenly realizing what their November birthdays meant, too funny! As a honeymoon baby, I can sympathize lol I'm really glad my twins were born prematurely so they may never know they were birthday sex babies... I loved how the people in the comments for that post were suddenly realizing what their November birthdays meant, too funny! As a honeymoon baby, I can sympathize lol Damn, I'm a November kid.\n\nSquick. My boyfriend is a November baby. I tease him about this all the time.  I loved how the people in the comments for that post were suddenly realizing what their November birthdays meant, too funny! As a honeymoon baby, I can sympathize lol And for everybody who isn't trying to prevent pregnancy, good luck! I think it would be the funniest thing to end up with a kid who eventually discovers what happened 9 months before she/he was born! I wonder if there is a high incidence of births around November 14th? I've seen charts that show that mid-September to early October is when there are a lot of births (if I remember correctly) Holiday babies :) And for everybody who isn't trying to prevent pregnancy, good luck! I think it would be the funniest thing to end up with a kid who eventually discovers what happened 9 months before she/he was born! And for everybody who isn't trying to prevent pregnancy, good luck! I think it would be the funniest thing to end up with a kid who eventually discovers what happened 9 months before she/he was born! And for everybody who isn't trying to prevent pregnancy, good luck! I think it would be the funniest thing to end up with a kid who eventually discovers what happened 9 months before she/he was born!  Doesn't matter the day of the year I am not forgetting to take that little pill. I am not ready to get pregnant at 20.  Amen. I take that thing like clockwork, regardless of what day it is. I have been on the pill for eleven months, and I have not missed a single day that entire time. Almost 2 years here and DITTO. \n\nI have 2 alarms, one set 5 minutes before and one set for the time I take it. I ALWAYS take it within that 5 minute window. \n\nIt may be a little OTT but I always say I'd rather be a tad bit obsessive about taking my pill than end up with an unexpected pregnancy. That's a really smart idea. Maybe I should start setting two alarms instead of only one. I've found it really helpful! Gives me time to find my pills or grab some water and if I get distracted I have a second reminder a few minutes later. \n\n You do realize you don't need to drink water to take the pill, right? Yes, of course!\n\nI believe you DO need to drink at least 8 ounces if you take a chewable form of the pill (which I don't). It was a total revelation for me when I realized I didn't have to drink water to swallow the pills. It made pill-taking so much more convenient for me. Amen. I take that thing like clockwork, regardless of what day it is. I have been on the pill for eleven months, and I have not missed a single day that entire time. 14 months and I missed a few but mostly when I switched to a new time zone for a week. Going from Florida and California was not a good week when it came to my pills.  Ugh yeah. How does that work anyway?\n\nAlso, I didn't mention the one week when I went off the pill because I didn't get my new pack in time, but that wasn't really an instance of forgetting to take it. I would have needed to take it at 10pm my time meaning 7pm there. We were always out the room and I was so use to taking once I was near my room or bed that taking it to dinner with me never crossed my mind till half way through the week. I then started taking it at 7pm but by that point I got my period already. I was on a family vacation so sex was not happening anyway.  So if you're on vacation in a different time zone, you just keep taking it at the same time in YOUR time zone? 14 months and I missed a few but mostly when I switched to a new time zone for a week. Going from Florida and California was not a good week when it came to my pills.  Hah, yeah, I missed several when flying from the west coast of the US to Tel Aviv, and then back a couple of weeks later.    You actually did remind me to take my pill. The alarm went off an hour ago and I silenced it and forgot :x You actually did remind me to take my pill. The alarm went off an hour ago and I silenced it and forgot :x  After my failed IUD and failed morning after pill, I am spending this Valentine's Day pregnant (again). I am looking forward to a great 8 or so months into the future none the less. :-) If I were you I would consider buying a lottery ticket. :)    I remember to take my pill every day, however my boyfriend seems to have lost any interest in having sex with me so I guess I don't really need to worry. You ladies have any ideas on how to spice things up again? I got tired of always initiating so I stopped and we ended up going two months without doing it. I try telling him I want to have sex, but it's mostly met with \"One of us is just going to end up passing out on the couch so why even try?\" It's extremely discouraging.\n\nThrow away because my bf is a redditor and knows my other name. From your brief description, it sounds like he's depressed. I would address that possible issue first. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18ib2x/have_a_great_valentines_day_and_a_great_9_months/"
  }, {
    "id" : 33,
    "title" : "Spent all last night crying, and I'm not looking forward to getting through today. Will you be my Valentine?",
    "snippet" : "You've always been the best community for me on reddit. I think it's only fitting we share Valentine's Day together :)  I will be your Valentine! My little puppy is my Valentine today, and if I could share his dog food-breath kisses with you, I would! Believe me, he would very much like that!   I'm stupidly emotional right now as well. Official Valentine's sympathy thread? My boyfriend unexpectedly has to travel for work, so I won't see him today or for our two year anniversary on Saturday. Pretty bummed. That sucks :/ my boyfriend is just not fond of (commercially driven) valentines day, and with me being emotionally everywhere already, I think we're just not going to do anything... My wifey is away for work. I've seen her for all of 4 hours this week. :sigh:  Sure will!\n\nV-Day is over here in Australia, but I'm up an hour early (I got up around 05:15) and cramping horribly (yay for getting period on V-day... not!), so why not?\n\n[Have a rose](https://lh6.googleusercontent.com/-vij7hHE_oKY/UEZkSaqeHKI/AAAAAAAAH8I/g6_JsIDp_Yc/s800/Roses%2520%25281%2520of%25201%25291.JPG) :)\n\n/HUG oh man, being period-free today is at least one thing i have to be grateful for. Thanks for the rose :)!  heee.  Some subs have a chatroom feature.  \n\nWe should do that here and have slumber parties and watch movies.  ::hug::    -hugs- I'm in the same boat. I will totally be your Valentine  I'm having a shitty valentines too.  Two midterms today and boyfriend is away for work and I just feel really low today.  I'd be happy to be one of your 2X Valentines.  Have a great big Internet hug and PM me if you want to.  [deleted]  I'm sorry you are down.  Remember when you are low, pain is a temporary thing.  The old adage that time heals all wound is true.   If symptoms persist, please consult a doctor.   Do not be down. Rise! \n\nhttp://onebillionrising.org/ Also, love and hugs &lt;3  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18ikpn/spent_all_last_night_crying_and_im_not_looking/"
  }, {
    "id" : 34,
    "title" : "Ladies of 2X: Tell me your happy Valentine's Day Stories, having a partner is not required.",
    "snippet" : "I'm bored and sick and I'd love to hear some happy stories about what you guys are doing to celebrate this year and any sweet little things you did for your partner or friends or that your friends or partner did for you.  I'll start.\n\nI don't normally like Valentine's Day, I was always one of \"those\" girls the ones who roll their eyes at the commercialism and never really saw the point of it. This year though I feel a bit differently about it.  \n\nYesterday I woke up feeling miserable, muscles aching, sore throat, swollen lymph nodes, it was pretty horrible.  Perfect timing too since my first interview with a graduate school was scheduled for that afternoon.  Turns out I had pharyngitis and I could barely get out of bed.  I spend the whole day agonizing about the interview and eventually rescheduled (they were so kind about it, I was terrified they wouldn't be understanding). But I kept feeling worse.\n\nMy partner and I had planned a night of kinky sex to enjoy Valentine's Day but seeing as I could barely move it wasn't going to happen.  He came over in the evening and took care of me the whole night, made me soup, cuddled with me and we watched Futurama. He got me wet towels to lay on me to help with the fever.  I was sweaty and I'm sure I smelled awful and looked terrible but he still made me feel beautiful and loved.\n \nAs much as a nice evening out or a bunch of kinky sex would have been I couldn't have asked for a better evening (other then not being sick).  It feels so good to have someone who cares for you at your worst as much as when you are at your best.  \n\nSo tell me ladies, who makes you feel beautiful when you feel bad?  Your partner? Your friends? Your family?  Tell me some happy stories, maybe your plans for the night, ways you plan to show the people you love how much you care, sweet things others have done for you that brightened your day.    I moved to Ireland about a month ago, but I really don't know a lot of people here, so I thought I might spend the day alone and in the dumps. Not so! I don't know people here, but I do have some really good friends and family at home, and they were awesome - my mom sent me valentines and got the rest of my family to do the same, my brother's been emailing me non-stop, and my best friend and I skyped for two hours, ate ice cream straight from the carton, and compared the UK and US versions of Cosmo (surprisingly different).  And to top it off I had a nice afternoon enjoying a cup of tea and a really good book. I felt a little bad about not having a lot of friends or not having a boyfriend, but at the same time, I had a nice day today, and that's what counts. \n\n(Not quite Valentine's Day related, but when I'm feeling down in general, I always call my brother first. Last week he sent me the nicest card - what he wrote in it was so nice that it made me cry. That didn't brighten my day, it brightened my *week.*)  To preface this story, it's necessary to know that on occasion I'll (jokingly) ask my SO \"How much do you love me?\" and he'll reply something along the lines of \"A million buckets worth\" or \"Enough buckets to fill the hole on Jupiter.\"\n\nTonight when my SO came home, he gave me a (very sweet) letter he had written, and I thought that was going to be it (because we are both pretty poor until payday tomorrow). However, we then left shortly after he arrived home and as I got into his truck, I noticed a bucket on the passenger side seat...filled with all my favorite snacks and candy, as well as a DVD of the very first movie we saw together. It was a simple gift but a very sweet surprise. :) To preface this story, it's necessary to know that on occasion I'll (jokingly) ask my SO \"How much do you love me?\" and he'll reply something along the lines of \"A million buckets worth\" or \"Enough buckets to fill the hole on Jupiter.\"\n\nTonight when my SO came home, he gave me a (very sweet) letter he had written, and I thought that was going to be it (because we are both pretty poor until payday tomorrow). However, we then left shortly after he arrived home and as I got into his truck, I noticed a bucket on the passenger side seat...filled with all my favorite snacks and candy, as well as a DVD of the very first movie we saw together. It was a simple gift but a very sweet surprise. :) That's an amazing gift!  I'm like you about Valentine's Day normally, but my boyfriend of 4 months said he wanted to go all out &amp; treat me to a nice dinner &amp; that sort of stuff, so I wasn't going to stop him. However, we're in grad school &amp; we decided that we would celebrate it tomorrow when we'll actually be able to spend time together. Work today was absolutely terrible &amp; I was in a terrible, awful mood on my way home. Checked the mail &amp; I got such a sweet, unexpected card from my mom. Then my new bedspread came in a delivery about 5 days early. Then, a bouquet of flowers arrived from my boyfriend. I don't cry often, but I cried. I usually don't like cheesy or traditional Valentine's Day gifts, but nobody has ever sent me flowers before &amp; it came unexpectedly on a day when I needed it the most. Then he came over after class just to cuddle on the couch for a few hours to listen to me vent about my day &amp; to talk about his day. I can't believe that we still haven't even properly celebrated V-day. Tomorrow we're exchanging gifts, going out to dinner, &amp; spending the evening drinking wine &amp; watching tv. He's getting a funny card, a funny inside joke gift, &amp; a nice gift from me. For the first time in my life, I've truly enjoyed Valentine's Day as something special &amp; meaningful for a couple. I've been toying around with whether or not I'm ready to say that I love him, cause it's a really big deal to me, and I think I am :)  Haha, my partner didn't believe me at first when I told him I wasn't interested in celebrating a traditional Valentine's Day, I had to convince him.  I'm not not romantic, at least not in the traditional way.  Gifts aren't really interesting to me, I'd rather just have food and sex (my partner and I are both active members of our local kink community).  Notice I use the term \"partner\" instead of boyfriend.  Maybe I'm weird but I've always thought \"boyfriend\" sounded too juvenile.  I'm bisexual but even though my partner is a man I opted to use the queer terms since I like the feel of them better. \n\nYour boyfriend sounds sweet though, he was nice to treat you anyway.  Although I know how it feels when everything is going wrong and the right gift shows up at the right time it can really make everything seem better.  \n\nAlso I understand what you mean about saying \"I love you\" I've been with my partner almost a year and only recently said it to him, Its very significant. Yeah, I just don't need gestures like that to feel loved and appreciated. My boyfriend has a hard time understanding that, because he's always dated really demanding &amp; needy girls. We've wanted to go out to dinner together for at least 3 weeks now, but every weekend we've been so busy or exhausted that we end up staying in. I'm totally fine with that, but it's nice to get out of our apartments sometimes. Plus, I'm wearing a new dress that's been sitting in my closet waiting for our next dinner date. And I totally understand the use of the word \"partner.\" I think it's a better descriptor of how a relationship should be. \n\nAnd about saying \"I love you,\" I totally agree. I was with my last boyfriend for two years (with some breaks) &amp; we never said it. I'm completely fine with waiting until it absolutely seems right &amp; natural for my boyfriend &amp; me. We had a conversation about the significance of saying \"I love you\" &amp; we're on the same page about its meaning. I can see myself with him for a long time &amp; our relationship really is a partnership. He's someone I admire so much for his wisdom &amp; character &amp; I'm so happy to have him in my life.  You guys sound adorable.  Its probably a nice change for him to be with someone so independent after him having more needy partners.  \n\nI do agree about getting out of the house.  Its my personal preference though to do the going out on the town stuff on non-holidays just because I don't like being around lots of people.  Although there is definitely something really fun about getting to wear a cute new dress for the first time.  I've been feeling kinda down lately and I thought I'd spend most of my day today hiding out in the library after my classes (I'm 21/in college), because I'm one of the few people in my group of friends who doesn't have a significant other, and I found out two of my good friends (who are also single) wouldn't be around for today or most of the weekend. To top it off, my class schedule today (Two classes straight from 11am-3pm) makes it so I can't get lunch with people and in general my Tuesday/Thursdays are a bit on the lonely side.\n\nWell I hung out with one of my friends last night before he left for the weekend and we just kinda had a nice time chillin' and watching anime. He helped me feel a bit better about the things that have been worrying me lately, and in general I just went to bed happy because of him caring about me. And today he texted me a Happy Valentine's Day and it made me smile. =)\n\nToday ended up being much better than I expected! I got a text right before my classes started from one of my girl friends asking where I was, and she seemed bummed when I said I wasn't free until 3, which made me sad too because I always get asked to hang out during these class times. But later when I was done with class, I came back to my room with a single rose on my desk -- this friend had given my roommate the rose to give to me! I felt awesome and loved. My sister (also my roommate) made me a little Valentine's card with glitter and gave me a heart-shaped donut, which also added to my feeling happy.\n\nLater, another friend of mine met up with me in our campus Starbucks, and we talked for a good two hours before she went off to hang out with her boyfriend. She gave me a late birthday card (my birthday was back in January), which had all sorts of doodles and two lollipops attached. I also had a great chat with her, which I love because I have few close female friends and it's just super nice chatting with her.\n\nSo basically I thought I'd spend today hiding from everyone being overly cutesy with their significant others, but I ended up being reminded how much my friends care about me, and how love comes from more than just romantic partners. Cheesy, but I think it's something I needed a reminder of. =)  I've been having a pretty rough week full of intense schoolwork and lack of sleep. Today I decided to cut out early and eventually came home to my flatmates eating loads of Indian food, drinking wine, and watching Friends; half an hour later we were all quite tipsy, stuffed full of sag paneer, and laughing hysterically. After several days of holing myself up alone in the library this was exactly what I needed! Never mind cutesy cards and bunches of roses, I just needed something silly to keep me light-hearted.   I didn't do anything special today, even though I'm one of the people who actually love Valentine's day. I love all the red and pink and hearts and people dressing up and trying (I think people should express emotions, especially love, regularly, and not just on VD, but at least then on VD if not otherwise so it's all good anyway for me).\n\n\nAnyway! I wanted to spend the day reading, but my little sister called me completely freaked that she needs help with baking :) It's her first VD (sheesh, every time I have to remind myself I'm not talking about venereal diseases) in a relationship and her bf got her some seriously beautiful roses, almost as tall as me! So instead I spent the day helping her bake and playing cards with friends. And her cupcakes turned out delicious.\n\nOh, I got a bonus to a nice day, as much as I would've loved some sex tonight, I got a red gift as well, so instead of sex I celebrated not being pregnant. :) I didn't do anything special today, even though I'm one of the people who actually love Valentine's day. I love all the red and pink and hearts and people dressing up and trying (I think people should express emotions, especially love, regularly, and not just on VD, but at least then on VD if not otherwise so it's all good anyway for me).\n\n\nAnyway! I wanted to spend the day reading, but my little sister called me completely freaked that she needs help with baking :) It's her first VD (sheesh, every time I have to remind myself I'm not talking about venereal diseases) in a relationship and her bf got her some seriously beautiful roses, almost as tall as me! So instead I spent the day helping her bake and playing cards with friends. And her cupcakes turned out delicious.\n\nOh, I got a bonus to a nice day, as much as I would've loved some sex tonight, I got a red gift as well, so instead of sex I celebrated not being pregnant. :)  My husband and I decided this year to not do anything for Valentine's.  It's our first one as a married couple but we weren't feeling obligated to make a big deal out of it.  It's been surprisingly refreshing!  There are years when I've made special dinners or booked little trips but today we are just doing whatever we want.  \n\nI did end up giving him a Cadbury creme egg because I saw them while shopping for groceries yesterday and thought it would be amusing to say \"Happy Valentine's Day\" and hand him a Cadbury creme egg.  Then he got me [this card](http://shop.theoatmeal.com/collections/frontpage/products/man-nipples-greeting-card).  And that's how we roll.    My fiancé just started a new job and he was supposed to have to go to Texas this whole week. So, we decided to just celebrate our \"monthiversary\" on Saturday and forget about Valentine's Day. We usually celebrate Valentine's Day if we can but it's not a big deal if we can't. \n\nAnyway, his trip changed and he was going back home yesterday afterall but kinda late in the evening so we decided to just get a quick bite when he got back. \n\nSo, I was super excited this whole day that he was coming back and I was doing some cleaning, dancing and listening to music and playing with our puppy when I got roses delivered! It was really unexpected. :) Then later he got back and I waited for him outside with our puppy to surprise him (and the puppy barked at him because he didn't recognize him), we went out for burgers and also got a kahlua milkshake and just had a very nice casual date. :)",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jlpb/ladies_of_2x_tell_me_your_happy_valentines_day/"
  }, {
    "id" : 35,
    "title" : "“Women of L.A”: The Anti-Female Anthem of 2013 (by Erin Gibson, writer at Funny or Die)",
    "snippet" : "  I think it would be VERY interesting to see the reactions on Reddit (which, judging from the comments when it hit the front page yesterday, were relatively positive) if the genders in this video were reversed.",
    "url" : "http://www.gibblertron.com/post/43064447687/women-of-l-a-the-anti-female-anthem-of-2013"
  }, {
    "id" : 36,
    "title" : "Spreading love on Valentine's day. Story inside!",
    "snippet" : "So, I just wanted to gush. While I'm in a long distance relationship and had to spend Valentine's Day alone, it didn't stop me from having a great Valentine's Day. I went out and bought a bag of goodies for some close friends that live close to me, and went to deliver it to them. Unfortunately, my friend's girlfriend (I'll call her Ashley) was there. My stomach instantly dropped because Ashley is really abrasive and I didn't like her very much. Nobody else in our group did either because of her seemingly bad attitude. As a result, my friends frequently gossiped about her while my friend and Ashley were gone, and wanted our friend to break up with her.\n\n\nBecause Ashley had showed up early while my friend was finishing up her surprise, I volunteered to take her out for a bit to give her time to finish up Ashley's surprise. During my time with Ashley, we wound up getting to know each other better and I let go of the negative feelings I had towards her. I learned that Ashley isn't all that bad of a person, and I now feel better having given her a chance. I'm glad I reached out to her because I think it's a step in the right direction of things getting better.\n\n\n**tl;dr** Spent part of my day reaching out to somebody who I previously disliked and wound up being pleasantly surprised. Learned that Valentine's Day is also about spreading love to people in general :3  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jlpq/spreading_love_on_valentines_day_story_inside/"
  }, {
    "id" : 37,
    "title" : "Fiancé is having a full blown schizophrenic episode on Valentines Day and I have to get him locked up in the mental ward (kinda depressing, slight rant)",
    "snippet" : "So my fiancé has schizophrenia, but he thinks he was misdiagnosed and that they lost his files. When I met him he had only just come off his meds and he knew of his mental illness and openly admitted to it. For three years I've watched him spiral down again and again. Two years ago he thought the gates of hell cracked open and that demons were coming out of the sky. That I could stand, he wasn't a danger to himself and there wasn't much I could do. But the last few days he's been in a rapid downward spiral and today he thinks that a bikie group is moving into town and that they're going to kill us all. There is no bikies moving in. There is nobody after him. But he keeps asking bad people questions and he's going get me hurt and get himself hurt too. \n\nI'm currently trying to find out how to get him put in the mental ward, since he's convinced that everybody else is crazy and he's fine and refuses to get assessed. I just want to hug him and snuggle up in bed and watch some good horror movies and say I love you to each other. But I can't. Instead I have to get him locked away. This just makes me so incredibly sad. I know what I have to do. It's either the mental ward for him or I have to leave town and let him fend for himself. He is such a wonderful person when his mental condition isn't bad, and I love and care for him deeply.\n\nI'm seeing all these posts on facebook about people bitching about stupid petty stuff and how they're disappointed with what they got on valentines day and it makes me pretty mad. And the happy posts with pictures just make me want to cry right now.\n\nSo if you're disappointed with what your loved one decides to get you or do with you for Valentines Day, take a step back and have a look what you've got. Appreciate the fact that he/she loves you and at least is spending that time with you at all. Happy Valentines Day ladies, and remember, don't lose perspective.  I work on a acute behavioral health unit, if you have some questions, I could try to help.  I have to say that this statement \"When I met him he had only just come off his meds and he knew of his mental illness and openly admitted to it\" concerns me.  While the medications usually have side effects, sometimes to the point that people feel like they aren't themselves anymore, they aren't prescribed for a period of time like antibiotics.  Medication compliance is a huge issue, and it needs to be taken seriously.  People usually adapt to the changes from the meds, until something better comes along, this is the only real option.  When people go off meds, it becomes harder and harder to bring them back, meds that used to work... might not.  100mg of Seroquel... try 400mg now, things like that.  \n\nLove and support is the best thing, but part of that is understanding the illness, and reinforcing safe decisions.  You will not help him, or yourself if you don't put your foot down when it comes to treatment.                 Dude delete that Facebook! It dehumanizes people. I hope your sweetheart will get better soon. Hang in there.  This is just... such an absurd comment, I don't even know where to begin. Facebook is annoying. You said it made you feel bad. I deleted my Facebook after I got tired of the fakery and self-absorption and I feel better. Honest suggestion.  Dude delete that Facebook! It dehumanizes people. I hope your sweetheart will get better soon. Hang in there. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18hov1/fiancé_is_having_a_full_blown_schizophrenic/"
  }, {
    "id" : 38,
    "title" : "Happy V-Day Guys! Here is a link to see what V-day events are happening in your area! :)",
    "snippet" : " ",
    "url" : "http://vspot.vday.org/vday/events"
  }, {
    "id" : 39,
    "title" : "Here's the 1950s Quiz That Proves You Are a Terrible Wife (Glad we've moved on from this.)",
    "snippet" : "  I dunno, in my assessment \"16 - squeezes toothpaste at the top\" remains a mortal sin in spite of the passage of time. I dunno, in my assessment \"16 - squeezes toothpaste at the top\" remains a mortal sin in spite of the passage of time. I dunno, in my assessment \"16 - squeezes toothpaste at the top\" remains a mortal sin in spite of the passage of time. I dunno, in my assessment \"16 - squeezes toothpaste at the top\" remains a mortal sin in spite of the passage of time.  My favorite is number 23.\n\n&gt;Reacts with pleasure and delight to marital congress (10) My favorite is number 23.\n\n&gt;Reacts with pleasure and delight to marital congress (10) I know right!\n\n&gt; You've gotta be a tiger in the bedroom! You need to love to fuck! Just don't let anyone know it. Ever.\n\n\n&gt; ...Whore My favorite is number 23.\n\n&gt;Reacts with pleasure and delight to marital congress (10)  What's the deal with the red nail polish? I would imagine that it was considered vulgar and whorish. After all, proper ladies never call attention to themselves in such a way! What's really funny is I never wear red nail polish because I don't think I'm pretty enough for it. What's the deal with the red nail polish?  I got -3. I consider this a success.\n\nMy boyfriend is cooking my dinner before we engage in premarital congress, and then I'll sleep in the morning and eat breakfast naked.\n\nEDIT: Boyfriend scored 83. I think I win. But more importantly, did you react with pleasure and delight to said congress?  While most of this list was cringe-worthy, some of it sounded surprisingly feminist. Namely merits #26 and #48 - \"has spunk - will defend her ideals and religion\" and \"willing to get a job to support the home\". It also goes back to ask that the wife has the same religion (implicitly, ideals) as the husband. So outwardly, as long as she parrots HIS thoughts, she scores points on this scale. While most of this list was cringe-worthy, some of it sounded surprisingly feminist. Namely merits #26 and #48 - \"has spunk - will defend her ideals and religion\" and \"willing to get a job to support the home\". But consider that \"spunk\" is defined as having an opinion up until the point that you get upset (\"sulk or pout\") or contradict your husband in public, which is on the no-no list. Also \"willing to get a job\" does not mean have a career outside the home, once things stop being tight its back to timely meals and straight stockings for you young lady.\n\nGreat list though, I'm so glad I was born when I was. Oh, it's not empowering by any means, I'm just surprised it included even that level of enlightenment.\n\nI think the important thing no matter what era you're born in is to hold yourself to your own personal standards and not let someone else's backward notions affect your own evaluation of your self-worth.\n\n*edit: grammar  There's a husband one too.\n\nhttp://www.flickr.com/photos/tiabla/sets/72157605047200616/ This version is a easier to read, at least for me: http://www.scribd.com/doc/3086410/Tests-for-Husbands-and-Wives- There's a husband one too.\n\nhttp://www.flickr.com/photos/tiabla/sets/72157605047200616/ There's a husband one too.\n\nhttp://www.flickr.com/photos/tiabla/sets/72157605047200616/ There's a husband one too.\n\nhttp://www.flickr.com/photos/tiabla/sets/72157605047200616/  The cold feet game is rather cruel... I could see demerits for that, and backseat driving. But fuck you if I can't swear, make wildly inappropriate innuendos in mixed company and tell all horribly raunchy jokes! The cold feet game is rather cruel... I could see demerits for that, and backseat driving. But fuck you if I can't swear, make wildly inappropriate innuendos in mixed company and tell all horribly raunchy jokes! The cold feet game is rather cruel... I could see demerits for that, and backseat driving. But fuck you if I can't swear, make wildly inappropriate innuendos in mixed company and tell all horribly raunchy jokes!  I actually did pretty well on this, despite some things that are totally weird and outdated (stocking feet in the house a demerit? STOCKINGS at all?). Like, really \"well.\" 81. And I'd consider myself a feminist. Is something wrong with me? WHY THE HELL should I not put stocking in the wash basin? What does that even mean?! (Oops, slang or vulgarity; 5 points from Gryffindor ;). Supporting heresy and witchcraft. FIVE POINTS DEMERIT! But same religion as my husband: +5 points? :p I actually did pretty well on this, despite some things that are totally weird and outdated (stocking feet in the house a demerit? STOCKINGS at all?). Like, really \"well.\" 81. And I'd consider myself a feminist. Is something wrong with me? I actually did pretty well on this, despite some things that are totally weird and outdated (stocking feet in the house a demerit? STOCKINGS at all?). Like, really \"well.\" 81. And I'd consider myself a feminist. Is something wrong with me? I'm just going to believe you cashed in those +5 points each for your twelve young children. :P I actually did pretty well on this, despite some things that are totally weird and outdated (stocking feet in the house a demerit? STOCKINGS at all?). Like, really \"well.\" 81. And I'd consider myself a feminist. Is something wrong with me?     Interesting conversation.. +1\nGood sense of humor..  +1\n\nAble to cook?.. +5!!\nDislikes children?..  - 10!\n\nHonestly, the scoring sounds more suitable for a Nanny than a wife.  &lt;1950's mode&gt; \nWhat's the difference\n&lt;/1950's mode&gt; Wives should also react with pleasure and delight to marital congress, remember? &lt;1950's mode&gt; What's the difference &lt;/1950's mode&gt; ;)        I think if I wrote my partner's parents a letter they would be like...why didn't you just call/text/email?\n\nAlso, what's wrong With wearing stocking feet around the house? I thought wearing shoes inside was rude? I just counted that one as if it was the modern equivalent. Writing them a mail or whatever. \nThe point of that question is that we'd be bad wives if we never want to communicate with them. Lol\n\nAs for the stockings, it's probably because it's considered ugly, stocking feet out of shoes. Either that of its a matter of thriftiness: walk barefoot in stockings for a bit and you'll snag them on something and have to buy new ones.                       ",
    "url" : "http://blogs.villagevoice.com/runninscared/2013/02/heres_the_1950s.php?page=2"
  }, {
    "id" : 40,
    "title" : "Did any of you ladies initially have misconceptions or biases against vibrators, only to eventually change your mind later?",
    "snippet" : "For many years, I was under the impression that if I used a vibrator, I would no longer be receptive to my partner's efforts to sexually please me. \n\nAfter my parents divorced, my dad dated lots of women. My dad has always been very open about relationships and sex, so he would often discuss his happenings with me (without going into graphic details). At several points throughout my teens, he mentioned to me that I should never use vibrators, because if I did, then I would no longer be able to feel sexual pleasure from a man. He related some story to me about a woman who used them, who could \"no longer\" experience sexual pleasure from being stimulated by guys, as a result. For years, I believed all of this was true.\n\nFast forward to age 22, when I lost my virginity to my boyfriend. It took a while for sex to start feeling even remotely pleasurable for me. During that whole period, I started to wonder if perhaps experimenting with a dildo or a vibrator would help me get used to penetration. Around that time, I also started going on 2X and /r/sex a lot and reading lots of vibrator-related posts. None of them mentioned anything about the supposed problems my dad had told me about. In fact, using a vibrator sounded damn awesome. Furthermore, one of my close female friends had recently begun experimenting with a bunch of sex toys, which only piqued my curiosity further.\n\nFinally, I decided, what the hell. There is a Babeland just a few blocks from me, so I walked over. I asked the salesgirl to recommend me something specifically good for adjusting to penetrative sex. She showed me several vibrators, and I wound up going with a rabbit-esque one.\n\nI took it home and tested it out. Needless to say, it felt fucking fantastic. I wound up using it twice that day—it was just that great.\n\nIt's been about nine months now, and it hasn't affected my sex life with my boyfriend at all. I wouldn't say vibrators feel better or worse for me. It's merely a different type of pleasure, that's all. Sometimes I prefer fingering, sometimes I prefer oral, sometimes I prefer penetration, and sometimes I prefer the vibrator. It's all about variety. I just can't believe I went for so long believing the things my dad told me. He probably just felt threatened by the idea of vibrators.\n\nTLDR: My dad told me I should never use vibrators because they will make me unable to feel sexual pleasure from my partner. Years later, I went out and bought one, and I have proven him utterly wrong.      I thought that you only put vibrators in your vagina, I didn't really consider that you'd use them on your clitoris at all. Even the non-dildo shaped ones?   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18iutq/did_any_of_you_ladies_initially_have/"
  }, {
    "id" : 41,
    "title" : "I Gave My Husband a Free Pass for Valentine's Day",
    "snippet" : "In short our Thursdays are busy. Not like sort of busy but like living in my car shuttling kids to sports and trying to keep the homework tears at bay busy. It's the kind of day where I trick the dog into thinking that he's been walked because I toss him in the car with me a few dozen times. \n\nSo I told my husband (who typically gets home from work after 9pm) that he can just toss a card my way and work his regular day. If he comes home early that just means that we'll lose him to work over the weekend. \n\nIt's not remarkable that I told him that I don't care about valentine's day. What **is** remarkable is that I actually meant it. I'm totally okay with this and don't feel less loved.  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18j1kh/i_gave_my_husband_a_free_pass_for_valentines_day/"
  }, {
    "id" : 42,
    "title" : "I'm so lucky to have parents that restore my faith in love. After over 30 years of marriage, my dad still surprises my mom!",
    "snippet" : "My father is generally the least romantic guy on earth. Vietnam vet, mechanic, just a very manly man. He usually shows his love by doing tasks for my mom (putting up new bathroom cabinets, building garden frames, etc)\n\nToday I get a text from my mother with this picture: http://i.imgur.com/xwJOZIY.jpg\n\nThe card reads \"I know I don't say it enough, but I do still love you.\"\n\n\nShe said she was so shocked and surprised that she started crying. Of course then I teared up too. Just thought I'd share an early, happy Valentines Day story with you all :)\n\n\n\n&amp;nbsp;&amp;nbsp;\n\n**Edit**: Removing my previous edit because it's Valentine's Day! No negativity :) Even if you're single, keep in mind that tomorrow a ton of chocolate goes 50% off! Stock up for shark week ;)\n  My parents have been together for 57 years now. To this day, they still do lots of cool little things for each other.  I...I teared up too...   My husband usually shows his love by doing things for me, caring for me.  Parking close to the mall because he knows I have arthritis in my feet, providing for me, taking romantic trips.  But he never says I love you.  It isn't him.  Sometimes he'll bring me flowers, or other little gifts, but not too often.  I'm not into V-day, but I do love spontaneous expressions of what our years together mean to him.  I'd have loved the flowers and card!  \n\nNothing wrong at all with a man who spontaneously decides to participate in the V-Day madness when it is not his usual gig.  In fact, it is touching.  Be fucking happy for them, even if it isn't your definition of the perfect expression of love.  For OP's mom and dad, it is.  So what if it coincides with yet another artificial holiday?  \n\nedited to add: 26th anniversary last week.  We went to Mexico, spent tons of naked time in the suite.  No flowers or jewelry.  \"Old\" people love Love too! My husband usually shows his love by doing things for me, caring for me.  Parking close to the mall because he knows I have arthritis in my feet, providing for me, taking romantic trips.  But he never says I love you.  It isn't him.  Sometimes he'll bring me flowers, or other little gifts, but not too often.  I'm not into V-day, but I do love spontaneous expressions of what our years together mean to him.  I'd have loved the flowers and card!  \n\nNothing wrong at all with a man who spontaneously decides to participate in the V-Day madness when it is not his usual gig.  In fact, it is touching.  Be fucking happy for them, even if it isn't your definition of the perfect expression of love.  For OP's mom and dad, it is.  So what if it coincides with yet another artificial holiday?  \n\nedited to add: 26th anniversary last week.  We went to Mexico, spent tons of naked time in the suite.  No flowers or jewelry.  \"Old\" people love Love too!    Sounds like my dad. He's very business and intimidating most days, even with his family - never really talks about his feelings out loud, but he shows he cares by doing projects or being the hero of the day (ex: Me calling him freshmen year of college at least 20 times to ask how to tell if _____ or _____ has gone bad in the fridge). He does little things for my mom, and always tries to get her nice things (usually asking for my advice).          That's so sweet. \n\nMy dad is the master of innocently gifted crappy gifts. He recently got my mother dishtowels for her birthday... dishtowels. She washes the dishes while they're sailing. It's not just for her, he has a knack for gifting me strange earmuffs that don't fit my head when we have the same hat size. He also missed my mom dropping hints about a kitchenaid mixer for about 10 years before she strongly hinted about this to me. Sometimes he nails it, but usually not without help.   Aww that's lovely. Nice to hear these stories of long lasting love on Vday! What is in the little box to the left of the flowers? It looks like thread?      If you edit is aimed at me, I want you to rest assured I am neither bitter or jaded. I am very happily in love actually. (: That's very nice. You must show love and prefer to receive love in ways different than other people. Isn't it shocking how people don't function the same way? That's very nice. You must show love and prefer to receive love in ways different than other people. Isn't it shocking how people don't function the same way? Definitely not shocking in the least, but all my downvotes would tell another story. I've not said anything condescending toward anyone, just dissenting from the popular rhetoric. I should change my name to Miss Unpopular. Hehe. (: Definitely not shocking in the least, but all my downvotes would tell another story. I've not said anything condescending toward anyone, just dissenting from the popular rhetoric. I should change my name to Miss Unpopular. Hehe. (:  Things != Love [Tsk tsk](http://i.imgur.com/sElddnp.jpg) LOL. Not hardly. Very happily in love. I just dont equate gifts with love. Well, some *do* equate affection with gifts. That doesn't mean that you have to agree. Well, some *do* equate affection with gifts. That doesn't mean that you have to agree. All these downvotes would suggest otherwise! Oh well. You were not downvoted for your views, you were downvoted for your presentation of them.  People hate pseudocode? It's hard to tell the meaning behind words on the internet, so a negative opinion which seems like it's presented as fact just to bring down, or change the mood sometimes falls flat. Similarly I'd assumed that equating love with getting gifts was considered a negative.  Things != Love You should read the Five Love Languages. Some people really do give and receive love by through gifts. It's not the things themselves that have meaning, but the thought and intent behind it.\n\nSo yes, things != love, but gifts most certainly can = love. Things != Love It was a spontaneous, unsolicited, rare gesture accompanied by a thoughtful card with a very personal, rarely spoken sentiment that deeply touched the recipient. Worth it. I am not opposed to gift giving. Valentine's day is not a spontaneous event. Considering the OP made it pretty clear that her father *doesn't* get her mother Valentine's Day gifts, and her mother wasn't expecting it, I'd say it counts as spontaneous on his part. Things != Love I think the word you were looking for was \"gestures.\" Gestures can equate to love.  ... That's the point. Buying flowers is a gesture. It's not the flowers themselves that made the wife happy (cos they die), it's the fact that he went out of his way to buy them for her to accompany the fact that he loved her. It's not like he threw the bouquet at her to pacify her when she was upset. Check #3 on this post:\n\nhttp://www.separatedmen.com/articles/love_languages.asp I do not see how getting someone gifts prompted by a (rather commercially driven - I think anyone can see that) holiday is notably different than buying these things to placate the person for doing something wrong. It's preemptive. Not getting them is seen as being unloved, which is wrong. Sadly that is how society seems to work. See: Christmas",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18gih6/im_so_lucky_to_have_parents_that_restore_my_faith/"
  }, {
    "id" : 43,
    "title" : "I saw something on FB today that hurt me so badly it actually made me cry and I don't know who to rant about it to because I can't tell anyone who knows me why it hurts so much.",
    "snippet" : "**DISCLAIMER**: I have to get something off my chest and I think this would be a good place to put it. My heart has been aching today and I have a lot to say. If you don't want to read a wall of text, venture no further. \n\nThis is my throwaway because a lot of people, including immediate family members know my username, and I am about to divulge personal information I have never told anyone. The only other person that knows this information is my SO. \n\nI'm 21, and I'm a junior in college. I've been dating my boyfriend for exactly 2 years and 6 months Friday. We have great, awesome sex, and a lot of it. In the early fall of 2010, when we first started dating, I lost my birth control pill pack and I ended up getting a new pack after skipping 4 pills. I got pregnant. We had been dating for two weeks when this happened, so naturally, I got an abortion. I love kids and I have wanted to be a mother since I was 5 years old. I have the names of my children all picked up and lined out. I browse /r/BabyBumps all the time because I love seeing women become mothers. Am I weird? Maybe. \n\nLong story short, it broke my heart to get an abortion. Not only because I love kids, but that I was so careless about sexual protection that it got to the point where I needed to have one. I don't regret the abortion at all, but I do regret my choices concerning protection that led up to. I think about the \"what ifs\" if I hadn't had the abortion. I think about the adorable child my boyfriend and I would have made. \n\nI was a freshman in college when I got pregnant and he was a junior. We decided to have the abortion immediately after I discovered I was pregnant. We knew that our hopes, dreams, and aspirations would go down the drain if we had not. And two years later, we are closer than ever to achieving those dreams, and still together. I couldn't be happier.\nHe now has a wonderful, wonderful job in engineering, and I am graduating early next year with a 3.8 gpa from one of the highest ranked public universities in the United States. I have a solid internship, and a job offer for when I graduate. I'm applying to grad schools in Europe, because my SO and I both have dreamed of moving to Europe since we were young. He's taking me to the Bahamas in March for my Spring break. We love life, and we are making the most of it. I am in the best shape I ever have been: I work as a spinning instructor, and I'm running a marathon in March. We share a cute apartment in city my school and his job are located in. If I had not had the abortion two years ago, *none* of this would be happening. I am so thankful I live in a country where no one can deny me access to abortion. \n\nOf course, there are some of you who would indeed carry the child full term, and either put them up for adoption, or raise them on your own. To you, I say, you are brave. I give you props for going through 9 months of judgement, stares, and ridicule, and putting your own life aside for a baby. (I am sure that not all of you did in fact get ridiculed, but that seems to be the common trend with the girls I know who are young mothers)\n\nFor me, I knew that neither of these possibilities would work. I was (and still am) not ready to be a mother. I'm still a kid! I spend my nights partying, drinking, and getting high with friends when I don't have to study, and during the summers, I work and travel as much as I can. I am an athlete, and I did not want to sacrifice my body with pregnancy, because it is impossible to bring yourself back to the point you were at before. Maybe I'm selfish, but this is my life. I couldn't bear the thought of bringing a child into this world, and giving them up for adoption as soon as they were born. I tear up just thinking of how painful that would be. I can't even imagine what it would be like to go through that, and to those of you who have, you are so brave to have gone through with that. \n\nI was browsing my facebook newsfeed, when I stumbled upon a link to [a facebook page](http://imgur.com/a/93cvc) (I've taken screen shots and uploaded them to imgur, so the link won't bring you directly to the page) one of my facebook friends shared. I was immediately confused when I saw it bore the title \"I am for women, I am for children, I am for life.\" When I read the description, my confusion turned to rage. The description is written by a male. I am not at all saying men shouldn't be allowed to have an opinion on abortion, but the campaign claims to be \"For Women\".\n\nHow can this campaign be for women if the person running it isn't even a woman? He never had to experience an abortion procedure with his own body. He never had to experience the terror and sickness one feels when sitting in a stall in dorm building's communal bathroom and staring at the little pink plus sign of the 7th stick they've pissed on to confirm their pregnancy. Maybe he has impregnated a woman who then got an abortion, but from how he worded his essay, he hasn't been. Regardless, the fact remains, until you've been impregnated at 18 years old by a 20 year old college kid you've only been with for two weeks, or until you've been any woman who has ever experienced an unwanted pregnancy for *any* reason, you can't claim your pro-life campaign is \"For Women\".\n\nCampaign away for pro-life causes, I don't care! But don't mask a freaking campaign for pro-life under women's rights and \"liberation from the choice to end a life\", because that is where I begin to have a problem with you.\n\n&gt;I guess I'm talking about this for a couple reasons. For one, the only people we hear from on this issue are women and priests. Well here is an average guy saying something now, and hoping other average guys will come out of the woodwork despite the fear of being \"that person on Facebook trying to push an agenda.\" This is not politics. My father has told me my entire life that a true man is one who takes responsibility. Men: step up and show your girlfriend, wife, family and friends that you will say something, too. A society like ours is proud to be founded upon accountability in the vain of justice. This is justice. Simply saying \"I wouldn't, but its not my place to tell others not to\" like I once did is a cop-out. There is surely a place for tolerance in our world--we all come from different backgrounds, different religions, different upbringings--but as human beings, isn't it a given that we should all take a stand for humanity? As Americans, if we see injustice, especially pertaining to life or death, we do something. Let's be courageous men and women and stand up for real and true lives being ended. If we ALL wouldn't do it ourselves, then isn't something wrong?\"\n\nMaybe the reason you *only* hear it from women is because it's an issue about the biological female's body. And guess what, I have news for you. I have never said \"I wouldn't do it, but it's not m place to tell others not to\", because I HAVE done it, and I WOULD do it again if I got pregnant at an inopportune time. This is not justice. This is an ill-informed campaign run by men to stop women from making a very personal, private, and difficult choice that the majority of human beings are lucky enough not to have to make. The only thing WRONG here is your campaign and your bold claims, sir. \n\nLove,\nAn actual post-abortion female who doesn't regret it. \n(Yeah. We exist.)\n  Liberation from choice sounds like oppression. I don't want to be liberated from making any choice, no matter what the choice. Reminds me of *The Handmaid's Tale*: \n\n&gt;There is more than one kind of freedom, said Aunt Lydia. Freedom to and freedom from. In the days of anarchy, it was freedom to. Now you are being given freedom from.  Liberation from choice sounds like oppression. I don't want to be liberated from making any choice, no matter what the choice. It sounds Orwellian. FREEDOM IS SLAVERY It sounds Orwellian. Liberation from choice sounds like oppression. I don't want to be liberated from making any choice, no matter what the choice. Liberation from choice sounds like oppression. I don't want to be liberated from making any choice, no matter what the choice. &gt;I don't want to be liberated from making any choice, no matter what the choice.\n\nThis is an absurd point-of-view. There are thousands of choices that you are punished or prohibited from making. This abortion choice was one prior to Roe v. Wade, and will probably be one again at some point in the future. You have a warped view of \"liberation\" if you think it means you get free license to do whatever you want in society without answering to the collective will of those around you. That just isn't the world we live in. Um, that's not what I think liberation means. I meant that I don't want to have any of my choices taken away from me. I have the choice to murder someone, but I make the choice not to. And yes, there was an abortion choice prior to Roe v. Wade, but it wasn't really a choice. It was hard to get an abortion, you're probably going to die from it, and it cost a fuckton of money. Seriously, that's not a choice. That's a choice taken away from me. I want the choice of a safe, clean abortion. Um, that's not what I think liberation means. I meant that I don't want to have any of my choices taken away from me. I have the choice to murder someone, but I make the choice not to. And yes, there was an abortion choice prior to Roe v. Wade, but it wasn't really a choice. It was hard to get an abortion, you're probably going to die from it, and it cost a fuckton of money. Seriously, that's not a choice. That's a choice taken away from me. I want the choice of a safe, clean abortion. \"The choice of a safe, clean abortion\" is not always going to be there, and my point is that \"flaw\" is ingrained in our system. With a more conservative court, public opinion, and a dash of judicial activism Roe v. Wade can be overturned. I don't understand the concept of these untouchable choices you think you have.  I don't think it's untouchable. I was saying that I don't want that choice to go away. I don't want to be \"liberated\" from that choice.  \"The choice of a safe, clean abortion\" is not always going to be there, and my point is that \"flaw\" is ingrained in our system. With a more conservative court, public opinion, and a dash of judicial activism Roe v. Wade can be overturned. I don't understand the concept of these untouchable choices you think you have.  \"The choice of a safe, clean abortion\" is not always going to be there\"\n\nWhy not?  Laws change, for one. Also the practical limitations. Some people live too far away from a clinic for it to be feasible. States that only have on clinic are a good example.  Why do you assume those states will not open more clinics? \n\nI see no reason laws preserving a woman's right to bodily autonomy would change to prohibit that :) Two things there: Laws are restricting abortion clinics (cutting funding, increase regulations, etc) without prohibiting the right to an abortion. Secondly, the \"right to bodily autonomy\" is a terribly fluid concept. I see no reason to believe the understanding you have of that phrase is going to be held by all future policy makers for all time. If and when abortion doesn't fall under the purview of their definition of \"autonomy\" than that \"right\" will likely disappear.  Bodily autonomy is the foundation of any other freedom. One would have to relinquish all parts of the Constitution to do so with bodily autonomy. \n\nThe restrictions on abortion clinics are being founded and funded by fundamentalist religious zealots. These zealots can and will be voted out of office and the restrictions will be withdrawn :)   Last week pro-lifers were giving free cupcakes \"Have a free cupcake, because we have one for every child that wasn't born due to abortion!\"\n\nI really want make a batch or two of cookies, brownies, and cupcakes and tell people \"Have an option, because you deserve to have a say about what is in your body!\" My school's pro-life club chalked the main campus the first week of school with pro-life messages. I can't imagine how rough it might've been for people who have had abortions or miscarriages to walk past all of it. It was in the middle of campus and unavoidable if you wanted to get basically anywhere. Luckily some pro-choice people presented counterarguments, and it rained a few days later. When I see prolife messages, unless they are derogatory and mean, I can usually ignore them. If they want to state their opinion, then fine. Do it. But when they start calling women who had abortions murderers... They better protect their heads because I am coming after them. Oh my gosh, I almost flew off the handle at one of my family members on facebook the other day. She actually had the nerve to say that anyone who's had an abortion is a bad mother! That's so much worse than calling someone a murderer in my eyes, which just seems like hyperbole. A bad mother though? That means every single woman out there who has both had a child and an abortion is not fit. \n\nWanted to stab her.  My school's pro-life club chalked the main campus the first week of school with pro-life messages. I can't imagine how rough it might've been for people who have had abortions or miscarriages to walk past all of it. It was in the middle of campus and unavoidable if you wanted to get basically anywhere. Luckily some pro-choice people presented counterarguments, and it rained a few days later. I think I'd be out there with a bucket of water and a scrub brush right behind them telling them to keep their filthy opinions to themselves.  Last week pro-lifers were giving free cupcakes \"Have a free cupcake, because we have one for every child that wasn't born due to abortion!\"\n\nI really want make a batch or two of cookies, brownies, and cupcakes and tell people \"Have an option, because you deserve to have a say about what is in your body!\" Isn't that encouraging abortion? I mean, free cup cakes!\n\n You mean that you turn abortions into cupcakes? Awesome! Isn't that encouraging abortion? I mean, free cup cakes!\n\n Last week pro-lifers were giving free cupcakes \"Have a free cupcake, because we have one for every child that wasn't born due to abortion!\"\n\nI really want make a batch or two of cookies, brownies, and cupcakes and tell people \"Have an option, because you deserve to have a say about what is in your body!\" Last week pro-lifers were giving free cupcakes \"Have a free cupcake, because we have one for every child that wasn't born due to abortion!\"\n\nI really want make a batch or two of cookies, brownies, and cupcakes and tell people \"Have an option, because you deserve to have a say about what is in your body!\" Last week pro-lifers were giving free cupcakes \"Have a free cupcake, because we have one for every child that wasn't born due to abortion!\"\n\nI really want make a batch or two of cookies, brownies, and cupcakes and tell people \"Have an option, because you deserve to have a say about what is in your body!\" That's fucked up. When I was younger, for Mother's Day, a church near my parents house put up a thousand tiny crosses in their lawn and a giant sign reading \"ONE CROSS FOR EVERY ABORTED CHILD\". I mean, I understood they were a southern baptist church, so acts like that aren't surprising, but the choice to do that on a day dedicated to moms was just really tacky and tasteless. I like to think they got a heavy backlash of criticism, because I've never seen the tiny crosses up there again.  That's fucked up. When I was younger, for Mother's Day, a church near my parents house put up a thousand tiny crosses in their lawn and a giant sign reading \"ONE CROSS FOR EVERY ABORTED CHILD\". I mean, I understood they were a southern baptist church, so acts like that aren't surprising, but the choice to do that on a day dedicated to moms was just really tacky and tasteless. I like to think they got a heavy backlash of criticism, because I've never seen the tiny crosses up there again.  Last week pro-lifers were giving free cupcakes \"Have a free cupcake, because we have one for every child that wasn't born due to abortion!\"\n\nI really want make a batch or two of cookies, brownies, and cupcakes and tell people \"Have an option, because you deserve to have a say about what is in your body!\"  This is a huge issue I have with the whole abortion debate, it criminalizes girls who have had abortions. Women who have abortions don't do it because they are mean women who hate children. And it is a traumatic experience and it stays with them forever.  This is a huge issue I have with the whole abortion debate, it criminalizes girls who have had abortions. Women who have abortions don't do it because they are mean women who hate children. And it is a traumatic experience and it stays with them forever.  Not all abortions are traumatic. Many (and I might even say MOST) experience relief. The trauma - if it comes - comes from those who stigmatize them for their decisions; not from their internal feelings on the procedure.  agreed. If a women goes as far as to get an abortion there is usually very good reason for her and the fetus but my point is that women are not unfeeling about the procedure. Pro-life people make it seem like women don't care or that they are selfish and that is not the case at all. I agree with that. Apologies if I sounded combative - I deal with these supposed \"pro life\" people often and have watched them sing \"Happy Birthday Dead Baby\" to a woman entering the clinic because her baby had died in utero and - prior to infection setting in - it needed to be removed. \n\nShe was notably devastated and we had to hold her husband back from rushing the ignorant protesters.   40 days ending March 24th? Sounds like Lent to me. He's speaking out of his religious convictions. He can have his beliefs and opinions, but I do not have to share them. Neither do you. \n\nIt is highly likely that his religious tradition also supports the supremacy of men over women (inferred from his writings) and he believes it is his duty to tell women what to do. Those kinds of people are not the ones I wish to listen to. Do not debate him. Do not give him another bit of your mind's real estate. His views will not change, and you are under no obligation to change yours. It is an impasse. Go visit the Lolcats page on facebook instead and your time will be better spent. \n\nAlso, I can't take anyone seriously who misuses the phrase \"alma mater\" to mean \"motto.\" 40 days of life is a thing. It's always when they stand outside Planned Parenthood with their signs As a Catholic, Lent is about personal devotion to God and repentance of your own sin. As a Catholic, those people suck. Planned Parenthood nearly saved me when I was a sophomore in college-and a virgin. So suck on that, anti-choice Catholics. As a Catholic, Lent is about personal devotion to God and repentance of your own sin. As a Catholic, those people suck. Planned Parenthood nearly saved me when I was a sophomore in college-and a virgin. So suck on that, anti-choice Catholics. 40 days ending March 24th? Sounds like Lent to me. He's speaking out of his religious convictions. He can have his beliefs and opinions, but I do not have to share them. Neither do you. \n\nIt is highly likely that his religious tradition also supports the supremacy of men over women (inferred from his writings) and he believes it is his duty to tell women what to do. Those kinds of people are not the ones I wish to listen to. Do not debate him. Do not give him another bit of your mind's real estate. His views will not change, and you are under no obligation to change yours. It is an impasse. Go visit the Lolcats page on facebook instead and your time will be better spent. \n\nAlso, I can't take anyone seriously who misuses the phrase \"alma mater\" to mean \"motto.\"   You know what? You sound like a fucking awesome person who I would want to be friends with if we met in real life.\n\nFuck that guy. Just be thankful the law is on our side, and let's always promise to work to keep it that way. &gt;thankful the law is on our side\n\nSo worried about how much longer this will be the case :-( I so wish that if it ever was taken away, no woman would go to work again in protest until it was changed. Ultimate protest. &gt;no woman would go to work again in protest until it was changed. \n\nThen they would win.   \"because it is impossible to bring yourself back to the point you were at before.\"\n\nOh no! Quite the opposite. I feel stronger than ever, 1.5 years after having my son. Birth was like the best and biggest workout of all time, I used muscles I didn't even know I had.\n\nJust helping to eliminate this fear for later. :) Seriously. If you have a normal pregnancy and birth, and you're not of advanced maternal age, and you continue to take care of yourself... your chances of coming out ahead are not zero. \n I guess I can't speak from experience - that is just what I have heard. I'm sorry the assumption!  People suck. I'm sorry :(  Personally, I think responding to those posts with news stories about women who had an abortion because they were expecting a non-viable fetus (maybe even some of the \"I'm not Sorry\" stories) may be the way to go some days.\n\n\nIt's pretty damn hard to say it's wrong when the mother would have been facing the knowledge her baby was going to die within minutes. Or the stories of 9 years olds who suffered major complications after having to give birth because their body wasn't developed enough.\n\n\nTLDR: anti-choice groups like to guilt women, maybe we should guilt them back?   Did you report the group and your \"friend's\" for hate speech? You can do that on facebook. =)\n\nAnd congrats on your fucking awesome life!   What about rape victims? If abortion was completely banned in the States rape victims would have to have the child. I am for all abortions for any reasons, so obviously rape would be one of the most dire reason to have one.\n\nAbortions should be legal everywhere. I couldn't imagine being raped. Let alone carrying the consequences of a rape. I agree. Plus, making an exception for rape seems like a horrible idea. I can't imagine what a rape victim would feel having to prove she was raped in order to have an abortion. So many rapes go unreported. If we want abortion to be available for rape victims, it needs be legal for any reason.  I agree. Plus, making an exception for rape seems like a horrible idea. I can't imagine what a rape victim would feel having to prove she was raped in order to have an abortion. So many rapes go unreported. If we want abortion to be available for rape victims, it needs be legal for any reason.  I agree. Plus, making an exception for rape seems like a horrible idea. I can't imagine what a rape victim would feel having to prove she was raped in order to have an abortion. So many rapes go unreported. If we want abortion to be available for rape victims, it needs be legal for any reason.  Yes. \n\nPlus those who provide exceptions for rape show that they only seek to punish women for having voluntary sex.  Oh yes! I have no desire to see any restrictions on abortion. I just think those who use \"except in the case of rape\" as a caveat don't really think that through. If someone thinks carrying a pregnancy to term after a rape is so traumatic that it justifies an exception to their otherwise pro-life stance, surely having to prove rape (and potentially not being able to do so) in order to receive an abortion is also traumatic?  Reminds me of [this](http://i.imgur.com/GArJYXk.jpg). But see, men take part in our reproduction, so they absolutely have a right to an opinion and a say. Does it mean as much? No, but that doesn't make it less valid. they get to have a say in men's reproductive rights. not a woman? no say in women's reproductive rights.  To have reproduction, you need men and women together. That's why they get a say. It doesn't count as much as a woman's when speaking directly about a woman's body, but if both have contributed it's certainly a valid opinion. so they can have a say in what to do with their bodies, just like I have the only say in what to do with my body. Men's reproductive rights end when a pregnancy happens inside of a woman. If men can figure out a way to get pregnant then they can have a say in that.  They can have a say in their birth control, like new forms of a shot that kills sperm or using condoms. They have NO 'say' whatsoever when it's another person's body at stake.\n Pregnancy doesn't necessarily mean a woman's body is \"at stake.\"\n\nIf they helped create the pregnancy, why would you ever NOT take their opinion into account about whether to continue it? I just don't understand. If you are close enough with someone to have unprotected or risky sex with them and get pregnant by them, how could you say you value their opinion so little? &gt;Pregnancy doesn't necessarily mean a woman's body is \"at stake.\"\n\nYes it does. Just because it is not always life and death doesn't mean there isn't something to sacrifice. I don't want to gain a shit ton of weight, have possible SERIOUS health complications, lose the body I worked seriously hard for, possibly have to go through life risking surgery and what is arguably the worst pain one can experience, and have saggy boobs and swollen ankles and a belly full of child for the better part of a year that I DO NOT WANT. \n\nAnd I'm not talking about being in a relationship with someone and taking their wishes into account. I'm talking about having a \"say\" in the final decision. These men want to be the ones who take the right to choose away from women completely. Sure, you can voice your opinion (\"I think you should keep the pregnancy\") but that doesn't mean you have a say.\n\nIt just means you can share your opinion. I totally and completely, 100% have the final say in what happens to my body. I may or may not take your opinion into account, depending on how much I value it (this can be anything from a one night stand to a 10 year+ marriage) The say is all mine, though. Not 50/50, not 60/40, not even 99/1 of who gets to choose what happens to my body and what medical procedure I do or do not have. It is completely up to me.\n\nIt may not be \"fair\" but neither is biology &gt; gain a shit ton of weight\n\nThirty pounds is not that much weight.\n\n&gt; possible SERIOUS health complications\n\n&gt;possibly have to go through life risking surgery\n\nPossible is why I included \"necessarily\"\n\n&gt; And I'm not talking about being in a relationship with someone and taking their wishes into account. I'm talking about having a \"say\" in the final decision.\n\nThey are essentially the same thing. If you are taking someone's opinion into account, you are factoring it into your decision. Basically, if you are with someone to the point where you could be pregnant by them, and there is any debate about continuing the pregnancy, you would be incredibly selfish to not include them in the decision.\n\nYou also mention your body and \"losing\" it. To be mature enough to have children, you have to get over it. Since you seem to not be at that point, you probably won't be making this decision any time soon. &gt;To be mature enough to have children, you have to get over it. Since you seem to not be at that point, you probably won't be making this decision any time soon.\n\nwhich is literally the reason that abortion should not be up to anyone but **me**.\n\n**I**'m not ready to be a parent and sacrifice my body   so **I** shouldn't be forced to stay pregnant. That is the point\n\nand yeah right ok 'thirty pounds is not that much weight', being pregnant isn't about getting a little chubby, don't pretend its just no big deal to be pregnant. Your body changes a LOT. And so what, because there is no guarantee there will be serious health complications means that I don't have the complete and total right to choose what my body goes through? That because there is a RISK of life threatening health problems, the actual risk for surgery (my medical history would make this almost a guarantee). It is not just \"oh you gain a little weight and then you have a baby, no big deal\"\n\nWomen go through A LOT being pregnant. Some have near constant nausea, muscle tearing (pregnancy can permanently separate the abdominal muscles, among other serious complications), possible permanent incontinence, PROBABLE tearing open of your vagina (sometimes all the way to your anus.) Possible major invasive surgery.\n\nTHe serious potential for many things to go wrong, forever. So because it's not a guarantee that there will be serious health problems means that I don't get to choose 100% what happens to my body? \n\nWhat if someone said \"hey, this is a really risky health condition that you have, and we have a safe and totally non-invasive procedure to correct it now with negligible side effects. If left untreated, this health condition will worsen, causing you to balloon up inside in your abdomen, has the serious potential to be life threatening and will either tear your genitals completely upon exiting your body or require risky invasive surgery involving cutting open your entire abdomen to remove. Someone else actually has a say in this instead of you, though, so you don't have the option of this safe procedure. Someone has already made the decision that you have to wait it out and just take whatever happens to your body.\"\n\nThese guys want to \"liberate women from the burden of making a choice\". What is that? That's wrong &gt;To be mature enough to have children, you have to get over it. Since you seem to not be at that point, you probably won't be making this decision any time soon.\n\nwhich is literally the reason that abortion should not be up to anyone but **me**.\n\n**I**'m not ready to be a parent and sacrifice my body   so **I** shouldn't be forced to stay pregnant. That is the point\n\nand yeah right ok 'thirty pounds is not that much weight', being pregnant isn't about getting a little chubby, don't pretend its just no big deal to be pregnant. Your body changes a LOT. And so what, because there is no guarantee there will be serious health complications means that I don't have the complete and total right to choose what my body goes through? That because there is a RISK of life threatening health problems, the actual risk for surgery (my medical history would make this almost a guarantee). It is not just \"oh you gain a little weight and then you have a baby, no big deal\"\n\nWomen go through A LOT being pregnant. Some have near constant nausea, muscle tearing (pregnancy can permanently separate the abdominal muscles, among other serious complications), possible permanent incontinence, PROBABLE tearing open of your vagina (sometimes all the way to your anus.) Possible major invasive surgery.\n\nTHe serious potential for many things to go wrong, forever. So because it's not a guarantee that there will be serious health problems means that I don't get to choose 100% what happens to my body? \n\nWhat if someone said \"hey, this is a really risky health condition that you have, and we have a safe and totally non-invasive procedure to correct it now with negligible side effects. If left untreated, this health condition will worsen, causing you to balloon up inside in your abdomen, has the serious potential to be life threatening and will either tear your genitals completely upon exiting your body or require risky invasive surgery involving cutting open your entire abdomen to remove. Someone else actually has a say in this instead of you, though, so you don't have the option of this safe procedure. Someone has already made the decision that you have to wait it out and just take whatever happens to your body.\"\n\nThese guys want to \"liberate women from the burden of making a choice\". What is that? That's wrong Pregnancy doesn't necessarily mean a woman's body is \"at stake.\"\n\nIf they helped create the pregnancy, why would you ever NOT take their opinion into account about whether to continue it? I just don't understand. If you are close enough with someone to have unprotected or risky sex with them and get pregnant by them, how could you say you value their opinion so little? So what you're saying is that in an ideal world, women would always consider their partner's opinion before making a decision. I don't see what that has to do with reproductive rights, though. What are the legal ramifications of your suggestion? Would we have to tell men and have them sign off on our abortions from our bodies? This is why they don't get any say in our *rights*.  \n\nDo we have to prove to the state that we discussed it with the man in question? That's all *ok* (ish) until you're dealing with a woman in an abusive relationship or who doesn't know who the father is. This gets really really messy.\n\nAnd ultimately, the choice has to belong 100% to the woman in question. Her body, her risks, her choice. Regardless of what she should do, she can make that decision completely on her own, and nobody has the right to make it for her.\n\nOh, and not all pregnancies come from intentionally unprotected or risky sex. Condoms, while useful in preventing pregnancy and disease, break or slip off and have a fairly high typical use failure rate (15%) and some women can't do hormones and can't afford or don't want IUDs. It's not like unwanted pregnancies are planned. Sorry, why does condoms only not mean risky, then?\n\nI'm not talking legal. I never once said anything about legal. I'm talking being with someone, close enough to possibly get pregnant by them, and involving them in your choice. I can't imagine just completely vetoing their opinions and taking nothing into consideration. Then if you're going to ramble on about \"rights,\" you might as well just use the word \"moral\" instead. \n\n\"It's more moral to involve the man's opinion, because...\" \n\nI think the problem here is that you're using the word \"right,\" which has a lot of legal connotations and people are assuming that you're trying to talk courts here, and you don't even seem to know what you're talking about in the first place so your responders are getting frustrated. Sorry, why does condoms only not mean risky, then?\n\nI'm not talking legal. I never once said anything about legal. I'm talking being with someone, close enough to possibly get pregnant by them, and involving them in your choice. I can't imagine just completely vetoing their opinions and taking nothing into consideration. Saying that a man should be able to voice his opinion and saying that men should have a say come off as being different things. When I here someone say something about \"He/she gets a say,\" it usually comes off as something more official than just, \"Yeah, I'll listen to them.\" That doesn't seem to be what you meant, but it's how it sounded to me.\n\nCondoms only is generally considered safe sex. Some women don't do well on hormones, so the pill is out. IUDs are expensive and also not for everyone. Doubling up with diaphragms is an option, but if you have a one night stand you may not have your specially fitted diaphragm with you.\n\nAlso, that's a 15% chance of getting pregnant in a year if you only use condoms, not a 15% chance that it won't work each time you use it. So each time you have sex is not risky, and I would call condom-only sex less risky than pill-only if you're with someone you don't know well because it also prevents STIs. Condoms aren't the most effective birth control, but they are pretty effective (nothing has like a 75% chance of pregnancy in a year I think?) and if they're used perfectly, that number goes up to something like a 5% chance of pregnancy in a year. But it's possible to use the wrong size, causing breaking or slipping, to put it on the wrong way especially if you're intoxicated, to not check the expiration dates, and so on. They aren't complicated but there are lots of ways for it to screw up, and that's what makes the failure rate so high.  I don't agree with abortion and I do think it is wrong unless under certain circumstances. This being said I'm completely for a woman have the right to have this choice. The thought of a man or a government that can tell me or any other woman what we can or can't do with our bodies terrifies me. While I disagree with your choice, I completely support your right to make that choice. :)   Thank you. Literally an hour ago I asked for storie Dom women regarding abortion. I'm thinking of it. I support my boyfriend and our 18month old daughter. I just got a promotion(not a week yet). We still live with my parents to make it easier. Tonight I found out I was pregnant. I'm terrified and considering abortion. Your view point is comforting and I want to cry. Thank you again I am so happy to help - feel free to talk to me whenever about it. It's totally up to you, whether or not you have an abortion. This is your body, your life. That is what we are talking about. It's up to you.\nI'm glad I could provide some solace in your situation.\nBest of luck, darling Honestly, I don't know what to ask. I'm terrified. Bringing a child into this world would be horrible. We can just now manage on our own. I'm lost I guess Honestly, I don't know what to ask. I'm terrified. Bringing a child into this world would be horrible. We can just now manage on our own. I'm lost I guess You should choose what REALISTICALLY seems like the best option for your lives right now. You not only have yourselves to consider but your other child as well.\n\nAnd while you're deliberating and after this pregnancy you need to SERIOUSLY re-evaluate your birth control choices. two unplanned pregnancies in 2 years is not so much working Funny thing is, my birth control is sitting next to me. I had to wait until my next period to try this one out. But thank you  Maybe men should step up and use a condom if they're not ready to be a father. That would truly be taking responsibility.\n\nTrying to take responsibility for someone else's body and choices isn't responsibility; it's oppression.   I don't think that men shouldn't have a say in reproductive issues, or even women's issues. My dad is probably the most vocal feminist I know. He is very well versed in women's issues and is the biggest cheerleader for women's rights, both reproductive and elsewhere. I do not consider his contribution to the equality movement to be less important because he is a man. \n\nI should be clear that I do not agree with this particular facebook group nor the man that runs it, but I don't think it really matters that he's a man. I don't agree with him, I don't like the group, but I could care less that he's a guy. \n\nedit: a few spelling errors :) My dad is also a huge feminist. I have no problems with men advocating for women's rights. My issue is that the man in the article stays he wants to \"liberate women\" from the choice to kill. He just comes off as very chauvinistic. But I completely understand and agree with you point. :)    I don't see what's wrong with a man being against abortion.. if that's what you are upset about. \nIf he was posing as a woman.. then yes that's weird and creepy. But if he's just giving him thoughts on the matter I don't see anything wrong with it. \nAbortion IS a big topic. It's not black and white. I specified that I didn't think there was anything wrong with it. I'm angry that he thinks that abortions are an \"injustice\" and men must guide women to the \"right path\" which, in his case, is completely anti abortion.  What if instead it were a Facebook page of straight people who are standing up \"for gay rights\"? Just because someone isn't gay, does that mean they can't fight for their gay friends and family? You may not agree with this guy's opinion, but he definitely has the right to stand in solidarity with women who believe the same way he does. However, perhaps it would have been more correct for him to say that he stands with pro-life women, not women in general. What if it instead were a Facebook page of straight people who say it's \"to protect gay people\" by prohibiting gay sex and marriage equality?\n\nFTFY. No, a more proper analogy from that side of the fence would be to \"stand with gay conservatives\" who are against gay marriage, or something like that. Maybe that's the argument I should have used at first, as ridiculous as it is. The point is to support someone affected by an issue who has the same stance as you, in solidarity. What if instead it were a Facebook page of straight people who are standing up \"for gay rights\"? Just because someone isn't gay, does that mean they can't fight for their gay friends and family? You may not agree with this guy's opinion, but he definitely has the right to stand in solidarity with women who believe the same way he does. However, perhaps it would have been more correct for him to say that he stands with pro-life women, not women in general. I think the difference is that straight people supporting gay rights are giving the right to choose, and equality, to people who are in situations they can never truly understand, with the understanding that as they cannot ever be in that situation, it would be ignorant of them to make that decision for someone else. As a man against abortion, he is taking the right to choose away from someone in a situation he will never truly understand or experience, with the assumption he does understand. When it's obvious he does not, and he never will.  But men do have the option to support women in their choice. From what I  get out of his essay, this guy isn't saying he wants to tell women what to do with their bodies, but instead wants to support their pro-life stance. Although this guy only wants to support women who choose to keep the fetus, I'm still arguing that men should be able to support women's choices - emphasis on the men believing it's the *woman's* choice. What if instead it were a Facebook page of straight people who are standing up \"for gay rights\"? Just because someone isn't gay, does that mean they can't fight for their gay friends and family? You may not agree with this guy's opinion, but he definitely has the right to stand in solidarity with women who believe the same way he does. However, perhaps it would have been more correct for him to say that he stands with pro-life women, not women in general.  \"How can this campaign be for women if the person running it isn't even a woman?\"\n\nBecause this man cares about women. Saying that is as sexist and hurtful as saying something like \"How can you care about/donate to the cure for testicular cancer? You aren't even a man.\" or \"How can you be a feminist, you are a man. You don't know our problems\".\n\nKeep in mind that a HUGE amount of women have NOT either had an abortion now been in a communal bathroom freaking out over a pregnancy. Those women should still be able to speak up for a womans right to choice on pregnancy. Watch your words.\n If he cared he wouldn't write that.  You can't compare that to a women supporting testicular cancer or a man's issue.  The only way you can draw a parallel (and at a stretch) is to say that we women who care for men can't allow them to sever their cancerous nuts because they hold the seed to life and we women are 'for LIFE' and we need those nuts for the sperms to fill uterus.  Now that sounds retarded huh?\n\nMen can care about women and he can support pro-life but suggesting that what is is doing is for the better of women is wrong - that is what she is saying; she even stated that she does not care if a man wants to be prolife but to state that men need to stand up to women who want to have an abortion to be 'for LIFE' is not caring for women.  It is despicable and controlling. If he cares for women, he wont be making a campaign to disallow her decision in regarding her bodily health.\n Thank you for explaining your position more clearly. \n\nYou are, however, basing your \"if he cared he wouldn't write that\" from a completely biased standpoint. You can't simply assert how a person feels or what he wants. Ever. Also, you assume that forcing a woman to keep a baby is not caring for her. You disagree with him. I disagree with him. Not everyone does, but a lot of people do. There's no way to say on this issue; it is completely a matter of opinion. You could, however, if you wanted to, say this if he cared for women *such as me* then he wouldn't say that. But you cannot assert that he is wrong on an opinion of his. Your previous argument is logically flawed. I do believe he could honestly feel that he cares and what he is doing is for the better of women from his point of view but it is horribly misguided for the vast and overwhelming majority of people.   The pro-choice side also commonly take the position that they are \"pro-woman\". There are many women on both sides of the abortion debate, deciding that all women are on your side is dishonest.  I don't care if you think abortion is fine, but do you really have to brag about all your achievements?\n\nHaha, maybe I'm just jealous because I don't think I can juggle academics, social activity, athletics, work, and travelling as well as you can. Any tips on that? I know this isn't strictly related to the point of this thread, but still...",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18gorr/i_saw_something_on_fb_today_that_hurt_me_so_badly/"
  }, {
    "id" : 44,
    "title" : "Looking for a durable toy...",
    "snippet" : "Looking for the [\"Silver Bullet\"](http://i.imgur.com/vwGHp41.jpg) type. Have gone through two already. Anyone know of a more durable brand?      ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18jiad/looking_for_a_durable_toy/"
  }, {
    "id" : 45,
    "title" : "Sometimes I think I may have been born in the wrong decade...",
    "snippet" : "....so, I am all too quickly approaching my 34th birthday and have suddenly found myself single after ending a three year relationship with a great guy who just wasn't \"the one\". I want a family, to be a mother, more than anything. However; in this day and age that is not enough. I need to also find a career and not just a job. All I  really want is to be a mother, a housewife. I am reluctant to admit this and rarely tell anyone of my desire because then I am not a modern woman. Does anyone out there feel the same way?       I ALWAYS feel this way.  Sometimes I feel judged for wanting to be a SAHM or people ask if I'm just lazy and don't want to work.  But I've always wanted to be a soccer mom, on the PTA, Girl Scout leader (but no Boy Scouts until they allow gays) and my friends think I'm crazy.  I can't help it, I want what I want.  I like taking care of people.  I do it for my friends and family.  I want to do it for my future husband and kids. People who think stay at home parents are lazy have never been stay at home parents.   I like feeling like I contribute to the household. Actually, I like being the \"breadwinner\" while my husband finishes some weekend classes to get a better job. But you better believe when he gets his new job that will replace both our incomes I will quit my job and stay with my son. \nI never thought I'd want to be a sahm until I had my son two years ago. The first time I dropped him off and had to go back to work I cried the whole way there. I am very fortunate that my MIL keeps him throughout the week, but it still kills me. It hurts that he runs to her , though I'm glad he's happy and with someone that loves him. But that's not enough. I don't want him raised by someone other than me. I don't want him to ever think that I put anything but him first in my life. \nThere will always be people that don't understand why you want to stay at home but they don't matter. It is ok to desire being a full time mom, I promise! If it makes you feel any better, I stayed with my grandmother growing up as well (pretty much until I was 16 and could drive!) and I never felt like she was raising me instead of my parents. There were a couple times growing up when I was jealous of my friends with SAHMs, like when I would forget something for school at home, but as I grew up I appreciated that we had extra money for vacations and allowances and college. If you are able to stay with him that's great but I promise as long as you make time for his important events like my parents did he won't feel like you put work ahead of him :)     [deleted]  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18i95e/sometimes_i_think_i_may_have_been_born_in_the/"
  }, {
    "id" : 46,
    "title" : "Period Question.... ",
    "snippet" : "Sorry if possibly TMI. I started my period last Tuesday. It is now Thursday of the next week. It started and has been exceptionally light the entire time. For the first week it was super dark brown like you would get at the end of your period. The past two days it is still light but red like normal. \n\nThis is the first abnormal period I have ever  had. I am 31. I also have not been to the GYN in 2 years possibly 3 at least. I am not even sure if they will still take me as a patient. \n\nI am not on birth control (I am a lesbian) and no sex within the past month. Same partner for the past 10 years.\n\nShould I be concerned? I am making a GYN appt for my GF and I but should I be more insistent about how soon? It will be at least 6 months before the will see us.  Wait - why won't your gyno see you for 6 months? It sounds like you need to get a new doctor.\n\nHaving your period for a week and a half is not great and you should definitely consult a doctor about it, but if the flow is light it's probably not a medical emergency either. Our previous Gyn moved to another practice. First available appt. is six months from now. They don't seem to think it is an emergency so we get to wait.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18it3a/period_question/"
  }, {
    "id" : 47,
    "title" : "2X, what are your hobbies? I'm looking for something do to with my spare time that doesn't involve a screen.",
    "snippet" : "Mostly what I do with my time now is reddit and Netflix. Clearly I need to step away from the computer. I'd also like something that can be solitary. Not in a, \"I hate people, just leave me alone,\" kind of way; but in a \"It's 8pm on a week night, already in my pjs, and I don't want to watch more TV,\" kind of way.\n\nSomething crafty maybe? I wandered around Michael's for a bit to get ideas but the the only thing that really caught my eye was the polymer clay. I like the idea of creating nice things that I can give as gifts or keep for myself.\n\nBut I also don't have much spare money, and crafty things have the potential to get expensive. What do you guys do for fun that doesn't involve the computer or TV?  Cmon over to /r/crochet ! ...or any other crafty subreddit.\nAlternatively, what about starting an evening yoga routine? Put on some music you like, and start winding down. But clay sounds like a good idea too. \nWhen I get bored I like to find ways to make everyday life less monotonous, like trying a new recipe. Or sometimes I take an old blouse or shirt and try to figure out a way to revamp it. For example, I recently put some bright new buttons on an old button down. \nMaybe start a sketch diary? Spend an hour a night drawing or doodling or cartooning your thoughts. \nMaybe try falling in love with a new author-- for some awesome 2x style humor, check out Dorothy Parker.  r/crochet? Come join us two needlers at r/knitting! ; ) Cmon over to /r/crochet ! ...or any other crafty subreddit.\nAlternatively, what about starting an evening yoga routine? Put on some music you like, and start winding down. But clay sounds like a good idea too. \nWhen I get bored I like to find ways to make everyday life less monotonous, like trying a new recipe. Or sometimes I take an old blouse or shirt and try to figure out a way to revamp it. For example, I recently put some bright new buttons on an old button down. \nMaybe start a sketch diary? Spend an hour a night drawing or doodling or cartooning your thoughts. \nMaybe try falling in love with a new author-- for some awesome 2x style humor, check out Dorothy Parker.   I cross stitch. It sounds like a granny thing to do, but I'm currently working on this [Pikachu](http://fc01.deviantart.net/fs71/f/2011/013/b/3/pikachu_cross_stitch_pattern_by_saber4734-d371pve.png) pattern. I find the discord between subject matter and the medium to be particularly fun. \n\nI also read a lot. There are whole worlds out there to explore not in front of a screen, if you want to! I cross stitch. It sounds like a granny thing to do, but I'm currently working on this [Pikachu](http://fc01.deviantart.net/fs71/f/2011/013/b/3/pikachu_cross_stitch_pattern_by_saber4734-d371pve.png) pattern. I find the discord between subject matter and the medium to be particularly fun. \n\nI also read a lot. There are whole worlds out there to explore not in front of a screen, if you want to! I used to cross stitch all the time but I never knew what to do with what I cross stiched.  I wish that we all still carried hankies that were embroidered.    You will one day curse my name if you actually get into it but quilting. It's an addictive hobby, one day you will have hundreds of pieces of fabric scattered everywhere and wonder \"how did it come to this\". However it's also super fun. You managed to catch me at a good time as I was actually looking up some beginner projects for a friend. http://www.modabakeshop.com/2012/04/happy-weekender-quilt.html#more That's an ambitious first project but defiantly doable, especially if you have sewed at all before. Also come join us on /r/quilting oh. my. god. I need to figure out how to use a sewing machine. oh. my. god. I need to figure out how to use a sewing machine.  I spend a lot of my free time keeping up with my health and fitness. I love cooking healthy food and eating well. I also spend time every day working out - running and lifting, snowboarding on the weekends, and field hockey during the season. Most of these can either be solitary or social activities :) That's great that you find fitness to be enjoyable, but I have never liked things such as running and lifting weights. I cook and eat relatively healthy because that's what's best for my body and bank account, but health and fitness is not something I would classify as \"fun.\" And a lot of those types of activities are hard to fit in when you have a spare hour. But, I do go ballroom dancing on a regular basis, and I enjoy taking a nice stroll. Keep looking! Once you find one thing you enjoy, you'll begin to get into the endorphin high and they will all seem fun. This has not remotely been my experience, and I've tried a lot of things.  The handful I enjoyed did not result in my suddenly liking everything else. Keep looking! Once you find one thing you enjoy, you'll begin to get into the endorphin high and they will all seem fun. That's great that you find fitness to be enjoyable, but I have never liked things such as running and lifting weights. I cook and eat relatively healthy because that's what's best for my body and bank account, but health and fitness is not something I would classify as \"fun.\" And a lot of those types of activities are hard to fit in when you have a spare hour. But, I do go ballroom dancing on a regular basis, and I enjoy taking a nice stroll. That's great that you find fitness to be enjoyable, but I have never liked things such as running and lifting weights. I cook and eat relatively healthy because that's what's best for my body and bank account, but health and fitness is not something I would classify as \"fun.\" And a lot of those types of activities are hard to fit in when you have a spare hour. But, I do go ballroom dancing on a regular basis, and I enjoy taking a nice stroll. That's great that you find fitness to be enjoyable, but I have never liked things such as running and lifting weights. I cook and eat relatively healthy because that's what's best for my body and bank account, but health and fitness is not something I would classify as \"fun.\" And a lot of those types of activities are hard to fit in when you have a spare hour. But, I do go ballroom dancing on a regular basis, and I enjoy taking a nice stroll.   I paint! I love it! I started out being terrible at it, but I've managed to keep at it for about 5 years now, and I like to think I've gotten better. I can sometimes spend hours sitting working on a painting when I'm in the mood. It's not actually that expensive either. Just get some medium quality brushes and some student quality paint (acrylics and water color are cheaper than oil). Canvas is on sale plenty of times during the year at Michaels usually for buy one get one free, but all you need is a bottle of gesso and some cardboard to make a canvas for acrylic or oil paintings. Painting is the only hobby that has ever stuck with me. (I know how to play flute, cross stitch, make bead animals, play violin, play soccer, and occasionally volunteer at the local shelter!) but painting is what I do now and it's great.  I love to paint abstracts. I'm terrible at painting realism, but smearing paint around is just to satisfying.   I do animals, but in bright colors in weird spaces with lots of splattering. And color. Did I mention color? (I like colors.) can we see? can we see? I do animals, but in bright colors in weird spaces with lots of splattering. And color. Did I mention color? (I like colors.) Its sounds like a lot of fun, and very expressive! Maybe one day you will share with 2x.  I paint! I love it! I started out being terrible at it, but I've managed to keep at it for about 5 years now, and I like to think I've gotten better. I can sometimes spend hours sitting working on a painting when I'm in the mood. It's not actually that expensive either. Just get some medium quality brushes and some student quality paint (acrylics and water color are cheaper than oil). Canvas is on sale plenty of times during the year at Michaels usually for buy one get one free, but all you need is a bottle of gesso and some cardboard to make a canvas for acrylic or oil paintings. Painting is the only hobby that has ever stuck with me. (I know how to play flute, cross stitch, make bead animals, play violin, play soccer, and occasionally volunteer at the local shelter!) but painting is what I do now and it's great.  Skip canvas, buy pads or blocks of 200-300 lb. Paper I just use card board from boxes. Girl Scout cookie boxes, amazon shipping boxes, whatever cardboard comes my way. Then I just put gesso on it and I'm good to go. I only buy premade canvas when there's a good sale. :D  I've recently started playing with paracord (parachute cord) that sees use in bracelets, wraps, and just about anything you can come up with. Consider it a more utilitarian macrame. 100 ft runs about $8 near me. That should be good for 5-10 bracelets depending on complexity. You won't get away from the screen right away, as the best resources are on youtube. If you enjoy knots and braiding, you'll have a good time with it. This seems like an idea I could go for. Where do you buy paracord (besides online)? Michael's had some paracord stuff, but it was already in bracelet form. And do you have ideas for interesting projects? I'm not really a bracelet person, but I googled a little and saw a project to make a belt, which was cool.            I knit and I read, mostly, although admittedly I usually do the first one while watching Netflix but at least then I feel productive with my TV time. It's also more relaxing on the eyes. I find that after a day at work on the computer, I don't want to come home and look at the computer unless it's to watch a movie out of the corner of my eye. Knitting is relaxing, fun, and you can make anything you want exactly how you want it.\n\nNo matter what you decide, crafting on a budget is doable, especially since you're near a Michael's. *Never buy anything full price at one of those stores.* Watch for coupons in the paper, sign up for the email lists, get them in the mail if you can. (I know Jo-Ann's has a mailing list, but I don't know about the rest.) Jo-Ann's, at least, even accepts competitor coupons. Wait for sales and use those coupons and you won't break the bank. The nice thing about knitting (or crochet) is that you've spent the money to (usually) create something somewhat utilitarian. I wear things I make and people I give things to wear them, too. It's great fun to give someone exactly what they want to their exact specifications and see them wear the heck out of it.  Audiobooks!!!  They have revolutionized my knitting time.  Oh, I absolutely love audiobooks, but I use them as workout motivation. I won't let myself continue my book unless I'm exercising. Nothing makes me get on a treadmill faster than being able to listen to the next chapter.\n\nWhat usually ends up happening is I sit with my boyfriend while he's playing video games and knit to keep myself occupied. Then, I keep knitting while we catch up on our TV. I got a ton of a project done while we were marathoning House of Cards last weekend. Great show! I'm only 3 episodes in, but its so good!     I love nail art, I can spend hours on it! Check out /r/RedditLaqueristas for some inspiration :D This was going to me by suggestion too!! I have been doing it for going on 2 years now- my nails are short i can't seem to grow them out long, and sometimes my art isn't quite pintrest material but it's fun and i love it. bonus, i can still watch tv if it's not something that needs full attention. i painted my nails through the entire Big Bang series last month! :D From what I read in a magazine the other week short, natural shape nails are actually very fashionable at the moment, so don't feel bad about yours! I love nail art, I can spend hours on it! Check out /r/RedditLaqueristas for some inspiration :D This is not a cheap hobby at all.  OP, if you do this, try hard not to get sucked into polish hoarding.  Since October my polish stash has exploded from around 25 bottles to over 300.  O.o To start off you can buy a few nice sets, they aren't very expensive, I got a 48 Kleancolor set for my birthday last year and I love them! [This is](http://www.amazon.com/Emori-TM-Vibrant-Lacquer-Metallic/dp/B00A11RCGI/ref=sr_1_7?s=beauty&amp;ie=UTF8&amp;qid=1360869158&amp;sr=1-7&amp;keywords=nail+polish+set) the next set I want to buy, don't know how their quality is but the colours look very pretty and the reviews are good :D\n\nBut yes I spent way too much money on this as well... got stamping plaits, nail art brushes, some fancy nail polishes, dotting tools ;_;  Flocking powder, striping tape, caviar beads, decals, cuticle oil, industrial sized bottles of acetone.... :/                       i shoot paper.  it's very expensive.  sometimes i wish i didn't love it as much as i do. you... what now?  i go target shooting.  it's fun.  it's also relaxing and a great stress reliever.  forces me to focus on what i'm doing and turn off all the crap in my brain that stresses me out. oooh cool! Yeah that is a good one!                   I have adult coloring books - not adult as in NSFW, but [more like this](http://www.amazon.com/Creative-Flower-Fashion-Fantasies-Coloring/dp/0486498638) and I color them with colored pencils. They sell them at Michael's and there's lots of different ones. I also play video games, I read, I knit here and there, and I recently dug out my flute from my years in band and I've gotten into printing sheet music and practicing new pieces. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18hb5g/2x_what_are_your_hobbies_im_looking_for_something/"
  }, {
    "id" : 48,
    "title" : "Girl hate (short rant)",
    "snippet" : "I gew up with a sister three years younger than me. We look alike, but we couldn't be more different: I was lazy in school but always managed to get by, she was motivated and studied. I played with boys, she had girl friends. I didn't care much for my appearance, she loved styling. I hate shopping, she loves it. She loves frills and dresses, and I preferred jeans and a t-shirt.\n\nMy mom always joked about raising three boys and one daughter instead of two and two, and through puberty, I felt the same. I didn't rebel much, my sister threw fits and tantrums, and I assumed that girly=bitchy, dense and only caring about looks. Whenever I wore 'feminine' clothing, I felt uneasy, though it never stopped me from wearing it. I was \"one of the boys\", not like \"most girls\", the usual blabla. Not saying I wasn't friends with girls, I liked them although I thought caring so much about looks was stupid, but people are after all different.\n\nI have changed much since then: I have started dying my hair in bright colours, I wear skirts and blouses more often, I put on make-up occasionally. And recently I talked to my mom about my sister, and she said: \"She's such a girl. I'm so glad you're not!\" I replied: \"Mom, I'm a girl, too...\" \"Well, but not a real girl!\"\n\nI realized that this was where my attitude came from. I'm working to change on it, and although I still think that if you're spending an hour in the bathroom on a weekday, you're doing it wrong, but I just wanted to vent.\n\n**TL;DR:** Even feminist, liberal moms can spread girl hate.  It sounds like this was just your moms misguided attempt to try and make you feel comfortable with yourself. It sounds like she meant to say \"not girly\" instead of \"not a girl\"\n\nWhat do you mean by \"if you spend an hour in the bathroom on a weekday you're doing it wrong\"? I know it probably was! I guess I'm just coming into the age where I realise that my mom is not the 'superhero' I thought she was.\n\nWhat I meant was: I don't need an hour on a weekday, I take a quick shower, slap on some make-up, that's it. But I guess some people just like to take longer or do more complicated things in there. it takes me like half an hour alone just to dry my hair because it's super long\n\nmoisturize, make up, dry my hair, clothes, take off my clothes and try again, find out there's a weird crusty stain on my pants, put on different pants, floof my hair and put hairspray in it, mascara mascara lip balm and it's already been an hour and all I'm wearing is mascara and foundation and regular not crusty pants I no longer bother trying to dry my hair. Sometimes I blow-dry it for ten minutes and just let it unstyled. Works if you're okay with ponytails, braids or just 'natural' hair, and if I go out I wash my hair in the morning, let it dry over the day and just style it in the evening. I'm a lazy person, I guess. :D I no longer bother trying to dry my hair. Sometimes I blow-dry it for ten minutes and just let it unstyled. Works if you're okay with ponytails, braids or just 'natural' hair, and if I go out I wash my hair in the morning, let it dry over the day and just style it in the evening. I'm a lazy person, I guess. :D It sounds like this was just your moms misguided attempt to try and make you feel comfortable with yourself. It sounds like she meant to say \"not girly\" instead of \"not a girl\"\n\nWhat do you mean by \"if you spend an hour in the bathroom on a weekday you're doing it wrong\"? OP's mom was misguided to support her interests and attitude? No, OP's mom was misguided to characterize her as \"not a real girl\" in her presumably well-intentioned efforts to support OP's interests and attitude.\n\nIt's great to be glad about who your kids are. If they identify as female, though, it's not so great to tell them they're not \"really\" female. It's not so great for the daughter's development of a healthy gender identity, and it's also not so great for any females anywhere if \"real girl\" always equates to \"bitchy, dense, and only caring about looks\".  I'm glad you're able to examine your beliefs in this way! However, remember that girls who spend an hour in the bathroom on a weekday are doing it because they want to. I do my makeup to de-stress and when I can get an hour to myself, I really enjoy playing around with different looks and wearing my art on my face. What's wrong with that? It's okay to take long.... except when it's a weekday and everybody else has to get ready as well! Thankfully my parents re-did the house recently and had a second bathroom built. No more bathroom queues!   I kind of went through a girl-hate phase for a bit in high school. I loved my girl friends dearly, but didn't like \"normal\" girls (I had bright red hair and wore mismatched clothes so I thought I was pretty special and had the \"I'm so different\" attitude even though almost everyone in the 90s was exactly like that). I'm pretty sure the hate stemmed from my dad one day showing me a picture of his friend's daughter, who was a pretty cheerleader, and saying to me \"This is what a girl is supposed to look like\", so I kind of hated anyone pretty and \"normal\" looking for a while after that.  ...But I like my excessively long, hot showers because water is included in my rent. =(. Oh, I love hot showers too! My own shower is just way too uncomfortable to be in for long. :(     I think a lot of trans guys would probably love to have your mom.  I think a lot of trans guys would probably love to have your mom. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/18h8av/girl_hate_short_rant/"
  }, {
    "id" : 49,
    "title" : "This is so screwed up (How The Biggest Loser is bad 4 people)",
    "snippet" : "  That type of psychological abuse she mentions is very similar to my high school track coach ran practice. He would make you run until many of us had passed out or vomited during workouts. He would also say that we were doing more sets of whatever than he intended us to do so it would look like he was letting us off easy. He told stories about one kid who would run a mile vom behind a tree (point to the tree the kid used to vomit near), go back to the track and keep running like it was some sort of thing to aspire to. It's sort of Stockholm Syndrome but for coaching. \n\nThe dehydration thing is something rowers and boxers do frequently but to a lesser degree of severity to meet weight ranges. I remember having cut weight (see: didn't eat enough fucking food) myself at one point to meet the weight test for the girls pole vault pole that the school owned. \n\nThe way they treated the lady with the doctor's note reminded me a lot of my own career of injuries that I kept playing on. I tore a muscle so bad I couldn't walk and wound up in the ER after practice and was on crutches for 2 weeks. I went back to running right after that, because pole vaulting dammit. I also broke my toe (unrelated dumbass award), pulled my achilles tendons from over training to the point of not being able to walk and went to the ER during class, and got horrible shin splints. If I wasn't on crutches for it, I was running on it. I also had pretty bad environmental asthma and would pass out every time we did a gauntlet. \n\nMy legs are just now fully recovering at 22, almost 23 from some of these shitty injuries I got. All of which could have been avoided by not overtraining and being more aware of \"if it hurts slow down/stop, don't power through\". Now I think I finally have a healthy outlook on exercise, I bike a lot, walk everywhere (city dweller), do yoga and bodyweight strength exercises at my own pace. \n\nIf they're ripping people up like that, especially if they have no prior fitness training... they're fucking them up for decades, particularly if they're older. It's really fucking irresponsible. \n\nTL;DR: I am triggered with fist shaking rage.   Not only is Biggest Loser bad for the contestants, it's bad for people.  Contestants get angry if they only lose like five pounds one week or lose like 20lbs in one week.  This is completely unrealistic for most people and very unhealthy.  Permanent weight loss is better at a slow and steady pace for around 0.5-2lbs per week.  Also, the BL also promotes unhealthy and expensive processed food that are necessary for weight loss.  \n\nThat being said, I like Jillian Michaels when she's not on BL.  She has a great podcast and really helps people address the emotional issues of weight loss.  I belong to her website (because she has great meal plans and my RD kept trying to sell me this like MEDIFAST diet) and she has daily journals where you are supposed to write about your day, etc.  And there are also worksheets that help you address your issues (if you're like me, you probably have a ton) that might be associated with your weight.  Plus her workouts kick my booty.   The trainers are encouraging it, the film crew is filming it, the editors are editing it. How do you get so many shitty people into one place at once? Reality TV, it's a shitty blackhole that sucks in shitty people to form a shitty singularity. [I liked your quote so much I glamorized it.](http://i.imgur.com/3ofiBhI.jpg)   It's very disturbing and disgusting how they warp body image and glamorize unhealthy weight loss. Not to mention practically *torturing* people. I'm all for people wanting to be healthy but honestly, weight loss doesn't work and in the long run you'll probably put on more weight than what you started with. It's a big sham by diet companies and it really saddens me. I don't know how anyone can call TBL \"reality\".  &gt;weight loss doesn't work and in the long run you'll probably put on more weight than what you started with\n\nThis isn't really correct. *Dieting*, especially fad dieting, will make you almost invariably gain weight back. If you just \"diet\" and don't actually move to a healthier lifestyle, you'll gain the weight back. As *soon* as you stop the diet, you tend to revert back to your normal lifestyle and obviously gain weight at the same rate you did before. If your weight was at a plateau before, then you are more likely to not gain it back. \n\nHowever, this only applies to *dieting*. Weight loss can and will \"stick\", it honestly just depends on how far you go with it. Most studies I've heard pretty much say just that: fad dieting, normal dieting, etc. just doesn't work. That does *not* mean that weight loss does not work. \n\nDiets don't require a lifestyle change. More often than not, you just change *what* you're eating. The best, healthiest way to take in less excess calories through food is by lessening your portion sizes and varying the type of food you eat. \n\nFad diets, and indeed most diets in general, completely ignore this. That is why they don't work. If you lose weight from dieting, and you were gaining weight before dieting, you're going to gain the weight back as soon as you go back to the diet you had before. Simple as that. However, if you adjust your portion sizes (to **healthy** sizes, not small sizes) and start changing what types of foods you eat, your health will improve, and if you do it for long enough, you'll probably lose a good amount of weight. And because you lost that weight due to a gradual, healthy change in your lifestyle, you're likely to keep it off. \n\nThis isn't taking into account exercise, which will obviously burn calories and does (in varying degrees) improve your metabolism. Because this conversation should be about health and not about weight, though, exercise is vital to your physical well-being. If you're going to diet to replace an exercise regime, don't just diet harder! Increase your activeness. \"Take the stairs!\" is really tired advice, but it exemplifies a part of weight loss that a lot of people just don't seem to take seriously. \n\nOur bodies are very malleable. It is very possible to lose weight and not gain it back. It takes some effort, but that shouldn't make people feel like it's out of reach, and literally saying \"weight loss doesn't work\" is misleading and adds to a lot of the confusion surrounding weight loss. I'm sure you've heard this a hundred times, but while the body is a complex thing, you can boil down weight gain to \"the amount of excess calories consumed is directly proportional to the amount of calories stored\" and \"the amount of calories burned is inversely proportional to the amount of calories stored.\"  &gt;you just change what you're eating\n\n&gt;lessening your portion sizes and varying the type of food you eat.\n\nI don't understand what you're saying. A diet can be all of these things.\n\n&gt;If you just \"diet\" and don't actually move to a healthier lifestyle\n\nYou're presenting a false dilema I think darklettermen is using the word *diet* in a way that means \"temporary, finite, eating plan for losing weight\" and the phrase *lifestyle change* in a way that means \"making your eating habits healthier for the rest of your life to lose weight and keep it off\". &gt;you just change what you're eating\n\n&gt;lessening your portion sizes and varying the type of food you eat.\n\nI don't understand what you're saying. A diet can be all of these things.\n\n&gt;If you just \"diet\" and don't actually move to a healthier lifestyle\n\nYou're presenting a false dilema It's very disturbing and disgusting how they warp body image and glamorize unhealthy weight loss. Not to mention practically *torturing* people. I'm all for people wanting to be healthy but honestly, weight loss doesn't work and in the long run you'll probably put on more weight than what you started with. It's a big sham by diet companies and it really saddens me. I don't know how anyone can call TBL \"reality\".    Someone did an [AMA a while back](http://www.reddit.com/r/IAmA/comments/zakkz/i_ama_former_biggest_loser_contestant_who_would/) about his experience on the Biggest Loser. He enjoyed his experience and would do it again. \n\n\nThere seems to be mixed feeling towards the show. It's a quick way to loose weight, but not the way to live. If you read the AMA, he says they did 6 hours of exercise a day, and the contestants controlled their diet and usually ate around 1500 calories a day. He also denies any dehydration rumors.",
    "url" : "http://www.bodylovewellness.com/2010/06/23/kai-hibbard-biggest-loser-finalist-part-3-of-3/"
  } ],
  "processing-time-source" : 53,
  "processing-result.title" : "twoxchromosomes15_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/home/ciara/Documents/programming/cs467/rtopics/r-topics/carrot2-cli-3.6.2/../data/twoxchromosomes15_reddit.xml"
  }
}