{
  "processing-time-total" : 2095,
  "clusters" : [ {
    "id" : 0,
    "size" : 11,
    "score" : 34.84674555831252,
    "phrases" : [ "Husband" ],
    "documents" : [ 5, 12, 16, 18, 22, 24, 37, 43, 44, 45, 46 ],
    "attributes" : {
      "score" : 34.84674555831252
    }
  }, {
    "id" : 1,
    "size" : 8,
    "score" : 48.73291681792684,
    "phrases" : [ "Boyfriend Lives there and your Friend Lives" ],
    "documents" : [ 12, 17, 19, 27, 41, 42, 43, 47 ],
    "attributes" : {
      "score" : 48.73291681792684
    }
  }, {
    "id" : 2,
    "size" : 7,
    "score" : 56.151085297257545,
    "phrases" : [ "Foods to Eat" ],
    "documents" : [ 0, 7, 28, 34, 41, 43, 47 ],
    "attributes" : {
      "score" : 56.151085297257545
    }
  }, {
    "id" : 3,
    "size" : 6,
    "score" : 37.76541641229109,
    "phrases" : [ "Awkward" ],
    "documents" : [ 5, 12, 40, 42, 47, 49 ],
    "attributes" : {
      "score" : 37.76541641229109
    }
  }, {
    "id" : 4,
    "size" : 6,
    "score" : 35.956588531753454,
    "phrases" : [ "Lost my whole Family" ],
    "documents" : [ 7, 18, 24, 27, 33, 43 ],
    "attributes" : {
      "score" : 35.956588531753454
    }
  }, {
    "id" : 5,
    "size" : 5,
    "score" : 78.29462917101716,
    "phrases" : [ "Amazing Relationship" ],
    "documents" : [ 12, 15, 34, 41, 47 ],
    "attributes" : {
      "score" : 78.29462917101716
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 43.07676240120014,
    "phrases" : [ "Feel Horribly" ],
    "documents" : [ 0, 5, 9, 33, 41 ],
    "attributes" : {
      "score" : 43.07676240120014
    }
  }, {
    "id" : 7,
    "size" : 5,
    "score" : 109.43905803111976,
    "phrases" : [ "Hate my Body" ],
    "documents" : [ 16, 27, 34, 44, 47 ],
    "attributes" : {
      "score" : 109.43905803111976
    }
  }, {
    "id" : 8,
    "size" : 5,
    "score" : 34.02668026907949,
    "phrases" : [ "Tell him your Plan for Getting" ],
    "documents" : [ 19, 21, 23, 41, 43 ],
    "attributes" : {
      "score" : 34.02668026907949
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 30.694601428807115,
    "phrases" : [ "Talk to your Doctor" ],
    "documents" : [ 12, 24, 38, 43 ],
    "attributes" : {
      "score" : 30.694601428807115
    }
  }, {
    "id" : 10,
    "size" : 4,
    "score" : 92.63231135782488,
    "phrases" : [ "Time to take the Pill" ],
    "documents" : [ 4, 23, 37, 38 ],
    "attributes" : {
      "score" : 92.63231135782488
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 31.4820300116346,
    "phrases" : [ "Candy" ],
    "documents" : [ 12, 20, 47 ],
    "attributes" : {
      "score" : 31.4820300116346
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 37.875466357902305,
    "phrases" : [ "Glad to see she Turned" ],
    "documents" : [ 5, 25, 47 ],
    "attributes" : {
      "score" : 37.875466357902305
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 62.90911863341244,
    "phrases" : [ "Period a few Days before it Starts" ],
    "documents" : [ 33, 38, 44 ],
    "attributes" : {
      "score" : 62.90911863341244
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 42.00619250029311,
    "phrases" : [ "Breast" ],
    "documents" : [ 3, 47 ],
    "attributes" : {
      "score" : 42.00619250029311
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 40.26694487785887,
    "phrases" : [ "Celebrate" ],
    "documents" : [ 2, 47 ],
    "attributes" : {
      "score" : 40.26694487785887
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 39.89255506750107,
    "phrases" : [ "Donating" ],
    "documents" : [ 21, 29 ],
    "attributes" : {
      "score" : 39.89255506750107
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 43.91122585062761,
    "phrases" : [ "Ovary" ],
    "documents" : [ 24, 32 ],
    "attributes" : {
      "score" : 43.91122585062761
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 73.12098040855005,
    "phrases" : [ "Say no to Size Zero" ],
    "documents" : [ 9, 47 ],
    "attributes" : {
      "score" : 73.12098040855005
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 71.78471437338723,
    "phrases" : [ "Truck Drivers" ],
    "documents" : [ 9, 14 ],
    "attributes" : {
      "score" : 71.78471437338723
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 64.3466826971375,
    "phrases" : [ "Vibrator" ],
    "documents" : [ 13, 30 ],
    "attributes" : {
      "score" : 64.3466826971375
    }
  }, {
    "id" : 21,
    "size" : 11,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 1, 6, 8, 10, 11, 26, 31, 35, 36, 39, 48 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 2038,
  "documents" : [ {
    "id" : 0,
    "title" : "Latex free condoms? Opinions?",
    "snippet" : "Okay 2x, this is slightly embarrassing because I THOUGHT I was an educated, aware, young woman.\n\nHowever, at 25, I've just developed a latex allergy. I'm in nursing school, and the latex glove exposure has given me progressively worse rashes.\n\nThe good news is I did not find this out through my nether regions.\n\nThe bad news is...I am REALLY inexperienced with latex-free condom options. Are lambskin condoms....weird? Do they feel strange? Are there other options as well?\n\nLike I said, this is pretty embarrassing. I thought I was pretty well informed when it came to sex. I have no idea where to go on this situation though!  There are polyurethane condoms, they feel and look the same as regular ones. I think most major brands carry one or two types of those.  Plus the polyurethane condoms protect against STIs pretty well, too, which the lamb skin are not so good at. Oh good. This is what I worry about. Plus the polyurethane condoms protect against STIs pretty well, too, which the lamb skin are not so good at. [deleted] I may have to try some then, for when I'm on antibiotics and things. I really dislike latex because I always end up extra sore and dry because I'm sensitive but not quite allergic to latex, and I'm in a monogamous relationship.\n\nKind of a stupid question, I know, but where do you get them and do they come in sizes (I assume they do but don't know)? There are polyurethane condoms, they feel and look the same as regular ones. I think most major brands carry one or two types of those.  There are polyurethane condoms, they feel and look the same as regular ones. I think most major brands carry one or two types of those.   I use Skyn originals, Lifestyle brand. They are great, don't feel weird at all. Best bet: ask the pharmacist at your local drugstore to help you choose one.\n\nAnd: please, please please update your medical charts at the doctor and dentist. I just had a really scary experience getting a cavity filled at the dentist where they 'missed' my latex allergy, and put a latex dental dam in my mouth... The kind strapped around the tooth an covering your lips. My face was frozen, I could not speak and I literally had to form the letters of 'latex' with my fingers to communicate the mistake.... I use Skyn originals, Lifestyle brand. They are great, don't feel weird at all. Best bet: ask the pharmacist at your local drugstore to help you choose one.\n\nAnd: please, please please update your medical charts at the doctor and dentist. I just had a really scary experience getting a cavity filled at the dentist where they 'missed' my latex allergy, and put a latex dental dam in my mouth... The kind strapped around the tooth an covering your lips. My face was frozen, I could not speak and I literally had to form the letters of 'latex' with my fingers to communicate the mistake.... I use Skyn originals, Lifestyle brand. They are great, don't feel weird at all. Best bet: ask the pharmacist at your local drugstore to help you choose one.\n\nAnd: please, please please update your medical charts at the doctor and dentist. I just had a really scary experience getting a cavity filled at the dentist where they 'missed' my latex allergy, and put a latex dental dam in my mouth... The kind strapped around the tooth an covering your lips. My face was frozen, I could not speak and I literally had to form the letters of 'latex' with my fingers to communicate the mistake.... I use Skyn originals, Lifestyle brand. They are great, don't feel weird at all. Best bet: ask the pharmacist at your local drugstore to help you choose one.\n\nAnd: please, please please update your medical charts at the doctor and dentist. I just had a really scary experience getting a cavity filled at the dentist where they 'missed' my latex allergy, and put a latex dental dam in my mouth... The kind strapped around the tooth an covering your lips. My face was frozen, I could not speak and I literally had to form the letters of 'latex' with my fingers to communicate the mistake.... I use Skyn originals, Lifestyle brand. They are great, don't feel weird at all. Best bet: ask the pharmacist at your local drugstore to help you choose one.\n\nAnd: please, please please update your medical charts at the doctor and dentist. I just had a really scary experience getting a cavity filled at the dentist where they 'missed' my latex allergy, and put a latex dental dam in my mouth... The kind strapped around the tooth an covering your lips. My face was frozen, I could not speak and I literally had to form the letters of 'latex' with my fingers to communicate the mistake....  I don't find them to be too strange. Perhaps you should go buy some latex free condoms and familiarize yourself with them. Yes, buy different kinds and try them out.  Different brands and styles work for different people. The thing is, I'm not really sexually active at the moment to \"try them out.\" That's why I needed opinions. Would like to have some on hand just in case the opportunity prevented itself.  I've dated two men with latex allergies/sensitivities. I've never tried lambskin because they're so expensive, but I've had good luck with the non-latex rubber ones. \n\nOnes I've tried that I've liked:\n\n-Durex Avanti Bare: http://www.amazon.com/Durex-Avanti-Bare-Pack-Box/dp/B0021YVAZ2\n\n-Lifestyles Skyn: http://www.amazon.com/LifeStyles-7312-Non-latex-Condoms-12-count/dp/B001FWXXXS/ref=pd_sim_hpc_1 I've dated two men with latex allergies/sensitivities. I've never tried lambskin because they're so expensive, but I've had good luck with the non-latex rubber ones. \n\nOnes I've tried that I've liked:\n\n-Durex Avanti Bare: http://www.amazon.com/Durex-Avanti-Bare-Pack-Box/dp/B0021YVAZ2\n\n-Lifestyles Skyn: http://www.amazon.com/LifeStyles-7312-Non-latex-Condoms-12-count/dp/B001FWXXXS/ref=pd_sim_hpc_1 I found that I hated the taste of the Durex brand, but they felt fine. Thanks for the info :) I've never used condoms for blowjobs, I suppose. Me either, but for any oral action after sex or mid sex it was a total mood kill. I've dated two men with latex allergies/sensitivities. I've never tried lambskin because they're so expensive, but I've had good luck with the non-latex rubber ones. \n\nOnes I've tried that I've liked:\n\n-Durex Avanti Bare: http://www.amazon.com/Durex-Avanti-Bare-Pack-Box/dp/B0021YVAZ2\n\n-Lifestyles Skyn: http://www.amazon.com/LifeStyles-7312-Non-latex-Condoms-12-count/dp/B001FWXXXS/ref=pd_sim_hpc_1 Lambskin are quite expensive, but they are infinitely better than latex or polyurethane condoms in terms of warmth and sensation. A few bucks a condom for better sex is a small price to pay in my opinion. I think they feel almost as good as condom less sex. They aren't as effective at preventing STIs though, so they probably should only be used in monogamous relationships.\n\nI definitely recommend them to any couple who is tired of the lack of sensation from regular condoms. They are a decent alternative if a woman doesn't like or can't tolerate hormonal birth control or copper IUD.      Skyn condoms are great. They are the same compound as latex, but the protein that causes the allergy is not there. I have a latex allergy that progressed to anaphylaxis and these are great! They feel and have the same durability as latex and are about the same price. Plus they don't taste/ smell like a balloon! Latex allergies that cause a rash are not true latex allergies, but an allergy to the chemicals used to harden the latex so it is possible to get rashes from other things that use that chemical..I'm I'm not sure what products use those. If you want you can try a silicone diaphragm if you are only concerned with pregnancy and not STDs. I'm definitely progressing to anaphylaxis, unfortunately. :( My throat started to feel like when I eat foods I'm allergic to the last time I wore the latex gloves. I took them off and immediately scrubbed my hands, then took a benadryl.\n\nMy nursing professor confirmed that it's most likely a true latex allergy. :(\n\nEventually a diaphragm, or even an IUD, will be a good choice for me. For now though, I'm not in a monogamous relationship &amp; thus wary of STIs.  That sucks! In case you don't know already, if you are allergic to latex, you are probably also allergic to bananas, kiwi, and avocado. Just a heads up! According my my gyno, the increased risk of STD's is only during the healing period, so as long as you wear condoms during that initial healing period you will be no more at risk than the general population. The constant increases risk of STDs is outdated info that, unfortunately, many doctors do not realize. Also, lambskin condoms so not protect against STDs, but polyurethane and SKYN condoms do.\n\nEDIT: here is a list of latex free products that I keep with me always! http://www.latexallergyresources.org/consumer-products Ohh thanks for the info!\n\n&amp; thankfully, not allergic to nanners or avacodo. :) I dug around my nursing books and found out that a potato allergy can also predispose you to a latex allergy. I had a wicked potato allergy when I was little, that I did grow out of. SO WEIRD. \n\nWill be bookmarking this list! You da bombbb.   A.May.Zing.  Get the Skyn brand, the Durex ones leave a horrible taste so if there's any oral involved, it sucks.  Lambskin isn't something I use, I prefer the polyurthane of Skyn.  My boyfriend says they don't feel any worse than condoms, and actually cause a little less loss of sensation. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195w49/latex_free_condoms_opinions/"
  }, {
    "id" : 1,
    "title" : "I need to get out of an unhealthy relationship. Please help.",
    "snippet" : "I'm an 19F and he's 24M. We've been dating for a little over a year and he was my first everything. First boyfriend, sex partner, love etc.\n\nHe meant the absolute world to me and I can go on and on about how much he means to me. And I know that I mean just as much to him. But we are toxic together. Sometimes, perhaps twice a month, we'll get into big fights over the most meaningless petty things. And a few times they've turned physically.\n\nI've been on the depo shot and have been for 6 months. I'm due for another one tomorrow but I will definitely NOT be getting it. It has fucked up my emotions and hormones and I feel like I PMS 24/7. I think it's a factor of why we fight, but the other part has to do with his stubbornness and immaturity.\n\nI hold a lot of resent towards him from things that have happened in the past. For the majority of our relationship, I was a big financial support for him, helped him pay bills, rent, food etc. He worked on and off without a steady job and he wasn't in school. He also ran into a few court problems that I also helped him with. \n\nA few months ago, I also found out he texted his girlfriend at 3am and invited her over to cuddle. I remember this particular night and it was right after I left his house. This obviously broke my heart and I know he felt terrible about it. He begged for my forgiveness and felt incredibly sorry for what he had done. Nothing came out of it, and I never quite understood why he did it. But nevertheless, it changed my view of him then and that has never fully recovered.\n\nIt's super hard to summarize a relationship in a few paragraphs and I don't think I did it justice. Despite our problems, I love him so much and my heart is breaking now. I don't think we are good for each other and I'm so sick of the fighting. This evening, we got into a fight over the stupid thing and it turned physically. He pushed me a few times and pulled me to the ground, and I hit his face. Granted, I'm a lot smaller and there was barely any impact. I still intended to hurt him.\n\nSo 2Xs, please help me. How do I get over this relationship? He is my best friend and there has been a lot more good times than bad. But I don't think we're right for each other. I'm sorry if this reads scattered and weird, I'm typing on a phone.\n  I've been in this exact situation and the longer you draw it out the worse it will be.\n\nYou have to get the balls to go ahead and tell him exactly what you just told Reddit, other wise everyday is going to be a constant of faking everything. I did. I told him it was over tonight but I've \"broken up\" with him several times now. I never thought I would be that girl, who was so in love with her boyfriend that it clouded her judgement. But I am. :(\n\nI don't know if I can make this decision permanent. Like I said, he's my best friend and we see each other every day.  It's just gonna keep drawing on and draining your energy. Gotta break the cycle! How did you eventually get over your partner? ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/196lf0/i_need_to_get_out_of_an_unhealthy_relationship/"
  }, {
    "id" : 2,
    "title" : "To wedding celebration, or not to wedding celebration?",
    "snippet" : "Have you ever had a joining of two families where you feared someone would start arguments or fist fights? Is it worth the risk to mark a momentous occasion? How did you swing it?\n\nHas anyone ever eloped and wish they'd had the party? Vice versa?\n\n\n\n\n ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/196rkt/to_wedding_celebration_or_not_to_wedding/"
  }, {
    "id" : 3,
    "title" : "Should I be concerned? ",
    "snippet" : "Hey TwoX! I was wondering if you guys could help me out. \n\nI am 18F, with A breasts (B on a good day). Basically, there really isn't anything there. Today in the shower, however, my breasts were really sore and hurt a lot when I pushed them. I'm not about to get my period so I find it strange that they are so sensitive. I also realized that the center of my breast is really hard. I know I dont have big breasts, but I always imagined what I did have would be soft and fat like. Not super hard for like 70% of the breast. \n\nI don't have older sisters and I'm not close enough with my mom to talk to her about this kinda stuff. Could any of you offer advice? Is the hard center part normal? Is it normal that they hurt? \n\nthanks in advance!     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/196hb7/should_i_be_concerned/"
  }, {
    "id" : 4,
    "title" : "Ladies who are/were on the pill, I'd like some advice",
    "snippet" : "What time of day do you take your birth control pill? Why does it work for you and do you ever forget to take it? \n\nI've been having trouble settling on a good time to take the pill. I used to take it at noon, but with my current job, I often forget to take it until 12:30 or 1:00. I also tried taking it at 8:00am, right as I get into work, but that time isn't great on weekends when I like to sleep in. I have a friend who swears that 6:00pm is the best time to take the pill... it's after you get home from work but before your 'evening plans' have started, but I'm not sure about that. \n\nI'd like to hear what time you chose, why you chose it, and the benefits/drawbacks of taking the pill at that time. \n\nAlso, I hear that there are phone apps that remind you to take the pill. If you use one of those and have some insight, I'd love to hear it. \n\nThanks for your help!\n\nPS. I should mention that I have been on the pill for years. Aside from the \"there's no perfect time of day to take it\" issue, I'm quite happy with it, and I'm not interested in switching birth control methods. \n\n**[Edit]** Thanks everyone for your responses! I now feel prepared to make an informed choice about the arbitrary time I take my pill next month.   I used to take mine at bedtime.  My hubby and I split the duties - he gets me a small glass of water every night and I take the pill ;)  I take mine at 9pm--it used to be when I got off work, and I just stuck with it even after my schedule changed because it's just ingrained in my head to take it then. I'm always awake at 9, so it seems to work. I take mine at 9pm--it used to be when I got off work, and I just stuck with it even after my schedule changed because it's just ingrained in my head to take it then. I'm always awake at 9, so it seems to work. I always take mine at 9, too. I think I started because my freshman-year roommate took hers around the same time, and I was just starting to take the pill, so I figured we could remind each other. Ever since then it's just stuck. I don't even set an alarm anymore; now I have some sort of spidey sense for when it's 9 p.m.  Bedtime worked best for me. Wash my face, take out contacts, moisturize, pill, more face stuff, brush teeth, bed   I used to take mine at 9pm, which worked well but I had a few nights in one year where I zonked out earlier or got too busy and didn't remember the pill for 8+ hours. D: \n\nSo I switched to 9am instead - the upside to this is that I have two alarms in my phone for it. First alarm for 9am, which I rarely miss. Second alarm for noon, as a just in case (and I've been very grateful for it a few times!). I'd much rather only take my pill three hours late than 8-12 hours late, which is why I don't plan it for the evening anymore.            ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1968os/ladies_who_arewere_on_the_pill_id_like_some_advice/"
  }, {
    "id" : 5,
    "title" : "I unconsciously sabotage myself whenever someone starts to show romantic interest in me. Help?",
    "snippet" : "First of all, I'm 23 and I've never been in a relationship. I've had a few guys who were interested and a few girls too (I'm told I'm a casual flirt and a tease.), but as soon as I start feeling like they're actually, actually interested in me, I emotionally back out. \n\nThis can occur through avoidance, over-thinking, just general anxiety. I can't fall in love. I can't even imagine someone being intimate with me. I can imagine having sex with a random stranger, but give that stranger a familiar face and it's like my brain shuts down and goes NOPE.AVI\n\nI'm interested in the *idea* of getting into a relationship- but as soon as it becomes a reality, I just can't deal. Any one else feel this way? How do I cope? I don't have any money to go into therapy and my school's free counseling banned me because I told them I was suicidal at one point (they said they weren't able to deal with that and all my interweaving issues. Luckily, I managed to go over that hurdle on my own.), so my only choice is paying. Which for a broke ass college student is pretty much impossible...\n\nHelp?  There can be a whole host of reasons why people sabotage things when they stand a chance of being real. Part of the problem is trying to figure out exactly what it is for you so you can work on that base issue. Do you have any inkling what that base issue (or issues) for you might be? It's probably a multitude of factors: lack of self-esteem/self-worth, anxiety paired with bouts of depression (fixing that through regular exercise these days), Observational learning of dysfunctional relationships (My parents are the worst married couple, I could go on and on about that one, they also constantly tell me never to get married), expectations about what being in a relationship entails, being naturally introverted to the point where I get easily suffocated by others, fear of being controlled/losing my individuality\n\nShit the list goes on and on, doesn't it?  But that is a good thing, in a way. If you'd answered, 'I really have no idea.' then a whole lot more soul searching would be required - with you having to probe deeply to figure out exactly why you feel the way you do. Knowing why you act the way you do is half the battle. The other half is trying to work through it, or around it, or how to remove it.\n\nI'm guessing the observational learning from your parents would've come first amongst all of this? Is this something you feel applies wherever you look? It's more unconscious, I believe. It combines with my lack of self-worth and anxiety and ends up in this snowballing effect of negative though processes ('don't get with a guy, he'll be disgusted with you when he sees your true self' or 'all men just want sex' and 'i won't be able to satisfy him, i'll have to change for him' or 'it'll just end up like my parents marriage, whats the point of even trying' )\n\nI understand that the thoughts aren't true, but they hit me in a way where I don't really realize they're there unless I'm looking really deeply inside myself.   You're not alone in this; I have a similar situation. I can have crushes on people for months and drool over them in my sleep, but the moment \"us\" actually becomes a possibility, I tend to nope the fuck out. I've been in two relationships before. Each time, I took this fight-or-flight response and ran around like a chicken with its head cut off. I freaked out, I couldn't breathe. I was riddled with anxiety. My longest relationship to date had been three days, though I avoided him every moment. \n\nI don't know why, or what can be done, but I really hope you find a way to help yourself :) &gt;I can have crushes on people for months and drool over them in my sleep, but the moment \"us\" actually becomes a possibility, I tend to nope the fuck out.\n\nThis is me. I knew a girl online, we got 'internet married', She said she'd buy me a ring and I told her I'd buy her a dildo (we're very open haha). I crushed on her like nobody's business (going to class in a daze, thinking about her and fantasizing) ....and then we exchange phone numbers and suddenly *I can't* . *It's too real.* \n\nAs terrible as it is, I'm glad I'm not alone. I wonder if there's some kind of support group for this. A support group would be wonderful. I feel like once it's official, it's become a status, and it's crushing. I had this... Anxiety. I had a weight in my shoulders. The moment I ended it, *I felt free.* I'm friends with both of them to date, and I actually took one of them to the school's homecoming. It was awkward, but not the horrible feeling of being in a relationship. It was just too much.  Yeah- I definitely get that. Expectations, yeah? Like suddenly since you're official, now you have to text each other more or go out more to maintain this relationship, and shit- aint nobody got time for that.\n\nOne of my other issues is that I've got this split between wanting to be independent and my own person and having someone to be with during my later adult and elderly life, you know what I mean? I don't want to be alone and lonely, but I want to be alone. \n\nMaybe we're just not meant for relationships? Maybe we're not, I don't know. I'm thinking I have commitment issues, though I've never had the chance to put that to the test. I know growing up, I saw my mom is this horrible relationship with my dad. She needed to get out, but she was so financially independent and had to stick with him. I vowed to be independent and not have to rely on anyone else. \n\nNow, of course, I can't deal with relationships. I mean, the one guy texted me saying \"I'll come get you this morning,\" and I lost it. I don't know why, but it freaked me out. I don't *need* someone to get me, I walk on my own every day. I ended up never showing up... \n\nIt may have something to do with possession issues. If I'm in a relationship, I'm supposedly *theirs*. I grew up where \"this is my house, my rules. Your stuff is in my house, so it's mine. I can do what I want, when I want. You have no say.\" And stuff like that freaks me out to no end. I don't want to be controlled. \n\nI think I just started picking apart my own brain. I probably have issues... Shit, flyaways, you're me. The mother part, the controlled part, I have all of that too. I feel the same exact way.\n\nI want to be a strong independent woman who can support herself but I'm also stupidly gullible, and my fear is that I'll end up in a situation where I'll be controlled and emotionally abused into doing shit I don't want to do. I'm overly sensitive to the moods of others and will do almost anything to avoid confrontation and conflict, it just doesn't work well in a relationship at all...\n\nGoddamn, all this self-analyzing is making me thirsty. Shit, flyaways, you're me. The mother part, the controlled part, I have all of that too. I feel the same exact way.\n\nI want to be a strong independent woman who can support herself but I'm also stupidly gullible, and my fear is that I'll end up in a situation where I'll be controlled and emotionally abused into doing shit I don't want to do. I'm overly sensitive to the moods of others and will do almost anything to avoid confrontation and conflict, it just doesn't work well in a relationship at all...\n\nGoddamn, all this self-analyzing is making me thirsty.  I did that!  Past tense I'm much better now.  I don't know how you'll manage it, but I ended up simply dating a lot of people.  I'd note when they got interested...  Then find the flaws I was picking as the reason that I'd end it.\n\nIt turns out I was actually picking terrible for me people, long term.  I was happy with a relationship that had nothing really settled, but ultimately I wanted something I wasn't getting.  It forced me to examine what I was actually looking for in a relationship and what on earth I was doing.  Flirting feels awesome, positive feedback is awesome, especially if your self confidence feels low when you're by yourself.\n\nI figured that one, I hate dating.  (This is still true.)  Two, I had some pretty interesting issues on what a relationship should be.  And three, I didn't know what all these things were.  So I dated.  A lot.  And it wasn't always serious.  Some relationships lasted a couple of weeks.  Some, months.  Over time I learned what I would and would not deal with.  What was livable and what I wouldn't compromise on.  And finally, that dating didn't have to be long term.\n\nSide note that is amusingly tangentially related, my husband and I met looking for friends with benefits, nothing more. :D  It was not supposed to be a serious relationship at all.  Boy did we mess that up. ;) I did that too- mass dating, I mean. Back when I was sexually confused (Was I a lesbian, straight, bi, ASEXUAL!?) I went out with 3 boys and a girl. The men were all flops and never went anywhere (2 of which were my choice. After the first couple dates, my automatic fight-or-flee response got activated and I ran out before it could get serious.) The girl... We were doing good, but I didn't feel the chemistry. Granted, I didn't feel chemistry with the guys either, but shit- she took me to Disneyland and we watched fireworks. It should have been the greatest date ever. She was adorable.\n\nBut that ended too. We're just friends now. \n\nDid you and your husband have insta-chemistry? Would it be productive to list the things I won't compromise on in a relationship, even without being in one? Is it just a lot of soul-searching or more 'on-the-spot' kind of stuff?  I tend to do this too. I'll make all sorts of excuses about how one of the person's traits is a dealbreaker, or they're not my type, or we don't have enough in common, but really I'm just scared of being in a close relationship with someone, and so I compare everyone to an impossible ideal guy. After my current boyfriend asked me out and I rejected him, it took me about a month to muster up the courage to go back after him. Even though I KNEW he liked me it felt like the bravest thing I've ever done. \n\nI don't know if the mindset that's preventing you from dating is along the same lines, but whatever it is you can talk yourself out of it step by step. Whatever you envision as the worst case scenario, convince yourself that even experiencing that would be a *good* thing compared to fear and stasis, although it's unlikely anything even close to your worst case scenario is going to happen. You can start slow, agreeing to just one date at a time -- just because you have an interest in someone and want to see how it plays out doesn't mean you owe them any intimacy. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1967gv/i_unconsciously_sabotage_myself_whenever_someone/"
  }, {
    "id" : 6,
    "title" : "I'm only 21, but there are tiny lines alllll over my face, most apparent when I smile. What's the dealio here? Can this be fought or prevented from going further?",
    "snippet" : "Can anyone please provide input on this? I don't like it at all.   My two best pieces of advice are 1. Daily use of a high SPF sunscreen on all exposed skin to prevent further sun damage. 2. Retinoids, retin-a or tazorac are best to improve skin texture. \n\nBut also eat well, moisturize!, drink lots of water, eat plenty of fat, get enough sleep...     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195ch8/im_only_21_but_there_are_tiny_lines_alllll_over/"
  }, {
    "id" : 7,
    "title" : "I don't know how to be a girl/human. Advice on anything would be greatly appreciated :)",
    "snippet" : "I've been ill for 4 years and before that i was a teen.\n\nWhen i was a teen i was a tom boy, i didn't care about make up or dresses or anything like that. I also rode horses every day so i never even had to think about keeping fit because horse riding kicks your ass - i could do 100 sit ups without getting tired. \n\nI didn't have to think about what foods to eat because i had a family to cook for me and choose what food i ate (plus the ridiculous metabolism young people have).\n\nNow I'm finally in recovery I've realised that i have no idea how to take care of myself. I feel like I've missed out on learning how to grow up the past 4 years. \n\n**tl;dr: I've been sick for 4 years and was a tom boy before that, i don't know how to be a girl/human.**\n\nI lost pretty much all of my friends when i was sick (I don't want to go into details about being sick, just want to move on, so lets not go there), so i don't have anyone in person to ask.\n\nI don't have just one question, other than \"how do i human?\", but I'm posting this to just get as much advice from other women as i can on how to be a human. \n\nBasically all i do is try to shower at least every second day, take my medication and vitamins, put moisturizer on my face at night, brush my teeth, go to sleep on time and I'm trying to eat three meals a day, i don't have any other routines in my life at the moment.\n\nI can already see people replying with \"We can't help you if you don't ask a specific question\", so I'll try and put some up, but its such a broad question I'm asking so i wont be able to think of many in one sitting (my brain isn't working this week either, I'm not sure if i'm even making any sense with this) if you have any advice that doesn't fit into these questions please post anyway :) \n\n * How often a week should i exercise to keep fit and healthy, and what are some exercises that are good for that? \n\n * What beauty routines do you have? \n\n * What are some good foods to eat regularly? \n\n * How to i make myself look pretty? What make up items should i have in my arsenal? - and how do i use them?\n\n * How do you deal with people? I'm finding it hard to make/keep friends. \n\nIs there anything important that you do every day/week/month that i haven't even mentioned?\n\n**Second tl;dr: How do i be a girl/human?**\n\nSorry if all this seems like a jumbled ramble, I'm still in recovery and have had a bad week.  \n\nThank you so much for reading and I would really appreciate any advice you could give me, no matter how small :)     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/196nwm/i_dont_know_how_to_be_a_girlhuman_advice_on/"
  }, {
    "id" : 8,
    "title" : "I'm getting my first brazilian wax this week. Any tips? What will it be like?",
    "snippet" : "So I've wanted to get waxed for the longest time and I'm finally going for it. However, I am super nervous. I know it is going to hurt really bad, and that's okay, but is there anything I can do to minimize the pain? Also I'm just not sure what to expect...what will the experience be like?   Mine didn't really hurt. Just wear soft underwear and a skirt if the weather permits. You could probably take an asprin beforehand, if you think you need to. But I really thought mine was going to be the most painful thing ever, and surprisingly it wasn't. As far as what happens, I was taken into the room where they did the waxing, left alone for a few minutes to take off my pants and undies, then the lady came back in, and starting the waxing. You might be asked to help pull or hold skin to keep it tight. The woman that did mine was really funny and talked to me the whole time about the most random stuff. She did a super good job though. After it's done, you can't shower for a few hours, but otherwise I was good to go. Good luck!      ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195oum/im_getting_my_first_brazilian_wax_this_week_any/"
  }, {
    "id" : 9,
    "title" : "Say No to Size Zero - a campaign started by a British model - just curious what other people think about this. It rubs me the wrong way, a bit. ",
    "snippet" : "  How about, \"Say yes to diversity in body shapes in fashion and the media\"?  Should be noted that this is in the UK - different sizing system. \n\nI am skinny and easily fit most size zero clothes in the US, but I am a size 4 or 6 in the UK. By UK sizing, a 0 would be skeletal.   I don't like the linguistic implications of \"zero.\" I worry about having it in one's mind that a \"nothing\" is a good thing to be. \n\nThere is no rational reason for a size of clothing to be called \"zero.\" There are no zero-inch waistbands, no zero-inch bustlines, no zero hips or thighs or shoulders or arms. There is nothing about a woman that should be regarded by anyone, anywhere, anytime as a ZERO. \n\nUsually when I proclaim this to younger women they look at me as if i have two heads.  I agree with your sentiment, but logistically it doesn't work that way.  As manufacturers offer a wider range of sizes, they can either:\n\n* rename the entire sizing nomenclature upwards.  This will annoy current customers and will probably alienate many of them.  Many will not like being told, \"Size 6?  Sorry but you're now a 10.\"  (I won't even go into size inflation.)\n\n* extrapolate the sizing.  That's how we now have 0 &amp; 00.  \n\n* name the new line as petite.  This is actually difficult because petites usually have different proportions than regular sizes, so calling a regular pattern \"petite\" will probably cause marketing problems when petite women try the clothes and find them ill proportioned. \n\nAs you can see, having 0 is a least of evils.  Or they could just use European sizing. That way nobody would be a \"zero\", and there would be some semblance of standardization in women's clothing sizes. But that would be too easy.  I agree with your sentiment, but logistically it doesn't work that way.  As manufacturers offer a wider range of sizes, they can either:\n\n* rename the entire sizing nomenclature upwards.  This will annoy current customers and will probably alienate many of them.  Many will not like being told, \"Size 6?  Sorry but you're now a 10.\"  (I won't even go into size inflation.)\n\n* extrapolate the sizing.  That's how we now have 0 &amp; 00.  \n\n* name the new line as petite.  This is actually difficult because petites usually have different proportions than regular sizes, so calling a regular pattern \"petite\" will probably cause marketing problems when petite women try the clothes and find them ill proportioned. \n\nAs you can see, having 0 is a least of evils.   I have super-skinny friends that eat like truck drivers and I know for a fact these campaigns make them feel horrible and not 'real' women. They are self-conscious and think they are 'ugly'.  They have severe self esteem issues about their bodies. This stuff goes both ways, in my opinion.    I have super-skinny friends that eat like truck drivers and I know for a fact these campaigns make them feel horrible and not 'real' women. They are self-conscious and think they are 'ugly'.  They have severe self esteem issues about their bodies. This stuff goes both ways, in my opinion.     I guess that I'm atypical in that I'm a size 0 who is neutral about this.  I appreciate the intentions but am \"meh\" about the wording. \n\nIt's like the \"real women have curves\" message.  I'm not the intended target and it doesn't really affect me, so I ignore it.  I find it a bit annoying that I'm socially discouraged from complaining about my weight issues, but that's a relative small thing in the grand scheme.          I'm a size double zero and I eat constantly. I've honestly tried to gain weight since weighing 83lbs at age 17 doesn't seem normal to me, but I can't. I don't understand why someone wouldn't say \"Say no to size zero\" cause its like saying say no to any size. Small girls are still beautiful. As are all other women I'm no doctor, but 83 lbs at 17 is REALLY small, even if you're under 5 feet. Maybe consult a physician?",
    "url" : "http://www.katiegreenofficial.com/"
  }, {
    "id" : 10,
    "title" : "Kind of a rant, asking for perspectives on being messed up about relationships",
    "snippet" : "Okay, so maybe this won't make much sense, but I'm hoping maybe you guys might have something constructive to say about it. So I'm nearly 31, and I've never had a relationship that's lasted very long. I tend to get pretty obsessed at the beginning (I'm nothing like OAG or anything) and then my interest just kind of peters out, and either the relationship dies because I'm too interested in the beginning or because I'm not interested enough in the end.\n\nMy last relationship was about three months ago and I'm beginning to meet guys again and I can feel the same thing beginning to happen, the thinking to much about guys and putting to much on casual encounters (that is casually meeting people, not casually having sex with them). Even when I meet guys I find myself thinking about being in relationships with them and I don't want that exactly; I want to have male friends where that's not a thing, but I don't know how.\n\nSo now I'm kind of feeling so discouraged about the way I seem to hold relationships and how messed up it feels like to me that I just don't want to deal with it anymore. I'd love to have a healthy relationship, but I feel like I don't know how and I want to have purely platonic friendships with attractive young men and I'm not sure how to do that either. Do you guys have any advice for me?\n\nThanks for reading. Sorry about how ranty this is, but I just can't seem to figure it out.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195yxx/kind_of_a_rant_asking_for_perspectives_on_being/"
  }, {
    "id" : 11,
    "title" : "[UPDATE] Facing the possibility of miscarriage",
    "snippet" : "So turns out the Drs cant really tell me anything, I've been bleeding for longer than a normal period &amp; I was in emergency for 4 and a half hours yesterday for them to turn me away saying there is nothing to be done until I can get in to have a scan.  Which because it was Sunday they werent prepared to do on the spot.\n\nSo until I have a scan (which thankfully is tomorrow) I wont know if Im miscarrying.   I wish you all the best. You know you have a community to turn to for insight and strength regardless the outcome.   My condolences! I wish the best for you &amp; your unborn child.  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195ypd/update_facing_the_possibility_of_miscarriage/"
  }, {
    "id" : 12,
    "title" : "Sharing Sunday!  Share your rants &amp; raves for 2/24 here.",
    "snippet" : "No Bueno:\n\n* MrAnthropic is on a business trip, so I'm kinda lonely.\n* WtF bacne?!  Why the hell is my skin worse than my teens?\n* Carpal tunnel sucks.\n\nBueno:\n\n* Working from home tomorrow, so I get to sit around in yoga pants.  Ahhh.\n* Talked to a far away friend for an hour.  'Twas nice.\n* Was semi-productive this weekend with tidying up &amp; cooking.\n* Because MrAnthropic is gone, there's been a lot more focus on me (e.g. home beauty treatments in the evening, catching up on my TV shows).     The Good:\n\n* Had an interview for grad school last week\n* another school emailed and said they would fly me out to the west coast for interviews\n* Don't have bed bugs. \n* Had a great discussion with a friend about google goggles and other technological innovations\n* Got baked last night, was awesome. \n* Have awesome internship\n\nThe Bad:\n\n* My parent's boat is sinking slowly at dock in the Caribbean.\n* Fucking dust mites or fleas in my apartment... I can't figure out how to make them go the fuck away\n* Made an OKCupid account, I feel like I've lost hope in the humanity of our generation. \n* I'm now convinced that we are slowly entering a dystopian future where computers will completely rule our interactions and no one will pay attention to each other, and one company will own everything, namely Google. This is now an impending fear of mine. \n* Still unemployed-ish.  As someone who also has an OKC account, I share your sadness about the state of humanity. I can't help with that problem, but I may be able to help with another one: if you have reason to suspect that the problem is fleas, but there's not a visible huge infestation, you might consider trying a natural carpet powder like [this one](http://www.petco.com/product/102831/Sentry-Natural-Defense-Flea-And-Tick-Carpet-Powder.aspx) on your carpet or rugs and upholstered furniture. A few years back I picked up a dog in an emergency rescue situation and he had fleas. We used this powder in my roommate's car and all over our house, and successfully avoided an infestation. As a note, though, if you have any furry pets you will need to make sure they're treated for fleas too. If you don't know what caused the infestation, then finding that out is important, since otherwise they may just come back; for example, sometimes the fleas are living in a bush right outside your window. Thanks!\n\nI do not have furry pets (because my lease won't let me D: ), my parents have an indoor/outdoor cat and a dog. I brought a rug back from their house... which started this saga. I am going to pick up that powder from the nearest petco/pet store. I have fucking wall to wall carpeting in my main living space, so using the powder on it might do the trick for now. Though never again will I sign a lease for a place with carpets. Fuck carpets.  Seriously agreed, carpets are the worst. When we had the aforementioned foster dog, we unfortunately lived in a 3-story townhouse with carpeting everywhere, including 2 very tall staircases. The carpet powder + vaccuuming definitely wasn't fun, heh. But it really seemed to do the trick; that dog had fleas all over him, yet we never found a single one in the house after that (as a note, we gave that dog and my dog flea baths before doing the carpet powder, but that sounds like it doesn't apply in your case). The Good:\n\n* Had an interview for grad school last week\n* another school emailed and said they would fly me out to the west coast for interviews\n* Don't have bed bugs. \n* Had a great discussion with a friend about google goggles and other technological innovations\n* Got baked last night, was awesome. \n* Have awesome internship\n\nThe Bad:\n\n* My parent's boat is sinking slowly at dock in the Caribbean.\n* Fucking dust mites or fleas in my apartment... I can't figure out how to make them go the fuck away\n* Made an OKCupid account, I feel like I've lost hope in the humanity of our generation. \n* I'm now convinced that we are slowly entering a dystopian future where computers will completely rule our interactions and no one will pay attention to each other, and one company will own everything, namely Google. This is now an impending fear of mine. \n* Still unemployed-ish.  The Good:\n\n* Had an interview for grad school last week\n* another school emailed and said they would fly me out to the west coast for interviews\n* Don't have bed bugs. \n* Had a great discussion with a friend about google goggles and other technological innovations\n* Got baked last night, was awesome. \n* Have awesome internship\n\nThe Bad:\n\n* My parent's boat is sinking slowly at dock in the Caribbean.\n* Fucking dust mites or fleas in my apartment... I can't figure out how to make them go the fuck away\n* Made an OKCupid account, I feel like I've lost hope in the humanity of our generation. \n* I'm now convinced that we are slowly entering a dystopian future where computers will completely rule our interactions and no one will pay attention to each other, and one company will own everything, namely Google. This is now an impending fear of mine. \n* Still unemployed-ish.  I found my future husband on OKC. There are good people there, just answer like 5 billion questions and stay away from any non-matches. It's not so much the people, but the fact that it's a valid form of dating that I find strange and disconcerting.  First of all, it's kind of disingenuous to refer to it as a form of dating, considering you do still have to go on actual dates with your matches. \n\nSecond, why is it somehow less valid than other forms of meeting people? What kind of meeting isn't strange and disconcerting to you? Through friends? At bars? At work? Class? I'm just sort of worried that people will stop doing any sort of in-person interfacing in general. This is sort of one of my Luddite fears, see the thing about Google taking over the world on my list of \"The Bad\". I'm just wondering what this will do in terms of social interactions for future and current generations. Of course it doesn't help that I regularly get solicited by 40 something year old couples looking for a threesome for their wife because I'm a bisexual woman in her 20s.\n\nI didn't mean to insult you, one of my best friends met her long term/lovely BF on OKC. I think people can meet in a variety of ways, I think it would be awesome if someone met the love of their life on a specialty car forum or /r/r4r. I simply wonder if this is actually preventing people from going out and making those efforts of initial courtship in person as it's easier to drop a message.  Maybe, but like I said, you do have to actually *meet* the person if you want the relationship to go anywhere. I understand Luddite fears; I'm personally more afraid that people will stop interacting with each other while being in each other's presence because of smartphones. Wait, that's already happening. T_T I am aware of that... it's just a new and strange way of \"meeting\" people in the sense that your initial first impression is online and they know about you before talking to you, rather than the other way around. \n\nI feel you on that smart phone thing. Oh, god, my best friend is one of those. He's like let me answer a call in **THE MIDDLE OF DINNER** with you, or text while we're at a concert or either of those while he's talking to me. Seriously needs his iPhone privileges taken away.  My fiance does it on dates. =/ The Good:\n\n* Had an interview for grad school last week\n* another school emailed and said they would fly me out to the west coast for interviews\n* Don't have bed bugs. \n* Had a great discussion with a friend about google goggles and other technological innovations\n* Got baked last night, was awesome. \n* Have awesome internship\n\nThe Bad:\n\n* My parent's boat is sinking slowly at dock in the Caribbean.\n* Fucking dust mites or fleas in my apartment... I can't figure out how to make them go the fuck away\n* Made an OKCupid account, I feel like I've lost hope in the humanity of our generation. \n* I'm now convinced that we are slowly entering a dystopian future where computers will completely rule our interactions and no one will pay attention to each other, and one company will own everything, namely Google. This is now an impending fear of mine. \n* Still unemployed-ish.  Don't feel bad because you're on a dating site. I (accidentally!) met my amazing, compassionate, athletic, scientist boyfriend with the smokey-smelling red beard on OKC. There's good fish in that sea! \n\nAnd good luck on grad school! I'm in a doctoral program myself and love it (for the most part, it's a white knuckle ride for sure!). What are you going in for? If they're flying you out (like mine did) that's a fantastic sign! I guess I mean that I'm kind of sad that our generation chooses to use the internet to meet people to get dates instead of meeting people or having more social gatherings IRL. I also met one of the people I was conversing with that was even more profoundly awkward than me.\n\nI'm just looking at MA and MM programs presently. I'm in for music composition if all goes well. I just really want to write, have imposed deadlines (I am more productive when someone else tells me I need to do a thing by X date), and catch up on all the music theory and history I missed because of my liberal arts undergrad.  My boyfriend and I met on OKC by making fun of each other and sending quasi-rude messages to each other. We then (by chance!) bumped into each other at a beer brewing meeting, and sparks/hops flew, I guess. We've been together for almost three years. So, it wasn't really 'meet on the computer', as we probably wouldn't have actually gone out with each other had we not met in person. A good recommendation if you're looking is to find events that attract guys you like. (Lit nerds? Is the local book store having open-mic night? - for example)\n\nMusic composition is fun (I have a friend who got his MM at NYU and now engineers video game music), and if you find the right knack, you'll have a good future out of it! Best of luck! : ) The Good:\n\n* Had an interview for grad school last week\n* another school emailed and said they would fly me out to the west coast for interviews\n* Don't have bed bugs. \n* Had a great discussion with a friend about google goggles and other technological innovations\n* Got baked last night, was awesome. \n* Have awesome internship\n\nThe Bad:\n\n* My parent's boat is sinking slowly at dock in the Caribbean.\n* Fucking dust mites or fleas in my apartment... I can't figure out how to make them go the fuck away\n* Made an OKCupid account, I feel like I've lost hope in the humanity of our generation. \n* I'm now convinced that we are slowly entering a dystopian future where computers will completely rule our interactions and no one will pay attention to each other, and one company will own everything, namely Google. This is now an impending fear of mine. \n* Still unemployed-ish.     The good:\n\n- Went to an awesomely fun 90's themed dance with two of my girlfriends last night, and now my coat pockets are filled with 90's candy.\n\n- I don't have to leave the house til this evening, which is great because the weather is gross.\n\n- There are Thin Mints in my freezer.\n\nThe bad: \n\n- I have crazy amounts of schoolwork to do and my senior thesis is hanging over my head like the blackest of clouds.\n\n- Tomorrow is Monday, and I have work Monday and Tuesday so I hate the beginning of the week. What is 90's candy exactly? Pixie sticks and Lick-em-aids?                            The Bad: \n\n* I'm a Ph.D student and research assistant who is taking 14 hours this term. I am beyond exhausted and I'm sick of classes already!  \n* My cohort (class mates) have gotten kind of cliquish and it's annoying. Most because they're into educational technology and I'm not, and they act like I'm a backwoods hillbilly kindergarten teacher as a result. \n* My two best friends moved in together, and they pretty much cut off the rest of our group. \n* I moved here from the Pacific Northwest and I miss my Oregon/Seattle friends so bad sometimes I just wanna cry :*(. \n* World's worst heartburn after dinner with my dad.  \n* I WANT THE NEW SEASON OF GAME OF THRONES AND I WANT IT NOW.  \n\nThe Good: \n \n* As a Ph.D student and research assistant, my lab is fully funded and I love my research, my PIs, and the awesome interviews I get to conduct this week!\n* Despite eating like a stable full of starving donkeys, I've lost weight! \n* Mr. skynolongerblue and I got a new bookshelf and found old posters. Cue a lot of decorating/organizing, and now a much more tidy apartment! \n* Delicious, delicious St. Louis-style BBQ tonight with my dad...the world's best mac and cheese...and brisket...too bad my stomach is paying for it now!  \n Worlds best mac &amp; cheese and you're not in Seattle?!\n\nIf I had any money to spend I would send you a lovely care package. Just got back to Seattle this week after being gone for almost two months.  I know! Although having sun, snow, and living in a giant city is awesome, I miss my friends, *fresh* seafood, good beer, and drivers who don't view cyclists as an invasive species to the road.            ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194rje/sharing_sunday_share_your_rants_raves_for_224_here/"
  }, {
    "id" : 13,
    "title" : "OK, so I admit that even in my 30s I'm drawn to Hello Kitty, but some of these products just leave me wondering \"why, huh?\" ",
    "snippet" : "  I dunno. My roommate has a HelloKitty toaster that imprints HelloKitty's face onto toast. I must admit, I think it makes toast tastier. I can definitely see the appeal in some of this stuff.   Different people have different levels of liking certain things. Hello Kitty just happens to be one of them. You may just think Hello Kitty is cute and girly, but there are probably others who are super obsessed with Hello Kitty and want everything Hello Kitty. \n\nAlso, Japan and other Asian countries really adore Hello Kitty to the point of obsession. It's become such a huge cultural icon for them that it's hard to ignore. Some of those products may not be officially licensed, but were created to appeal to the niche markets that want Hello Kitty products such as Hello Kitty toilet paper or vibrators.     That hello kitty vibrator looked like a child's toy. I'm kinda disturbed.     ",
    "url" : "http://www.babble.com/celebrity/weirdest-craziest-and-most-bizarre-hello-kitty-items-ever/"
  }, {
    "id" : 14,
    "title" : "I want to be a Truck Driver.",
    "snippet" : "And since i'm a woman, i'm scared.\nI'm 20, i'm not decided on what to do with my life, i thought i did but it turned out that career wasn't for me after all. Now i'm back looking at things that interest me. I've found 2. One of them is being a truck driver. \nI've thought about it for 6 months now. I've told 3 people. They all looked at me like i was crazy. Why? Because it's a ''man's job''.\nI've always loved road trips, when i was young i'd hope we'd take the car and not an aeroplane. When i got my driver's liscence i'd beg my friends to let me drive on our roadtrips. So i thought why not drive for a living?And It's good money! (enough for me anyways) \nBut i'm SCARED. Scared to be judged, scared to be laughed at when i call to enroll at the class you have to take. Scared that if i go to that class, i'll be the only female..\nAnd then theres also this stigma that truck drivers are trash...\n\nSo Twox, Do any of you work in a place where it's mostly males? I need confidence! Tell me your stories!\n\n     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/196f0w/i_want_to_be_a_truck_driver/"
  }, {
    "id" : 15,
    "title" : "In a great relationship but developing a crush??",
    "snippet" : "Hi 2X, I created a throwaway because people I know irl know my real reddit account.\n\nI have been in an amazing relationship with a wonderful man for 4 years now and we've been long distance for ~2. Now, I love my bf very much but lately I've noticed I've developed a bit of a crush on a boy who goes to school here with me. He has been texting/talking/messaging me quite a bit - none of it visibly flirtatious though. Now, I'd never ever actually do anything with him but it disturbs me that I can have feelings (however superficial) for another guy when I'm lucky enough to be with an amazing man. Help me get some perspective?  It happens to us all at some point or another. It doesn't mean you're a bad person or that your relationship is doomed; it means you're human.\n\nThe most efficient way to nip this crush in the bud is to ease back on contact until your feelings for him diminish, and to shut down any venture into flirtatious territory promptly and firmly. If he doesn't already know you're in a relationship, work it into conversation at some point when it's appropriate. It happens to us all at some point or another. It doesn't mean you're a bad person or that your relationship is doomed; it means you're human.\n\nThe most efficient way to nip this crush in the bud is to ease back on contact until your feelings for him diminish, and to shut down any venture into flirtatious territory promptly and firmly. If he doesn't already know you're in a relationship, work it into conversation at some point when it's appropriate. It happens to us all at some point or another. It doesn't mean you're a bad person or that your relationship is doomed; it means you're human.\n\nThe most efficient way to nip this crush in the bud is to ease back on contact until your feelings for him diminish, and to shut down any venture into flirtatious territory promptly and firmly. If he doesn't already know you're in a relationship, work it into conversation at some point when it's appropriate. I'll try to lessen contact but it's hard because he's in my major in a small school so I see him all the time.  I recently went through this. I developed a crush on my fiance's roommate. We get along incredibly well, have great conversation, love the same things...I couldn't help it.\n\nOne night, I ended up confessing to my fiance and he was so hurt that he almost asked for my engagement ring back...it was bad. Him nearly breaking up with my knocked some sense into me and made me realize just how much I *didn't* want to lose him. So, I put all of my focus and energy into my fiance, and we went out to breakfast the next morning, and just...spent time together.\n\nWe've also been in an LDR before, too. It SUCKS, I know! I'm so sorry!\nI think sometimes people just need more affection than others, and I am definitely like that. You may be, too. Do you think, possibly? Maybe you just really feel better, in general, with more hugs, kissing, sex, etc.?\n\nIt disturbed me at the time, when I had my crush. I am sorry I don't have good advice and that my post is kind of all over the place, but I wanted you to know that it's a totally normal feeling, and you're not alone! That reaction sounds a bit over the top to me.  \n\nIn some sense it normal for some people to feel a bit threatened by their loved one finding someone else attractive... But wanting to break off the engagement because you found another guy (who I assume you don't love, don't want to marry and haven't spent that much time with) attractive? Yikes. I think it really sucks that he made you feel so guilty about it. \n  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195awh/in_a_great_relationship_but_developing_a_crush/"
  }, {
    "id" : 16,
    "title" : "feel like people are lying",
    "snippet" : "i have lost 100 pounds 3 years ago. I never think i look pretty. My husband and friends all tell me I look pretty and sexy, but all I see is the bad things about me. I feel like they are just saying it because they love me and want to make me feel better. How do i change the way i see myself.     One thing that has helped me to feel more confident about *my* body is to think about my friends and their relationships with their bodies. \n\nIf you have close girl friends, I suspect you've had dozens upon dozens of conversations with them, listening in horror as they dissect every teensy little thing they hate about themselves. As they cry/drink wine/eat ice cream/roll their eyes in disgust at the ridiculous over-load of warped media messaging/look sad, you've looked at their bodies and thought things like: \"I mean, yeah, I guess, she does have a bit of a muffin top, but her body is so cute! She has such a great smile! She has awesome boobs! She has such long legs!\"\n\nYes, because you have eyes you see that she has a muffin top or a big nose, but the things that you observe about her body and that she considers repulsive flaws don't *disgust* you, they're just features. You notice them, but you don't have an emotional response to them. You think, \"That's Jane's body. She's awesome.\" \n\nThis is how your friends think about you. They see that you have X feature that does not resemble a photoshopped Heidi Klum. But because they love you, they see you as a whole person, not X feature.\n\nI feel like this response is kinda disorganized, but I hope it can help you. Re-framing my thinking in this way, trying to see myself the way I see my own friends, really helped me.     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195qc1/feel_like_people_are_lying/"
  }, {
    "id" : 17,
    "title" : "I have no where to go, I'm dependent on my bf for everything. Help me figure out what to do! ",
    "snippet" : "Im sorry if this post turns out to be hard to follow. Im in a very scattered state of mind and I just want to hit things and scream.\n\n\nIm 19 years old and I have no one but my boyfriend, who is 21 years old. Weve been together for 3 years. By I have no one I mean that none of my family is in a financially/emotionally stable enough situation to provide me with any kind of support (monetary or emotional). My parents live on an income that totals half of what is considered poverty in the US. Because of this, they dont even have a phone that I can talk to them on. My grandma is blind and older and also poor. She has a lot of physical problems and usually has a hard time listening to me talk about my life. I dont have a single friend on the face of the planet. Im literally alone in the world without my boyfriend.\n\n\nI love him to death, and I want to be with him. But his current studies leave him with so little time that it is hard for him to give me the emotional/physical time that I need. I try really hard not to make him feel bad for it, but sometimes the fact that I only get maybe 2 solid hours alone with him a week builds up and I have a meltdown. I dont know what to do. I love him and I like him, and were fine when school isnt involved, but I feel so alone and I dont get near enough support as I need. And I feel awful, because Im sure its a heavy burden for him to carry knowing hes my only source of everything emotional.\n\n\nMy dependence on him goes further than that, too. I was never taught how to drive and my parents stole a large chunk of money from me when I was 16 that I was buying a car with, so my only source of transportation is through him. I live in a rural college town with no public transit, so I literally have no other options. Weve talked about him teaching me to drive, but with his schedule its hard to fit that in. Im going to have the money to afford a car in August, but whats the use of having a car if I cant drive it?\n\n\nBasically I feel like I am trapped and it doesnt feel good. I spent most of today crying because I feel like I had to grow up so fast (Ive been financially supporting myself since I was 15) but yet Im still as limited as a child. What do I do? I mean, if I ever get unhappy enough with my boyfriend to leave, what will I do? How do I break this dependence on him? I dont want to leave him, I might even want to marry him far in the future, but I want to be able to do everything myself if I have to. \n\n\nTL;DR: Basically I depend on my bf for everything because my parents never taught me essential life skills and need to know how to gain independence.\n\n**EDIT: I go to class 18 hours a week and I work 20 hours a week at a preschool. I live about 10 feet from campus, alone, because it's cheaper than dorms. I have a pretty ok income with my scholarships and job. I budget well, and after my tax return this year and working full-time this summer (along with a lot of saving for the last few years) I will definitely have the money for a car. It's just that my bf does not have the time to teach me.**   I'm so sorry you're lacking social support! That is really crucial. Even a couple of friends/relatives you can rely on makes a huge difference.  \nI didn't see anything in your post about what you get up to all week? Are you literally just staying at home with nothing to do? If so, I think a lot of this situation will be fixed by going to school or working part-time. Heck, even studying an online course might help!   You don't say what you do during the day.\n\nAre you in college? If not, is enrolling an option? There are any number of financial aid options available for impoverished students, and from what you said about your parents' income you should definitely qualify. There may be a community college nearby; they often offer trade skills in addition to pure academics, and a 2-year associate's degree can go a surprisingly long way, depending on the subject. They're also cheaper than state universities (not even talking about private ones).\n\nAre you working? If not, try go get at least a part-time job; it'll help build your resume *and* give you some cash. Contribute part of it toward living expenses; put as much as you can into a savings account. If nothing else, you can do some volunteer work to build up work experience for your future resumes.\n\nAsk your boyfriend to teach you how to drive. Do this as soon as possible - *before* you get a car. This is a big key to your independence.\n\nAs far as real-life skills: take care of some chores around the house, take a look at your finances and set up a budget (even if it's a dummy budget) and try to fit your expenses into it, even if it's only on paper. This will help you get a sense of how much you need to earn per hour/week/month/year, and what kind of spare cash you can expect to have on hand. If you don't even know where to start with it, Google \"basic budgeting\" or something like that and follow the steps.\n\nYou can do this. :) Thanks a lot for your advice! I'm currently taking 18 hrs of class and working 20 hrs/week. I have an ok income with my scholarships and job, and I'm pretty good at budgeting (like my post said, I've been taking care of myself since I was 15). I live alone about 10 feet away from campus because it's much cheaper. Again, thank you for your advice!     This might sound crazy, but why not get a bike instead of a car? A bike can be had for a fraction of the price of a car -- you can use the bike to regain your independence, giving you the opportunity to make new friends while continuing to save for a car, insurance, *and driving lessons.*  I have a bike. The problem is, like I stated, I live in a very VERY rural area and a bike cannot get me anywhere other than class. As for saving and money--there will be absolutely no problem with getting a car/insurance/all other things associated in August. I just need to learn how to drive the darn things. Thank you for your advice! ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195cyi/i_have_no_where_to_go_im_dependent_on_my_bf_for/"
  }, {
    "id" : 18,
    "title" : "Religious family member de-friended me on FB.  Wants to be friends again...HELP!",
    "snippet" : "Hello ladies!  I have a dilemma.  I (23F) have a cousin (28F).  We grew up in a religious family.  She stayed conservative (didn't kiss until her wedding day), and I turned out quite liberal (my husband and I lived together for several years before getting married).  \n\nAnyway, about two years ago I posted a picture on fb of me (in a sports bra and shorts) flexing my guns, haha.  She defriended me from fb.  We never talked about it, and I assumed she was figuring out my liberal streak and wanted to distance herself.  It hurt my feelings, but I got over it.  We were never THAT close.\n\nSo she messaged me today.  She said she defriended anyone (probably only women) who posted pics with their shirt off.  She said she wanted to look at fb with her husband around and saw my pic.  She said she was \"overprotective at the time because she was less secure.\"  She went on to say she was sorry, and can I forgive her? \n\nI am torn.  On the one hand I am really trying hard to get away from the judgement that comes along with my conservative roots.  It took me a long time to get over the hurt my old friends and family caused when \"I followed the path away from god\".  I spent years ridden with guilt, feeling like I was a bad person simply for thinking for myself.  I want to just be me, free from judgement.  \n\nOn the other hand, she was very brave to apologize, especially after all of this time.  That takes courage, a quality that I absolutely respect. But part of me thinks she isn't actually sorry, she just wants to evangelize to a lost soul.  \n\nI have no idea how to respond, or if I should even accept her friend request.  I can't talk to my family about this.  What would you girls do?  I'd just accept the request! You are right, she was brave in that she apologized to you!\n\nI think that if she makes a comment in a disapproving tone at all, remind her that you two aren't completely the same, and if they continue, it might be best to not be friends on Facebook again! \n\nHowever, don't let friending her (if that is what you decide) to keep you from posting what you usually post! Her friendship shouldn't shy you away from who you are :) Thanks!  How would you reply to her message?  Should I just say thank you for apologizing, or should I let her know that it hurt my feelings?  I'm not really sure how honest I am supposed to be...        ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/196cav/religious_family_member_defriended_me_on_fb_wants/"
  }, {
    "id" : 19,
    "title" : "I don't know how to proceed with my life.",
    "snippet" : "I am a 21/f going on 22. Currently, I am in my last semester of school for my General B.A. degree taking a course overload and I am scared for my future and wanted to take this opportunity to make changes and do a complete makeover of who I am and the lifestyle I live. I feel I am just a product of everyone else's influence over me and I need to figure out what I truly want.\n\n***\n\nI know that myself comes first. School is my first priority. I have never done as well as I have now over the course of my degree, and I am quite happy. I am halfway done my last semester. After school though, I have no idea where I will be living, what I will be doing. I just hate the uncertainty and it's stressing me out. I do have a place to stay after I am done (at my mom's place while she's away). I just do not want to get a minimum wage job after I am done, it'll make me feel like shit. \n\n***\n\nAs for the man I love, we've talked about how we both feel many times over the course of seven months that we have been broken up. He does not want a relationship because he wants to go out and do things on his own, which I do not blame him for at all between myself and his ex-girlfriend before me. He never truly had time for himself and being with his friends. We maintain a friendship and hang out every once in a while whether it's at a coffee shop, walking in a park or what have you. I just think there is still a lot of potential for the both of us if there was that second chance just because we've grown so much as individuals while we've been a part. I'd like to try again and see, at least. \n\n***\n\nJobs are frustrating the crap outta me. I am hoping that I find something for April because that's when I am done school. I am under review for a couple jobs, but I am terrified as to what comes after. I always have a plan, and this is the first time that I will be going into it with practically no idea what is to come. \n\n\n**TL;DR: I don't know what to do or how to start the changes I want to make in my life - morals, values, lifestyle. I don't know how to deal with my want to be with my ex-boyfriend who I've been broken up with for seven months and still think that things could work out. I don't know how to deal with getting a job, moving and all of that stuff. I am finally becoming a true \"adult\" and I am terrified of what is to come next.**  What you're feeling is perfectly normal for someone about to make a big life transition. I don't have any specific advice, but trust me, keep putting one foot in front of the other and things will work out. I'm also someone who like to plan ahead, but life is rarely that structured. It sounds like you're in a pretty good position for someone part way through their last year of school, so take this as an opportunity to embrace the unknown and accept things as they come. \"Adults\" are just people who have slightly more practice figuring things out as they go along, its not like you're supposed to know everything about yourself and the world because you graduate (or get married, or get a job, or have kids, or whatever).\n\nAnd congrats on (almost) finishing school! \n Thanks. I appreciate the comment. I have to realize that you can't always plan for what life has to offer you and I have to accept it. I am glad that I am not the only one who feels this way. I didn't think I was alone in the thought, but I thought maybe I was just over-reacting and not thinking straight.  Don't worry, chances are, everyone you know is feeling this way. I, for one, felt this way when I was graduating college. The advice I can give is this: go out there and apply for jobs you can see yourself working at, and the right job will come to you. \n\nI *highly* suggest you also become comfortable with the possibility that there are other men besides your ex who will be a wonderful match for you. You will never truly know if you would like to rekindle an old flame until you experience even just casual dates with other guys.\n\nLastly, be excited for your future instead of being afraid of it. It wasn't until I started saying \"yes\" to things I've never done before that my life took off in wonderful ways.   I always have a plan too, but you should let that go. Life will always throw a wrench in them and you stress yourself out just because the plan didn't work. Learn to roll with things. I did and I am considerably less stressed and happier.  I felt the same as you around that time in my life. See a therapist? I may go talk to a therapist on campus and go from there. I have had four previously when I was younger and have even gone to group therapy for anxiety, but it wasn't really my thing - there was no one my age. I will definitely give it a try at the school though. Thanks for the suggestion! I totally get it - I went to a group for bi polar and everyone was 40. When you can't relate to the other people its definitely not as helpful. Good luck with finding someone!!  I'm in a very similar situation: just broke up with my boyfriend of over five years, about to graduate with a M. Sc. in business and looking for a \"real\" job. I'm also scared shitless, not used to the uncertainty. What I've come to realize though is that sometimes, it's just not possible to have complete control over everything and have a perfect plan for the future. If you try to plan the unplannable, control the uncontrollable and force things, you'll just make yourself miserable. Try to see this as an opportunity instead. You don't need to know what you want for the rest of your life right this second. Even if you don't get the perfect job, or if you're not sure what job you want, whatever you get will give you time to try new things, figure things out and may lead to future opportunities. Sure, working minimum-wage sucks, but it sounds like you have some good potential jobs already. Concentrate on that, not the worst possible scenario. Likewise for men. I would suggest relaxing, dating other people and seeing what else is out there.\n\nAll that being said, I know it's difficult to just stop being scared and relax. I haven't managed it perfectly either yet. But there is no magical solution to the situation; you can't control or plan everything, so the only way to not drive yourself crazy is to learn to let go just a little. It's difficult, yes, but it's a good life lesson.   Know that it is exceedingly common to feel this way at this point in your life. Transitioning from college to \"adult life\" is very difficult! The good news is that life gets way better. It's really cool to establish yourself, prove to yourself that you can be self-sufficient, and get a job to earn some cash instead of being a poor college student. You can do so many awesome things and it'll feel great to work hard to achieve them. I can't tell you specifically what to do, but I can tell you that you're probably going to grow and change a lot in the next few years and if you keep your head up, you're going to come out of this transition as a better, stronger person.   Same boat, except I don't even have a place to stay after graduation yet :( Best of luck.  Ok so I sound very similar in personality to you. I have to have a plan and not having one stresses the hell out of me. So what you need to do is plan the unplannable. One of the reasons you are so freaked out is because you don't have a series of steps to follow. First of all make a list of the stuff that you have that is going well and that is already set. Like for instance having a place to live after you graduate. 2nd make up a list of steps you can take to either have a job by April or have something lined up so you can get a job (for instance volunteer work relevant to your field or an internship) Just having a set of concrete steps like 1.) Make 3 network connections in my field by March 15th 2.) Complete resume by end of February 3.) Apply to 10 different companies by April 1st Will help you feel like you have some more control over the whole thing.   Paint. Seriously and really and truly. Watercolor, acrylic, whatever. Even get a box of crayons. Just take ~10 minutes a day (or more if you like) and sit with something blank, paper or canvas, and make it pretty. Preferably do this first thing in the morning, but if that doesn't work, do it any time you can. No purpose in mind. Just sit and relax and create. Do it every single day for a week. I, your friendly neighborhood internet stranger, guarantee that this will awaken your inner crystal-ball-oracle-fairy-godmother.  This seems like a kinda great way to waste time and not really solve the issue. Just sounds like a way to escape the problem without solving it.  Paint. Seriously and really and truly. Watercolor, acrylic, whatever. Even get a box of crayons. Just take ~10 minutes a day (or more if you like) and sit with something blank, paper or canvas, and make it pretty. Preferably do this first thing in the morning, but if that doesn't work, do it any time you can. No purpose in mind. Just sit and relax and create. Do it every single day for a week. I, your friendly neighborhood internet stranger, guarantee that this will awaken your inner crystal-ball-oracle-fairy-godmother.  This is a great idea too. Thanks! I just need to relax and just get into a zone. I have painted before and it helped so much. I just have forgotten this method of relaxing and getting my mind off of things. Thanks for the reminder. I will definitely start doing this again. \n\nEdit: Saw the comments - it doesn't really resolve the issue, but it eases my mind and I think would be a good thing to do here or there with a combination of trying to figure out what to do. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194zif/i_dont_know_how_to_proceed_with_my_life/"
  }, {
    "id" : 20,
    "title" : "What are your favorite snacks?",
    "snippet" : "As the Reddit Gift Exchange rolls around, I realize that all *my* favorite snacks don't mesh well with what my match wants, so I figure who better to ask then the lovely ladies of 2X? I would just head to AskReddit, but I've always had better, more serious responses here. \n\nAnyway - thanks for your time! I'm somewhat stumped. =[\n\nEDIT: His criteria was nothing crunchy or chewy.\n\n  Plain milk chocolate? Sucking candies? Powdered Kool-Aid? Maybe cookies?\n\nWhat the hell isn't crunchy or chewy??!!\n\n\nI'm struggling to come up with unique things to send, and my match's only requirements were \"no candy with alcohol/spirits in them\". I don't envy you. Lucky you. xP ErisHeiress also pointed out that hard candy to suck on isnt' crunchy or chewy... \n Yea, I didn't see that because I already had the thread open.\n\n\nLast year my match said he really likes snacks with peanut butter. Made it a lot easier because I had a path to follow, but it wasn't too restricting. Granted, I'm guilty of saying that I like everything.   It would help if you told us what your match likes. I edited all the info I got in; He wants nothing crunchy or chewy.  No crunchy or chewy? \n\nUh... shit.  yogurt :p I don't think yogurt would ship well, though. No crunchy or chewy? \n\nUh... shit.  Yea... That's where I'm at. Apparently there was dental work done recently, which probably makes sweet iffy too. All I can think of is hard candies like lollipops, jolly ranchers, that sort of thing. Technically crunchy but you shouldn't chew 'em anyway.   well im gonna sound like a dork but dried fruit from safeway. fruit cups. granola bars from costco. some kinda crackers. yogurt. ice chips        ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195bae/what_are_your_favorite_snacks/"
  }, {
    "id" : 21,
    "title" : "I cut off 13 inches and donated to Locks of Love today! (pics inside)",
    "snippet" : "Fortunately, the salon I visited serves wine to their patrons, which calmed the nerves a bit. I immediately loved the look and feeling of my short hair!\nBefore: http://imgur.com/zwpA6vG\nAfter: http://imgur.com/vxjQu1G\nEdit: Thanks for all of the lovely compliments, friends! I wish I would have done more research. I appreciate the information.  I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. Pantene is where I ended up sending mine after some research into locks of love.  Pantene is where I ended up sending mine after some research into locks of love.  I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. Thanks for this info! I'm planning on donating my hair, and it's good knowing where to send it. You have to remember that it costs a lot to hand sew each strand individually to make these wigs- meaning all of these organizations have warehouses full of hair and no money to make them into wigs. So if you are going to donate your hair, you really should send a monetary donation in addition to that to help offset the cost of making the wig.  Can you send just money donations? I already chopped my hair off (and it grows to slowly for me to commit to regrowing it) but I want to help somehow! I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. Locks of Love charges on a sliding scale or does give some away for free based on the financial situation of the family. You have to remember, it costs *thousands* of dollars to make a cranial prosthetic wig with each hair individually sewn in. Plus, since children's head grow quickly, they outgrow the wigs or have to be fitted with special vacuum fit hair prosthesis. \n\nPantene is able to give their wigs away for free because they are a multi million dollar successful company that has the money to back the non-profit side of their company. Locks of Love is only non-profit and works entirely off donations. So rather than knocking the company and discouraging donations, maybe instead encourage sending monetary donation in addition to the hair donation to help offset the cost of making the wigs this non-profit organization devotes all its resources to. Locks of Love charges on a sliding scale or does give some away for free based on the financial situation of the family. You have to remember, it costs *thousands* of dollars to make a cranial prosthetic wig with each hair individually sewn in. Plus, since children's head grow quickly, they outgrow the wigs or have to be fitted with special vacuum fit hair prosthesis. \n\nPantene is able to give their wigs away for free because they are a multi million dollar successful company that has the money to back the non-profit side of their company. Locks of Love is only non-profit and works entirely off donations. So rather than knocking the company and discouraging donations, maybe instead encourage sending monetary donation in addition to the hair donation to help offset the cost of making the wigs this non-profit organization devotes all its resources to. Also keep in mind that most of Lock of Love wigs go to kids with some form of Alopecia or permamnat hairloss. keep in mind what? Does that change whether they deserve the wigs? Kids with alopecia absolutely deserve wigs if they want them. It's just not common knowledge that Locks of Love will only work with children who have permanent hair loss. Most kids with cancer (assuming they survive) will regrow their hair after the chemo stops, so they aren't eligible. Most people think they are donating their hair/money to sick kids.  Kids with alopecia absolutely deserve wigs if they want them. It's just not common knowledge that Locks of Love will only work with children who have permanent hair loss. Most kids with cancer (assuming they survive) will regrow their hair after the chemo stops, so they aren't eligible. Most people think they are donating their hair/money to sick kids.  keep in mind what? Does that change whether they deserve the wigs? I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. Do you happen to know of any other good companies to donate through? Pantene doesn't accept dyed hair, so I can't use them :( Do you happen to know of any other good companies to donate through? Pantene doesn't accept dyed hair, so I can't use them :( I wrote up this response on another post and you can check out the organizations\n\n&gt;There aren't that many organizations to chose from. Obviously Lock of Love is the most well known. The American Cancer Society recommends  [Wigs for Kids](http://www.wigsforkids.org/) and [Pantene Beautiful Lengths](http://www.pantene.com/en-US/PanteneBeautifulLengths/Pages/default.aspx). Others I have heard of are http://www.childrenwithhairloss.us/ , [Angel Hair](http://www.angelhairfoundation.org/), [Angel Hair for Kids](http://www.acvf.ca/index.php/our-programs/angel-hair-for-kids/), [Chai Lifeline](http://www.chailifeline.org/), and [Wigs 4 Kids](http://www.wigs4kids.org/). \n\n&gt;But honestly, most of these organizations are not in need of hair- they are in need of money in order to make the wigs which are hand sewn strand by strand. Last report I heard, they had a warehouses filled with donated hair without the funds to make them into wigs. So I would recommend sending a monetary donation in addition to your hair donation to offset the cost of the wig no matter which you chose.  Do you happen to know of any other good companies to donate through? Pantene doesn't accept dyed hair, so I can't use them :( There's an organization called Children With Hair Loss that you can donate to, and they don't charge for the hairpieces they provide. I'm cutting all of my (color-treated) hair off in a few weeks with St. Baldrick's, and sending my hair their way :) do you shave your head for st. baldricks? i've thought about doing that actually. i've donated my hair many times but think shaving my head would kinda neat! Yep! It's really more of a buzz cut; they don't allow razors at the events, pretty sure thats for safety reasons. You can check their website to see if there are any events in your area, mine is the Thursday right after St. Patrick's day and I think a lot of places host them around that time! (I'd link you, but I'm on my phone and can't remember if it's .com or .org) do you shave your head for st. baldricks? i've thought about doing that actually. i've donated my hair many times but think shaving my head would kinda neat! can you tell me more about St Baldricks? My mind just jumps to black adder but it sounds like fun I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. I love this look! If you are planning to do this again I'd recommend donating to Pantene Beautiful Lengths or a different company because Locks for Love charges for the wigs they make where as some of the other companies give them away for free. I'm actually planning on donating my hair at some point when it gets long, and I've always said \"Locks of Love\" whenever anyone asked because I guess they're the most famous organization that does this, so I'm commenting here because I want to remember Pantene Beautiful Lengths.\n\nAlso a source would be nice.  Cute! I really like the chin length look on you.\n\nAnd wine at your salon?! Why dont I have any of these magical places near me??? Cute! I really like the chin length look on you.\n\nAnd wine at your salon?! Why dont I have any of these magical places near me???  I did a similar thing a few years ago, I cut off 25\" of hair. I guess it's unusual in a sense because I'm a guy, but I loved being able to donate all that hair.  Unusual? More like awesome.  I ended up cutting off 28 inches 2 years ago and sold it. It paid most of a semester of college for me. I wish I had the money so that I would've been able to just donate it but that income kept me from going into debt as soon.  How did you sell it? There was a website that was kind of like an amazon or eBay for hair (kind of weird) but I posted pictures of my hair and gave info about it. I got paid more because I hadn't cut it yet and was willing to have the cutting recorded. The person that I sold to didn't tell me if they were using it for a wig or whatever and I didn't ask. I got a little over $4,000. My hair had never been colored and was extremely well maintained. The only thing that would have gotten me more money was if it had been virgin, or never before cut, hair.  Based on your description, I've decided that there's like an 80% chance that a creepy dude in a yellowed tank-top is furiously masturbating into a pillow stuffed entirely with human hair that he bought from this service. There was a website that was kind of like an amazon or eBay for hair (kind of weird) but I posted pictures of my hair and gave info about it. I got paid more because I hadn't cut it yet and was willing to have the cutting recorded. The person that I sold to didn't tell me if they were using it for a wig or whatever and I didn't ask. I got a little over $4,000. My hair had never been colored and was extremely well maintained. The only thing that would have gotten me more money was if it had been virgin, or never before cut, hair.  I ended up cutting off 28 inches 2 years ago and sold it. It paid most of a semester of college for me. I wish I had the money so that I would've been able to just donate it but that income kept me from going into debt as soon.  Where did you go to sell it? I've been considering doing that but I don't really know where to even start looking.  There was a website that was kind of like an amazon or eBay for hair (kind of weird) but I posted pictures of my hair and gave info about it. I got paid more because I hadn't cut it yet and was willing to have the cutting recorded. The person that I sold to didn't tell me if they were using it for a wig or whatever and I didn't ask. I got a little over $4,000. My hair had never been colored and was extremely well maintained. The only thing that would have gotten me more money was if it had been virgin, or never before cut, hair.\n\nEdit: when I get home I'll try to find the website I used, I can't think of it off the top o my head.  I ended up cutting off 28 inches 2 years ago and sold it. It paid most of a semester of college for me. I wish I had the money so that I would've been able to just donate it but that income kept me from going into debt as soon.  How much money did you get? A little over $4000.  Woah, that's more than I expected.  Now that I'm looking at prices that people are selling for on some sites I think I ended up getting extremely lucky. I ended up having a slight bidding war also so that definitely helped me.   I ended up cutting off 28 inches 2 years ago and sold it. It paid most of a semester of college for me. I wish I had the money so that I would've been able to just donate it but that income kept me from going into debt as soon.  I'm also interested in doing this. What condition does your hair have to be in? I've never dyed it but I have tons of split ends caused by heating tools. My hair had never been dyed, it was extremely well maintained. When I say that I mean that I rarely ever used heating tools on it, I used coconut oil on it and used only gentle shampoos and conditioners. I regularly trimmed my hair to keep split ends at bay also.  I'm planning on doing this. I've got about 14 inches so far. \n\nCan you tell me what the website you used was called? I can't find the exact site that I used but I found one that looks nearly identical its http://sellhairstore.com\n\nI just want to warn you, after looking at what people are offering their hair for I would wait until you have more to cut, 20 inches and over really is prime. I think that I honestly got ridiculously lucky and ended up having a bidding war that drove the price up more. I wasn't willing to cut that much hair and sell it for less than $2000 and I was firm with people that were bidding. Good luck and I hope you're as lucky as I was!                      ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/193c3k/i_cut_off_13_inches_and_donated_to_locks_of_love/"
  }, {
    "id" : 22,
    "title" : "How do you rebuild self-confidence and trust in a relationship when it's been shattered?",
    "snippet" : "My husband and I have been together for five years, married for three. We have two children together, a 2.5 year old and an 11 month old.\n\nIn September last year I found out he'd had an inappropriate flirtationship with a 17 year old he worked with (he's 26, where we live age of consent is 16, so while not illegal it still upsets me, though that's the mama bear in me talking). The extent of their relationship was sexy texting, flirting, sexual tension, hanging out together. He says nothing physical happened. It came to a head when she made a move on him (alone in her bedroom) and he turned her down.\n\nI actually found out from her friend who sent me a Facebook message linking me to her tumblr and instagram. It was full of things about my husband, including screenshots of texts he'd sent her. \n\nThis came at a really hard point in our relationship; i had PPD, our baby was 6 months old and hadn't slept for more than an hour at a time, and that was sleeping while I held her. She wouldn't take a bottle, so no one could relieve me. Despite that I was back at work because we were trying to buy a house. Then work told me that my job would finish in January. I also have rheumatoid arthritis and was/am having an active flare but can't take any of my regular medication for it because I'm breastfeeding. So yes, shit was hard, and I was feeling very vulnerable.\n\nEven after he was busted and I made it clear to him how I felt he kept texting her. He still saw her at work. She didn't know I had her tumblr so she kept posting texts he was sending her. He made all these cute little efforts to cheer her up (she is depressed and she self harms), and he did nothing to try cheer me up. At one point we had just finished having sex, I got up to go to the bathroom and he texted her about wearing her vagina on his face. We had another huge argument and he said he wouldn't see her socially or talk to her outside of work.\n\nFast forward to valentines day just gone, and a friend of mine who doesn't know what has been going on texted me asking why my husband was out with another girl practically sitting on top of her. And why they left in his car together. \n\nSeriously, is it so unreasonable for me to ask that he doesn't see her? Why can't I make him understand how much it hurts me that he's off with her? This is the first time in my life I've been riddled with self esteem issues about my body. I'm carrying around extra weight from the kids, my hands are starting to deform because of the RA, I'm constantly tired and worn out. But none of that mattered to me before he started getting his ego stroked by this younger, hotter woman. \n\nSo now I'm in limbo. He's apologizing and saying all the right things, but really, he's been saying them for months. He keeps going back to her. He says he's lonely and he felt like I didn't need him anymore because I appear so capable and that I prioritise the children over him and that's why he keeps hanging out with her. \n\nIs there anyway to rebuild the trust? I'm at a point now where I'm just waiting for it to happen again. I love him (otherwise I wouldn't still be here) but I can't handle having my self esteem crushed every few weeks/months. How do I rebuild my own self confidence? I've never before hung my self esteem on how my body looked, but now I can't stop and I don't know how to reach a body acceptance. \n\nThere's a lot more that's happened with him and the other woman that contributes to how hurt I am, but I'm so tired my brain is muddled. Also, I have seen a counsellor by myself, but she wasn't very helpful. Basically spent the entire hour calling my husband a scumbag. We have a marriage counseling appointment but it's about a month away.\n\nTL;DR husband betrayed me with a younger, more attractive woman while I was at a very vulnerable stage, no idea how or if I can rebuild trust and self esteem.\n\n   &gt;  He says he's lonely and he felt like I didn't need him anymore because I appear so capable and that I prioritise the children over him and that's why he keeps hanging out with her. \n\nHe's lying to you and blaming you for the affair. And its an affair. An ongoing one at that. The fact that they're supposedly not doing the rumpy pumpy doesn't change that one bit. \n\nThese are not the actions of a grown ass man, but that of a self obsessed 17 year old boy with his head stuck up his ass. He's a twenty-six year old male fooling around with a 17 year old girl with self-destructive tendencies that he's meet through work. While not illegal, it's a miracle he's still got a job: A state of affairs which is, quite frankly, more than likely to change at some point within the immediate future. He is hurting the girl, *not* helping. \n\nAnd he's hurting you, the mother of his children. Because you supposedly don't need him enough. Because he's lonely. **Aren't you lonely?** \n\n&gt; no idea how or if I can rebuild trust\n\nNor do I. It might be doable, but for one thing: **You're not a moron with cat shit for brains**\n\nYou recognize the presence of a pattern and that the likelyhood of anything changing is practically nil. You cannot build anything durable on a rotten foundation plagued by eight feet tall termites. Only hope to fool yourself while knowing deep down that you husband don't care enough about you and your children to not cheat on you with a disturbed 17 year old girl. \n\n&gt; no idea how or if I can rebuild self esteem.\n\nPack his bags. Treat yourself with the respect you're due. \n\n&gt;I love him \n\nIt's not enough. I know that's not what you want to hear, but its the truth. \n &gt;  He says he's lonely and he felt like I didn't need him anymore because I appear so capable and that I prioritise the children over him and that's why he keeps hanging out with her. \n\nHe's lying to you and blaming you for the affair. And its an affair. An ongoing one at that. The fact that they're supposedly not doing the rumpy pumpy doesn't change that one bit. \n\nThese are not the actions of a grown ass man, but that of a self obsessed 17 year old boy with his head stuck up his ass. He's a twenty-six year old male fooling around with a 17 year old girl with self-destructive tendencies that he's meet through work. While not illegal, it's a miracle he's still got a job: A state of affairs which is, quite frankly, more than likely to change at some point within the immediate future. He is hurting the girl, *not* helping. \n\nAnd he's hurting you, the mother of his children. Because you supposedly don't need him enough. Because he's lonely. **Aren't you lonely?** \n\n&gt; no idea how or if I can rebuild trust\n\nNor do I. It might be doable, but for one thing: **You're not a moron with cat shit for brains**\n\nYou recognize the presence of a pattern and that the likelyhood of anything changing is practically nil. You cannot build anything durable on a rotten foundation plagued by eight feet tall termites. Only hope to fool yourself while knowing deep down that you husband don't care enough about you and your children to not cheat on you with a disturbed 17 year old girl. \n\n&gt; no idea how or if I can rebuild self esteem.\n\nPack his bags. Treat yourself with the respect you're due. \n\n&gt;I love him \n\nIt's not enough. I know that's not what you want to hear, but its the truth. \n   Trust one thing and one thing only: empirical data. Not words, not promises, not hope. Trust the behaviors you observe.\n\nNo one would say that ending a marriage with two little ones and serious physical ailments is easy. However, you have seen no indication that your husband will actually change his ways (just that he says he will). I see no indication that your marriage will change. People who want to change don't talk about changing; they do it.\n\nYour statement about the counselor calling your husband a scumbag suggests to me that you do not want to believe that about him. Let's see: he has lied to you, broken his promises to you, cheated on you, disrespected you, and blamed you for his philandering. \n\nWhat, pray tell, is your definition of \"scumbag?\" I think what she meant was that the counselor was too focused on her husband being a scumbag to help with her problem. Her husband being a scumbag is the problem. I think what she meant was that the counselor was too focused on her husband being a scumbag to help with her problem. Trust one thing and one thing only: empirical data. Not words, not promises, not hope. Trust the behaviors you observe.\n\nNo one would say that ending a marriage with two little ones and serious physical ailments is easy. However, you have seen no indication that your husband will actually change his ways (just that he says he will). I see no indication that your marriage will change. People who want to change don't talk about changing; they do it.\n\nYour statement about the counselor calling your husband a scumbag suggests to me that you do not want to believe that about him. Let's see: he has lied to you, broken his promises to you, cheated on you, disrespected you, and blamed you for his philandering. \n\nWhat, pray tell, is your definition of \"scumbag?\"         ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194m3d/how_do_you_rebuild_selfconfidence_and_trust_in_a/"
  }, {
    "id" : 23,
    "title" : "Righting Wrongs aka Turning Lead Into Gold (x/post from r/self)",
    "snippet" : "For many reasons this is a throwaway account.\n\nHi Reddit. I have a very serious legal issue, and I want to take the time to tell bit of a story. If you find that it's too long, I apologize, however, it's important to me that everyone understand that this is not a joke, this is not a lie, this is an account of actual events that have brought me to this point.\n\nIn 2007, I joined the Air Force. I was 19. My father, a retired Air Force Sergeant, helped me go through the process. My biological mother, and my step mother, are also retired or ex-military. I wanted to pay for school, and be done with my 2 years, so I felt that I was familiar enough with the military that I could get in, and get out and be done. That's not what happened. I signed up to join in the state of Georgia, where my father lives. All of my information on all of my paperwork had my address and residency in the state of Georgia. Before I left for basic, a friend asked me to visit her, in Texas. Being that MBT takes place in San Antonio, I figured, why not? I asked my recruiter and my father if it would be possible to leave for basic from Texas, since I'd already signed in and had a date set to go in. They said sure thing, got me all transferred to a recruiter in Conroe, Tx, and off I went to visit my friend.\n\nThe time came for me to go to basic, and my group left from Houston. I spent a week in basic training before I began to feel ill. We were informed that a pretty nasty respiratory infection was going around, but no weight was put on how serious it was. I continued to get sick. Eventually, I decided it was time to get to a doctor. One night, I began to hyperventilate, I was extremely anxious, I was overly warm, and I needed assistance. Upon arriving at the bases hospital, I was subjected to ridicule, no real check-up and told I was fine and may have had \"dust in my throat\" which was \"slightly inflamed\", given a prescription for ibuprofen, and sent on my way. The next day, at the pharmacy, the pharmacist asked my why I was only getting ibuprofen. I told him I didn't know, and he immediately sent me to the doctor in the clinic. Turns out, I had a full blown case of at least 5 infections, including Strepp, and was given a penicillin shot immediately. I was also prescribed a bunch of pills. At that point, I decided I wanted to get out. I didn't feel well, I felt malnourished, and generally awful. I was released with a claim of \"anxiety\" which I did report, however being that it turned out I was falling ill, I should've had someone change that on the grounds of medical reasons.\n\nNow we get to the good part. Upon being released from BT, I was told that I would be leaving, returning to Houston. Surprised, I asked why, seeing as how my actual residency was in Georgia. I never became a Texas resident. I was told \"we just have to send you back to the location you came from\". I asked them why I couldn't be sent to the location I was actually from. They told me to take my ticket or stay in basic training. I informed them that I had no phone, no family or contacts in Houston, and they still refused to allow me to contact my father, a former National Security Agent, to get them to help me. I was sent to Houston, and subsequently kidnapped, right out of the bus station by a pimp. I was subsequently missing for 3 weeks to a month, and then raped after refusing to perform sexual services for said pimp. Remember I was 19, fresh out high school, still sick from basic training, and now a rape case on the southside of Houston. My case with the HPD, was never handled, though I contacted the officer who was handling my case for at least 2 -3 months after the fact.\n\nFast forward to today. I am in the process of getting ready to file suit against a business, and I don't want to get into the details of it, but in order for me to do so, I pretty much have to go back and make all of these claims to the proper authorities. I've contacted my family, with no response or help from them. I've contacted as many legal entities as I can, including the State Attorney General of Texas, to have my case re-opened. I want to know what I can do. I cannot continue to live my life as a victim of a system that looks at me and only sees a \"whore\". I've had to make my life work as an exotic dancer and many other odd jobs, where I am being used illegally for labor or to perform acts I DON'T WANT TO. And at the risk of losing what little money I can keep together, I continue to travel, trying to find a place where someone will help me. My family apparently thinks I'm a ghost. The only person willing to fight is my partner, who is the only person who has cared to know my life story. I am so sick and tired of being raped by EVERYONE who should've taken responsibility when they had the chance. I plan to make noise. I plan to cause a fuss. I plan to make REAL CHANGES. I have lived my life WHORING myself to the world because it looks at me and says that is exactly what I am. I've contacted my local FBI, at least 5 attorneys, various grassroots agencies, and yet I still feel invisible. Do you know the lady who answered my call at the FBI said she didn't even know that labor trafficking was the same as sex trafficking? I have both issues, and they STILL haven't gotten back to me.\n\nReddit, I know you can't be the cesspit of tomfoolery and assholery that I have been witnessing over the past year or so. I have had awesome interactions with the people of this site, and I know someone with a working brain and a working heart will know what I can do to have my ENTIRE LIFE rectified.\n  ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195lil/righting_wrongs_aka_turning_lead_into_gold_xpost/"
  }, {
    "id" : 24,
    "title" : "My left ovary is missing",
    "snippet" : "I have a pretty complicated pelvic history.  I had a uterine prolapse when my youngest was born, and had to have a hysterectomy and cystocele/rectocele repair.  They left both my ovaries as I was pretty young and they didn't want me to go into surgical menopause.\n\nTwo years later the repairs failed and I had to go back in for another repair surgery.  This time they place a sling (of porcine tissue) under my bladder, attached to the interiors of my hip bones, to hold it in place.  Unfortunately, the surgeon had never done it before (and did not tell me), and he caused *a lot* of damage.  I had 8 further surgeries that year to correct the damage he caused.  I've had chronic pain since then, incontinence problems, and other issues.\n\nFast forward 10 years to this week.  Having lots of \"new\" pain, I've been seeing a new ob/gyn.  Turns out I have a huge cyst that's adhered to several places inside my pelvic cavity, and is full of blood and is infected. I've already spent 3 days in hospital on IV antibiotics, and now I'll be having surgery soon to remove that.  That alone is stressing me out.\n\nBut the thing that's REALLY freaking me out; through all the imaging studies to find this cyst, my doctor discovered I don't have a left ovary.  It just isn't there.  At some point, during one of those many surgeries, someone removed a perfectly health ovary and **didn't tell me about it**.\n\nI have all the surgical notes, not one of them mentions removing an ovary.  (I do know I had one, because of an ultrasound done prior to my hysto.)  According to my current doc, this \"happens sometimes\"??!!\n\nHad anyone else had this happen?  Heard of it happening to someone else?  I'm upset and angry, not least because they're going to have to remove my right one now and put me into surgical menopause.  But I just feel incredibly violated.  And angry.\n\n\n**TL;DR**:  I used to have two ovaries.  One was surgically removed for no reason (at some point) and without my knowledge.  The last one will be removed soon.  Has anyone else had this happen to them??\n\nSorry for the wall of text, I'm freaking out. :(\n\n**EDIT**:  Wow ladies, thanks for all your support!  It really does help. :)  A couple questions that keep coming up:  I was active duty military and therefore cannot sue.  We actually tried at the time, having my non-US citizen husband sue...no go.  I do, however, receive a military retirement, so that helps.  And health care (civilian, but paid for by the DoD).  One person said a similar thing happened to her mom, and it turned out her ovary was still present, but had migrated through her pelvic cavity...so maybe mine's just gone on walkabout and they'll find it in this next surgery!  \n\nAlso, I do have all my surgical notes (needed them for my medical retirement), and none of them mention removing an ovary.  I did go through them again last night.  Now I'm researching if I have any help available through the VA.\n  Oh my god, I can't imagine how awful and scary that must feel. I'm so sorry that happened to you. I hope you can figure everything out and perhaps get compensated. I know this isn't much, but have some internet hugs from me. Thank you. :)  All of those earlier surgeries were done through the military, either by mil docs or referrals to civilians that the military paid for.  I'm more interested in getting a hold of that initial doc (who's still in the AF and still practicing) and letting him know exactly what I think of him.  Probably not a good idea though... Were you on active duty when all of this was going on?  Even if you are a veteran make sure you go talk to an outside group that can help file claims. I am from a military family and have had lots of experience with the VA and they really do only want to help you get the care you deserve in every way.  I may be jumping the gun and you are not a veteran or active duty but no matter who did this to you it is still unjust.  I have no idea what you are going through but for right now you need hugs more than anything so more internet hugs.   I'm a female vet, and yes, my VA disability is directly related to my surgeries.   Same here.  I'm just pissed that I can't sue.  Not for the money (I prefer the retirement anyway), but because I know he's *still practicing* and still in the AF.  That really bothers me... Were you on active duty when all of this was going on?  Even if you are a veteran make sure you go talk to an outside group that can help file claims. I am from a military family and have had lots of experience with the VA and they really do only want to help you get the care you deserve in every way.  I may be jumping the gun and you are not a veteran or active duty but no matter who did this to you it is still unjust.  I have no idea what you are going through but for right now you need hugs more than anything so more internet hugs.   Yes, I was active duty through all those surgeries.  I was medically retired (at 15 years service) because of all the damages.  I have to re-file my VA claim soon anyway, and will try to add this.  The VA lost my records 3 separate times, and finally just rated me on a hysterectomy; none of my actual problems were rated.  Since I haven't had any pelvic surgeries since I was retired, and since I quite patently had an ovary before them, I'm hoping I can get that added with all the rest of it. Thank you. :)  All of those earlier surgeries were done through the military, either by mil docs or referrals to civilians that the military paid for.  I'm more interested in getting a hold of that initial doc (who's still in the AF and still practicing) and letting him know exactly what I think of him.  Probably not a good idea though... Thank you. :)  All of those earlier surgeries were done through the military, either by mil docs or referrals to civilians that the military paid for.  I'm more interested in getting a hold of that initial doc (who's still in the AF and still practicing) and letting him know exactly what I think of him.  Probably not a good idea though... Ripping him a new one through a lawyer would be better. If he does random shit like this for no reason it's time he's put out of practice. Can't be done.  Veterans, active duty, and dependents, and their civilian family members, cannot sue military doctors.  Federal law, although I don't have a cite handy for it. My older brother died due to delayed medical care and the idiocy of a doctor (born premature and the doctor kept saying nothing was wrong while my mom was in labor).  It was clearly malpractice, but nothing can be done because my dad was military.  My older brother died due to delayed medical care and the idiocy of a doctor (born premature and the doctor kept saying nothing was wrong while my mom was in labor).  It was clearly malpractice, but nothing can be done because my dad was military.  Wow, I'm so sorry.  Was that doctor at least disciplined?  I can't even imagine...  I can't imagine how scary it is to realize someone *stole a part of your body against your knowledge*. I'm really sorry this happened to you. Since you have a lot of documentation, do you think you could pursue a medical malpractice lawsuit?\n\nBy the way, pardon the dumb question but... it isn't possible that your body actually reabsorbed your ovary or anything like that, is it? &gt;stole a part of your body against your knowledge\n\nThat's exactly what's freaking me out.  My personal gut feeling is the doctor that who did the sling surgery accidentally nicked it and then removed it...and didn't put it in the notes.  The surgery itself was only supposed to be 2.5 hours and ended up being nearly 6.  And he was really dodgy about the whole thing afterwards, and washed his hands of me by two weeks post-op (transferred me on to a urologist and wouldn't see me anymore).  \n\nYes, your body can reabsorb an atrophied ovary (so my current doc says), but unless it had been damaged in some way during the surgery it shouldn't have atrophied in the first place.  \n\nEither way, I doubt I'll ever know what happened.  But it's really freaking me out, especially since they now have to remove the other one.   I do have a friend who had one just go missing though. They have no idea where hers went but it simply isn't there any longer. Can you get your surgical records? You are entitled to them. Very strange...had she had surgeries or anything?  And yes, I have my surgical records; there's no mention of removing an ovary. :(   Someone in this equation needs to be sued for negligence or malpractice. Someone in this equation needs to be sued for negligence or malpractice. Military doctors cannot be sued.   Seriously? Why? It is called the Feres Doctrine.  Military docs are protected from malpractice suits by law.   Military doctors cannot be sued.   Sorry, maybe I'm just being obtuse, but where did OP mention one of her doctors was a military doctor? Sorry, maybe I'm just being obtuse, but where did OP mention one of her doctors was a military doctor?  How did they confirm that it is missing? I have both ovaries, but one didn't show up on an ultrasound I had a few months ago. Apparently it is not uncommon for them to not show up. I hope things work out for you! My understanding is that it didn't show up on either the ultrasound or a CAT scan they did.  I was really stunned when I spoke with the doc, and came up with a huge list of questions afterwards.  I'll be sure to ask if there's any chance it was a mistake. My understanding is that it didn't show up on either the ultrasound or a CAT scan they did.  I was really stunned when I spoke with the doc, and came up with a huge list of questions afterwards.  I'll be sure to ask if there's any chance it was a mistake. Definitely check to see if it was an error. I had three ultrasounds and a CT scan in an attempt to locate my (potentially infected) appendix, none of which found it. Eventually, surgery was required to examine my enigmatic vestigial organ. An appendix is obviously significantly smaller and easier to miss than an ovary, but there is a chance that it was similarly hidden. That's what I'm hoping at least.  Since they'll likely need to remove my right ovary in this upcoming surgery, I'll know pretty soon if the left one is there or not, I expect.  Maybe they'll be able to visualize it while they're in there...\n\nDid they ever find (and remove?) your appendix??  My mother has gone through much of what you're dealing with! Almost exactly! After her hysterectomy she still had her ovaries leftover. She started experiencing pain, one of her ovaries was basically overcome by cysts so they removed that. She was still having pain and the doctors determined that her other ovary was literally just \"floating\" around inside of her causing pain! They thought someone had taken it out previously, but as it turns out it never appeared on any of the numerous scans she had done! Kind of mind boggling. Then again, my mother has a LOT of scar tissue from her 3 c-sections and hysterectomy plus numerous other surgeries -- so that might be why it was hard to find.\n\nRecently my grandmother found out her ovaries are missing, and the doctor said it was likely due to prolonged chlamydia that was undiagnosed! \n\nI wouldn't get too stressed about your ovary just yet, it may show up sooner or later just like my mom's! Good luck getting everything sorted out! &gt; it may show up sooner or later just like my mom's\n\n...considering the fact that your moms' was found floating around her abdomen, I don't know how reassuring that is :/  This entire thread is all kinds of horrifying. My mother has gone through much of what you're dealing with! Almost exactly! After her hysterectomy she still had her ovaries leftover. She started experiencing pain, one of her ovaries was basically overcome by cysts so they removed that. She was still having pain and the doctors determined that her other ovary was literally just \"floating\" around inside of her causing pain! They thought someone had taken it out previously, but as it turns out it never appeared on any of the numerous scans she had done! Kind of mind boggling. Then again, my mother has a LOT of scar tissue from her 3 c-sections and hysterectomy plus numerous other surgeries -- so that might be why it was hard to find.\n\nRecently my grandmother found out her ovaries are missing, and the doctor said it was likely due to prolonged chlamydia that was undiagnosed! \n\nI wouldn't get too stressed about your ovary just yet, it may show up sooner or later just like my mom's! Good luck getting everything sorted out!         Holy fucking malpractice! I don't even know where to tell you to begin. The problem is you have had so many surgeries it'd be difficult to figure out who did it. Were all of your follow up surgeries performed by the same person or at least at the same hospital?\n\nI am so sorry you are going through this. The damage, pain, and bladder difficulties are problem enough, and now to find out you're missing an ovary that you were never told about... I can't imagine. I'm really not a litigation-happy person but some situations call for it. This is one of them. You don't *accidentally* remove an organ, and if you do, you are a shit surgeon. And all the doctors who didn't even notice it in follow-up surgeries are either also terrible surgeons or they did not read your file closely - another sign of a careless practitioner.\n\nEdit: OH FUCK these were military doctors?! I don't even know if you legally CAN sue them... Find a victims' rights lawyer immediately and get a consultation.  She can't sue.  A sad reality of military care.  Much if it is quite good, but the bad ones are safe from lawsuits.       Which side is the cyst on? It would make more sense that the cyst was once the ovary. (Also, in case you're interested, an MRI would be the most accurate scan to look for it - they're the best for looking at soft tissue)  Are you from Canada? I heard of a similar incident happening in Toronto, where a woman just woke up from surgery and discovered that her ovary was missing. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/193v27/my_left_ovary_is_missing/"
  }, {
    "id" : 25,
    "title" : "Hey TwoX, I've been irresponsible lately and I need to vent the anger I have towards myself.",
    "snippet" : "I'm very disappointed in myself. I haven't worked out in far too long, I haven't been practicing the piano as often as I should (it's my major), the other day I just completely forgot to go to a class, and this morning, I overslept my alarm so I couldn't go to church and sing in the choir (I get paid). Fortunately, reading all these problems makes me realize how small they are.  Well it's good to see the problems are small. They all have easy fixes as well. You can't go back and changed what happened all you can do is makes changes based on what you have already done. Set alarms, write out reminders and schedule time for what is important to you. Don't get worn out by the little things.   They're small now. But if you let laziness take hold, it'll creep into all areas of your life. Don't feel like cleaning the house now? It'll happen next week. Don't get the car maintained on schedule? Whatever, it's still running fine. \n\nEventually you wind up with a house that looks like something out of Hoarders and a car broken down in the middle of the highway.\n\nLaziness creeps up on you!\n\nIt's good that you realized this now when you can do something about it. There's something to be said in favor of discipline.    Your problems are small. Problems become large when you let them scare you into digging a hole. I had an entire semester that went downhill fast, fast, fast, all because I missed one class, then was scared to go back the next class because of what I had missed, then was scared again because I thought it was too late to dig myself out. And then I let it get so bad that it really was too late. \n\nThe moment you begin to fix a problem--no matter what tiny steps you take to fix it--you begin to feel better and more in-control. You are not past that stage yet! Take a short walk tonight, doodle around a little on the piano tomorrow, set your alarm next time. Most importantly, forgive yourself. Everything is fixable, and you're at the perfect time to fix it. Good luck!    I'm really glad that you've had the moment of realization and now you're going to get things on track!\n\nI really struggle with organization and fighting laziness. Something I find helpful is writing lists - I write a list of everything I need to do. Then I break it down into what I need to do today, tomorrow etc. \n\nCrossing items off with a red pen feels really good!\n\nGood on you for deciding to shake things up and getting back on track. Best of luck with it all :)\n\nAt least these problems can be fixed - start working out again, practice until you feel yourself improving, see if you can borrow someone's notes or download lecture slides. \n\nI'm really bad at sleeping in and I find it's best to set my alarm on my phone and then put it on the other side of the room so I have to actually get up and turn it off. (Otherwise Asleep Maree turns it off and rolls back over.)",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195313/hey_twox_ive_been_irresponsible_lately_and_i_need/"
  }, {
    "id" : 26,
    "title" : "Feeling guilty about an inconveniently timed anxiety bout that I had... Advise or cheer up maybe?",
    "snippet" : "So basically since I was a little girl I've been afraid of hospitals and doctors. Not needles. Doctor's exams. So I'm a Mormon (don't kick me out of Reddit though, I like it here haha) and I had to do a physical 3 weeks ago to serve my mission. I went into it thinking that I'd grown out of the phobia, maybe just telling myself that to make me feel better, but it wasn't 5 minutes into the appointment when I started having my usual anxiety attack and my heart rate went to 150 or something almost immediately. Of course, the doctor got all concerned and now 3 weeks later, I've only recently been cleared after 5 more appointments, including one with a psychiatrist. I know everything is supposedly better now, but I can't get over feeling guilty about still having a childhood fear. Any thought or help? :)\n\nTL;DR-- What can I do to work through the fact that I'm 18 and still afraid of the doctor? ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1966fm/feeling_guilty_about_an_inconveniently_timed/"
  }, {
    "id" : 27,
    "title" : "I Need Someone To Hear Me",
    "snippet" : "I don't know if this should go here or not. I'm mostly new to reddit, so if it needs to go some where else let me know.\n\nI want a baby. \n\n \nI think about it every single day. I think about it every couple of hours. I am jealous. I am heart broken. \n\n\n3 years ago I accidentally got pregnant by my long term boyfriend. I was terrified and excited. He was miserable the whole time. He prayed that I would miscarry. I felt my baby dance in my tummy. It never really sunk in that I was pregnant. \n\n2 and half years ago I gave birth to a 1 lb 1 oz baby girl who lived for a little over an hour. \nShe never opened her eyes. She never cried. She silently struggled to breathe. She flailed her arms. She tried so hard to breathe. I wanted her to breathe. I pleaded with God to let her breathe. \n\nI kissed her face. I whispered in her ear. I told her I loved her. I loved her more than anything. I told her I was sorry. I had never been so sorry. I told her that it was my fault. My body failed her. I told her I was proud of her.\nI kissed the top of her head. \n\nShe died. \n\n\nShe was here for an hour. \n\nShe died.\n\n\nWe named her Annabelle.\n\nI miss her. \nI would have been the best Mom.\n\nI am jealous. \n\nMy long term boyfriend cheated on me with the girl he claimed he never loved. He cheated on me too many times to count. I left, but I was alone. I fell in love again, but I'm still alone. My new love doesn't understand. I don't blame him.\n\n\nMy long term boyfriend was \"never going to have another child.\" He \"didn't want another one.\" \n\nMy long term boyfriend got his new girlfriend pregnant. His new girlfriend Facebook messaged me and told me she was pregnant on the day that Annabelle would have been 2 years old. His new girlfriend is vindictive.\nHis new girlfriend is due in March. I want to scream, it's not fair. \n\n\nI want a baby. I want a baby with my love. I want to be pregnant. I want strange people to rub my belly. I want people to ask me weird questions. I want to feel a baby squirm inside my tummy. \nWe are not ready. We are still growing. We are still learning. I am impatient. \nI want to be a real Mother. I want to move past this. \nMy friends do not understand. They think, \"You are not ready.\" They say, \"Why? Don't you think you should wait?\" They say, \"It will happen some day.\" They say, \"I don't know what to say.\" \n\nI want someone to know what to say.\n \nI want to be heard. \n\nI want to be validated.\n\nI want someone to understand.  I hear you.\n\nMy sensible side says *block the new girlfriend for gawdsake* so she cannot torment you.\n\nI know a touch of what you are feeling, though for different reasons. I know the ache, the inability to see friends' baby pictures, the envy, the anger at someone who has what I want. To cope I had to block a lot of people out, even if only temporary, and try to focus on another aspect of my life. I'm single at the minute so \"temptation\" isn't there - I think this has helped actually.\n\nDo you think you'd be able to refocus slightly? What kind of life would you want Annabelle's little brother or sister to have? How can you move towards that now? E.g. if you want a little house out in the country, can you start putting some money aside, perhaps decide whereabouts you'd like to go?\n\nI won't tell you to just ignore your feelings - I know that is impossible.\n\nI also want to say that it's okay to grieve for your little girl; I hear sometimes that women feel they have to hide the grief. Does your new love understand your sadness, even if he doesn't quite understand why you want another baby now? &lt;3\n\nI love babies. Any babies. I love them all. Being around other people's babies had helped me, especially since a close friend had a baby a few months ago. \n\nI'm trying desperately to move towards the life that we want. We're saving money, moving, bettering ourselves... But the feeling is always there, the feeling that something is missing. I'd rather be chasing a little one around than doing anything that I am doing right now.\n\n\nI appreciate that you understand that it is okay to grieve. A lot of people don't feel that way. They take the \"get over it\" mentality. \n\nMy new love does understand, to an extent. He's a strong person. He's not a very emotional person and he has a hard time relating unless he has directly been in a situation. He loves me and he tries, but his personality just doesn't allow him to go there. (I don't know if that even makes sense.) Just because Annabelle didn't get to live very long doesn't mean that she wasn't your daughter and that you aren't a real mother still and it certainly doesn't mean that you don't have the right to grieve just as much as any other parent who has lost a child.\n\nI do want to caution you just a bit that having another baby won't necessarily make the hole in your heart full again. No other baby will replace Annabelle, and it may be wise to see a grief counselor if you haven't already tried that. \n\nLosing a child of any age isn't something you just \"get over,\" and while having another baby may help, it may turn out like my great-grandmother's pregnancies and children after her first baby died at 6 months old: every subsequent baby grew up, so she needed another and another and another, almost like she was trying to always have the baby girl who had died still with her. Eight sons later, she hit menopause and still wasn't happy. I would hate to see another mother and children go through that cycle, because everyone loses. So treat this as you would losing an older child and see a grief counselor to make sure you're dealing with your grief in a healthy way. I had an Aunt who was sort of the same way. She was all kinds of crazy before she lost any of her children, but afterwards she was worse. She lost a daughter during birth and then a son when he was 4 years old. He was hit by a semi truck. Her living son, who is also very strange, felt like she never really loved them.\n\nAfter I lost my daughter I posted about missing her on FB (on her due date) and my cousin, the living son, messaged my sister and told her I needed to get over it because my subsequent children would feel like I never really loved them. \n\nI don't want to fill the spot in my heart that is missing because my daughter is gone.  \n\nI want to fill the emptiness that is there because I cannot be a mother right now. I don't know if I will ever get to be a mother because of the condition that I have that caused me to give birth prematurely. \n\n\nNo one could replace Annabelle, just like none of nephews couldn't replace the other if one of them died. I'd love them each on their own.  &lt;3\n\nI love babies. Any babies. I love them all. Being around other people's babies had helped me, especially since a close friend had a baby a few months ago. \n\nI'm trying desperately to move towards the life that we want. We're saving money, moving, bettering ourselves... But the feeling is always there, the feeling that something is missing. I'd rather be chasing a little one around than doing anything that I am doing right now.\n\n\nI appreciate that you understand that it is okay to grieve. A lot of people don't feel that way. They take the \"get over it\" mentality. \n\nMy new love does understand, to an extent. He's a strong person. He's not a very emotional person and he has a hard time relating unless he has directly been in a situation. He loves me and he tries, but his personality just doesn't allow him to go there. (I don't know if that even makes sense.) &lt;3\n\nI love babies. Any babies. I love them all. Being around other people's babies had helped me, especially since a close friend had a baby a few months ago. \n\nI'm trying desperately to move towards the life that we want. We're saving money, moving, bettering ourselves... But the feeling is always there, the feeling that something is missing. I'd rather be chasing a little one around than doing anything that I am doing right now.\n\n\nI appreciate that you understand that it is okay to grieve. A lot of people don't feel that way. They take the \"get over it\" mentality. \n\nMy new love does understand, to an extent. He's a strong person. He's not a very emotional person and he has a hard time relating unless he has directly been in a situation. He loves me and he tries, but his personality just doesn't allow him to go there. (I don't know if that even makes sense.)        Think about what you can offer a child, as opposed to how nice being pregnant again will make YOU feel.  Feeling a baby kick would be nice, but how nice will you feel when you need $200 for your 8-year-old's school trip that you don't have?  \n\nBabies grow up into adults.  Your choices have consequences and not just for you.  I'm sorry that you have been so badly failed by other people, but that reflects on them, not you. They don't deserve to be in your life anymore, so shut them out of it.\n\nAre you talking to anyone in real life about this (counselor, therapist, close family)?  I'm not saying this to be flippant - get a dog (for now/to start with).  Dogs will love you far more unconditionally than a child, and they are far easier to take care of.  At the same time, they require a lot more energy and attention than you might expect.\n\nIt could be a good start, and a good place to direct your maternal feelings for the time being.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194m9a/i_need_someone_to_hear_me/"
  }, {
    "id" : 28,
    "title" : "This week is Eating Disorders Awareness Week. Please take the time to educate yourself on the impact of eating disorders, and take the time to care for yourself and others in your life who may be suffering. ",
    "snippet" : "  As someone who spent the first half of last year (and the summer of 2011) in treatment for anorexia/bulimia and compulsive exercising, I'm glad I'm in a better place now (although still have to push myself daily to eat and have body image problems constantly). If there are any twoXer's dealing with EDs, you can conquer this. &lt;3 Congrats on making those steps. I had it really bad in high school and now I'm not a slave to food. It's true that creeping voice is always there, but now I tell it \"shut up! I deserve this food to give me fuel to live my awesome life!\" Weirdest part? I only weigh maybe 10 pounds more than I did at the peak of my disorder. So all that stressing and anxiety for nothing.   To bad it doesn't include the non-traditional eating disorders. It needs to raise awareness to all disorders not just the body image ones. Shame. To bad it doesn't include the non-traditional eating disorders. It needs to raise awareness to all disorders not just the body image ones. Shame.",
    "url" : "http://nedawareness.org/"
  }, {
    "id" : 29,
    "title" : "Prosecutor leads effort to test more than 11,000 untested long-abandoned rape kits that sat in a Detroit police warehouse, to help bring justice to victims\n",
    "snippet" : "    Saw this on Dateline I think? The prosecutor is a very tough woman. There was one woman they interviewed whose rapist actually killed three other women before being caught and convicted.   I would definitely donate money to help get this done.  It's unfortunate, but they've found there were a few \"serial\" rapists in the mix.  Detroit has some serious issues. (post articles if I can find them - this is based on listening to radio interviews - 760wjr)\n\nThey have made a few arrests at this point.  It's unfortunate, but they've found there were a few \"serial\" rapists in the mix.  Detroit has some serious issues. (post articles if I can find them - this is based on listening to radio interviews - 760wjr)\n\nThey have made a few arrests at this point. ",
    "url" : "http://rockcenter.nbcnews.com/_news/2013/02/15/15848051-prosecutor-leads-effort-to-test-long-abandoned-rape-kits-brings-justice-to-victims?lite"
  }, {
    "id" : 30,
    "title" : "vibrators?!",
    "snippet" : "Just wondering what you ladies think. \nWhat do you think about them?\nDo/did you have one/want one? \nDo you use it often? or maybe you stopped, if so - why? \nWould you consider getting one? \n\nThoughts, opinions, welcome! Currently single, I'd like one, but it feels so taboo I'm not even sure what I think about them, or where to begin. More and more of my single close friends (we're in our early 20s) are getting them, and only speak really highly of them.  I used to work as a product specialist for a sex toys company, so as well as being around vibrators every day, I also ended up with a rather varied collection! \n\nHere are some tips you may find useful for getting your first vibrator:\n\n* Vibrators are definitely still a taboo topic, but they really shouldn't be! In my opinion, the reason why the topic of sex toys is taboo is because there's a massive lack of education about them. Many people still assume that a vibrator is a massive, vibrating, penis-shaped thing that is designed for the pure purpose of making men feel insecure about the size/shape of their manhood. Admittedly, these sex toys do exist, but they only make up about 10% of the market. \n\n* A lot of women find small \"lady finger\" vibrators or \"bullet\" vibrators perfect as their first clitoral sex toy. They're small, quiet, discreet, but surprisingly powerful! I highly recommend the Rocks Off RO-80mm Ammunition Bullet Vibrator. It doesn't look offensively vibratory, and it just feels amazing!\n\n* Some women don't enjoy the hard plastic of bullet or lady finger vibes, so you might want to look for something with a softer silicone coating. Avoid jelly rubber as it is porous and a pain to clean. Silicone is easy to clean, hygienic, doesn't have any weird smells and feels really nice. It will be more expensive than other vibrators, but the extra cash is worth it.\n\n* Lubricant! A lot of women forget to buy lubricant along with their vibrator and wonder why it feels terrible! Admittedly, you may be turned on enough that you don't need it, but a little bit of water-based lubricant will make sure that your vibrator is sliding smoothly across your skin and hitting all the right spots.\n\n* Variable speeds. As someone who has been using vibrators for a good 8 years (not constantly over that 8 years, I must add! I wouldn't have time for anything else!), I like variety. Sometimes I want one of those slow build-up orgasms with gentle vibrations and sometimes I want an orgasm in minutes so I can just get on with my day with a spring in my step. If you can get a vibrator with variable speeds, this allows you to experiment more and figure out what you like.\n\n* If you're a fan of internal stimulation, look for something with a curved head that will reach your G-spot. A rabbit vibrator is a good mix of clitoral and vaginal stimulation, but can be a little intense for your first time.\n\n* If you're not happy walking into a sex shop and talking to the people who work their about what you'd like to use on your mimsy, there are some great online stores that offer discreet packaging and delivery. I'm not sure where you are in the world, but my recommendations would be Babeland or Eden Fantasys.\n\n* So, your vibrator experience may vary as no two vaginas are alike, but here are some recommendations for those new to vibrators:\n[RO-80mm Bullet](http://www.babeland.com/ro80mm-bullet-vibe/d/2477)\n[Jimmyjane Iconic Bullet](http://www.babeland.com/jimmyjane-iconic-bullet/d/2529)\n[Moka G-Vibe](http://www.babeland.com/Moka-G-Vibe/d/3741)\n[Kiki Vibe](http://www.babeland.com/Kiki-Vibe/d/1025)\n\nAny questions or anything, just shout! If I was on Mastermind, I swear to god 'diddling sticks' would be my specialist topic...  &gt;Former product specialist for sex toy company whose username is debauchery20\n\nYou are my new favorite. Also thanks for the lengthy response! I'm sure you made a lot of TwoXers very....happy.....  I have several, and they're amazing.  I really like [Babeland](http://www.babeland.com/), which offers a good variety of quality toys.  (And you want quality when there are moving parts near your bits.)  The website has a 'sex info' tab with lots of articles on what different toys are and what they do, and there is a 'beginners' category.  If you're wanting both penetration and vibration, a rabbit vibe is definitely the way to go.   Dude, it felt really taboo to me too. I have a pretty discreet one, I bought it because of the reviews, and also because it's very quiet as well as being well-designed.\n\nMost (if not all) sex toy sellers will ship in discreet packaging, so you don't have to worry about people judging you (if you care) when you get a package in the mail.\n\nI was raised Catholic, and although I haven't considered myself so in almost a decade, I still feel some semblance of guilt/shame about buying stuff like that for myself.\n\n[Lelo's \"Gigi\"](http://www.amazon.com/Lelo-282-Gigi-Deep-Rose/dp/B000TGIVLK)             ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194m3v/vibrators/"
  }, {
    "id" : 31,
    "title" : "My friend is being sexually harassed at work, and I'm pretty sure he is fucking with her psychologically too, how do I help her?  ",
    "snippet" : "Hi. I am a guy and I've been friends with this woman a long time. She texted me today asking \"am I pretty :(\"? (We live a few thousand miles apart so we mostly text or talk on the phone). And then we had a conversation about what's been happening at work. She also said he is blackmailing her, but she didn't tell me how. \n\nFirst of all how can she deal with the sexual harassment? She said her work has a zero tolerance policy. Does she need to record it somehow or is her word good? Or maybe it would be on the store cameras? She said he is cornering her in the store and occasionally getting physical.\n\nSecondly what about her mental health? \n\n    I read about one girl who would record with her MP3 player every single time the co-worker wanted to speak to her. That, along with logs and in-store cameras will be enough to get this guy not just fired but also prosecuted. Depending on location recording someone without their knowledge is illegal, OP make sure your friend checks out the laws regarding that where she is. She could use it to get an accurate transcription of what was said though.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194l6e/my_friend_is_being_sexually_harassed_at_work_and/"
  }, {
    "id" : 32,
    "title" : "Can my illness cause my menstrual cycle to be late?",
    "snippet" : "Well two weeks ago, I got a bad cold and that lasted five days. Then I got a fever that lasted a couple days and the rest of this week has been just the end of my illness. I should have my period soon, but I don't. There is no way I could be pregnant. Could being sick have causes a delay with my period or could I skip it entirely? Please help! Thanks!!   Could happen, yes. Particularly, being sick around the time of ovulation could cause your ovaries to go, \"Hrm. It seems like you have more important things to deal with right now than fertilization. Maybe I'll just hang onto this egg for a little while or until next time, okay?\" That makes sense! Thank you. So could that mean that I will get it normally next month? ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1960z8/can_my_illness_cause_my_menstrual_cycle_to_be_late/"
  }, {
    "id" : 33,
    "title" : "Do you ever go through phases, even months at a time, where you feel horribly hideous for no reason? How do you deal with it? ",
    "snippet" : "Because I've been going through this on and off. \n\nMost of the time I feel fine, and I know objectively there's nothing 'wrong' with how I look. \n\nI just got to the point in the past few years where I started to feel beautiful. I lost a lot of weight at the end of high school and it made me feel better. I take good care of my health and my body, I am clean and wear nice makeup and all that. I get compliments from men and it makes me feel nice. \n\nBut lately I've been going through these phases that last several weeks or even months, where I feel HORRIBLY ugly and disgusting. I get extremely paranoid that people are looking at me and noticing the small bumps on my forehead or thinking my nose is too big. I avoid eye contact with people because I don't want them to see my fave. I can't sleep at night because I'm so stressed about how dry my hair is or wondering if my big boobs make me look fat. \n\nIt's all so irrational and distressful and I don't know how to explain it. I don't even want to talk to anyone about it outloud or in person because I don't want to seem dramatic or like I'm fishing for compliments. \n\nI just want to know if anyone else has dealt with something similar. Not just feeling bad about yourself for a few days. But having random phases of pure self disgust for periods at a time that come and go. \n  I go through this sometimes.  I wish I knew how to fix it because I would totally share the solution with you!\n\nIt's so *unreasonable* because I know that there is no way that I could be pretty one day and then hideous the next, but just can't help it.  \n\nI tried to talk to my hubby about it a couple of times, but even when he assures me that I look fine, I don't believe them because I think he's just being nice. (Yes, I realize that this sounds crazy.)\n\n*Most* of the times that this happened, I realized that the insecurity about my appearance usually stems from insecurity from another aspect of my life - school (I quit my job to go back to school recently), family, friends, etc.  Once I fix it then I feel better again.\n\nBut sometimes I just want to feel attractive.  So (confession time!) I put extra effort into my appearance and am extra friendly, with the ulterior motive of getting positive reactions from guys.  It makes me feel guilty because I'm a married woman. :(\n\nAnyways, you're not alone in this! I know exactly where you're coming from. In my warped mind, I think that my SO is calling me beautiful because he's just going through the motions, or that it's a knee jerk response. Whereas if someone I don't know well says it, I feel that they're being genuine. \n\nIn the end, I should be looking in the mirror and learning how to discover my own beauty for myself, rather than seeking validation from strangers...I know, I know. Easier said than done.  Absolutely! And it's okay. Sometimes I feel great; other times I feel less than great. I work out 5x/week and was looking at myself in the mirror last night thinking, *Damn, I look sexy,* then I was trying on clothes at a store today thinking to myself, *Really? That squishes there?* \n\nMost of the time I feel confident, sexy, and awesome. There are times--extended, sometimes--during which I feel like none of these things. I just channel my inner RuPaul and remember: *If you can't love yourself, how in the hell you gonna love somebody else?* And then I can't help but laugh, take a deep breath, and channel that inner sexy.       Man here. I broke a bunch of bones in the left side of my face when I was a kid, it left permanent bruising and my face slightly asymmetrical. I was always kind of self-conscious about that growing up (oddly never about the terrible stretch marks I got after my growth spurt) but I've realized that most people don't notice and even the people who do notice don't care. People tend to make a way bigger deal out of their flaws than they actually are.\n\nI guess I've just grown not to care what other people think. I don't tell myself I look good, nor do I ever feel ugly. I is what I is, no point in fretting over something you can't change.        ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194axl/do_you_ever_go_through_phases_even_months_at_a/"
  }, {
    "id" : 34,
    "title" : "I hate my body",
    "snippet" : "Well, as the title shows, I hate my body. I go to the gym 4 or 5 days a week, I try to eat as healthy as possible without going insane. Ill admit it, I eat pizza every now and then and those double decker tacos from taco bell, amazing. Looking at me, I suppose no one would say that I am \"fat\". I have tried to be positive when looking at myself naked but it just isn't working. I have hips I hate, I have a muffin top I can't get rid of and my ass just isn't what it used to be. My boyfriend is extremely loving and tells me he loves my body and wishes I saw myself as beautiful as he does. Blah blah blah blah..\n\nSo my question to you ladies is, What do you do to help you just accept the way you're made? How do you get a healthy prospective when looking at your body?\n\nTDLR; Ladies, how do you accept your body and what kind of advice can you give a girl who hates hers?   Women of all shapes and sizes obsess about their bodies.  We are conditioned through societal images &amp; expectations to look like [this](http://2.bp.blogspot.com/-zKwCcxgYr40/UJuj_TVrIAI/AAAAAAAAVV4/Ogn6uZGdw0M/s1600/Hollywood-Model-Emily-Ratajkowski-01.jpeg).  Anything not matching that is seen as substandard and flawed.  But this is not what the average woman looks like.    \n\nThe images that we are bombarded with are not indicative of how most women look.  Head on over to [My Body Gallery](http://www.mybodygallery.com) and scroll through some of the pictures.  THAT is what women really look like. You said yourself that you are not at an unhealthy weight, you enjoy eating (this is very important, to have a healthy relationship with food), and your boyfriend loves how you look.  I can guarantee you that your boyfriend doesn't look at you naked and see your \"flaws\" like you do.  Your insecurities are most likely detrimental to your relationship - your boyfriend wants you to be confident and happy with your body.  He KNOWS you are beautiful.   \n\nBut the most important thing is that you know you are beautiful.  I would do some research on body image... you are certainly not the first woman to have a complex about her body because of the expectations society places upon us to have \"perfect\" bodies.  (Pssst... I don't think they're perfect.)  Fully agree, just wanted to add that the My Body Gallery link needs a fix.     Quick question. What are you doing at the gym? Like as much as I understand loving yourself as you are if it's something that you can change why not? I do weights and cardio. Try to change it up and do circuit training. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195zip/i_hate_my_body/"
  }, {
    "id" : 35,
    "title" : "The feminist pornographer: Tristan Taormino, editor of a new book on X-rated activism, says it's time to find a middle ground in the porn wars",
    "snippet" : "  I think a huge issue with porn is making it acceptable to pay for porn. Not paying for porn is a badge of pride on the internet - especially on reddit - and it is considered idiotic to spend money on porn. Even on a morality standpoint I've had friends tell me that they felt like paying for porn was \"giving up\" on women. \n\nMaking paying for porn acceptable and not abhorrent allows us as consumers to vote with our dollars. It helps companies understand what sells and they don't have to continuously target the group that does pay for porn - whose tastes perpetuate the horrifically titled and misogynistic  aspects of porn. \n\nI'm not saying we need porn sold in grocery stores but there are a number of restrictions that make it extremely difficult for porn to be paid for. Notably Paypal and iTunes barring adult content. As well as a lot of government interference in the actual production of pornography. Treating it as seedy in turn makes it seedy. \n\nMore money in porn makes it easier to take risks and experiment with making porn as whole a better product instead of having feminist porn be an outlier - all porn can be feminist while the super icky stuff is an unfortunate outlier.  One, porn is in [no danger](http://www.guardianexpressla.com/porn-revenues-exceed-5-billion-world-wide-despite-free-pornography-online-and-rampant-piracy/) of not being paid for.\n\nTwo, the idea that porn has to be judged as \"feminist\" or not is kinda ridiculous.  Feminism is not the end-all-be-all social philosophy which will save the world, and the fact that there are sharp divisions within the feminist community (as the article admits) suggests that a consensus may never be reached about what exactly \"feminist porn\" even means.\n Admittedly I'm just making reddit comments, I agree with you on it hard being able to label porn as feminist or not because feminism is such a wide ranging ideology that you will find someone who call anything feminist/non-feminist. \n\nWhat I was trying to articulate is making titles like \"18 year old gangbang sluts demolished by monster cocks\" less prevalent. \n\nI'd probably take the article you linked to with a grain of salt  (doesn't link to source etc.) but yeah people are paying for porn but that's what is dictating current trends which aren't great. It'd be awesome to have better stats on what sells than a vague poll of \"what industry insiders think the porn industry is worth.\" \n\nBuying porn absolutely has a stigma. Society reducing the stigma on porn consumption can only mean good things for that industry and the consumer and hopefully curbing the more extreme \"gonzo\" sex as a norm but make it a niche.   &gt; What I was trying to articulate is making titles like \"18 year old gangbang sluts demolished by monster cocks\" less prevalent.\n\nI can't see why. Porn continues to make money, though more now through advertisements on streaming sites (among other things). And the producers will keep the market supplied with what it wants most because that will make the most money. And apparently that is \"18 year old gangbang sluts demolished by monster cocks\". Porn is about fantasies, and fantasies aren't about what is socially acceptable (see: so many women with forced sex fantasies).\n\nMaking it easier to pay for porn (which I can't see happening when it's so easily available online) won't change what sort of porn people want to see. \"Feminist porn\" isn't a niche market because somehow people can't manage to pay for it. It's a niche market because, in the whole porn ecosystem, it covers only a small part of the demand. Why pay for music, movies, games, and all kinds of things? That was true for all of those industries until content delivery caught up with piracy. Steam, Netflix, iTunes while not ending piracy made legitimate purchase more attractive to the average consumer and let content creators have the opportunity to make more money and improve the content they produce.  \n\nWe presumably know what makes the most money in porn now because that's the content that's there but we don't know what could make the most money because the industry is stuck making circular content with a few outliers. People are mostly looking for \"18 year old gangbang sluts\" because that's to a large degree all that's there unless you have a common enough fetish that there's porn produced for it. \n\nReducing the stigma behind the consumption of porn and paying for it helps everyone connected with porn except maybe those benefiting most from the status quo right now. I'm just down for making everything better and I think the more money that goes to content creators the more incentive there is to produce great content rather than relying on shady tube site ad dollars and such.     If you're right, you can become a millionaire by starting a Netflix/Steam for porn. But I think that if there was a market for it, someone would have managed to monetize it by now. ",
    "url" : "http://www.salon.com/2013/02/24/the_feminist_pornographer/"
  }, {
    "id" : 36,
    "title" : "Oklahoma May Deny Women Affordable Birth Control Because It 'Poisons Their Bodies'",
    "snippet" : "      ",
    "url" : "http://thinkprogress.org/health/2013/02/22/1627441/oklahoma-birth-control-poison/?mobile=nc"
  }, {
    "id" : 37,
    "title" : "A Mom Rant",
    "snippet" : "My mother is crazy. \n\nSimple as that. She has always been a bit short tempered and weird about things, but in the last few years, she's gotten flat out crazy. She openly states that I should have been the one to move across the country 3 years ago, not my brother, is always demanding to know when I'm going to get pregnant, and , most recently, started telling me that I needed to 'jump on my husbands dick more often so I can pop out another grandkid for her.' \n\nI replied that I couldn't have sex with him if he didn't want to, to which she replied that I could make him do it, whether he wanted to or not. She knows that I am a rape survivor, so no way am I going to try to make him do something he doesn't want to. My husband just isn't a very sexual person at all, which, yes, sometimes is very frustrating, as I LOVE sex. But still, neither of us are ready to have kids yet, I'm having some medical issues that pregnancy would only exacerbate, and its just not a monetary good time for kids.\n\nShe loves to ask if she was a good mother. I've gotten to the point where, if she asks again, I'm going to flat out tell her, \"no. You weren't. If by good, you mean beat me with a wire hanger while I was backed in a corner in the kitchen, for the simple reason that the carpet didn't have vacuum lines you could see, then yes you were wonderful. And if good also means trying to fat shame me into losing weight because you didn't like that I couldn't be a skinny dancer, then yeah you were great. (BTW, fuck her, I could and can still dance like nobodies business, even if I wasn't skinny.) If by good mom, you mean making me cry before school by calling me a fat bitch/whore, cunt, then not letting me fix my makeup and taking a picture of me like that and showing it to your assistant (plus the other teachers) AT THE SAME DAYCARE I WORKED AT EVERY DAY AFTER SCHOOL, yep, great. If by good, you mean telling me on my WEDDING DAY that I was a fat bitch who didn't deserve to be happy, you were awesome, and finally, apparently good to you means verbally abusing me and not listening to anything I say, calling me an uneducated bitch (I haven't finished college) who sits at home all day (I am a photographer, I work from home, and I help her on the weekends with her choir BECAUSE she can't deal with it herself.) and does nothing. She is the reason I have such a shitty self-image. She gave me diet pills for Christmas this past year, then said, \"You're beautiful!! I just want to help that come out.\" Um, I thought it was out. I'm pretty damn cute, even if I'm not a size 12. (For reference, think Adele, but a bit more plump.)\n\nI am still in contact with her for the sole reason that if I cut her off, I lose my father. Which sucks. I know I deserve better, and so does my dad. My mother is a verbally and sometimes physically abusive person who uses manipulation to get what she wants and has no regard for other people. Most of my stress is from her, and I feel physically drained from even talking on the phone with her.\n\nI'm at my wits end with everything, and more than once have contemplated checking into a mental facility because of anxiety and paranoia that she causes. I just need to know that I'm not the only one with a crazy as woman who calls herself my mom.       Holy shit, how do you have a relationship with her at all after all of that. If my mother treated me like that I would never talk to her.\n\nMaybe you need to cut off from her completely for a while. That certainly does sound emotionally draining. Just remember to put you and your husband first. You owe her nothing. I can relate with OP, I too had an emotionally and physically abusive mother, and as counterintuitive as it may seem, it's hard to break contact. They are good at what they do, they know how to make you feel bad, and look worse, so they appear to be the victim in all this. OP, I wish you luck, and know that you are not alone. There are support groups for adult survivors of child abuse.      &gt; I am still in contact with her for the sole reason that if I cut her off, I lose my father.\n\nSomething to think about: if your father knows all this, will he actually cut off contact with you unless you maintain contact with your mother? If so, he's probably not that good a parent himself. No. My dad is just too tired of dealing with her to not go along with whatever she says. He was and still is a good father. We try to talk by ourselves when in there so I can have at least one normal parental relationship. In that case you can probably stop talking to her and still have a relationship with him. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194fzg/a_mom_rant/"
  }, {
    "id" : 38,
    "title" : "My period came back after being gone for a week. Why?",
    "snippet" : "I took all the brown placebo pills before buying a new pack, typically I buy a new pack after 3-4 brown pills because I like to skip/have light periods. Taking the brown pills for a week gave me my period, I started taking the pill again mid period. Last Friday I got my period again, coupled with some stronger than average cramps. The blood has been a mix of brown and red, so I can't tell when it's going to end. The flow is pretty light, but it contains the occasional globs of blood.    It may be the cutting your period short.  I did that when I was on the pill and after a few months I would get some random spotting.  The doc said it was from cutting it to short and that I should let my body have a longer period to keep it from being random.  I decided I would rather have random light spotting than a longer period every month.  That doc was really terrible though when I went to another one I did not even bring it up because I was finally going to get an IUD.  The old doc had refused to give me one because I had not had kids yet so I would take his advice with a grain of salt.  The other comments here suggest stress and that's what I always thought it was more linked to.  either way though I would not be to worried.   Yeah, they had been saying for a while that it isn't good to get an IUD unless you've already had kids, but both my and my mom's doctors have said that it's fine (did you know they're more affective at preventing pregnancies than sterilization?). Do you have an IUD now? If so, how do you like it/what has your experience been with it?  I wouldn't really cut the period time for a pill like that. Stresses out your body.\n\nWhy don't you change to a pill that has a shorter period? There are plenty that you can talk to your doctor about. The one I'm on only has 4 period days, which I love. That way you're not messing with the way the pill was designed.  Actually I am on loestrin, which has less placebo pills per a month than the standard pill pack. It isn't bad for your body, but you should be consistent with it. If OP didn't cut her period short the previous month, it may be that the spotting is just a symptom of the body trying to adapt to the change in hormonal rhythm. I think it took me about 3 months for the spotting to stop once I was only taking 4 placebos a month.\n\nAlso, I find my body is a bit more sensitive if I take a pill late. On the rare occasions I do spot now, I can usually trace any spotting back to a belated pill.\n\nedit: spelling Loestrin is the one I'm on too. It's the only BC that didn't make me puke 30 minutes after taking it and I love the short period.\n\nI was just suggesting that OP go on a BC that includes the shorter period, in the pack, since that's what she is looking for. It'll be easier to maintain consistently and then she won't be messing with the hormones.\n\nIt's very easy to talk to your doctor about what you're looking for in a BC and find one that works best for you. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1950md/my_period_came_back_after_being_gone_for_a_week/"
  }, {
    "id" : 39,
    "title" : "honest question: my bf and I have been dating 2 years in March. We are planning on moving to the other side of the country in months. Do I push marriage or not",
    "snippet" : "        ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195mb1/honest_question_my_bf_and_i_have_been_dating_2/"
  }, {
    "id" : 40,
    "title" : "Teenager with first relationship, incredibly awkward (no idea what to say), please help?",
    "snippet" : "Please let me know if there's some sort of /r/adviceforawkwardteenagegirls or something that'd be more appropriate..\n\nEssentially what the title says.\n\nI just have.. no idea what to say to him. Ever. I like him as a person, we get along well, but I've known him for ages (so we can't talk about what we do/past history, as a lot of it's shared) but not enough that we know each others interests really well? I don't know\n\nI'm a generally awkward person, I have a group of five or so very close friends that I'm not awkward at all with and then the rest of the world which I am. So it's not just him - if it was anyone at all, I'd be awkward. It usually takes me a good two-three years of constant friendship before I'm not-awkward, which is why I have such a small friends group.\n\nBasically, what the fuck do I talk to him about? Once we get into a conversation we're fine but I'm just so fucking awkward. He \"went out\" (never officially) with my best friend and they never talked in reality, just texted. (She's fine with it.)  I have a teenage daughter and having been a teenage girl myself,  I know how awkward things can be.\n\nIts one of those things that only gets better with practice.  Do you know any subjects he'd be interested in chatting about? If so, show some interest.  Ask questions. Conversation will start to flow. \n\nIt might mean that you have to make a bit of an extra effort with him to begin with, but it will help things go more smoothly. \n\nMore importantly,  you'll be practicing life skills! Hope that helps!   Honestly, I don't think there's any way of preventing the akwardness.\nEven in my 20's, when I first met my SO, things were WAY up there on the akward scale. It is sometimes difficult to figure out what to talk about. Things will get less akward over time, methinks. \n\nTry finding fun things you can do together. That should 'break the ice,' so to speak, and allow you to feel more comfortable with sharing your thoughts and feelings with him.   If there's a subreddit like that, I need to know about it! Also, /r/awkwardpeoplewithcrushes.  I thought that was actually a sub... goddamnit",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/195lpe/teenager_with_first_relationship_incredibly/"
  }, {
    "id" : 41,
    "title" : "My boyfriend and my best friend have become roommates, and now I'm starting to hate my best friend",
    "snippet" : "About four months ago, a girl (let's call her Catherine) who I have been getting very close to over the last year, got kicked out of the co-op she founded. But my boyfriend said she could rent a room in his house for a month to give her time to find a place of her own. He decided to charge her almost half of what the room is worth, but he's doing this to help out my friend.\n\nNow, though I pay rent and keep my stuff in my own house, I pretty much live with my boyfriend. I stay with my him 6 nights a week, but I like to keep our stuff separate so I still keep my own place. I've been \"living\" with him like this long enough to experience three other roommates he's had.\n\nShe's driving me up the freaking wall (she's stayed two months longer than she said she would). Not only is she being difficult to live with for my boyfriend (not paying rent on time, rearranging the furniture, not giving him his alone time when he needs space), but she's completely violating me and my personal boundaries. She \"borrows\" my clothes without asking, and even though I keep only a handful of items here (as in, one or two outfits at a time), my jacket or my skirt will go missing for a few weeks until I interrogate her long enough to admit she's taken them. She moves my shit around even though I've told her not to. She knocks on the door to talk ALL THE TIME. When I'm feeling social I go out in the common areas, which is where I spend most of my time, but whenever I want to go in my (boyfriend's) room to get some shut-eye or have some alone time, she doesn't want to stop talking. She wants attention on her at all time. And the worst part it, she steals my food. I've explicitly told her several times to not touch my food ever, at all. And last night I opted out of going to the grocery store because I was too tired, and I knew I had breakfast food that I could eat when I woke up. Well I woke up. And guess what she ate last night without my permission and without replacing -- my breakfast! She ate THREE bagels. THREE. Now there are non left. There's literally no other food in the house except ice cream, sausage, and ramen. \n\nThese are only SOME of the things she does (and she does all the standard bad roommate stuff like has never cleaned the kitchen, brings people over who are loud at 4 in the morning, is a horribly messy person, etc). Seriously, she is the worst roommate I have ever encountered in my life. \n\nI am not a passive aggressive person. I am very direct. I have explicitly verbalized my boundaries every single time she has violated them. Despite this, she walks all over me. She is extremely selfish and does not care at all about my experience, only her own. Unfortunately, my boyfriend is not very direct. He's very passive aggressive, and instead of telling her to move out, he does little things to annoy her as revenge, like move things back where they were if she rearranges anything). \n\nThis is taxing my relationship with my boyfriend and and ruining my friendship with this girl who is very cool outside of her HORRID living tendencies. The worst part is, she doesn't get it. She doesn't understand that she's being disrespectful. She's completely unaware and un-empathetic. There is no direct or indirect method of communication that seems to be making a difference. \n\nI have nowhere to vent about this. I don't know what to do. I can't tell her to move out. I have told my boyfriend I don't like her living here, but he hasn't done anything about it. I have an amazing relationship with him, and this is our only problem right now, so I don't want to break up with him over his inability to kick this girl out, but it is a huge problem. I am hating her more and more every day. I'm so miserable. She and I used to be best friends but now I want her GONE!\n\nAnd living in my house again is no longer an option. Within the last year my neighbors (duplex) have become extremely violent in their home. I've called police and CPS, and they're working with the family, but I cannot ever get a good night's sleep or sleep in because I wake up to the sounds of screaming/crying/violent physical abuse. I'm trying to find a new place to live but it's been very difficult so far. \n\nUGH I just feel so alone and don't have a space for peace and neither does my boyfriend. \n\n**tl;dr My friend moves in with my boyfriend and turns out to be a horrible roommate. He won't kick her out, and now we're all miserable.**  Unsurprising that she got kicked out of her previous place.  She's very cool but she's also extremely selfish and doesn't care about your experience?  That doesn't really add up.  I would give the friendship, first, as she doesn't seem worth it, and tell her that she's being a horrible roommate and taking advantage of you having gotten her a temporary place.  Second, ask your boyfriend if he wants her gone - if he does, then someone needs to act on this.  Give her a deadline and stick to it.  She'll find someone else to leech off of, I'm sure. &gt; She's very cool but she's also extremely selfish and doesn't care about your experience? That doesn't really add up.\n\nI would like to say that it does, kind of. I have friends I LOVE and absolutely adore and think they are totally cool. I also have friends I would never in a million years be roommates with. These are the same friends. \n\nSome people make great friends and bad roommates. It is possible that she's just a bad roommate but still a good friend. It comes down to living styles and personality differences, as well as boundary issues. She seems kind of unaware that what she's doing is as huge of an issue, because it may not be a big deal to her. Again, something you probably wouldn't have to deal with if she were not a roommate, just like sharing space, a kitchen, cleaning, food issues and having people over.\n\nNone of those are really an issue in a normal friendship where you keep separate houses Totally agree with you on the good friend/bad roommate deal, I know the same kind of people!  That being said, if this girl flat out doesn't care about OP and is that selfish, that's not a good friend/bad roommate like you're saying, in my opinion at least. &gt; She's very cool but she's also extremely selfish and doesn't care about your experience? That doesn't really add up.\n\nI would like to say that it does, kind of. I have friends I LOVE and absolutely adore and think they are totally cool. I also have friends I would never in a million years be roommates with. These are the same friends. \n\nSome people make great friends and bad roommates. It is possible that she's just a bad roommate but still a good friend. It comes down to living styles and personality differences, as well as boundary issues. She seems kind of unaware that what she's doing is as huge of an issue, because it may not be a big deal to her. Again, something you probably wouldn't have to deal with if she were not a roommate, just like sharing space, a kitchen, cleaning, food issues and having people over.\n\nNone of those are really an issue in a normal friendship where you keep separate houses I had a really good, old friend that became a roommate.  We are no longer friends and I want absolutely nothing to do with him.  It happens.  She needs to leave asap. Unsurprising that she got kicked out of her previous place.  She's very cool but she's also extremely selfish and doesn't care about your experience?  That doesn't really add up.  I would give the friendship, first, as she doesn't seem worth it, and tell her that she's being a horrible roommate and taking advantage of you having gotten her a temporary place.  Second, ask your boyfriend if he wants her gone - if he does, then someone needs to act on this.  Give her a deadline and stick to it.  She'll find someone else to leech off of, I'm sure.  I don't understand why your boyfriend is letting this continue. It's clear that she's a terrible roommate (not paying rent on time and stealing - really?). She's an adult who should know better - you shouldn't constantly have to be reinforcing boundaries with her. Your boyfriend needs to act on this, especially if he's also miserable.  It's a shockingly common situation.\n\nI'm not exactly sure why people refuse to kick out their horrible roommates, leeches, and moochers, but it happens. Though, I've got a hypothesis that it's usually some combination of pity and apathy... It's a shockingly common situation.\n\nI'm not exactly sure why people refuse to kick out their horrible roommates, leeches, and moochers, but it happens. Though, I've got a hypothesis that it's usually some combination of pity and apathy... I will say, I think there is an amount of pity in this. The reason I suggested she move in with my boyfriend when I knew I didn't want to live with her from the beginning is because I felt sorry for her.\n\nAnd earlier this week she moved a bunch of her furniture from a storage space and has paid some person $600 to help her organize everything. How can you kick somebody out right after they've done all that??? It's a very complicated situation. Plus, *I* can't kick her out, only my boyfriend can, and he suffers from extreme social anxiety and is one of the least confrontational people I know. I will say, I think there is an amount of pity in this. The reason I suggested she move in with my boyfriend when I knew I didn't want to live with her from the beginning is because I felt sorry for her.\n\nAnd earlier this week she moved a bunch of her furniture from a storage space and has paid some person $600 to help her organize everything. How can you kick somebody out right after they've done all that??? It's a very complicated situation. Plus, *I* can't kick her out, only my boyfriend can, and he suffers from extreme social anxiety and is one of the least confrontational people I know. I will say, I think there is an amount of pity in this. The reason I suggested she move in with my boyfriend when I knew I didn't want to live with her from the beginning is because I felt sorry for her.\n\nAnd earlier this week she moved a bunch of her furniture from a storage space and has paid some person $600 to help her organize everything. How can you kick somebody out right after they've done all that??? It's a very complicated situation. Plus, *I* can't kick her out, only my boyfriend can, and he suffers from extreme social anxiety and is one of the least confrontational people I know. I will say, I think there is an amount of pity in this. The reason I suggested she move in with my boyfriend when I knew I didn't want to live with her from the beginning is because I felt sorry for her.\n\nAnd earlier this week she moved a bunch of her furniture from a storage space and has paid some person $600 to help her organize everything. How can you kick somebody out right after they've done all that??? It's a very complicated situation. Plus, *I* can't kick her out, only my boyfriend can, and he suffers from extreme social anxiety and is one of the least confrontational people I know. Then why don't you guys do the least confrontational thing and move to a different place with your boyfriend? You both get out of terrible living situations and it sounds like you are both basically living together anyway.  Sorry to post twice but you can't be serious that living in your home isn't an option. \n\nIf your neighbors are screaming and extremely violent every night, then every night you call the police. You can't just walk away from your home because your neighbors make noise. You can complain to the landlord and get the police involved, repeatedly, every time. If you make enough complaints your landlord has to evict them, or you may have the option to withhold rent (talk to a realtor to ask) from him until he does because of unreasonable living situations.\n\n\nBut bottom line, you don't live with your boyfriend. Your boyfriend lives there and your friend lives there. You can't kick her out. Is this bothering your boyfriend as much as it is you? If it is, you need to have a sit down chat with him and tell him your plan for getting her out. She technically lives there and pays rent so you can't just 'kick her out' but I think you should talk about giving her a firm deadline for moving out. \n\nHave a 3 way sit down with her and your boyfriend and (have him speak up too!!) let her know that by x date (probably a month or month and a half away) she needs to be out. You helped her out, your boyfriend wants his space back or WHATEVER else you feel like saying, but she needs to be out by then and that's it. He may be able to find the confidence to say what he needs to with you there to back him up. Just make sure to be honest and direct without being nasty and condescending\n\nIf he's not going to do that then you need to deal with your own living situation because your boyfriend is being a baby. Is he this spineless about every problem in his life? Sorry to post twice but you can't be serious that living in your home isn't an option. \n\nIf your neighbors are screaming and extremely violent every night, then every night you call the police. You can't just walk away from your home because your neighbors make noise. You can complain to the landlord and get the police involved, repeatedly, every time. If you make enough complaints your landlord has to evict them, or you may have the option to withhold rent (talk to a realtor to ask) from him until he does because of unreasonable living situations.\n\n\nBut bottom line, you don't live with your boyfriend. Your boyfriend lives there and your friend lives there. You can't kick her out. Is this bothering your boyfriend as much as it is you? If it is, you need to have a sit down chat with him and tell him your plan for getting her out. She technically lives there and pays rent so you can't just 'kick her out' but I think you should talk about giving her a firm deadline for moving out. \n\nHave a 3 way sit down with her and your boyfriend and (have him speak up too!!) let her know that by x date (probably a month or month and a half away) she needs to be out. You helped her out, your boyfriend wants his space back or WHATEVER else you feel like saying, but she needs to be out by then and that's it. He may be able to find the confidence to say what he needs to with you there to back him up. Just make sure to be honest and direct without being nasty and condescending\n\nIf he's not going to do that then you need to deal with your own living situation because your boyfriend is being a baby. Is he this spineless about every problem in his life? He *is* a bit spineless, if that's how you're putting it. It's actually quite a problem for him -- he has really bad social anxiety and it doesn't help that he came from a family where his parents NEVER fought at all, and there's just been no such thing as confrontation in his life. He comes from a background of extreme passive aggression and because he has so much social anxiety, has never been social enough to expose himself to new friends with different methods of communication. So, he has a LOT of baggage to sort through in terms of communication.\n\nAs far as my house goes -- I have called the cops a few times but it doesn't stop the fact that it's still waking me up in the middle of the night. I also have called CPS who are dealing with it. Sometimes it's not violence, though -- sometimes it's a heavy bass from their music system. Anyway, I *am* working on changing my own living situation, as I'm looking for a new place. It's all just a huge transition. For the better part of a year, I've been living with my boyfriend but just keeping my stuff and paying for rent at another place. I really only go home once a week, just to change out my clothes. I buy groceries at my boyfriend's house and do laundry at my boyfriend's house; I hang out with friends at my boyfriend's house, and when people as me where I live, I tell them his address. Well unless you live there you have no say. Why not just tell her you're moving in and she needs to be out?\n\nAnd what I meant was call the cops EVERY time. Every time they do it. Every time they scream, blast music, get violent, anything. It won't get better until you make it better.\n\nAnd your boyfriend needs to grow a pair or suck it up. You can't be worrying about this for him, and you should either move in and actually get involved (what is the point of paying rent on an apartment if you only go there once a week to change your clothes...) or deal with your home situation and stay out of it. The point is having a space that I know is my space; it's my escape; it's my once-a-week vacation from the world where I can withdraw when I need it. And his house is great, but it wouldn't be as great if it had all my stuff in it too. I like having my own place, and I like not 100% living with him. The point is having a space that I know is my space; it's my escape; it's my once-a-week vacation from the world where I can withdraw when I need it. And his house is great, but it wouldn't be as great if it had all my stuff in it too. I like having my own place, and I like not 100% living with him. Well then you better get used to his roommate too because she's not going anywhere unless he sprouts a backbone since you don't really have a say either  I don't understand why you can't stay at your place and have your boyfriend over. I mean, you're paying rent there, after all.  Well, if your boyfriend does really want her out as much as you do, but is bad with confrontation, you can always tell your friend for him? Otherwise, because he is the one paying rent, if he isn't bothered enough to actually want her out, not much can really be done, I think. You can tell her straight up that you think her roomy habits are ruining your friendship. You say you're being direct with her, but maybe be 100% honest and tell her you want her the fuck out, because she's an awful roommate, but otherwise a good friend.. and you want to keep the friendship. \n\nThat really sucks, though, I completely sympathize. I had a bad experience with a roommate/best friend who got us all evicted.\n\nEdit: wording I don't know that I really want to be her friend anymore :(\n\nAnd yeah, he doesn't want me to tell her for him (he'd feel like less of a man... he's very, very slowly working up the courage to kick her out, but the problem is he has extreme social anxiety so any interaction is difficult, especially confrontational ones). I don't know that I really want to be her friend anymore :(\n\nAnd yeah, he doesn't want me to tell her for him (he'd feel like less of a man... he's very, very slowly working up the courage to kick her out, but the problem is he has extreme social anxiety so any interaction is difficult, especially confrontational ones). &gt;got kicked out of the co-op she founded.\n\nThat says it all.  I don't know that I really want to be her friend anymore :(\n\nAnd yeah, he doesn't want me to tell her for him (he'd feel like less of a man... he's very, very slowly working up the courage to kick her out, but the problem is he has extreme social anxiety so any interaction is difficult, especially confrontational ones). I don't know that I really want to be her friend anymore :(\n\nAnd yeah, he doesn't want me to tell her for him (he'd feel like less of a man... he's very, very slowly working up the courage to kick her out, but the problem is he has extreme social anxiety so any interaction is difficult, especially confrontational ones). I don't know that I really want to be her friend anymore :(\n\nAnd yeah, he doesn't want me to tell her for him (he'd feel like less of a man... he's very, very slowly working up the courage to kick her out, but the problem is he has extreme social anxiety so any interaction is difficult, especially confrontational ones).  I also have a disrespectful, messy, their of a roommate. Luckily the Landlord agreed to not renew his lease so we'll be free of him in September. \n\nIf you need a new place to live and you and your boyfriend both want her gone, the two of you should sit her down and tell her to move out, together. Like others have said, set a deadline and stick to it. If she's not gone, put her stuff out on the street and change the locks. \n\nYou can move into her room and pay rent if you still want to keep your stuff separate from your boyfriend's. Your boyfriend will get the bonus of a courteous remnant who pays rent on time and you'll have your own space without the issues your  eight ours cause you.  This is my fantasy idea! But honestly I'm a bit scared to move in with my boyfriend. I lived with a boyfriend for three years because I didn't have another choice financially, and now that I have the choice, I'm not sure I'd **ever** want to live with a boyfriend again. Having a completely different space where you can't possibly see/hear/have anything to do with an SO when you need your own space is very freeing.  This is my fantasy idea! But honestly I'm a bit scared to move in with my boyfriend. I lived with a boyfriend for three years because I didn't have another choice financially, and now that I have the choice, I'm not sure I'd **ever** want to live with a boyfriend again. Having a completely different space where you can't possibly see/hear/have anything to do with an SO when you need your own space is very freeing.   I had a similar best friend/bad roommate problem. We were sharing a place and after talking with her twice about her behaviors that were bad (messy, eating my food, not paying back money, permanently \"borrowing\" my favorite clothes, etc) I told her one of us had to move out. She freaked out at me and told me I had to find a new roommate for her before coming to her senses and realizing she should pick who she lives with and where. We're no longer friends. But she wasn't really a good friend in hindsight.\n\nDid your friend sign a lease? That might hinder a process of evicting her. Otherwise, you guys need to give her a deadline (30 days is probably her legal right and what is fair) of when she needs to be out or perhaps offer her an alternative of staying if she pays what she should be in rent and signs a lease stating the things she can't do (eat your food, move the furniture, etc). She is not being a good friend or person right now and you do not need her in your life.\n\nAdditionally, as for the condition with your neighbors, you need to be getting the landlord and police involved every time you hear them fighting. The more incidents on record, the better. You personally have the right to live in a safe environment, and morally should be reporting this every time it happens. As a former victim of domestic violence, I wish my neighbors had reported what they knew was happening.  Can you explain to your boyfriend that he will have to visit you at your place from now on, because you don't appreciate your belongings and personal space being invaded? This means you wont have to see her much at all, and he will probably have to make a decision. I am trying to convince him of that. Unfortunately my place is small and very boring, in a terrible location, and quite ghetto.  It's not your place to tell this girl to move out, so you've got that straight.  \n\nGo live in your own house.  Call the police as much as you have to.  I think it's bullshit though that this girl has to put up with some essentially live-in girlfriend who doesn't pay rent dictating the rules of the house.  Maybe that's why she's been so antagonistic towards you.   My paying rent is none of her business. It's not her house, it's my boyfriend's. My boyfriend gets to decide how much his tenants pay, and even if I *were* paying rent here, it wouldn't change her rent. They're not all splitting rent -- they're paying HIM. \n\nAnd it's part of *our* decided relationship that I spend so much time here because we want to spend time together, but we want to keep separate places. Our little saying is that I'm paying rent somewhere else so that I can live here. \n\nAnd finally, she KNEW our situation long before she moved in. \n\n**edit** yeah, he has other tenants who are fine, and not crazy bitches  &gt;She ate THREE bagels. THREE\n\nand that's terrible I think the point she was getting at was, it wasn't like she took a \"normal meal\" or was hungry and took one. \"One\" could be explained as I was hungry and couldn't get food, or I was thinking you wouldn't notice, or any host of a number of things that while rude and of varying levels of asshole-ery, fall under the \"obnoxious\" heading. But because she took three, its as if she didnt' care if OP would notice, and it couldn't have been because she was just a little hungry. Taking not only three, and not only the last one, but THE LAST THREE crosses several boundaries all at once. &gt;She ate THREE bagels. THREE\n\nand that's terrible &gt;She ate THREE bagels. THREE\n\nand that's terrible  Kick her out and keep her out of your life. She doesn't respect you or your boyfriend, and doesn't deserve your friendship. Good luck girl, hope things get easier soon.     I'm sorry! I know quite a few people who were good friends before they were roommates, and now fucking hate each other. I would say that you just say \"You need to be out of here by this date, or I am moving all of your stuff to a storage unit\" with your boyfriend next to you. That way he is obviously agreeing with what you're saying, but doesn't have to face the issue of confrontation himself. If she is not out by that date, move all of her stuff to a storage unit and change the locks.  It seems drastic, but this girl doesn't seem to be one to listen to what you have to say. \n\nJust as a side note, having a boyfriend who is this scared of confrontation may be a real issue later. So I would take the time where this is a relatively mild issue (versus making sure you get the right health care in a situation where you can't make a choice) and remind him that confrontation is hard, but also necessary.     ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1939xt/my_boyfriend_and_my_best_friend_have_become/"
  }, {
    "id" : 42,
    "title" : "TwoX, I'm nearing 3 years with my boyfriend, and I still haven't met most of his close friends...",
    "snippet" : "I'm not sure what subreddit I should be posting this on, but here we go:\n\nIt's been almost 3 years, and I still haven't met like 7/8ths of his friends. He always finds a reason not to have us meet. He says they're \"immature\" and that's why he doesn't want me to meet them, but to me it's a little suspicious and I'm not sure how to come about handling this. I'm not going to break up with him anytime soon, if ever, so I need advice... Thanks!   It's probably not just that they're immature, it's that he feels comfortable being immature around them too. I don't mean that in a bad way -- I act differently around my friends than I do only with my boyfriend too, and when I hang out with them together it's a little awkward trying to be \"myself\" when they're both used to interacting with me in different ways. \n\nIt's possible he feels that you'll judge him or feel excluded if you all hang out together and your personalities don't mesh, so he's trying to avoid it. After three years though, I think it's time for him to start making an effort to incorporate you into that aspect of his life even if it's outside his comfort zone a little. Maybe suggest having a big party with all of your friends together, so you'll be able to meet his friends casually and observe how they are when they hang out together, but you don't necessarily need to be right with them the whole time. \n\nThen once the ice has been broken, maybe he'll feel comfortable hanging out with all of you together more often -- or you'll find that they're not really your types after all, but once the mystery is gone it won't bother you so much. It's okay not to be friends with everybody your boyfriend hangs out with.   Okay this can go one of two ways depending on these:\n\nDoes he go out without inviting you a lot? Does he hang out with his friends and not invite you? Is your relationship public on facebook? Does he talk about his friends? Does he text them in front of you or is he secretive about it? \n\nYou've been dating 3 years, not to sound paranoid but this is a major red flag Okay this can go one of two ways depending on these:\n\nDoes he go out without inviting you a lot? Does he hang out with his friends and not invite you? Is your relationship public on facebook? Does he talk about his friends? Does he text them in front of you or is he secretive about it? \n\nYou've been dating 3 years, not to sound paranoid but this is a major red flag He often hangs out with them and not me, but when they are together they play computer games and I've seen his hours logged on Steam.. He never hides his phone, and yes we are public. Is that all they do? Do they ever go out, or is it just sitting in a room playing computer games? Are they all just sitting on their own computers, not really talking/socializing or are they actually friendly? Why do you refer to them as \"close friends\"? Is he honestly close with them (as a girl, I guess I kind of have the girly definition of someone you can hang out with a lot, do lots of things with, talk to, etc), or is it just routine that they sit around in someone's basement playing computer games? Does he ever hang out with them individually? \n\n\nI wonder if it's more like a \"This is a thing I do\" instead of a \"These are the people I hang out with,\" thing. If that is all they are doing, I can see it. I wouldn't invite my boyfriend to a book club, if he's never read the book, or a kickball game, if he's going to sit on the sidelines. If the hanging out is ALWAYS ONLY about playing computer games, there won't be much for you to do. How often is he going out to dinner with them or going to parties or going to the movies or doing other things? I think you definitely need to talk to him more about your concerns, but ask specific questions about his friendships and why it wouldn't work.  They go out quite a bit to go downtown and stuff. I call them close because they are with him literally every weekend. Maybe you're not the only GF he has. Seems very very suspicious that he hasn't introduced you.  Have you met other people he's close to, like his parents and family?  It's possible he might not have many/any friends. :(  This is not good. If you have a great relationship, shouldn't you be proud of one another? Shouldn't you want to show eachother off? Introduce your friends? It's very shady to me when someone doesn't want to bring their partner around, and in my experience, it usually ends up that that person is embarrassed of their SO in some way or another. I hope that's not the case here. On the flip side, maybe he's embarrassed OF his friends---he says they're immature and he probably thinks they'd annoy you? Who knows. Talk to him. I think its a little ridiculous that three years have gone by and you dont know his friends. Thank you! Those are like my exact feelings. He swears that it's the opposite, that he feels like his friends are embarrassing... I don't know, I have ADHD really bad so I'm a bit of a spaz, and I'm always worried that I embarrass him.. But if his friends are like he says they are, then we would probably get along great :P Even if he's embarrassed about his friends, he should trust you enough to understand. If he said, \"Look, my friends are immature. I like to be immature around them, and I'm aware I'm doing it. It's nice to be able to have a break from adulthood when I see them. I want you to meet them, but understand this.\" And, if you said \"Yeah, I get it. You're allowed to be however you want around your friends. I know and trust you, and I won't judge you on it,\" then what would happen?\n\n\nOther things to consider: Has he gone out a lot with your friends? Has he become an integral part of your social circle? Are all his friends single guys? If he hangs out a lot with a group of guys, it might be awkward for all of them, if one person's gf is around. If there's girls in the group, then it might be easier.\n\n\nI kind of disagree with the idea of a huge party to first meet them. It might be overwhelming, and there's also the alcohol factor. Maybe see if he can pick 1-2 friends to go out to dinner or something, or maybe something more distracting like bowling. If any of his friends have a gf, and they could do a double date, that might work, too. If it's only 1-2 guys, and in public, they all might be willing to be less \"immature,\" than when they are in a big group. If you meet them slowly, it might be easier to be more incorporated.  You do say \"close friends,\" as opposed to \"group he plays video games and drinks with,\" so hopefully your boyfriend could feel comfortable going out to dinner with 1-2. Good Luck.  My boyfriend said the same thing. He just kept saying \"Well, you can meet them if you want, but you guys won't like each other so you know. Just warning you\". It upsets me, but at the same time, I don't want him to be caught between his friends and me. I know he wouldn't be comfortable defending me against his best friends, so I don't want to put him in that position. I still want to meet them, and it does still kind of hurt my feelings that he hasn't gone out of his way to introduce us, but I just chalk it up to him wanting to keep things civil on both sides.    ADDITIONAL INFO: His friends apparenly have never had girlfriends, I don't know if that has anything to do with it or not, but yeah.. Forgive me, but how old are you? I've gotten to the point where I assume everyone is around my age, because I hate to realize how old I am, but I know there are people a lot younger than me, that are dating.\n\n\n\nIf you are in your very early twenties, or younger, I can kind of understand this. If you are in your mid-twenties and up, I kind of wonder about these experiences. Do the guys date at all, and just never have anyone they become close enough to to want to spend so much time with/incorporate into their lives? \n\n\nWhat are your living situations? Are people living with parents? Dorms? Are you living with your boyfriend? Do you work? Go to school? Financial situations and freedom to go out have an effect on what you can/can't do with friends, and what you get used to doing. I don't want to reveal my age because I fear that people will discount the seriousness of my relationship or call it \"puppy love\".. But I will say that we are under 20, living apart and going to school. I have met his friends that attend our school, but none outside of school (which is most of them).. I won't call it puppy love, especially after 3 years, but I will say that friendships as teenagers are different than friendships as you get older. I think as you get older, people tend to hang out in more co-ed groups. More people have serious relationships, and they get more incorporated into social circles. Every time I'm invited to a get-together via facebook or something, it says \"Significant others are of course welcome, just let me know\". \n\n\nAt your age, it may be a lot harder for his friends to be accepting of a change, and possibly a visible reminder of their lack of relationship experience. \n  XY here, I would never introduce the two for several reasons.\n\n1. It doesn't matter to me, I like to keep things separate.\n\n2. They won't get along.\n\n3. They don't care to meet her, in fact they rather I didn't bring her around because it will affect our \"men\" time.\n\n4. If she pops in then what? She says hi and moves on, kind of pointless to me.\n\n\nJust my 2 cents, do what you want. Why do you want to keep things separate? I love my boyfriend, and I want him to be part of my life. Which means, I want him to see how I interact with my friends, and appreciate the things I enjoy. \n\n\nAnd why are you dating someone who wouldn't get along with your friends? I find it hard to believe that your good friends and your girlfriend would have such personalities that they wouldn't get along, but still be that important to you.\n\n\nIs all you do with your friends \"men time\"? There's nothing wrong with that sometimes, but do you never hang out with females? \n\n\n\n\nJust out of curiosity, what do you do on New Year's Eve, for example?  XY here...\n\nHe's dating another woman or has some other relationship.  (Maybe an ex?  Maybe he's bi and with a guy?)  The 1/8 that you've met are the ones he can trust not to tell you or the other person.  I've known a guy who was juggling multiple relationships and to make it work, he had the friends groups very divided. Holy assumptions batman.  I don't really know a single one of my boyfriend friends, I know his work mates but aside from that. Saying that, he doesn't go out with them that often, I go out with my friends more often (he knows most of them). I don't know if it's a red flag that he has no friends? Probably  [deleted]",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194ciz/twox_im_nearing_3_years_with_my_boyfriend_and_i/"
  }, {
    "id" : 43,
    "title" : "TwoX, I don't know how to deal with my family. ",
    "snippet" : "Many years ago, I decide I didn't want to be a doctor. I didn't know what I wanted to be, but I'm young, and that's okay. \n\nThat's not okay with my family. Because they're brown, from Pakistan, and like others, think that the only acceptable career is a \"doctor\" or an \"engineer\". Why do they think that? Because of the money. \n\nI've never told my dad the truth. But for months, I've been telling my mom off and on, \"I'm not going to med school\" and \"I don't want to be a doctor\" and \"that line of work isn't for me.\" She never takes it well, and she always gets mad, but I leave her be, and think to myself that she'll get used to the idea eventually. \n\nToday, my dad came to me and asked me \"So when are you going to apply to medical school?\"\n\nI braced myself and finally told him. I don't want to go to medical school. \n\nMy dad, who's been wanting me to be a doctor since I was about five, looked at me and said, \"That's not an option. When are you going to apply to medical school?\"\n\nI told him again. \n\n\"When did this happen? Did something force you to not want to go anymore?\"\n\nI told him no. This was my own decision. \n\n\"You know I had high hopes for you.\"\n\nI knew this, but I wanted to let myself be happy for once \n\nHe nodded a few times, turned to my mom, and said, \"Alright. Find a boy for her. Lets get her married.\"\n\nIn America, I realize most people think this arranged marriage thing is an old custom. But it's not. All of my friends who were married got arranged marriages. I never go out, find my own boy, and fall in love with him. I'm supposed to pick someone out of the predetermined pool of bachelors my parents have, and then learn to love them after we get married. I've grown up with this ideaology. But I have never liked it. And I never wanted it for myself.\n\nI asked my dad if he was serious. And he said yes. He didn't want to waste his time continuing to put me through college just to get some lesser degree and work somewhere \"useless\". He said he wouldn't push it if I was going to med school, because I needed to focus on school, and not about husbands. \n\nBut at what point do I get my say? Why aren't I allowed to say \"No, Dad, I want to finish my education and then work and then maybe find a guy on my own and settle down?\" Why does he have to map out my life go me and why don't I get any say in the matter? How is this fair? At what point am I supposed to be happy if I'm just supposed to be a stay-at-home wife? It's what my own mom is, and she always told me how much she hates it. Why does she think it's alright to subject me to that?\n\nI just want to scream. Who goes into parenting, expecting their kids to be exactly the way THEY want them. And why are you going to put me through this when you realize I want to live my own life?\n\nAt this point, I'm scared that they're going to stop paying for college, since I'm planning toget a \"useless degree\" (chemistry btw). And what am I supposed to do then. Just wait around to get married? Why is this okay, I just can't understand this. I have neve felt so trapped, and I had no idea that my parents wanted me to resent them more than I do. \n\nThere are some people who think \"that's the life. Letting your husband work while you stay at home and relax.\"  But I have never wanted that. I want to be independent. I want to work, and follow my own dreams. I want to be able to live my own life. \n\nI'd sooner die than let them do this to me.    Ugh what an unfortunate situation to be in. Of course you are entitled to lead the life you want! I do think that /u/mimi_ has a point, though, you're an adult and are entitled to their money. \n\nHowever, I wonder how your parents would react if you told them about an alternate career path you want to follow. So instead I just saying \"I don't want to be a doctor\", you'll be saying \"I want to be a chemist, working in academia/industry/government, which can be equally lucrative, and this is how I will achieve this.\" This may make your parents realize that being a doctor or engineer are not the only paths to success, and more importantly, that you do have a plan, and are not just refusing to go to med school to be contrary to them (I don't mean you are, just that's what they may think). They may also agree to continue to pay for your schooling this way.  Ugh what an unfortunate situation to be in. Of course you are entitled to lead the life you want! I do think that /u/mimi_ has a point, though, you're an adult and are entitled to their money. \n\nHowever, I wonder how your parents would react if you told them about an alternate career path you want to follow. So instead I just saying \"I don't want to be a doctor\", you'll be saying \"I want to be a chemist, working in academia/industry/government, which can be equally lucrative, and this is how I will achieve this.\" This may make your parents realize that being a doctor or engineer are not the only paths to success, and more importantly, that you do have a plan, and are not just refusing to go to med school to be contrary to them (I don't mean you are, just that's what they may think). They may also agree to continue to pay for your schooling this way.   That's not a great situation to be in, but you do get to have your say. You just want to have your cake and eat it too.\n\nYou are not entitled to their money. You are an adult. There are plenty of people who have to work their way through college and do not receive ANY financial support or emotional encouragement.\n\nThere's an intelligent way to put yourself through college and live the life YOU want to live. You need to plan for it and get organized. Eventually, most parents come around, but if they still feel disappointment that you're making decisions that don't coincide with their wishes, that's their problem. Tough to work through, yes, but if this is the biggest challenge for you and your family, be thankful it's not something worse (alcoholism, violence, etc). That's not a great situation to be in, but you do get to have your say. You just want to have your cake and eat it too.\n\nYou are not entitled to their money. You are an adult. There are plenty of people who have to work their way through college and do not receive ANY financial support or emotional encouragement.\n\nThere's an intelligent way to put yourself through college and live the life YOU want to live. You need to plan for it and get organized. Eventually, most parents come around, but if they still feel disappointment that you're making decisions that don't coincide with their wishes, that's their problem. Tough to work through, yes, but if this is the biggest challenge for you and your family, be thankful it's not something worse (alcoholism, violence, etc). The thing is, in these traditional cultures it's not just the money, sometimes doing your own thing means losing your whole family, and the burden of knowing you've brought shame upon them.  \n\nYou go against the grain and fuck everything up for everyone, it's a huge deal.  Freedom means loneliness and ostracism, and when you fuck up like most young people do there's no home to go home to, it's terrifying.  \n\nYou're raised to be dependent on everyone around you and when you walk away... not all people are lucky enough to get forgiven eventually, and end up with more issues than when they started.  \n\nI know it seems so easy to modern American types to just walk away and do your own thing, but the psychological aspect is... probably something most of you won't understand.  But it's real. I think that's an excellent perspective to point out. Although estrangement does happen here for simliar reasons, it's no where near the degree I see in other cultures.\n\nA lot of people I know here come from nontraditional families who have zero safety net and zero relatives to contact for assistance (maybe I'm just in a bad area). If I don't go to work in the morning, there's no mommy or daddy who can come swing by and help me out. No \"come crash on my couch, let me buy your food for the month.\" No one ever cared about my report card or the security of my future. So I think that the psychological stress of being fully self-sufficient may be just as negative as letting down family members who will withdrawal their support and emotional ties if you don't... work in the specialized field they want you to. \n\nSome of my friends' parents are very strict and only want them to be a doctor or engineer like op, but I see their strictness and discipline (to the point of punishment and violence for bad grades) ultimately coming from a good place. I'm not justifying it, but having no one there to care about where you're going in life, having zero guidance, is just as bad.  The thing is, in these traditional cultures it's not just the money, sometimes doing your own thing means losing your whole family, and the burden of knowing you've brought shame upon them.  \n\nYou go against the grain and fuck everything up for everyone, it's a huge deal.  Freedom means loneliness and ostracism, and when you fuck up like most young people do there's no home to go home to, it's terrifying.  \n\nYou're raised to be dependent on everyone around you and when you walk away... not all people are lucky enough to get forgiven eventually, and end up with more issues than when they started.  \n\nI know it seems so easy to modern American types to just walk away and do your own thing, but the psychological aspect is... probably something most of you won't understand.  But it's real. And some of us dealt with it.  Just because you don't understand that some of us moved out and didn't speak to our family for decades.  \n\nDon't use the excuse of 'traditional cultures'.  I lost my whole family.  My mother would not even acknowledge me if we saw each other at the mall.   One of my friends was shocked when I told her that was my mother \"She acted like she didn't even know you\".  Yep.\n\nSo, yes, it IS something that us modern american types do get.  \n\n If a women had been made to be dependent on her abusive spouse would you tell her to just get over it and leave?\n\nThe \"pull yourself up by bootstraps\" American attitude can work in a lot of situations but not ones like these. As a woman who was dependent upon an abusive spouse, I have helped more than 1 woman leave. And the 2 situations are quite different. \n\nShe thinks her Parents OWE her an education?? They dont.   Her parents are living their values and expect her to share those values while she is their dependent. \n\nShe can try to communicate differently. But that is no guarantee that they will accept her decisiOn  Unless this chick gets full ride scholarships, she's up the creek if her parents refuse to sign the fasfa.  It's called working every second of the day on top of going to school on time and studying. \n\nMany people do it, many people's parents don't sign their fasfas.  I have two jobs and go to school. I don't cover anywhere near my expenses.\n\nMany people do it, but, many women also survived DYI abortions. That doesn't mean it's the best way to do things. And some of us dealt with it.  Just because you don't understand that some of us moved out and didn't speak to our family for decades.  \n\nDon't use the excuse of 'traditional cultures'.  I lost my whole family.  My mother would not even acknowledge me if we saw each other at the mall.   One of my friends was shocked when I told her that was my mother \"She acted like she didn't even know you\".  Yep.\n\nSo, yes, it IS something that us modern american types do get.  \n\n ...why are you so hostile?  I've dealt with it myself.  A lot of people really don't get it, or this advice thread would be way different.  I wasn't trying to offend you but today's american way of life and family values are still radically different from most other cultures.  The family life of sitcoms and reality TV just isn't the reality for traditional-culture style families.  Your results may vary. I don't know a single person who lives \"the family life of sitcoms\".  Not One. \n\nWho here lives \"the family life of sitcoms\"?  I doubt any of us do. \n\nWe can tell the difference between tv and reality. Our reality is not that different from your reality.  Unless you are in a different country, the same laws apply to you. \n\nFreedom from family always means loneliness and ostracism. It has nothing to do with the color of your skin. It has nothing to do with your religion. It has nothing to do with your country of origin. Don't Pretend that you are a great martyr because of culture.  Loads of us had zero safety net. Right up to not even getting diaper money when we had to get a restraint order against the abusive ex.  &gt;Freedom from family always means loneliness and ostracism.\n\nBut not everyone is trying to be free from their family, which I think is that godzuki26 was trying to say with \"tv families\". Some of us grown up in that setting with families who we are close with and depend on and have family reunions with like \"tv families\" depict. That's why she was saying it might be hard for some people to understand if that's what they're used to and what they consider the \"norm\" for how families are.\n\n\nI agree with her that in American culture it's also a lot easier and a lot more common to have distance between yourself and your family and it not be a big deal (what they were trying to express as well). I was raised to be very independent to the point that I live in a different country from my family and might not ever get married. But we still get together for holidays and it's no big deal. If you come from a different \"tradition\" or culture, this might not be the case so it would be hard for people like myself, who grew up being taught to be independent and on my own, to understand why someone couldn't just leave and do their own thing. Going back to your quote I picked out, I have freedom from my family. I live by myself in a big city on a different continent. I picked my majors and schools and boyfriends. And I am most certainly **not** lonely and ostracized because culturally what I'm doing is considered \"normal\" and \"okay\" to my parents.  Ahh, but you still have contact with them. You still talk to them. You can still count on them to answer the phone when you call. \n\n They will tell you when your aunt passes away or your cousin has a baby. \nYou are independent but you still have connections. That's different. That's the accepted norm in the USA.  Not everyone has that.  &gt;That's different. That's the accepted norm in the USA.  Not everyone has that. \n\nThat was actually the point of the comment that got you all riled up. In the US, the accepted norm is that a child will move away and do things independently but still be included in family affairs and holidays. There are certainly people in the US who don't live this lifestyle or for whom this is kind of true with the addition of alcoholism, abusive behavior, and so on within the family, but it's considered \"normal\" behavior. \n\nBut in other cultures, like OP's, trying to have that kind of independence is very unusual and may get you cut off from your family completely. This is the part that most Americans can't or don't understand because it's typically not a threat for us. To us, a family is supposed to be the people who can't reject you unless you actually hurt them, but in other cultures, a family is supposed to be the young supporting the old because they \"owe\" them and that involves following the parents' plans for wealth. If you can't or won't do that, then you don't deserve your family (note: I'm paraphrasing from what I've gathered from the Indian and Chinese people I work with, so it may be not entirely accurate but this is the gist of it). \n\nSo if OP rejects her parents' plans for her, then she's rejecting them and she's risking complete ostracism. Which really sucks, and makes this a hard decision, but it doesn't take away the fact that this is her decision. And what I am trying to say is, that type of ostracism is not limited to a particular race or a certain religion or selected nationality. \n\nDo some volunteer work with homeless kids. It will break your heart to see how many kids are considered disposable. Black, white, Asian, mixed, every race is represented.  There are patents on nearly every religion who do this to their children - Christian, Muslim, Jewish, Hindu   It doesn't matter. You name the cultural background, they have kicked their kids out v\n\nAs in - not getting notified of their siblings graduations/weddings/etc. not getting notified when a relative dies or a baby is born. As in, ignoring your child when you encounter them in public. \n\nIt is not limited to only Pakistani parents. \n\nShe does have a choice. I would give her the advice we give to closeted kids with homophobic parents. Stay in the closet until you finish your education and have a job lined up. Then come out to them. That makes it easier to stay off the street. But it may be too late for that.  I don't know a single person who lives \"the family life of sitcoms\".  Not One. \n\nWho here lives \"the family life of sitcoms\"?  I doubt any of us do. \n\nWe can tell the difference between tv and reality. Our reality is not that different from your reality.  Unless you are in a different country, the same laws apply to you. \n\nFreedom from family always means loneliness and ostracism. It has nothing to do with the color of your skin. It has nothing to do with your religion. It has nothing to do with your country of origin. Don't Pretend that you are a great martyr because of culture.  Loads of us had zero safety net. Right up to not even getting diaper money when we had to get a restraint order against the abusive ex.  That's not a great situation to be in, but you do get to have your say. You just want to have your cake and eat it too.\n\nYou are not entitled to their money. You are an adult. There are plenty of people who have to work their way through college and do not receive ANY financial support or emotional encouragement.\n\nThere's an intelligent way to put yourself through college and live the life YOU want to live. You need to plan for it and get organized. Eventually, most parents come around, but if they still feel disappointment that you're making decisions that don't coincide with their wishes, that's their problem. Tough to work through, yes, but if this is the biggest challenge for you and your family, be thankful it's not something worse (alcoholism, violence, etc). It's something really hard to learn. My mother always paid for everything for me while I was growing up, and then I was subject to her emotional sabotage. I had to do whatever she wanted me to do. I moved out and refused to let her help me out financially, and now she can't hold anything over my head. It sucks at first but it's better than living your life on your parent's terms. That's not a great situation to be in, but you do get to have your say. You just want to have your cake and eat it too.\n\nYou are not entitled to their money. You are an adult. There are plenty of people who have to work their way through college and do not receive ANY financial support or emotional encouragement.\n\nThere's an intelligent way to put yourself through college and live the life YOU want to live. You need to plan for it and get organized. Eventually, most parents come around, but if they still feel disappointment that you're making decisions that don't coincide with their wishes, that's their problem. Tough to work through, yes, but if this is the biggest challenge for you and your family, be thankful it's not something worse (alcoholism, violence, etc). &gt;You are not entitled to their money. You are an adult. There are plenty of people who have to work their way through college and do not receive ANY financial support or emotional encouragement.\n\nThe problem I have with this statement is that the government believes otherwise. The government believes that the family is obligated to pay for the child's education and bases the amount of aid the student gets based on the parents income, regardless of whether the parents pay or not. Emancipation is rarely an option because the government is on the look out for students and parents who are taking advantage of emancipation and using it to get more aid from the government instead of using it as it's meant to be used. \n\nNo, she is not entitled, but everything that happens to her depends a LOT on what her parents do. It's okay to get pissed off and angry when looking at it in this way. This is only true until you are 24. \n\nYou're not entitled to government money either. \n\nI'm not saying she doesn't have the right to get pissed off, I would be too. Although life's not fair, she has options. Just trying to point that out. If I pay taxes and I am a citizen of the nation, I'd say I am entitled to that money when I qualify for aid and need it just based on what I know. I don't see how I am not entitled to government money when I meet the qualifications for it.\n\nJust speaking from the position of the OP. The reason that they can't get the money is due to policies that are not updated to match the current situation. Problem is, it's hard to qualify for aid if your parents are still claiming you as a dependent. You can't just \"liberate\" yourself from them without a good reason (i.e. abuse, etc.) and so OP likely won't be able to get financial aid if her parents make a certain amount. If I pay taxes and I am a citizen of the nation, I'd say I am entitled to that money when I qualify for aid and need it just based on what I know. I don't see how I am not entitled to government money when I meet the qualifications for it.\n\nJust speaking from the position of the OP. The reason that they can't get the money is due to policies that are not updated to match the current situation. I understand your perspective - yes in theory that's how it should be. But that's not the reality for a lot of issues and at the end of the day you're not entitled to anyone's help but your own. I prefer to deal with how things are rather than how they are suppose to be. But your opinion is absolutely valid. But if you put money in, you're entitled to that money, how is it not reality?  That's not a great situation to be in, but you do get to have your say. You just want to have your cake and eat it too.\n\nYou are not entitled to their money. You are an adult. There are plenty of people who have to work their way through college and do not receive ANY financial support or emotional encouragement.\n\nThere's an intelligent way to put yourself through college and live the life YOU want to live. You need to plan for it and get organized. Eventually, most parents come around, but if they still feel disappointment that you're making decisions that don't coincide with their wishes, that's their problem. Tough to work through, yes, but if this is the biggest challenge for you and your family, be thankful it's not something worse (alcoholism, violence, etc). &gt; Tough to work through, yes, but if this is the biggest challenge for you and your family, be thankful it's not something worse (alcoholism, violence, etc).\n\nReally? They're telling her to commit her entire life to being an overworked overstressed cash cow(the parents *will* expect money), or get sold off to a stranger.\n\nBut that's cool. She should be thankful her parents want to use her, because at least they're not getting drunk and beating her.\n\n&gt;You are not entitled to their money.\n\nHowever this is true.\n\n&gt; You just want to have your cake and eat it too.\n\nWhen the hell have you been put in this situation. Commit to being a **fucking doctor** or **get assigned a stranger to fuck you.** How can you say \"cake and eat it too\" with a straight face?? &gt; Tough to work through, yes, but if this is the biggest challenge for you and your family, be thankful it's not something worse (alcoholism, violence, etc).\n\nReally? They're telling her to commit her entire life to being an overworked overstressed cash cow(the parents *will* expect money), or get sold off to a stranger.\n\nBut that's cool. She should be thankful her parents want to use her, because at least they're not getting drunk and beating her.\n\n&gt;You are not entitled to their money.\n\nHowever this is true.\n\n&gt; You just want to have your cake and eat it too.\n\nWhen the hell have you been put in this situation. Commit to being a **fucking doctor** or **get assigned a stranger to fuck you.** How can you say \"cake and eat it too\" with a straight face?? This type of unreasonable, ridiculous response is what drives a lot of women away from 2x. Also, you need to reread the op's post a little more closely. \n\n&gt;commit to being a fucking doctor or get assigned a stranger to fuck you\n\nJust because this is the ultimatum her parents are laying down for her, doesn't mean these are her only options. This does not take away from how awful the situation is. I'm only saying that she's an adult, and she has the power to direct her own life, as difficult as that may be financially and emotionally. \n\nI stand by my statement as a person who also has some middle eastern background. I've also made several life and death choices (involving myself, others, and strangers) that most people do not experience in their lifetime. The longer you dwell on these types of situations, the more you enter a victim mentality. This just only makes things worse, and I want the OP to avoid that. No matter how unfair things are for her, no matter how awful, *you cannot change the situation.* You cannot have the best of both worlds. In her case, she cannot erase hundres of years of tradition or her father's mindset. She needs to accept reality, *make a decision*, and move forward. Never did I say this wouldn't be extremely heartbreaking or difficult.\n\nAlthough op is in a completely unfair position, it does not erase the reality of the situation, or the fact that she alone is in the drivers seat. \n\nI see a lot of people make lose-lose, soul crushing decisions every day. Part of my job. I'm not desensitized to it, but I do see how important it is to make a hard decision instead of stagnating in conflicted misery.     \n &gt;This type of unreasonable, ridiculous response is what drives a lot of women away from 2x. Also, you need to reread the op's post a little more closely.\n\n\nThat is just exaggerated, condescending rudeness. \"A lot\" of our 120k+ users are being \"driven away?\"\n\nThis user has a valid point of view, whether you find it ridiculous or not.     &gt; I'd sooner die than let them do this to me.\n\nWould you sooner cut them out of your life than let them do this to you?\n\nYou always have the option of living like the rest of us and taking out loans for college. Just a thought. she cannot get loans if her parents won't sign the FAFSA. The situation with students who are no longer minors being dependent upon their parent's financial situation to obtain loans and grants is really wrong. But that is the way it is at this time.  The government makes it difficult to be emancipated -- you have to show that you are self supporting and live away from family. The FAFSA parental information requirement does not go away until age 24 :(\nThis would leave OP taking out far more expensive private loans to get through school. :(       I moved 2,000 miles away from my family to get away from them. I did the same and find it amusing because of our usernames.   I think you'll either have to work out a way to do it by yourself, or try something to placate them. Think Chem. Eng. would be a compromise? As a chemistry major, I have to say that chemical engineering is *not* the same a chemistry. It uses chemistry, yes, but is fundamentally different in the approach to problem solving and the ultimate goals. Chemists are generally all about knowledge while chemical engineers are generally all about money, not personally of course but professionally. It's about efficient processes and low-cost solutions, not about figuring something new out or being intellectually stimulating and investigating interesting topics, or even just doing basic chemical analysis. Engineering is a whole different beast. Oh yeah, I know that they are two different subjects, the whole money basis was the reason I suggested it, as it's more likely to please the parents who obviously have difficulty seeing past that.      Some weird responses in this thread.\n\nWhat do you want to go to school for? If it's not another similarly expensive type of degree, you can get through it yourself, with student loans. Even if it takes you a little longer, but there's no shame in that.\n\nYou are **not** getting your life sold off. Being forced to get married is pretty much like getting sold off. She's an adult. No one can force her to marry anyone. And yes, I grew up in a similar culture, with similarly minded parents, and I got out of it. Many of my friends have gotten out of it. She can too.  I don't think cultural pressure should be discounted. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/193gjt/twox_i_dont_know_how_to_deal_with_my_family/"
  }, {
    "id" : 44,
    "title" : "Hey ladies, DAE get woken up by the feeling of blood dripping down when you're on your period?",
    "snippet" : "I always wake up when its time to change my pad for some reason. Weird.   Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.  Same!\nHigh fives for sixth sense!!\n\nOr maybe our bodies just feel the blood start to drip down the vaginal walls and are like \"HOLY SHIT GET UP NOW AND DEAL WITH THIS.\"\n\nThe all-caps was completely necessary because I always have a burst of adrenaline when I wake up like this, which comes in handy for the desperate race to the bathroom. Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.  Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.  Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.  Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.  Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.  Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.  Yep. What's weirder is that I (used to- I don't get my period anymore YAY) wake up before the blood even starts dripping. I'd suddenly wake up, go to the bathroom, see nothing on my panties, but get a few drops of blood on toilet paper after I wipe. It's like a 6th sense.   THe night before I got my period, I had this terrible dream where I was spraying blood out of my vagina akin to a fire hose. But my periods always give me stranger than usual dreams... That'd be brilliant.  Imagine how quickly it'd be over!   THe night before I got my period, I had this terrible dream where I was spraying blood out of my vagina akin to a fire hose. But my periods always give me stranger than usual dreams... I'll start dreaming about having my period a few days before it starts. Pretty much every  month. That's awful! It's like extending your period a few days. :-( I'll start dreaming about having my period a few days before it starts. Pretty much every  month. THe night before I got my period, I had this terrible dream where I was spraying blood out of my vagina akin to a fire hose. But my periods always give me stranger than usual dreams... THe night before I got my period, I had this terrible dream where I was spraying blood out of my vagina akin to a fire hose. But my periods always give me stranger than usual dreams... THe night before I got my period, I had this terrible dream where I was spraying blood out of my vagina akin to a fire hose. But my periods always give me stranger than usual dreams...  I wake up 5~6 more times than usual while on my period, I always have to go check regardless of flow. It always feels like I'm over flowing, even if there's really nothing there. I hate that, when it feels like a dangerous amount of blood, when there's actually hardly anything there. :| Yes! I get so paranoid I've destroyed my sheets and have drowned the mattress in blood so I don't sleep as well and wake up more!  Sometimes I just put a towel under me and hope for the best (after waking up 5-6 times in a night).  When I first started, I would use a plastic lined sheet because I was so paranoid.  Now my body has this weird perfect timing thing down pat.  I love it. I haven't bled onto a bed since high school but I still like to sleep with a towel under me just in case there's one time it leaks everywhere but doesn't wake me up. Get a waterproof mattress pad instead... you shouldn't need to use a towel all the time!     Sad but true, I can always tell when my period is about to come because I get outrageously pissed off at nothing and everything and have some sort of either emotional breakdown or giant blowout fight the day before. It's like clockwork. It's so embarrassing, but it always takes me forever to figure out I have PMS. I always just think people are being idiots.. until I start wanting to punch things while sobbing. Then the little light bulb goes on and I go and apologise. A friend of mine believes her husband is the only man in the world to get PMS. Most of the time he's a really great guy, sweet and thoughtful and helpful and smart. But once a month, like clockwork, he turns into the most infuriating asshole, he does stupid and annoying things on purpose, and just generally becomes impossible to live with. And then a week later he's back to his usual delightful self.  Ahh man-periods. I know a couple guys who get them too.    Not dripping. Just the general wetness. I don't get irritated by the dripping until I get up to go and then *whoosh!*  Errrgh, just thinking about having to sleep with a pad again is making me cringe. I use a [menstrual cup](http://menstrual-cups.livejournal.com/) now, I can carry on sleeping nude all week, and I tend to forget that I'm even on my period... Just a head's up, even with a cup you should still be somewhat careful, at least on heavy days. Earlier this week I woke up and, rather than changing my cup straight away, went to the kitchen to take some panadol. Then something in the kitchen made me sneeze, and suddenly I had blood streaming down my legs, and had to hobble-run to the bathroom before any got onto the carpet. Errrgh, just thinking about having to sleep with a pad again is making me cringe. I use a [menstrual cup](http://menstrual-cups.livejournal.com/) now, I can carry on sleeping nude all week, and I tend to forget that I'm even on my period...      YES, this morning. :)  \n\nActually, I'm ashamed to say, my half-awake brain told me it would be fine if I just rolled on my side and tried not to move... lol sleepbrains      I am jealous of all you ladies who say the Diva cup is enough. I still need to wake up at least twice per night during heavy days. :(   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/192v50/hey_ladies_dae_get_woken_up_by_the_feeling_of/"
  }, {
    "id" : 45,
    "title" : "Whopper",
    "snippet" : "Here it is, Saturday night at 8:23pm. My husband is already asleep beside me, and I'm laying here in my flannel nightgown, watching Killing Lincoln.  Woooot.  I can't get him interested in sex (pretty sure he has low T) and I am having post-menopausal bleeding.   Fml. Just needed to vent.        [deleted]",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/193y6u/whopper/"
  }, {
    "id" : 46,
    "title" : "I'd like to know how to help a friend whose husband cheated on her.",
    "snippet" : "This hasn't happened to anyone I know before. They've been married for a couple of years and were thinking about having kids soon. Last night she found out that he has been sleeping with two other women, one of them long term.\n\nShe's staying with family. I'm not going to chase after her to talk to me, because of course she wants alone time! I sent her a message to say that I'm here for anything she needs. She says she'll be in touch for a coffee some time soon.\n\n2x, are there any other ways I can help her? Is there anything I can say when we see each other that will really help? Is there anything I shouldn't say? I've already resolved not to bad mouth her husband, just in case (although I think she's determined to break up with him). I think the best possible thing I can do for her is to listen, but I'd love any of your advice. This woman means a lot to me, and has been there for me recently more than anyone else. I want to be the best friend she can have in this horrible time.  You're an awesome friend. Some others might shy away from the whole situation but you just being there for her is huge. That's absolutely what she needs now is coffee with a girlfriend she can vent to. I don't know that there's anything \"right\" to say... Like you said, just listen. Remind her she did nothing wrong, cause she may want to blame herself for his straying.  I was cheated on in a situation that wasn't nearly this awful, but my best friend was the most amazing person in the world. My family was far away, so the filled every role I needed without me ever having to ask. She honestly kept me together until *I* got it together, now that I think about it. I'm trying to think about what she did. \n\n- Right after I broke up with my ex she showed up at my place with chocolate, wine, and the plushest tissues she could find. \n\n- She let me curl up on her couch and watch Firefly so I could be somewhere familiar that wasn't my place. \n\n- She didn't bring anything up unless I did. She listened to me, never passed judgment at my blubbering, and didn't offer advice unless I asked for it. I knew I could work through everything when talking to her because she was almost like a more rational version of my own conscience. A year later she said she had thought for awhile that the breakup should happen, but she never said anything to me at the time.\n\n- We did silly things. We knit silly projects together (uterus, nautiloid, penguin), colored, made beaded jewelry, and who knows what else. Granted, we had always done stuff like that, but we did things that were light and fun. \n\nI don't know if any of that helps you. Every situation and friendship is different, of course, but you sound like a great friend so I don't think you can go wrong with trusting your instincts on this. Your friend is lucky to have you!  Do things that don't revolve around the problem- go out to lunch, go for a walk, go to the movies.  She'll talk more when she's ready. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194owk/id_like_to_know_how_to_help_a_friend_whose/"
  }, {
    "id" : 47,
    "title" : "[IFF] Post-mastectomy tattoo by Tina Bafaro. Photo by Bafaro. Beautiful.",
    "snippet" : "  I'm getting a mastectomy in a couple of weeks (I'm 23). Glad to see she turned it around and made something beautiful out of it! Stay strong and never forget that you are a wonderful person no matter what happens to your body!\n\n*internet hugs* Thank you, yomatz. It really helps to hear some encouraging words. Keep us updated on how you're doing!  Stay strong, sister, and know we are all pulling for you. Take care! Thank you, yomatz. It really helps to hear some encouraging words. Hey lady. Just saw your comment at the top and it hit home- the same thing happened to me at the age of 23- (mastectomy following BC). It's now 10 years later and all is well. I just wanted to wish you all the best with your treatment and the healing process, and say that I hope you have some lovely people around you to walk through it with you. You may not feel the need to, but if you ever want to PM me for a chat, please feel free! All the best, and good health to you! x Thanks, I'll pm you. I want to hear about how it went/doing now if that's okay? I'm getting a mastectomy in a couple of weeks (I'm 23). Glad to see she turned it around and made something beautiful out of it! The moment I saw that picture, I said to myself (I'm 35 with a strong family history) \"OMG if I ever have to get a masectomy I'm totally getting this tattoo.\" You should think it over. It's hella awesome.\n\nI'm also sorry you have to deal with this at 23. You're too damn young. Best of luck to you. The moment I saw that picture, I said to myself (I'm 35 with a strong family history) \"OMG if I ever have to get a masectomy I'm totally getting this tattoo.\" You should think it over. It's hella awesome.\n\nI'm also sorry you have to deal with this at 23. You're too damn young. Best of luck to you. I'm getting a mastectomy in a couple of weeks (I'm 23). Glad to see she turned it around and made something beautiful out of it! I hate to ask, but how come? I tested positive for the BRCA1 mutation- which is a fairly(ish) rare genetic mutation that causes breast cancer. The average woman has a 12% chance of getting breast cancer, while carriers of BRCA1/2 has a 55%-87% chance. I have a strong family history of women getting cancer while young because of BRCA. My mom discovered her's when she was 28 and died at 32, so she wasn't much older than I am now. I tested positive for the BRCA1 mutation- which is a fairly(ish) rare genetic mutation that causes breast cancer. The average woman has a 12% chance of getting breast cancer, while carriers of BRCA1/2 has a 55%-87% chance. I have a strong family history of women getting cancer while young because of BRCA. My mom discovered her's when she was 28 and died at 32, so she wasn't much older than I am now. How did you did out you had this mutation? I ask because while I'm still young (21) my father's mother died o breast cancer in her early thirties. This happened over 55 years ago, however, so I can't exactly look up we medical records. There are no other females on that side of the family either.  That is the coolest thing... I've ever seen. Seriously.\n\nIt's awesome. My jaw dropped when I saw this, it's amazing!  This is beautiful!\n\n20 years ago, I saw this [image](http://www.deenametzger.com/poster/poster.html) during a class on Woman's Health. It changed my thinking about the nature of beauty and courage and illness. It is not too much to say that this tattoo changed my relationship with my body. \n\nTo see this become a tradition, of sorts, to celebrate victory over an illness or injury with an affirming image of one's own choosing, moves me to tears. \n\nAs a survivor of uterine cancer, with my own scars inside and out, it makes me consider what response I am choosing, and how to celebrate my own victory. \n\nThanks for posting this.  That image was definitely a turning point.  Someone had hung the poster of this in the staff lounge at the hospital where I worked about 20 years ago.  Real watershed. \n\nIn the last 5-10 years or so I've seen the tattoo become as common as the reconstruction.   This is a really beautiful photo, but it makes me wonder: if she were to walk around on a beach, or at a public pool without a top on would it be allowed, or would it be considered obscene? It would be considered AWESOME.\n\nBut in all seriousness, I can see people stirring up drama, but eventually deeming it acceptable. [Stir up drama, eventually deemed acceptable.](http://www.thestranger.com/seattle/cover-up/Content?oid=13970858)  Read the update links at the bottom first, if you don't want to get pissed off.\n\nThat's one of the coolest things I've seen in a while, thanks! &gt; \"She made it clear she wanted to show her scars as a 'badge of courage' and wanted to use the pool to spread her message,\" says parks spokeswoman Dewey Potter.\n\nTo *spread her message*!? What, like she got the masectomy to prove some point? FFS. No, I think the message is that some women have mastectomies, and she \"wanted to use the pool (in the way that she was) to spread that message\".  She felt that showing (or, not covering) her scars addressed that message in a way that made her feel comfortable.  Also, there is the argument that wearing tightly fitting tops can be painful after mastectomy procedures.\n\nSince she was directed to the pool by her cancer support group, I'd assume she got a mastectomy to remove breast cancer. Sorry, I must not have been clear - I understand that she most likely got a masectomy because of breast cancer, I meant to say that the pool's spokeperson made a stupid comment. I interpreted from the article that she wanted to go topless for comfort reasons, and the spokesperson for the pool tried to make it about something different. It would be considered AWESOME.\n\nBut in all seriousness, I can see people stirring up drama, but eventually deeming it acceptable. This is a really beautiful photo, but it makes me wonder: if she were to walk around on a beach, or at a public pool without a top on would it be allowed, or would it be considered obscene? This is a really beautiful photo, but it makes me wonder: if she were to walk around on a beach, or at a public pool without a top on would it be allowed, or would it be considered obscene? This is a really beautiful photo, but it makes me wonder: if she were to walk around on a beach, or at a public pool without a top on would it be allowed, or would it be considered obscene?  I imagine that tattoo was particularly painful. The sternum is a hard place to ink. It came out gorgeous though!  Not as painful as cancer. Not as painful as cancer. what, specifically, is inherently painful about cancer? If you detect it early, it might be before you can even feel it. and surgery is under general anesthetic. healing sucks, sure, but they give you meds too. I find your comment unnecessarily dramatic. Yes cancer sucks, but \"painful\" isn't really a defining feature. Many different types of cancer and many different levels of pain.  Some are excruciating. Google bone cancer if the topic interests you. I believe the thread is about breast cancer, what about that? My mom had breast cancer that metastasized to her bones.  She downed oxy like candy for the last five years of her life just to function.\n\nAnd as for cancer being painful, many of the treatments certainly are, even with early detection.  On one drug my mom's cuticles bled constantly and she had to wear bandaids on each of her finger pads just to use a keyboard, her fingers hurt so much. My mom had breast cancer that metastasized to her bones.  She downed oxy like candy for the last five years of her life just to function.\n\nAnd as for cancer being painful, many of the treatments certainly are, even with early detection.  On one drug my mom's cuticles bled constantly and she had to wear bandaids on each of her finger pads just to use a keyboard, her fingers hurt so much. I believe the thread is about breast cancer, what about that? I believe the thread is about breast cancer, what about that? Breast cancer can eat through tissue and bone. Also I would say a mastectomy is more painful than a tattoo. First relevant response all thread! thanks. what, specifically, is inherently painful about cancer? If you detect it early, it might be before you can even feel it. and surgery is under general anesthetic. healing sucks, sure, but they give you meds too. I find your comment unnecessarily dramatic. Yes cancer sucks, but \"painful\" isn't really a defining feature. Treatment (chemo and radiation) are often incredibly painful and come along with a myriad of other fun symptoms, like neuropathy, sores, sleeplessness, extreme fatigue, weakness, loss of appetite, dizziness, etc etc etc. and the course of treatment is long - like years long.  fucking awful. And then add surgeries (often multiple surgeries) recovery from which often means drains, etc etc. And I'm forgetting a million other things. \n\nCancer itself may or may not be painful, depending on the type (though I think end-stage cancer has spread and is usually excruciating ) but it'll kill you without the fucking horrendous treatment. Pain, to me, is childbirth or trauma injuries. Discomfort for long periods of time is much worse, but pain is not the applicable word. As someone with a chronic illness that is not \"painful\" I'm not saying it's less awful because it doesn't involve pain directly. I just expect people to use the right words. Generalizing that cancer is an inherently painful disease does not accurately portray what victims go through. No, it does accurately portray what cancer victims go through. Cancer can be objectively painful. It can compress nerves in organs and other body tissues. It can chemically stimulate nerve endings as well. Tumors can also become infected, which is also painful. [Half to three quarters](http://link.springer.com/article/10.1007%2Fs11916-011-0208-0) of cancer patients experience pain caused by the cancer alone. \n\nOn top of that, pain can be exacerbated or even caused by anxiety or depression, both of which often come with a cancer diagnosis. \n\nThen most treatments either involve surgery, pumping the body full of toxic chemicals, or irradiating body parts, all of which are acutely painful. \n\nScar tissue from surgery, chemotherapy, and radiation can leave permanent damage, meaning that even with a full recovery some people will live in chronic pain. \n\nAll of these are reasons why pain management plays a huge role in treatment, recovery, and quality of life. It's extremely important that it is addressed. My mom is a nurse who has gone above and beyond to care for many close family and friends who have been seriously ill, and I've seen multiple people admit that they're more uncomfortable than they say on a daily basis, but they don't want to complain. I've even seen her do foot rubs and head massages to provide any relief from their ordeal. I tear up thinking about her rubbing the face and hands of her best friend who was dying of metastatic ovarian cancer. Her friend hurt *everywhere*.\n\nAll of that aside, I don't think you have the right to tell people whether what they're describing is painful. It's insulting to hear what they're feeling doesn't fall under your definition of pain. Pain can be difficult enough to articulate anyway without having someone be dismissive.  Pain, to me, is childbirth or trauma injuries. Discomfort for long periods of time is much worse, but pain is not the applicable word. As someone with a chronic illness that is not \"painful\" I'm not saying it's less awful because it doesn't involve pain directly. I just expect people to use the right words. Generalizing that cancer is an inherently painful disease does not accurately portray what victims go through. Pain, to me, is childbirth or trauma injuries. Discomfort for long periods of time is much worse, but pain is not the applicable word. As someone with a chronic illness that is not \"painful\" I'm not saying it's less awful because it doesn't involve pain directly. I just expect people to use the right words. Generalizing that cancer is an inherently painful disease does not accurately portray what victims go through. Pain, to me, is childbirth or trauma injuries. Discomfort for long periods of time is much worse, but pain is not the applicable word. As someone with a chronic illness that is not \"painful\" I'm not saying it's less awful because it doesn't involve pain directly. I just expect people to use the right words. Generalizing that cancer is an inherently painful disease does not accurately portray what victims go through. I imagine that tattoo was particularly painful. The sternum is a hard place to ink. It came out gorgeous though!   The tattoos are beautiful over the mastectomy.   However a tattoo should not be placed there without knowing that one is increasing their risk for developing a lifelong swelling of the arm(s).  This is due to the standard procedure of removing several lymph nodes to check on whether the cancer has spread to the lymph system while doing a mastectomy. Someone with a mastectomy probably has had some or all lymph nodes removed from the underarm of the breast removed which raises the chance that she can develop lymphedema in the affected extremity. Excess tattoo ink is cleared by your lymph system which increases the load on the lymph system.  Lymphedema is caused by the lymph system not being able to clear the lymph load usually due to cancer surgery.  A tattoo over a mastectomy dumps the ink into the lymph vessels which need to travel through those missing lymph nodes to filter the fluid and allow the fluid to rejoin your circulatory system. Getting a tattoo after a mastectomy increases the risk of developing lymphedema in that arm immediately or decades down the road.\nBeautiful but very risky.\n The tattoos are beautiful over the mastectomy.   However a tattoo should not be placed there without knowing that one is increasing their risk for developing a lifelong swelling of the arm(s).  This is due to the standard procedure of removing several lymph nodes to check on whether the cancer has spread to the lymph system while doing a mastectomy. Someone with a mastectomy probably has had some or all lymph nodes removed from the underarm of the breast removed which raises the chance that she can develop lymphedema in the affected extremity. Excess tattoo ink is cleared by your lymph system which increases the load on the lymph system.  Lymphedema is caused by the lymph system not being able to clear the lymph load usually due to cancer surgery.  A tattoo over a mastectomy dumps the ink into the lymph vessels which need to travel through those missing lymph nodes to filter the fluid and allow the fluid to rejoin your circulatory system. Getting a tattoo after a mastectomy increases the risk of developing lymphedema in that arm immediately or decades down the road.\nBeautiful but very risky.\n          If I'm remembering correctly, this is an older piece by her--I believe it was done in the nineties, actually. \n\nPart of why I'm saying this is because my mom described something very similar to this back then... She was telling me about being in a locker room (at a gym or a Y or something) and admiring this other woman's tattoo for a few moments, talking to her about how beautiful she thought it was, and only after doing so for a bit, saying (admittedly, awkwardly, out of surprise because she hadn't noticed) \"oh my gosh... you have no breasts.\"\n\nFor whatever reason it stuck in my head.\n\nI remember seeing a picture of it a couple years ago, I think, and remembering my mom telling me about it and was like \"omg!\"\n\nIt is such a gorgeous tattoo.  If I ever wind up needing a mastectomy (unlikely with my small boobs), I can imagine feeling so much more comfortable with this than I would with the nipple tattoos. &gt;If I ever wind up needing a mastectomy (unlikely with my small boobs)\n\nCan you explain the thought behind that? Even small boobs can get cancer... Not being a dick, just seriously wondering why you think having small boobs means you're less likely to have a mastectomy? I'm assuming her logic is that more breast tissue = more breast tissue to possibly become cancerous. I thought that the amount of breast tissue is relatively constant, while the amount of fat is what makes some boobs larger? I thought that the amount of breast tissue is relatively constant, while the amount of fat is what makes some boobs larger? &gt;If I ever wind up needing a mastectomy (unlikely with my small boobs)\n\nCan you explain the thought behind that? Even small boobs can get cancer... Not being a dick, just seriously wondering why you think having small boobs means you're less likely to have a mastectomy? &gt;If I ever wind up needing a mastectomy (unlikely with my small boobs)\n\nCan you explain the thought behind that? Even small boobs can get cancer... Not being a dick, just seriously wondering why you think having small boobs means you're less likely to have a mastectomy? Well yes, I know that small boobs can get cancer, but I'd assumed it is less likely.  \n\nMy logic did in fact run along the lines described by poist_cotus and Leif2; there's less breast tissue there which can form cancerous growths, and if that does happen, it seems like it would be easier to detect, so it makes sense that I'd be at lower risk for mastectomy.... I'm also not overweight, nor above 5'9\", nor from families with histories of breast cancer, so that reduces risk as well.  But that's not really as relevant.\n\nDo small-breasted women and large-breasted women have the same risk of cancer? According to a few articles and studies I've encountered, there's no correlation between breast size and cancer risk.  (There is correlation between body weight and risk, height and risk, and age and risk, though.) Noooooooo!! So there is more less zero upside to having tiny boobs?  There's tons of upside to having tiny boobs.  Take it from someone who has gigantic boobs.\n\n* You don't have to spend a fortune on special bras that may or may not fit.\n\n* Super-thick bra straps are not sexy and not awesome for sexytime. Enjoy your little ones.\n\n* You can run with only one bra on.  I can barely run wearing three.  If I want to only wear one, it must cost $90 and have hydraulics.\n\n* You don't roll over on your boob while you're sleeping and wake up screaming in pain.\n\n* Your boyfriend doesn't roll over on your boob while you're sleeping, causing you to wake up screaming in pain.\n\n* You don't wear tops that are two sizes larger than your bottoms.  Thereore: you can wear dresses without having to get them tailored, thus raising the price another $50.\n\n* Your breasts will always and forevermore be associated with youthfulness.  Mine, as I get older, will more and more be associated with udders. \n\n* You don't look at the prospect of increased breast size during pregnancy with complete horror. \n\n* You can wear a top that isn't a crew neck without the sensation that people are going to think that you're *juuuuuust*  a little bit trashy.  (Or promiscuous, or trying to draw attention to your chest, or whatever.)\n\n* You can sit at a desk or table without having to make the decision: do I rest my boobs on it, or slouch so I can tuck them underneath?\n\n* Your cleavage isn't a vacuum for stray food crumbs. Furthermore, you don't have to face the awkwardness of having a male see the food fall down your cleavage.  And moreover, you don't have to field the question, \"Want me to get that for you?\"  *shudder*\n\nBut hey, the grass is always greener, right? You have a bra with hydraulics?  I assume you are kidding but that is hilarious.  \n\nRemember the Nike pump shoes from the 90s?  I always though a Nike pump bra would be great for women.  Well not for your condition but the smaller chested girls.  Want to fill out a dress better... Pump pump pump.  Want to look hot for the club pump pump pump pump pump.  Going to church deflate.  &gt;You have a bra with hydraulics? I assume you are kidding but that is hilarious. \n\nHardly kidding. DD+ sports bras are often an engineering marvel. Statement is even more true when you hit around the G cup range. Oh wow!  I had no idea.  Sorry to say that was hilarious then.  At this point you probably don't think it is funny at all. \n\nMy wife does the triple crappy sports bra trick and it seems she is at the limit size wise for that to work.  I guess I never considered larger.  You have a bra with hydraulics?  I assume you are kidding but that is hilarious.  \n\nRemember the Nike pump shoes from the 90s?  I always though a Nike pump bra would be great for women.  Well not for your condition but the smaller chested girls.  Want to fill out a dress better... Pump pump pump.  Want to look hot for the club pump pump pump pump pump.  Going to church deflate.  You have a bra with hydraulics?  I assume you are kidding but that is hilarious.  \n\nRemember the Nike pump shoes from the 90s?  I always though a Nike pump bra would be great for women.  Well not for your condition but the smaller chested girls.  Want to fill out a dress better... Pump pump pump.  Want to look hot for the club pump pump pump pump pump.  Going to church deflate.  There's tons of upside to having tiny boobs.  Take it from someone who has gigantic boobs.\n\n* You don't have to spend a fortune on special bras that may or may not fit.\n\n* Super-thick bra straps are not sexy and not awesome for sexytime. Enjoy your little ones.\n\n* You can run with only one bra on.  I can barely run wearing three.  If I want to only wear one, it must cost $90 and have hydraulics.\n\n* You don't roll over on your boob while you're sleeping and wake up screaming in pain.\n\n* Your boyfriend doesn't roll over on your boob while you're sleeping, causing you to wake up screaming in pain.\n\n* You don't wear tops that are two sizes larger than your bottoms.  Thereore: you can wear dresses without having to get them tailored, thus raising the price another $50.\n\n* Your breasts will always and forevermore be associated with youthfulness.  Mine, as I get older, will more and more be associated with udders. \n\n* You don't look at the prospect of increased breast size during pregnancy with complete horror. \n\n* You can wear a top that isn't a crew neck without the sensation that people are going to think that you're *juuuuuust*  a little bit trashy.  (Or promiscuous, or trying to draw attention to your chest, or whatever.)\n\n* You can sit at a desk or table without having to make the decision: do I rest my boobs on it, or slouch so I can tuck them underneath?\n\n* Your cleavage isn't a vacuum for stray food crumbs. Furthermore, you don't have to face the awkwardness of having a male see the food fall down your cleavage.  And moreover, you don't have to field the question, \"Want me to get that for you?\"  *shudder*\n\nBut hey, the grass is always greener, right? Once the news I was pregnant had sank in, I thought to myself \"I can't get bigger boobs I just can't\" then cried for a good 2 hours. Once the news I was pregnant had sank in, I thought to myself \"I can't get bigger boobs I just can't\" then cried for a good 2 hours. I only have 34Bs and I'm terrified of pregnancy boobage. I can't imagine someone who's already much larger having to deal with that. There's tons of upside to having tiny boobs.  Take it from someone who has gigantic boobs.\n\n* You don't have to spend a fortune on special bras that may or may not fit.\n\n* Super-thick bra straps are not sexy and not awesome for sexytime. Enjoy your little ones.\n\n* You can run with only one bra on.  I can barely run wearing three.  If I want to only wear one, it must cost $90 and have hydraulics.\n\n* You don't roll over on your boob while you're sleeping and wake up screaming in pain.\n\n* Your boyfriend doesn't roll over on your boob while you're sleeping, causing you to wake up screaming in pain.\n\n* You don't wear tops that are two sizes larger than your bottoms.  Thereore: you can wear dresses without having to get them tailored, thus raising the price another $50.\n\n* Your breasts will always and forevermore be associated with youthfulness.  Mine, as I get older, will more and more be associated with udders. \n\n* You don't look at the prospect of increased breast size during pregnancy with complete horror. \n\n* You can wear a top that isn't a crew neck without the sensation that people are going to think that you're *juuuuuust*  a little bit trashy.  (Or promiscuous, or trying to draw attention to your chest, or whatever.)\n\n* You can sit at a desk or table without having to make the decision: do I rest my boobs on it, or slouch so I can tuck them underneath?\n\n* Your cleavage isn't a vacuum for stray food crumbs. Furthermore, you don't have to face the awkwardness of having a male see the food fall down your cleavage.  And moreover, you don't have to field the question, \"Want me to get that for you?\"  *shudder*\n\nBut hey, the grass is always greener, right? There's tons of upside to having tiny boobs.  Take it from someone who has gigantic boobs.\n\n* You don't have to spend a fortune on special bras that may or may not fit.\n\n* Super-thick bra straps are not sexy and not awesome for sexytime. Enjoy your little ones.\n\n* You can run with only one bra on.  I can barely run wearing three.  If I want to only wear one, it must cost $90 and have hydraulics.\n\n* You don't roll over on your boob while you're sleeping and wake up screaming in pain.\n\n* Your boyfriend doesn't roll over on your boob while you're sleeping, causing you to wake up screaming in pain.\n\n* You don't wear tops that are two sizes larger than your bottoms.  Thereore: you can wear dresses without having to get them tailored, thus raising the price another $50.\n\n* Your breasts will always and forevermore be associated with youthfulness.  Mine, as I get older, will more and more be associated with udders. \n\n* You don't look at the prospect of increased breast size during pregnancy with complete horror. \n\n* You can wear a top that isn't a crew neck without the sensation that people are going to think that you're *juuuuuust*  a little bit trashy.  (Or promiscuous, or trying to draw attention to your chest, or whatever.)\n\n* You can sit at a desk or table without having to make the decision: do I rest my boobs on it, or slouch so I can tuck them underneath?\n\n* Your cleavage isn't a vacuum for stray food crumbs. Furthermore, you don't have to face the awkwardness of having a male see the food fall down your cleavage.  And moreover, you don't have to field the question, \"Want me to get that for you?\"  *shudder*\n\nBut hey, the grass is always greener, right? ...You seriously have to run with *three bras on?*  That's crazy.\n\nI have never in my life worn more than one in any situation, max of 2 sets of hooks and eyes on the straps.   If they're the cheesy uniboob sports bras, yeah.  The flimsy kind with the racer back.  The good ones, like I said, cost around $90 and hold you in nice and firm.  I have this one that gives me Madonna cone-boobies.  If they're the cheesy uniboob sports bras, yeah.  The flimsy kind with the racer back.  The good ones, like I said, cost around $90 and hold you in nice and firm.  I have this one that gives me Madonna cone-boobies.  Noooooooo!! So there is more less zero upside to having tiny boobs?  Well yes, I know that small boobs can get cancer, but I'd assumed it is less likely.  \n\nMy logic did in fact run along the lines described by poist_cotus and Leif2; there's less breast tissue there which can form cancerous growths, and if that does happen, it seems like it would be easier to detect, so it makes sense that I'd be at lower risk for mastectomy.... I'm also not overweight, nor above 5'9\", nor from families with histories of breast cancer, so that reduces risk as well.  But that's not really as relevant.\n\nDo small-breasted women and large-breasted women have the same risk of cancer? Well yes, I know that small boobs can get cancer, but I'd assumed it is less likely.  \n\nMy logic did in fact run along the lines described by poist_cotus and Leif2; there's less breast tissue there which can form cancerous growths, and if that does happen, it seems like it would be easier to detect, so it makes sense that I'd be at lower risk for mastectomy.... I'm also not overweight, nor above 5'9\", nor from families with histories of breast cancer, so that reduces risk as well.  But that's not really as relevant.\n\nDo small-breasted women and large-breasted women have the same risk of cancer?                 Am I the only one searching frantically for a nipple? *Post-masectomy.* Her breasts were removed due to cancer. Stay classy! I never knew they removed the nipples when they did a mastectomy. I always assumed that they tried to leave the breasts looking somewhat normal even tho they were gone. I've never really looked into this tho. TIL I never knew they removed the nipples when they did a mastectomy. I always assumed that they tried to leave the breasts looking somewhat normal even tho they were gone. I've never really looked into this tho. TIL *Post-masectomy.* Her breasts were removed due to cancer. Stay classy!  Hello, I am from the front page. Why is this beautiful? It seems more sad to me, is it beautiful because of the tattoo? And why can't she have implants and fake nipples? Or her original nipples? Not trying to be insensitive, just don't understand. Because it's her body, and she doesn't have to make them look \"normal\" just for the sake of what other people think.  Many people opt to skip the implants and fake nipples entirely.  This woman's choice to get a tattoo is a beautiful expression of her exercising some control over a part of her body that has caused her so much grief. Oh right, I did think it was possible that she didn't want normal boobs, but what got me is all the people agreeing and saying it's awesome and beautiful. And I'm not at all saying it's not beautiful, but I find it strange so many people are adverse to having just normal-looking boobs again, even if they are fake. So what people think is awesome is the kind of \"fuck boob cancer\" statement she's making? Oh right, I did think it was possible that she didn't want normal boobs, but what got me is all the people agreeing and saying it's awesome and beautiful. And I'm not at all saying it's not beautiful, but I find it strange so many people are adverse to having just normal-looking boobs again, even if they are fake. So what people think is awesome is the kind of \"fuck boob cancer\" statement she's making? Oh right, I did think it was possible that she didn't want normal boobs, but what got me is all the people agreeing and saying it's awesome and beautiful. And I'm not at all saying it's not beautiful, but I find it strange so many people are adverse to having just normal-looking boobs again, even if they are fake. So what people think is awesome is the kind of \"fuck boob cancer\" statement she's making?    For the cost of the ink, why not just buy new tits?   Fake, I see no nipples. Do you know what a mastectomy is?",
    "url" : "http://25.media.tumblr.com/4aa94618285b890f78ffa0538608369e/tumblr_mhr1mxOlQz1rtmkbio1_500.jpg"
  }, {
    "id" : 48,
    "title" : "not sure how to feel about this, am I overreacting?",
    "snippet" : "Last night my boyfriend admitted that he lied to me about how he felt about a girl he used to date. \n\nSome background: we have been together for about nine months now. We became really close very fast. We are moving to Las Vegas together for school soon and talk about getting married and kids all the time. I really feel like we'll be together for the rest of our lives.\n\nWhen we had been together for about a month he told dem about this previous girlfriend who he ended up not liking very much because she was boring and not very intelligent. He said that he didn't want to feel like he was taking advantage of her, so he ended it before it got too serious.\n\nRecently I told him that I started thinking about this previous girlfriend for some reason and how much I hated the thought of him with someone else. He proceeded to tell me that he liked me better and all sorts of gooey emotional stuff. \n\nLast night he told me that he had felt the same way about this girl that he feels about me now. He loved her and he thought they would end up together and that she actually left him. I know I have no right to be mad at him for how he felt about her, but I'm still really hurt. I don't know if it's more because he lied to me, even if it was so I wouldn't get hurt, or because he so easily got over this girl that he apparently loved. \n\nHe's at work right now and I want to talk to him about this, but I would like to get an outside opinion first. Thank you!  It wasn't very nice of him to lie, but your reaction is more than overreacting, it's terribly immature and insecure. You are creating a very unhealthy pattern though, if he lies to avoid getting a bad reaction from you, and you overreact often. Now he's with you, that's the important thing. If he wanted to be with someone else, he's be with someone else. Please wait with children, and marrying, for some years.   It sounds like he lied about it to you because he was lying about it to himself first. Clearly he had strong feelings about this girl he was with and felt heartbroken when she broke up with him. If he felt the same way about her as he does about you, that isn't surprising if he was in a serious relationship with her. That's how you feel in relationships, and you can't exactly condemn him for that.\n\nI would have talked with him FIRST about how you are feeling, rather than getting an outside opinion first. It's just the opposite way of how I would deal with a situation like this. I have talked to him, i just wanted to see another view of the situation.  Okay, but that's not clear from your last sentence which implies that you haven't talked to him and want an unbiased opinion before you do.  I think there's a combination of factors here. He may have been terribly hurt by what happened with the previous girlfriend and didn't want to admit that he'd been burned, and he also may not have wanted to hurt you by admitting that the initial feelings he had for someone else were strong. \n\nHis emotions were perfectly natural, btw. When you fall in love, you fall in love. He doesn't love you any less now just because he loved someone else before. \n\nDon't hold this against him, there's nothing he did wrong.   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/194zdx/not_sure_how_to_feel_about_this_am_i_overreacting/"
  }, {
    "id" : 49,
    "title" : "I can't get myself to sleep with men that I have known for months, yet I seem to have no problem getting intimate with a guy that I've only known for a few hours. What is wrong with me?",
    "snippet" : "Background:\n\nI am a young woman, recent college graduate, and I want to find a healthy relationship someday (not necessarily anytime soon). I'm afraid that if I meet someone that I actually like, I will ruin it like I have in the past.\n\nI'll give an example. I was seeing a man for several months, and I really liked him. He was a total gentleman the whole time, and he was intellectually stimulating, nice, and we had fun together. However, when things started to get serious, I couldn't bring myself to talk to him anymore.\n\nFast forward a few months, I am drunk at a football game and I meet a guy. We sleep together and we end up dating for almost a year, despite my significant lack of interest and trust in him. I only broke up with him when he started going crazy (telling me I wasn't allowed to talk to men, wear revealing clothes, etc.).\n\nReddit, why can't I sleep with a guy that I actually like and trust? What is wrong with me? How do I fix this?  As a guy, I honestly have the same problem. I find it almost awkward or weird getting intimate or serious with someone that I really know rather than say a one time fling. I have no problems with a drunken fling with a girl (obviously only doing what there comfortable with) but trying something with someone that I really know and appreciate, I just can't bear myself to do that. I think about it a lot and sometimes it gets to me but at the end of the day I always end up with the same positive outlook that yeah, eventually everything will work out. I don't have any advice as of right now but don't think that there is anything wrong with yourself, I think that's a bad way to view it. Just know that it's not only girls who can feel this way.  You sound like me. When the situation is convenient, I just go for it, but when the situation is ideal, there's this fear that grips me and I run away. Perhaps you're different, for me it was a combination of trust issues, loneliness and indifference. Even when I trust someone, sometimes I push them away, I don't know why, I just do. I learned to handle it, but that internal fear is always there. It's different for my fiance because I known the man for seven years.   I used to do something similar. Whenever I met a great person, I would essentially self-sabotage. I have a wild enough past, and there are some parts of it that I'm not proud of. I got caught in between \"Wow, this is such an awesome person. I hope they think well of me!\" and \"I am such a class A fuckup,\" and so I would pull myself back in the hopes that they'd never get close enough to see the less-than-shiny bits. \n\nBut some random? Totally fine. If I didn't care about them, it didn't matter what they saw. Their opinion of me held no value and no weight, so I could be myself in all the glorious disaster that I was. I didn't have to give them anything, or let them access who I really was. \n\nIt took me a while to get past it. I had to start valuing myself as more than my past. I used to see the part of me that was an addict, and now I still see that part but I also see the part that was strong enough to ask for help and who kicked the habit. I used to see my \"number\" as a bad thing, but now it means that I'm a confident woman who gets what she wants. You have to shift your entire paradigm, but you have to do it yourself before you can bring another person into the mix. Convince *yourself* that you're awesome and you deserve good things, and you do not need to have bad things in your life. Even if you have to fake it til you make it, you're going to make it.    ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1948ri/i_cant_get_myself_to_sleep_with_men_that_i_have/"
  } ],
  "processing-time-source" : 57,
  "processing-result.title" : "twoxchromosomes2_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/home/ciara/Documents/programming/cs467/rtopics/r-topics/carrot2-cli-3.6.2/../data/twoxchromosomes2_reddit.xml"
  }
}