{
  "processing-time-total" : 1750,
  "clusters" : [ {
    "id" : 0,
    "size" : 11,
    "score" : 37.025914195698675,
    "phrases" : [ "Ask" ],
    "documents" : [ 8, 9, 14, 21, 22, 24, 25, 29, 38, 42, 48 ],
    "attributes" : {
      "score" : 37.025914195698675
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 48.823698010971405,
    "phrases" : [ "Feel Better" ],
    "documents" : [ 9, 20, 21, 26, 38, 48 ],
    "attributes" : {
      "score" : 48.823698010971405
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 74.59368414983301,
    "phrases" : [ "Years Ago" ],
    "documents" : [ 2, 3, 9, 21, 38, 46 ],
    "attributes" : {
      "score" : 74.59368414983301
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 56.29143482281131,
    "phrases" : [ "Dress" ],
    "documents" : [ 9, 21, 25, 32, 46 ],
    "attributes" : {
      "score" : 56.29143482281131
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 56.767523033410846,
    "phrases" : [ "Dance" ],
    "documents" : [ 5, 16, 29, 36 ],
    "attributes" : {
      "score" : 56.767523033410846
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 43.01586587841223,
    "phrases" : [ "Realize" ],
    "documents" : [ 4, 10, 21, 48 ],
    "attributes" : {
      "score" : 43.01586587841223
    }
  }, {
    "id" : 6,
    "size" : 3,
    "score" : 55.99402703346542,
    "phrases" : [ "Art" ],
    "documents" : [ 0, 9, 29 ],
    "attributes" : {
      "score" : 55.99402703346542
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 56.402324507717644,
    "phrases" : [ "Point of View" ],
    "documents" : [ 21, 33, 47 ],
    "attributes" : {
      "score" : 56.402324507717644
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 41.21147835855296,
    "phrases" : [ "Tell my Family" ],
    "documents" : [ 21, 22, 38 ],
    "attributes" : {
      "score" : 41.21147835855296
    }
  }, {
    "id" : 9,
    "size" : 2,
    "score" : 68.22597417509051,
    "phrases" : [ "Argument" ],
    "documents" : [ 27, 47 ],
    "attributes" : {
      "score" : 68.22597417509051
    }
  }, {
    "id" : 10,
    "size" : 2,
    "score" : 89.78251717643055,
    "phrases" : [ "Baby Sister" ],
    "documents" : [ 28, 37 ],
    "attributes" : {
      "score" : 89.78251717643055
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 86.80104253925488,
    "phrases" : [ "Cake" ],
    "documents" : [ 12, 43 ],
    "attributes" : {
      "score" : 86.80104253925488
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 79.43550191477192,
    "phrases" : [ "Dad" ],
    "documents" : [ 7, 40 ],
    "attributes" : {
      "score" : 79.43550191477192
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 41.0908047982724,
    "phrases" : [ "Grace" ],
    "documents" : [ 1, 5 ],
    "attributes" : {
      "score" : 41.0908047982724
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 69.6774431352965,
    "phrases" : [ "Hair Removal" ],
    "documents" : [ 9, 20 ],
    "attributes" : {
      "score" : 69.6774431352965
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 76.8719880942423,
    "phrases" : [ "Orgasm" ],
    "documents" : [ 30, 34 ],
    "attributes" : {
      "score" : 76.8719880942423
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 37.002842816157425,
    "phrases" : [ "Sexual History" ],
    "documents" : [ 21, 26 ],
    "attributes" : {
      "score" : 37.002842816157425
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 55.42586761367168,
    "phrases" : [ "Therapy" ],
    "documents" : [ 29, 38 ],
    "attributes" : {
      "score" : 55.42586761367168
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 101.5474402418287,
    "phrases" : [ "Vagina Monologues" ],
    "documents" : [ 6, 35 ],
    "attributes" : {
      "score" : 101.5474402418287
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 83.42387897134469,
    "phrases" : [ "Victim" ],
    "documents" : [ 21, 31 ],
    "attributes" : {
      "score" : 83.42387897134469
    }
  }, {
    "id" : 20,
    "size" : 12,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 11, 13, 15, 17, 18, 19, 23, 39, 41, 44, 45, 49 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1699,
  "documents" : [ {
    "id" : 0,
    "title" : "(IFF) I work in an extremely male dominated field and take my job very seriously. Here's to all those  told me I couldn't do it and laughed when I walked on set!",
    "snippet" : "  Whats the job? I work in the art department as an onset in the film industry. In all honesty, I am more of a construction worker/professional mover than doing more art stuff I work in the art department as an onset in the film industry. In all honesty, I am more of a construction worker/professional mover than doing more art stuff I work in the art department as an onset in the film industry. In all honesty, I am more of a construction worker/professional mover than doing more art stuff I work in the art department as an onset in the film industry. In all honesty, I am more of a construction worker/professional mover than doing more art stuff   Go you!  \n\nIs that a double exposed picture?   No, she's behind some sort of plexiglass window. I'd say working on the technical side of television?     people laughed at you at work? wtf are you in a union or have a hr person to complain to? Not everything is an HR matter, sometimes it's just people being people. People should be better than that.  ",
    "url" : "http://imgur.com/RhnHFPd"
  }, {
    "id" : 1,
    "title" : "[IFF] Me at our One Billion Rising event at Washington State University! ",
    "snippet" : "  GO COUGS!  Pullman campus ?      You have a beautiful smile :)  You remind me very strongly of Alyson Hannigan and my friend Grace.    \n    \n[/randomosity]",
    "url" : "http://i.imgur.com/jGDdpAM.jpg?1"
  }, {
    "id" : 2,
    "title" : "I was just watching the Golden Girls on TV and I was thinking:  Am I going crazy or are there less strong, modern, intelligent women on TV now than even 5 or 10 years ago?  Why is that?",
    "snippet" : "we need another Buffy or Miss Suggarbaker imo  For some reason, in current popular culture every character, male or female, between ages 5-30 is going through a near-constant emotional breakdown. I suppose people being calm and in control doesn't make for good drama. Every show has to have drama.  Even 'reality' shoes have pretend drama.  I can't even watch them anymore.  I'm sick of watching couples fight for no good reason or watching silly, preventable misunderstandings cause chaos for the sake of drama.  It's emotionally grating. \n\nLets try some good script writing or something  Every show has to have drama.  Even 'reality' shoes have pretend drama.  I can't even watch them anymore.  I'm sick of watching couples fight for no good reason or watching silly, preventable misunderstandings cause chaos for the sake of drama.  It's emotionally grating. \n\nLets try some good script writing or something  Have you taken the power into your own hands yet and cancelled your cable subscription?  The only way to make these companies listen is to hurt them where it hurts most - their finances.  If you're still paying for television and complaining about nothing good being on television, you're still part of the problem. I want to but I'm afraid :/ lol\n\nwatching TV is how I 'unthink' which you need after a long day of thinking read a book, subscribe to an instant video service and watch shows you think promote good values, purchase episodes of shows you like\n\nthere's many options, and quite frankly cable is extortion at this point hmm maybe I will try it.  What is an instant video service? Netflix, Amazon Instant Video, LoveFilm(UK), Hulu Plus thanks.  How does it compare to TV?  Is it complicated?  The only thing I would miss about TV is probably lazily 'flipping the channels' to see what's on You've never heard of any of these services?  The TV shows on them are not current (IE, the season on air is not the season on the service) but they have a VAST library, you can watch as much as you want, any time you want, and its orders of magnitude cheaper than cable.  Check out their libraries and see if there's stuff you like.  Plenty of great TV shows, new and old, as well as movies.    I don't think you're crazy, but I do think you're looking through nostalgia coloured glasses.  The great shows and characters are easier to remember, and the crappier ones are forgotten.  There are still strong females today.  Becket from \"Castle\" comes to mind.  She's kicking butts and taking names, and also regularly lets Castle know he's being an ass.  Martha, Alexis and Lainey all are also pretty damn tough.  All the female characters in \"Once Upon a Time\" do their own rescuing, or at least put up a damn good fight.  The \"True Blood\" and \"Game of Thrones\" casts have psychopaths and bad-asses equally distributed between the genders.  Even a silly, shallow show like \"Two Broke Girls\" shows women working together to achieve their goals.  \n\nI'm saying that there's not bad TV out there, or that there are bad characters even in the better shows, but there are still great things being created too.    Don't forget about Leslie Knope in Parks and Recreation! She's my tv role model these days.  Yes, I came to the comments to suggest her!\n\nLiz Lemon of the recently ended 30 Rock is also a great character.\n\n\nMy boyfriend and I are watching  Battlestar Galactica at the moment and we are both very impressed with how many interesting and developed female characters there are. Also how many non-white characters, and non-white women. \n\n\nAlso, in my opinion the Walking Dead has a lot of varied female characters.   I think the Walking Dead comic has a lot of varied female characters. The TV show? Not so much. I see possible improvement with this second half of the third season, but most of the last season and the first half of this season seemed to focus, as far as female characters go, on Lori and Andrea being \"bitches.\" Carol has been criminally underutilized. Beth didn't seem to exist until the baby was born, aside from a two episode period of tossing Carl some awkward smiles. Michone is a bad-ass, but she has no lines other than \"angry glare\" or \"questionable glare.\" Maggie has gotten some cred, but there were plenty of people complaining on /r/thewalkingdead after last week's episode that she was \"turning into Lori.\"\n\nNow, I'm not saying that every female character has to be a representation of womankind, and I know that we all can't be that which is Daryl Dixon, no matter what gender you identify with. But I would like a 'likable' female character for a while. I think that's fair. I love Carol and Maggie. \n\nI don't think Lori deserves all the hate she gets. \n\nI noticed the same with Breaking Bad - people always call Skyler a bitch but that's not fair. She's a good character she's just not on side with our protagonist. \n\nBut yeah, Micchone is good but I want to find out more about her. \n\nAnd of course Darryl is my favourite character, no doubt!  I think Maggie is great. I loved her happy face when she figured out how to kill the armored walkers in the prison, and her relationship with Glen has been fairly interesting thus far, though I am unsure of how that will go with last week's episode and how parts of that went.\n\nCarol has the makings of all sorts of badassery. She has been emotionally resilient, coming more into her own throughout the zombie apocalypse than she was before it, despite the bad things that have happened to her/her family. I *really* want her to have some good scenes soon.\n\nMicchone has had a really neat feature in the comics, but, yet again, she's been very undeveloped on the show. I'd like her to have a character, not just be a sword-wielding machine.\n\nInsofar as Skyler on Breaking Bad- I hated her just like everybody else did, but I recently rewatched the series up to where we are now (NEED NEW EPISODES!), and I get where she is coming from. I think that she has a morally grey character who, while she has made some bad choices, has made those choices completely within what may be expected of a real person. When you take only the list of offenses of each character into play, she comes out looking soooo much better than Walt, even though I know a fair number of people who still like him more than her. I mean, she has at least killed far fewer people.\n\nAnd if Darryl dies, we riot.  This is why I watch mostly BBC.  Apparently at least a third of the people in England are actually female.  Imagine that! And women over 40 not only exist, they don't have to have facelifts to make them nonoffensive to the eyes. And they talk, and think, and do things.    Let's go further back. Designing women went off the air in 1993. \n\nGolden girls ended in 1992. \n\nMoonlighting Ended in 1989. \n\nCosby show went off the air in 1992.\n\nMaude ended in 1978. Can you even imagine a tv show now with the major character getting an abortion? Just because she doesn't want to be a mother?\n\n\nXena went off the air in 2001.    \nBuffy in 2003.     \nX-Files in 2002.  \n\nI'm starting to tear up. I don't have a tv any more. Wonder why. \n\nEDIT: Murphy brown - 1998.  I'm really going to cry\n Let's go further back. Designing women went off the air in 1993. \n\nGolden girls ended in 1992. \n\nMoonlighting Ended in 1989. \n\nCosby show went off the air in 1992.\n\nMaude ended in 1978. Can you even imagine a tv show now with the major character getting an abortion? Just because she doesn't want to be a mother?\n\n\nXena went off the air in 2001.    \nBuffy in 2003.     \nX-Files in 2002.  \n\nI'm starting to tear up. I don't have a tv any more. Wonder why. \n\nEDIT: Murphy brown - 1998.  I'm really going to cry\n The show \"Lost Girl\" is supposed to be good, although I've never watched it myself. Let's go further back. Designing women went off the air in 1993. \n\nGolden girls ended in 1992. \n\nMoonlighting Ended in 1989. \n\nCosby show went off the air in 1992.\n\nMaude ended in 1978. Can you even imagine a tv show now with the major character getting an abortion? Just because she doesn't want to be a mother?\n\n\nXena went off the air in 2001.    \nBuffy in 2003.     \nX-Files in 2002.  \n\nI'm starting to tear up. I don't have a tv any more. Wonder why. \n\nEDIT: Murphy brown - 1998.  I'm really going to cry\n  You should read [Enlightened Sexism](http://www.amazon.com/Enlightened-Sexism-Seductive-Message-Feminisms/dp/080508326X/ref=sr_1_1?ie=UTF8&amp;qid=1361660950&amp;sr=8-1&amp;keywords=enlightened+sexism), which includes a really insightful discussion about how women are represented on tv.   It upsets the menz. No, seriously, check out the hate the \"HBO wives\" (or AMC wives, for that matter) get whenever they try and quell the agency of the (anti)hero protagonist. Can't this simply be that female characters tend to be bitchy and obnoxious rather than inspiring, interesting, proactive etc? Doesn't it have more to do with writing than the viewer reaction? It upsets the menz. No, seriously, check out the hate the \"HBO wives\" (or AMC wives, for that matter) get whenever they try and quell the agency of the (anti)hero protagonist.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/192guj/i_was_just_watching_the_golden_girls_on_tv_and_i/"
  }, {
    "id" : 3,
    "title" : "{IFF} This was taken 7 years ago when I was 14. I haven't seen my sister in over a year, but this is what every reunion is like.",
    "snippet" : "   [deleted]",
    "url" : "http://i.imgur.com/QHT9Exf.jpg"
  }, {
    "id" : 4,
    "title" : "[IFF] I finally realized I don't need my ex to make me feel good. I worked hard for this body, and I'll be damned if I don't show it off!",
    "snippet" : "     ",
    "url" : "http://i.imgur.com/iGeDsm5.jpg"
  }, {
    "id" : 5,
    "title" : "[IFF] after being decidedly unfeminine my whole life, belly dance has made me feel pretty and graceful for the first time.",
    "snippet" : "     I want to learn,  but I'm overweight and embarrassed :(",
    "url" : "http://imgur.com/jsUvxW2"
  }, {
    "id" : 6,
    "title" : "[IFF] Seconds after finishing my part of the Vagina Monologues. ",
    "url" : "http://i.imgur.com/f3S1RpR.jpg"
  }, {
    "id" : 7,
    "title" : "IFF: My Dad and his dog Coco. She passed away yesterday from Central Vestibular disease, she was 2. I've never seen my Dad cry before. This probably doesn't belong here, but I wanted to share anyway.",
    "snippet" : "  I'm so sorry for your and your dad's loss.  Of course this belongs here!  Sharing happy memories is the best way to get through sad times.\n\nI lost my first dog to cancer when he was three and I think my dad took it harder than I did.  Dogs are such selfless, wonderful, loving companions.\n\n::big hugs::  Aww, I'm so sorry for your and your dad's loss. The first dog my parents owned together died from an illness when I was three, and it took my dad a long time to be able to have another dog. That dog was his best friend. He loves our current dog just as much (10 years old, this July!), but I know his first dog will always hold a special place in his heart.  I'm so sorry for you and your dad's loss. :( My childhood dog was 16 when we had to put him down and both of my parents were sobbing the entire time (I was away at college and my brother said his goodbyes and had to leave the room). Pets are just as much a part of the family as humans are and it seems like your dog was loved and cared for. Sending positive thoughts to you and your dad.    I'm so sorry! I can't imagine losing a dog :( I'm glad you shared the pic though- they look like great friends :)  ",
    "url" : "http://i.imgur.com/SgBE8up.jpg"
  }, {
    "id" : 8,
    "title" : "[IFF] My boyfriend asked me to move in with him. I can't just yet, but I still got a consolation prize. :)",
    "snippet" : "  Aww, he gave you a dalahäst? Haha no, my cousin brought me that when he came to visit. (He's from Sweden)  Yay! One of the best feelings ever was giving my bf a copy of my keys. only thing that topped it was moving into a place together. (just two weeks ago!) ",
    "url" : "http://imgur.com/goTwgsD.jpg"
  }, {
    "id" : 9,
    "title" : "[IFF] I never thought I would forgive myself for being a nude model when I was younger, today I remembered how beautiful I felt back then. NSFW",
    "snippet" : "  I will lay odds that you are still just as beautiful. I've developed an anxiety problem which in return has caused a nervous habit of creating giant scabs on my body from scratching. I then pick those scabs into  massive crater sized scars.\n\nI don't feel the way I used to when I did these photos. I feel ashamed to wear a dress, I hate when people look at my arms and even more so point out my scars. \n\nI've always felt guilty after I stopped, about these photos &amp; others, some more explicit some note even nude. I'm not sure why. Are you in counseling? I start next week. \n\nI have only just hit the breaking point. I've always had anxiety but as a young kid I pushed it away. Then I moved across the world with my boyfriend and for the past two years I've just hit a whole new level. Developed the scab issue, trust issues, anxiety &amp; panic attacks, xanax addictions, codependency on my boyfriend, anti-social and lack of feeling the need to have friends. \n\nNext week I am also starting yoga with a new friend....Big steps for me. Congratulations! \n\nYou will feel better soon. People keep saying that. \n\nHopefully it's true because at this stage I feel like there is an impending storm of doom going to happen. Your decision to effect change in your life will mollify the storm and give you the strength to survive it. You are a participant now. People keep saying that. \n\nHopefully it's true because at this stage I feel like there is an impending storm of doom going to happen. I also recently started treatment to deal with anxiety, and I can say that after about a month and a half I'm already starting to feel better. Some days are better than others, but the underlying feeling of doom has faded and some days it's not even there. I hope you will get there soon, too!  People keep saying that. \n\nHopefully it's true because at this stage I feel like there is an impending storm of doom going to happen. People keep saying that. \n\nHopefully it's true because at this stage I feel like there is an impending storm of doom going to happen. I start next week. \n\nI have only just hit the breaking point. I've always had anxiety but as a young kid I pushed it away. Then I moved across the world with my boyfriend and for the past two years I've just hit a whole new level. Developed the scab issue, trust issues, anxiety &amp; panic attacks, xanax addictions, codependency on my boyfriend, anti-social and lack of feeling the need to have friends. \n\nNext week I am also starting yoga with a new friend....Big steps for me. My therapist kept telling me to try out yoga.  I kind of blew her off for a while.  I mean, I lift weights, who needs yoga?\n\nI finally gave in about a month ago, and seriously, yoga is The Best Thing Ever.  I tend to store all of my tension inside; my husband tends to get very anxious about things.  At the end of the first class, we were both all like \"I *get* yoga now, I get why people love it\" and \"This is the most relaxed I've been in ages.\"  Between the yoga and the chakra meditation (which my therapist also recommended), I feel so much better than I have for the last couple of years. My boyfriend has been trying to get me to go.\n\nThe other night during one of our usual chats about me not being able to function properly I just said fuck it and texted my new friend who also suffers from panic attacks though Much under control and asked her to go. If you don't like going to yoga classes, you can also find DVDs &amp; do it at home.  Netflix has a lot of yoga DVDs if you have an account, or try your local library. I start next week. \n\nI have only just hit the breaking point. I've always had anxiety but as a young kid I pushed it away. Then I moved across the world with my boyfriend and for the past two years I've just hit a whole new level. Developed the scab issue, trust issues, anxiety &amp; panic attacks, xanax addictions, codependency on my boyfriend, anti-social and lack of feeling the need to have friends. \n\nNext week I am also starting yoga with a new friend....Big steps for me. I'm exactly the same way (minus the moving part), but after my last relationship I've been doing my best to try to rely on myself completely. My therapist is perfect for me and I've made great progress, but there's still stuff I really struggle with. I actually started yoga about a month ago (big step for me too!) with my sister-in-law and it's definitely very relaxing. I hope you start feeling better soon! Have you tried anything to fade your scars? I have a nervous picking habit and shea butter mixed with grape seed oil has helped fade my scars so they aren't as noticeable. I bought bio oil used it for two days and made an excuse as I do to wait until I can stop for good.\n\nGoing to try to start again tomorrow now. I start next week. \n\nI have only just hit the breaking point. I've always had anxiety but as a young kid I pushed it away. Then I moved across the world with my boyfriend and for the past two years I've just hit a whole new level. Developed the scab issue, trust issues, anxiety &amp; panic attacks, xanax addictions, codependency on my boyfriend, anti-social and lack of feeling the need to have friends. \n\nNext week I am also starting yoga with a new friend....Big steps for me. I start next week. \n\nI have only just hit the breaking point. I've always had anxiety but as a young kid I pushed it away. Then I moved across the world with my boyfriend and for the past two years I've just hit a whole new level. Developed the scab issue, trust issues, anxiety &amp; panic attacks, xanax addictions, codependency on my boyfriend, anti-social and lack of feeling the need to have friends. \n\nNext week I am also starting yoga with a new friend....Big steps for me. I start next week. \n\nI have only just hit the breaking point. I've always had anxiety but as a young kid I pushed it away. Then I moved across the world with my boyfriend and for the past two years I've just hit a whole new level. Developed the scab issue, trust issues, anxiety &amp; panic attacks, xanax addictions, codependency on my boyfriend, anti-social and lack of feeling the need to have friends. \n\nNext week I am also starting yoga with a new friend....Big steps for me. I've developed an anxiety problem which in return has caused a nervous habit of creating giant scabs on my body from scratching. I then pick those scabs into  massive crater sized scars.\n\nI don't feel the way I used to when I did these photos. I feel ashamed to wear a dress, I hate when people look at my arms and even more so point out my scars. \n\nI've always felt guilty after I stopped, about these photos &amp; others, some more explicit some note even nude. I'm not sure why. It will get better. I had problems when I was younger with social anxiety and depression and it partly manifested itself in me [pulling out my own hair.](http://en.wikipedia.org/wiki/Trichotillomania) It got better for me and it will for you too. Especially if you have taken on counselling. Also you look beautiful in those photos. There is nothing wrong at all with celebrating the beauty of the naked form. Without that there would be many fewer art galleries in the world.\n\nIf you need any advice of help please feel free to PM me. Otherwise there are some (great subreddits on the matter.)[http://www.reddit.com/r/calmhands] Thanks!\n\nI know the offer to chat is there, just making myself do it is the difficult part. I've developed an anxiety problem which in return has caused a nervous habit of creating giant scabs on my body from scratching. I then pick those scabs into  massive crater sized scars.\n\nI don't feel the way I used to when I did these photos. I feel ashamed to wear a dress, I hate when people look at my arms and even more so point out my scars. \n\nI've always felt guilty after I stopped, about these photos &amp; others, some more explicit some note even nude. I'm not sure why. I've developed an anxiety problem which in return has caused a nervous habit of creating giant scabs on my body from scratching. I then pick those scabs into  massive crater sized scars.\n\nI don't feel the way I used to when I did these photos. I feel ashamed to wear a dress, I hate when people look at my arms and even more so point out my scars. \n\nI've always felt guilty after I stopped, about these photos &amp; others, some more explicit some note even nude. I'm not sure why.  As a 20-year-old who is nude modeling, I'm glad you posted :) Sometimes I wonder if I will look back and regret this, but when I see the photos, I see a piece of me. I love your pictures, and I wish you the best. As a 20-year-old who is nude modeling, I'm glad you posted :) Sometimes I wonder if I will look back and regret this, but when I see the photos, I see a piece of me. I love your pictures, and I wish you the best.  You're gorgeous. Please look into counseling, really. These people are trained to help you! I start next Friday. \n\nBecause [this](http://imgur.com/tomxHsB) all over my body has to stop. If it makes you feel any better, I thought those were going to be way bigger.  My sister does the same thing to her scabs and most of them seem to fade away with a year or two. I'm very pale, I've had most of these for 2+ years and the amount is growing.\n\nIn some areas they stay white but majority are red. \n\nThen where I don't pick I ha e self harm scars from when I was a pre teen. When you get to the point, which you will, some aloe and vitamin E oil are your best friends in terms of scar removal. I picked at my facial acne and it resulted in wounds like the ones in your photo. Aloe and vitamin e oil have faded them almost entirely over the course of a year. I do that now. :( I don't suppose you have any advice on how to stop do you?\n\n(Sorry this isn't very relevant to the thread!) Sure it's relevant we're suffering from similar situations. \n\nI would say try what I try but that results in band aids all over the face. I start next Friday. \n\nBecause [this](http://imgur.com/tomxHsB) all over my body has to stop. [deleted] Not at all but most people think that when I say scars they are normal every day scars like everyone else.\n\nBuy they aren't, I've literally picked a hole in my skin that will never grow back.\n\nYou walk around like that for awhile with people staring or always commenting and I'm sure you'd feel the same.\n\nThis isn't some kind of pity call if I wanted that then I would make up some sad sobbing story.\n\nFortunately I have anxiety that's just out of control and I'm taking a step to manage it.  Just stumbled upon your post randomly and I'm really glad to see another person with the same problem I have. It's really difficult to make people understand compulsions. It can be very frustrating when people make comments and try to \"help\" when all it does is bring attention to the problem and cause more anxiety. I wish you the best of luck with managing your anxiety.  Not at all but most people think that when I say scars they are normal every day scars like everyone else.\n\nBuy they aren't, I've literally picked a hole in my skin that will never grow back.\n\nYou walk around like that for awhile with people staring or always commenting and I'm sure you'd feel the same.\n\nThis isn't some kind of pity call if I wanted that then I would make up some sad sobbing story.\n\nFortunately I have anxiety that's just out of control and I'm taking a step to manage it.  I start next Friday. \n\nBecause [this](http://imgur.com/tomxHsB) all over my body has to stop.   I too did nude modeling when I was 18. It never really bothered me. The female form is nothing to be ashamed of in any medium. Stand up and don't regret your past, it made you who you are today. :)         these are beautiful! dark, but beautiful!\nMaybe try to do some pin-up style portraits of your self to make your self see that you can be just as gorgeous now!  Coming from someone who has anxiety, I feel you girl. You're beautiful and I hope all goes well for you :)  ",
    "url" : "http://imgur.com/a/4ATn1"
  }, {
    "id" : 10,
    "title" : "IFF: Me and the bravest person I know. His best friend committed suicide when she was 18. A couple years later, he took me to the hospital when I was 18 for the same thing...saving my life, and doing what he couldn't do before. ",
    "snippet" : "  This picture and your title choked me up. He sounds like an amazing person, and I'm sure you realize how lucky you are to have him in your life.  I hope you are doing ok, and make sure he is too.    That's a very sweet picture : )    ",
    "url" : "http://i.imgur.com/4cDDxvI.jpg"
  }, {
    "id" : 11,
    "title" : "[IFF] On Top of the World",
    "snippet" : "  This is cool! Though I laughed at the horses ears poking out in the lower corner. ",
    "url" : "http://imgur.com/wFCjWr2"
  }, {
    "id" : 12,
    "title" : "[IFF] Today I was offered a position as a cake decorator. It is the career of my dreams! To celebrate, here is a look at the amateur cakes that got my foot in the door!",
    "snippet" : "   Wow, they look great! That makes me want to bake a cake now....     Was that a John Lennon cake for a 10 year old? Whaaaat?   Dear god I want that Oreo cake",
    "url" : "http://imgur.com/a/408qz"
  }, {
    "id" : 13,
    "title" : "[IFF] Mom and I took my 96 y/o great grandma to breakfast",
    "snippet" : "  So adorable. \n\nI'm actually crying right now. I really miss my grandma... \n\nI moved from Bosnia to Canada in '93 and have only seen her twice since then... last time in 2010. I'm really scared that she's going to pass before I can see her again. \n\nEnjoy your time together This made me cry too. I miss my grandma so much, I wish I could have spent more time with her before she passed away. Treasure your time with your great grandma! :] I'm so sorry this made you guys cry! \n\nI miss her when I can't see her. I lived overseas for four years and so many of my older family members passed away while I was there. I was always worried she would too.  I'm glad I live close enough to visit now.   This is the cutest thing ever. :) Also, your great grandma looks so much like my 86 year old grandma, except mind has less hair. :P   What an adorable great grandmother you have! I hope her spirits stay lifted up long after your outing. She's really struggling with depression.  I hope she stays happy, but usually as soon as we start to take her home she starts getting sad. :(  Her memory's starting to go too, and it seems like she forgets how often we visit.  She still thinks I live overseas, and I've been back for almost two years.  Your grandma is adorable!   Your grandma looks like she's having a great time! Also, I'm new here, what does IFF stand for?",
    "url" : "http://imgur.com/a/EKGn1"
  }, {
    "id" : 14,
    "title" : "\"Studies show that women using contraceptives consider pregnancy more unwanted than wanted, he said. \" -- No, Really?",
    "snippet" : "  &gt;\"Part of their identity is the potential to be a mother,\" Pedulla said. \"They are being asked to suppress and radically contradict part of their own identity, and if that wasn't bad enough, they are being asked to poison their bodies.\" \n\nHow can anyone be so fucking stupid and still qualify as a sentient being? No-one is asking women to do anything. Stop pretending that you're helping us!   Oh *fuck you*, dude. What the fucking fuck. Shit. \n\nI'm eloquent tonight.       ",
    "url" : "http://www.tulsaworld.com/news/article.aspx?subjectid=504&amp;articleid=20130222_16_A1_CUTLIN363111"
  }, {
    "id" : 15,
    "title" : "[IFF] I lost a best friend six months ago... I wish I could say it has gotten easier.",
    "snippet" : "  ",
    "url" : "http://imgur.com/UnKBIi9"
  }, {
    "id" : 16,
    "title" : "[IFF] I learned how to be sexy at my first pole dancing class tonight!",
    "snippet" : "  Whoohoo! That looks like a blast. \n\nIsn't it easier with shorts though? For grip! ",
    "url" : "http://i.imgur.com/UKGSv9B.jpg"
  }, {
    "id" : 17,
    "title" : "[IFF] I won my first debate trophy since my brother sat on and broke my first one last year, I'm so happy! The whole team tied for second...",
    "snippet" : "    ",
    "url" : "http://imgur.com/UAofDsN"
  }, {
    "id" : 18,
    "title" : "[IFF]: I wasn't born with sisters, but these ladies are as close as it gets.",
    "url" : "http://imgur.com/dz8cu6O"
  }, {
    "id" : 19,
    "title" : "Plus Sized and Feeling Beautiful.  Wanted To Share.",
    "snippet" : "          [deleted] What on earth is the point of your comment? OP looks fabulous. You should be ashamed of yourself for trying to make her feel ashamed. Thanks for the comment!!  I appreciate it! [deleted] Right, we can't just take for granted that fat people can feel beautiful without deluding themselves that they're something they're not, because obviously if they were fully aware of their situation they wouldn't feel that way. Thanks for reminding every person who'se had a weight-related self-esteem issues that even though, by some fluke, they might /actually/ be confident, it is also probable that they are lying to themselves. (Really, anyone with any self-confidence issues needs a regular reminder) \n\n/sarcasm Thanks for sticking up for me!!  LOL - I have been watching what I eat but I have been under a LOT  of stress - and as an emotional eater with an anxiety disorder, I lately have been maintaining weight rather than losing.",
    "url" : "http://imgur.com/2D0cYpl"
  }, {
    "id" : 20,
    "title" : "Help - waxing mishap! How the hell do I keep messing this up?",
    "snippet" : "I'm not sure if this is the right place to post this, but it involves a vagina, and most ladies have vaginas, and maybe you can help me out.  Ok, so this afternoon I went to wax my bikini line and messed up somehow and now I have a blood blister almost an inch in diameter on my lady bits.  I don't know if the hair wasn't trimmed properly, or I waxed in the wrong direction, or if the stars just weren't aligned properly, but anyway I fucked it up and it hurts.\n\nI have not had a single successful home bikini wax for the whole 8-ish years I've been doing it.  If I survive the actually waxing process I inevitably end up with horrible bumps and ingrown hairs, and by the time they settle down the hair's grown back anyway.  Same with shaving, plus when I shave, even if I use all the bikini-designed products for sensitive skin, fragrance free, whatever, there's a 50/50 chance I'll end up with a yeast infection.  I've tried a large number of products that claim to reduce ingrown hairs, red bumps and irritation, but with no luck.\n\nI'm seriously tired of this.  I'm not very comfortable with getting a professional wax, but home hair removal just isn't working for me.  Am I doing something wrong?  Should I give up and just go natural forever and ever?  What the hell do I do with a huge blood blister in a very sensitive area?  If you can afford it, get laser hair removal. Seriously. All my bikini problems are solved.  how many sessions and how many months does it take until it stops growing back for good?  Yikes, 8 years and still no success! I tried twice and gave up, and went to a professional.   I dropped waxing for sugaring with a professional. No more bumps or in growns for me! Interesting, I hadn't heard of sugaring before.  Why do you find it better than waxing? Firstly, there isn't that feeling sticky aftermath. Secondly, it goes with the direction of the hair instead of against. It seems quicker as well and for me definitely lasts longer. On the negative side of things, it does hurt more than waxing, but now that I've done it a few times, it seems to have levelled out (or I grip the sides of the table better).  Plus getting the sugar residue off only is a matter of hopping into the shower and letting it melt off rather than having to rub yourself in oil or those scented wipes that comes with the waxing strips.  Having it done professionally meant I could get some advice on what to apply to avoid ingrown hairs as well has how to treat the area in general. \n\nYou need to be consistent with your waxing for the skin to adjust - sporadically giving yourself a bikini waxing won't make your hair thin out or your skin adjust enough to make a difference. Do you remember to stretch the skin when you apply and pull the wax strip? Not doing so can give you those massive blisters.\n\nYou could try and look into getting an epilator. It doesn't irritate the skin anywhere near as much as shaving or waxing and it's a lot less messy.\n\nThis might sound rude and maybe I'm assuming too much - But how is your hygiene? It's alarming that this gives you yeast infections and that you skin keeps being fucked up for so long. How often do you change bed sheets? Towels? Underwear? - I'm perhaps being naive, but I just know that really slow healing skin and yeast infections for me were linked to my level of hygiene and I'm just wondering if you might be in a similar situation. Hmmm maybe being consistent is the problem.  I doubt my hygiene is the problem, but yeast infections aren't caused by poor hygiene anyway.  I'm pretty sure the yeast infections are caused by the shaving gels and aftercare lotions.  As for the poorly healing skin I just don't know.  I've started using antiseptic cream but that doesn't seem to make a difference.\n\nI do have a epilator, but it hurts enough on my legs, let alone my bikini area!  I don't think I'm that brave, but maybe it's worth a shot. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/192olo/help_waxing_mishap_how_the_hell_do_i_keep_messing/"
  }, {
    "id" : 21,
    "title" : "I'm tired of being accused of \"victim blaming\" for giving girls legitimate advice in protecting themselves against rape.  ",
    "snippet" : "Let me start by saying that I was violently raped last year. It was one of the most horrific experiences of my life. As such, I think it's VERY important that we continue to raise awareness for people, especially young girls, to be able to protect themselves. \n\nI understand the important of not victim blaming. I personally understand how detrimental it is to a victim to be blamed for their rape. Having said that, I'm tired of being accused of \"victim blaming\" for giving practical advice. \n\nI keep seeing things like \"Don't teach women not to go out alone at night, teach rapists not to rape\"\n\nTo me, this sounds like \"Don't teach women to take their safety into their own hands. Leave their safety in the hands of rapists\"\n\nOr, I see \"how to prevent rape\" lists, with things like \"if a woman is doing her laundry alone at night, don't rape her\"\n\nRapists are rapists for a reason. They're not good, reasonable people. You have to protect yourself from them, because they're not going to protect you from themselves. When you are being attacked, you can't say 'excuse me, I have a right to be in this laundry room alone at night, and you don't have the right to rape me' and expect them to say \"oh that's right, I'm sorry\" and leave you alone. \n\nI hope and pray for a world where women can freely walk down the streets at any hour of the night, or go to a party and drink what she wants, or go on a date with a stranger without the risk of being raped. But that's not the case and I wish people would stop pretending like women don't have to take ACTIVE steps to protect themselves. \n\nTelling a woman not to walk alone at night is not victim blaming. It's rapist blaming. I don't say to my friends \"try not to walk alone at night unless you have to, in which case carry pepper spray\" because I think \"if a woman walks alone at night she deserves to be raped\". Rather, I say it because I don't think women should trust that rapists with their safety. \n\nI know being raped wasn't my fault. But I also acknowledge that there were many things that I could've done to protect myself from an evil person, that I never really thought of. I don't think sharing those tips and ideas with other women should be called \"victim blaming\". \n\n\n***Edit: I'm not saying all rapes happen at night when a woman is walking alone. I'm giving a basic example**\n  I do think it is ok to teach children how to be safe and it is all correct to warn people as in \"there has been a lot of attacks in that area, I'd suggest you avoid it\".  Never the less, I have a few somewhat separate points why I don't think giving advice is that simple in a larger context.\n\n**Timing of advice**\nAdvice *before* anything happens in an unbiased way is perfectly fine. When it is said the same way you would talk about protecting your credit card pin code or wearing seatbelts when driving a car.\n\nWhat I *do* think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" *after* the person already got raped. First of all, that is what they are torturing themselves with (just like people who are part of traffic accidents tend to do), second, this isn't helpful in anyway and only serves to make the victim feel worse.\n\n**It is problematic because it perpetuates the idea of what a real rape is**\nStudies have shown that people have a lot of sympathy with victims of what is perceived as \"real rape\"; the victim and rapist don't know each other, it happens outside, plenty of violence is used, victim has multiple injuries and victim fights actively back. This does happen, and the common advice given to women probably do, to certain extent, reduce the occurrence of rapes of this type. \n\nWhat, however, is not taken in count is that statistically speaking this tends to be the most rare case of rape. Hence, the advice is somewhat misplaced. It is like telling someone to be careful when booking a flight but ignore any safety instructions when driving a car. It also serves to keep up the illusion of \"rape only happens to stupid/bad/non-careful people\". Studies have also shown that many victims who got raped when outside were not coming home from a party through a bad neighbourhood wearing mini skirts. Instead, it was friends having a party and someone in the group raping another person in the same, it was people walking their dogs.\n\n**The advice given today is not particularly relevant for what the problem is today**\nEven though stranger-outside rape is not that common this is still where the discussion lies - even when the intent, like yours, is good. And in my opinion this is a huge problem. You don't avoid getting raped by a friend, friend of a friend, partner or family member by not walking home alone, thinking about what you wear (which, some studies argue, isn't even a factor as we think of it as for choosing a victim). \n\nIt seems like a common reaction to rape by someone you know is to not recognize it as rape and blaming one self for it on a whole different level. You did everything you were advised against - except you didn't do anything the next person wouldn't have. You were alone with the person, perhaps you were drunk, maybe the to-be-rapist offered to take you home so that you would be safe. The victim basically trusts the wrong person and it is extremely counter-productive and down-right ignorant to say \"you shouldn't have trusted him\". \n\nI don't have a solution to how to avoid this and that's why I think it is extremely important to discuss this! But every time rape comes up its about psychos luring in a park. It is very rarely about the most common rapist who is someone you know and mistaken for being a decent human being. And maybe they are,  outside of the rape. And I've come to suspect that \"teach rapists not to rape\" is an attempt - albeit not that clear one - to discuss the currently typical type of rapists who are not distinguishable from the Good Guy Gregs out there. While the \"don't hang out alone at night\" type of advice is not particularly useful in the context of rapes perpetrated by people you know and at least marginally trust, advice about how to defend yourself certainly is.  &gt;  advice about how to defend yourself certainly is.\n\nTo certain extent yes. Especially if practiced. \n\nHowever, studies have shown that surprisingly(?) many rape victims actually \"freeze up\" as it is called. They don't fight, they don't yell or attempt to escape. I am not on page what is currently thought to cause it but I've heard people hypothesize it to be an evolutionary mechanism of survival: if you do what you are being told you hope to get out of it alive. Much like a lot of people will hand over their phone and wallet if jumped at on the street.\n\n I have this. I don't fight or flight, I freeze.\n\nIt fucking sucks.  I have this. I don't fight or flight, I freeze.\n\nIt fucking sucks.  I do think it is ok to teach children how to be safe and it is all correct to warn people as in \"there has been a lot of attacks in that area, I'd suggest you avoid it\".  Never the less, I have a few somewhat separate points why I don't think giving advice is that simple in a larger context.\n\n**Timing of advice**\nAdvice *before* anything happens in an unbiased way is perfectly fine. When it is said the same way you would talk about protecting your credit card pin code or wearing seatbelts when driving a car.\n\nWhat I *do* think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" *after* the person already got raped. First of all, that is what they are torturing themselves with (just like people who are part of traffic accidents tend to do), second, this isn't helpful in anyway and only serves to make the victim feel worse.\n\n**It is problematic because it perpetuates the idea of what a real rape is**\nStudies have shown that people have a lot of sympathy with victims of what is perceived as \"real rape\"; the victim and rapist don't know each other, it happens outside, plenty of violence is used, victim has multiple injuries and victim fights actively back. This does happen, and the common advice given to women probably do, to certain extent, reduce the occurrence of rapes of this type. \n\nWhat, however, is not taken in count is that statistically speaking this tends to be the most rare case of rape. Hence, the advice is somewhat misplaced. It is like telling someone to be careful when booking a flight but ignore any safety instructions when driving a car. It also serves to keep up the illusion of \"rape only happens to stupid/bad/non-careful people\". Studies have also shown that many victims who got raped when outside were not coming home from a party through a bad neighbourhood wearing mini skirts. Instead, it was friends having a party and someone in the group raping another person in the same, it was people walking their dogs.\n\n**The advice given today is not particularly relevant for what the problem is today**\nEven though stranger-outside rape is not that common this is still where the discussion lies - even when the intent, like yours, is good. And in my opinion this is a huge problem. You don't avoid getting raped by a friend, friend of a friend, partner or family member by not walking home alone, thinking about what you wear (which, some studies argue, isn't even a factor as we think of it as for choosing a victim). \n\nIt seems like a common reaction to rape by someone you know is to not recognize it as rape and blaming one self for it on a whole different level. You did everything you were advised against - except you didn't do anything the next person wouldn't have. You were alone with the person, perhaps you were drunk, maybe the to-be-rapist offered to take you home so that you would be safe. The victim basically trusts the wrong person and it is extremely counter-productive and down-right ignorant to say \"you shouldn't have trusted him\". \n\nI don't have a solution to how to avoid this and that's why I think it is extremely important to discuss this! But every time rape comes up its about psychos luring in a park. It is very rarely about the most common rapist who is someone you know and mistaken for being a decent human being. And maybe they are,  outside of the rape. And I've come to suspect that \"teach rapists not to rape\" is an attempt - albeit not that clear one - to discuss the currently typical type of rapists who are not distinguishable from the Good Guy Gregs out there. OK, just to address what you said\n\n&gt;What I do think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" after the person already got raped.\n\nI think we can all agree this is wrong. My post wasn't defending victim blaming. It was about making a distinction between victim blaming, and promoting precaution. This is a clear cut example of victim blaming. \n\n&gt;It is problematic because it perpetuates the idea of what a real rape is\n&gt;The advice given today is not particularly relevant for what the problem is today\n\nI agree with you, but I was merely using the most basic example that is often cited, the 'Don't walk alone at night'. That's not the only advice I would suggest giving though. I was raped by someone I had just started dating who was very sexually aggressive, especially when he was drunk. This person would get ANGRY when I didn't give him sexual attention. It was a huge red flag that I didn't really see because I had never dated anyone before, and I wasn't prepared for how to deal with that situation.\n\n I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves. \n\nOr if someone is making them uncomfortable or acting entitled or something, they should know what to do. \n\nBasically, I just want to see girls being prepared and protected as much as they can be. Rape will always happen, but if we can give girls tools to protect or defend themselves, that will be better. Taking a proactive approach to it should not be equated with after-the-fact victim blaming. They're not the same. \n\n\n\n\n I just have to say that I LOVE your idea for teaching women to watch out for red flags in people they know and trust and for teaching them what to do if someone is making them uncomfortable as well as what resources are available to them before the fact. That's what's missing in a lot of the safety advice people give out that I decried in my other rather verbose comments. but what is a red flag in someone you know and trust? She went over a big one just in this post: getting angry when he didn't get sexual attention. \n\nThere are red flags of abusers, and they are likely the same sort that come up in potential relationship rape. Even just the basic \"if you feel uncomfortable with the thought of being alone with someone, don't be alone with them\" instead of encouraging people to be \"nice\" and \"give someone a chance.\"\n\nThat doesn't always help, but even just giving a flat out \"If you are uncomfortable in a situation, leave the situation. If someone doesn't respect that you aren't comfortable in that situation with them, that's a sign you are right to be uncomfortable\" I think could be hugely helpful. \n\nNo advice is going to cover every single situation. But there is some that could be a help, I think.  &gt;\"If you are uncomfortable in a situation, leave the situation. If someone doesn't respect that you aren't comfortable in that situation with them, that's a sign you are right to be uncomfortable\"\n\nI feel like this is some of the best advice for a person to be proactive and protecting themselves -- not just in terms of rape, but in general. It's the whole 'trust your gut' thing.  Just wanted to reinforce that you should always trust your instinct.  She went over a big one just in this post: getting angry when he didn't get sexual attention. \n\nThere are red flags of abusers, and they are likely the same sort that come up in potential relationship rape. Even just the basic \"if you feel uncomfortable with the thought of being alone with someone, don't be alone with them\" instead of encouraging people to be \"nice\" and \"give someone a chance.\"\n\nThat doesn't always help, but even just giving a flat out \"If you are uncomfortable in a situation, leave the situation. If someone doesn't respect that you aren't comfortable in that situation with them, that's a sign you are right to be uncomfortable\" I think could be hugely helpful. \n\nNo advice is going to cover every single situation. But there is some that could be a help, I think.  She went over a big one just in this post: getting angry when he didn't get sexual attention. \n\nThere are red flags of abusers, and they are likely the same sort that come up in potential relationship rape. Even just the basic \"if you feel uncomfortable with the thought of being alone with someone, don't be alone with them\" instead of encouraging people to be \"nice\" and \"give someone a chance.\"\n\nThat doesn't always help, but even just giving a flat out \"If you are uncomfortable in a situation, leave the situation. If someone doesn't respect that you aren't comfortable in that situation with them, that's a sign you are right to be uncomfortable\" I think could be hugely helpful. \n\nNo advice is going to cover every single situation. But there is some that could be a help, I think.  This also really touches on a critical point: Trust your gut. You get to decide and choose where to be. Don't feel pressured into being in a situation you don't feel comfortable in. This is *different* from stuff like, \"Oh, I'm nervous in front of crowds, therefore I shall live forever alone in a cave.\" It's not saying you shouldn't try new things. It IS saying that if you get a bad feeling about something or someone, it's okay to trust that feeling. Learn to differentiate and trust your instincts. She went over a big one just in this post: getting angry when he didn't get sexual attention. \n\nThere are red flags of abusers, and they are likely the same sort that come up in potential relationship rape. Even just the basic \"if you feel uncomfortable with the thought of being alone with someone, don't be alone with them\" instead of encouraging people to be \"nice\" and \"give someone a chance.\"\n\nThat doesn't always help, but even just giving a flat out \"If you are uncomfortable in a situation, leave the situation. If someone doesn't respect that you aren't comfortable in that situation with them, that's a sign you are right to be uncomfortable\" I think could be hugely helpful. \n\nNo advice is going to cover every single situation. But there is some that could be a help, I think.  She went over a big one just in this post: getting angry when he didn't get sexual attention. \n\nThere are red flags of abusers, and they are likely the same sort that come up in potential relationship rape. Even just the basic \"if you feel uncomfortable with the thought of being alone with someone, don't be alone with them\" instead of encouraging people to be \"nice\" and \"give someone a chance.\"\n\nThat doesn't always help, but even just giving a flat out \"If you are uncomfortable in a situation, leave the situation. If someone doesn't respect that you aren't comfortable in that situation with them, that's a sign you are right to be uncomfortable\" I think could be hugely helpful. \n\nNo advice is going to cover every single situation. But there is some that could be a help, I think.  but what is a red flag in someone you know and trust? You know, this is a *very* good question. I was in a situation where I was manipulated and sexually violated by someone who I liked and trusted. In retrospect, of course, there were several things that he did that bother me now and led up to more major abuses. But at the time I didn’t really see them. Red flags aren’t as simple of a concept as people make them out to be. The best manipulators will know what to hide until they’ve already coaxed you into a false sense of security. I guess for me that sense of “this is too good to be true” has become my biggest and brightest flag, but without having had this experience, I don’t know what I could have told my past self that could have prevented the nasty series of events. This is definitely worth serious discussion. \n\nSpeaking of manipulators, I think one concept that everyone should be acquainted with is “gaslighting” which is something I didn’t really know about until it happened to me. Gaslighting is a common tactic used by many abusers and predators: it serves to warp the victim’s sense of reality. It consists of claims and dismissals such as “I didn’t say that,” “I never did that,” “that’s crazy” “you didn’t tell me” “I didn’t get any texts from you” “don’t be so dramatic”  to permit the abuser to avoid taking responsibility for things that were in fact said/done and that are legitimately a big deal. This sort of thing is subtle but can actually drive a person literally insane. There is no real defense against this other than to recognize it and consider the possibility that your partner is lying to you rather than assuming you did something wrong. That second one is really...unnerving to read. I have had that happen and not realize what was going on. Wow. but what is a red flag in someone you know and trust? OK, just to address what you said\n\n&gt;What I do think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" after the person already got raped.\n\nI think we can all agree this is wrong. My post wasn't defending victim blaming. It was about making a distinction between victim blaming, and promoting precaution. This is a clear cut example of victim blaming. \n\n&gt;It is problematic because it perpetuates the idea of what a real rape is\n&gt;The advice given today is not particularly relevant for what the problem is today\n\nI agree with you, but I was merely using the most basic example that is often cited, the 'Don't walk alone at night'. That's not the only advice I would suggest giving though. I was raped by someone I had just started dating who was very sexually aggressive, especially when he was drunk. This person would get ANGRY when I didn't give him sexual attention. It was a huge red flag that I didn't really see because I had never dated anyone before, and I wasn't prepared for how to deal with that situation.\n\n I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves. \n\nOr if someone is making them uncomfortable or acting entitled or something, they should know what to do. \n\nBasically, I just want to see girls being prepared and protected as much as they can be. Rape will always happen, but if we can give girls tools to protect or defend themselves, that will be better. Taking a proactive approach to it should not be equated with after-the-fact victim blaming. They're not the same. \n\n\n\n\n Phrasing it as \"don't walk alone at night\" rather abstracts the role of the rapist while placing responsibility on the victim. I think it would be better to start by talking about the rapists, how they coerce their victims and the attitudes that they hold.  Your warning might be better phrased as \"predators attack lone women at night\".\n\nHowever, I'd like to quibble with that warning too - one of the biggest things that allow perpetrators to continue getting away with it is that it is often talked about as if a stranger using violence is the only type of rape that exists.  In fact, the majority are either people known to the victim using violence, or strangers using alcohol or other drugs.\n\nI agree with your suggestion about red flags - we should be teaching people about predators and how to recognise them, as well as how those predators exert control.  And we should be teaching *everyone* these things - if women are better at recognising predatory men, then predatory men have fewer chances to act.  If that man's friends are better at recognising predatory men he's less likely to get away with it and much less likely to believe his behaviours are implicitly condoned and therefore less likely to attempt in the first place. Phrasing it as \"don't walk alone at night\" rather abstracts the role of the rapist while placing responsibility on the victim. I think it would be better to start by talking about the rapists, how they coerce their victims and the attitudes that they hold.  Your warning might be better phrased as \"predators attack lone women at night\".\n\nHowever, I'd like to quibble with that warning too - one of the biggest things that allow perpetrators to continue getting away with it is that it is often talked about as if a stranger using violence is the only type of rape that exists.  In fact, the majority are either people known to the victim using violence, or strangers using alcohol or other drugs.\n\nI agree with your suggestion about red flags - we should be teaching people about predators and how to recognise them, as well as how those predators exert control.  And we should be teaching *everyone* these things - if women are better at recognising predatory men, then predatory men have fewer chances to act.  If that man's friends are better at recognising predatory men he's less likely to get away with it and much less likely to believe his behaviours are implicitly condoned and therefore less likely to attempt in the first place. OK, just to address what you said\n\n&gt;What I do think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" after the person already got raped.\n\nI think we can all agree this is wrong. My post wasn't defending victim blaming. It was about making a distinction between victim blaming, and promoting precaution. This is a clear cut example of victim blaming. \n\n&gt;It is problematic because it perpetuates the idea of what a real rape is\n&gt;The advice given today is not particularly relevant for what the problem is today\n\nI agree with you, but I was merely using the most basic example that is often cited, the 'Don't walk alone at night'. That's not the only advice I would suggest giving though. I was raped by someone I had just started dating who was very sexually aggressive, especially when he was drunk. This person would get ANGRY when I didn't give him sexual attention. It was a huge red flag that I didn't really see because I had never dated anyone before, and I wasn't prepared for how to deal with that situation.\n\n I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves. \n\nOr if someone is making them uncomfortable or acting entitled or something, they should know what to do. \n\nBasically, I just want to see girls being prepared and protected as much as they can be. Rape will always happen, but if we can give girls tools to protect or defend themselves, that will be better. Taking a proactive approach to it should not be equated with after-the-fact victim blaming. They're not the same. \n\n\n\n\n OK, just to address what you said\n\n&gt;What I do think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" after the person already got raped.\n\nI think we can all agree this is wrong. My post wasn't defending victim blaming. It was about making a distinction between victim blaming, and promoting precaution. This is a clear cut example of victim blaming. \n\n&gt;It is problematic because it perpetuates the idea of what a real rape is\n&gt;The advice given today is not particularly relevant for what the problem is today\n\nI agree with you, but I was merely using the most basic example that is often cited, the 'Don't walk alone at night'. That's not the only advice I would suggest giving though. I was raped by someone I had just started dating who was very sexually aggressive, especially when he was drunk. This person would get ANGRY when I didn't give him sexual attention. It was a huge red flag that I didn't really see because I had never dated anyone before, and I wasn't prepared for how to deal with that situation.\n\n I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves. \n\nOr if someone is making them uncomfortable or acting entitled or something, they should know what to do. \n\nBasically, I just want to see girls being prepared and protected as much as they can be. Rape will always happen, but if we can give girls tools to protect or defend themselves, that will be better. Taking a proactive approach to it should not be equated with after-the-fact victim blaming. They're not the same. \n\n\n\n\n OK, just to address what you said\n\n&gt;What I do think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" after the person already got raped.\n\nI think we can all agree this is wrong. My post wasn't defending victim blaming. It was about making a distinction between victim blaming, and promoting precaution. This is a clear cut example of victim blaming. \n\n&gt;It is problematic because it perpetuates the idea of what a real rape is\n&gt;The advice given today is not particularly relevant for what the problem is today\n\nI agree with you, but I was merely using the most basic example that is often cited, the 'Don't walk alone at night'. That's not the only advice I would suggest giving though. I was raped by someone I had just started dating who was very sexually aggressive, especially when he was drunk. This person would get ANGRY when I didn't give him sexual attention. It was a huge red flag that I didn't really see because I had never dated anyone before, and I wasn't prepared for how to deal with that situation.\n\n I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves. \n\nOr if someone is making them uncomfortable or acting entitled or something, they should know what to do. \n\nBasically, I just want to see girls being prepared and protected as much as they can be. Rape will always happen, but if we can give girls tools to protect or defend themselves, that will be better. Taking a proactive approach to it should not be equated with after-the-fact victim blaming. They're not the same. \n\n\n\n\n I do think it is ok to teach children how to be safe and it is all correct to warn people as in \"there has been a lot of attacks in that area, I'd suggest you avoid it\".  Never the less, I have a few somewhat separate points why I don't think giving advice is that simple in a larger context.\n\n**Timing of advice**\nAdvice *before* anything happens in an unbiased way is perfectly fine. When it is said the same way you would talk about protecting your credit card pin code or wearing seatbelts when driving a car.\n\nWhat I *do* think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" *after* the person already got raped. First of all, that is what they are torturing themselves with (just like people who are part of traffic accidents tend to do), second, this isn't helpful in anyway and only serves to make the victim feel worse.\n\n**It is problematic because it perpetuates the idea of what a real rape is**\nStudies have shown that people have a lot of sympathy with victims of what is perceived as \"real rape\"; the victim and rapist don't know each other, it happens outside, plenty of violence is used, victim has multiple injuries and victim fights actively back. This does happen, and the common advice given to women probably do, to certain extent, reduce the occurrence of rapes of this type. \n\nWhat, however, is not taken in count is that statistically speaking this tends to be the most rare case of rape. Hence, the advice is somewhat misplaced. It is like telling someone to be careful when booking a flight but ignore any safety instructions when driving a car. It also serves to keep up the illusion of \"rape only happens to stupid/bad/non-careful people\". Studies have also shown that many victims who got raped when outside were not coming home from a party through a bad neighbourhood wearing mini skirts. Instead, it was friends having a party and someone in the group raping another person in the same, it was people walking their dogs.\n\n**The advice given today is not particularly relevant for what the problem is today**\nEven though stranger-outside rape is not that common this is still where the discussion lies - even when the intent, like yours, is good. And in my opinion this is a huge problem. You don't avoid getting raped by a friend, friend of a friend, partner or family member by not walking home alone, thinking about what you wear (which, some studies argue, isn't even a factor as we think of it as for choosing a victim). \n\nIt seems like a common reaction to rape by someone you know is to not recognize it as rape and blaming one self for it on a whole different level. You did everything you were advised against - except you didn't do anything the next person wouldn't have. You were alone with the person, perhaps you were drunk, maybe the to-be-rapist offered to take you home so that you would be safe. The victim basically trusts the wrong person and it is extremely counter-productive and down-right ignorant to say \"you shouldn't have trusted him\". \n\nI don't have a solution to how to avoid this and that's why I think it is extremely important to discuss this! But every time rape comes up its about psychos luring in a park. It is very rarely about the most common rapist who is someone you know and mistaken for being a decent human being. And maybe they are,  outside of the rape. And I've come to suspect that \"teach rapists not to rape\" is an attempt - albeit not that clear one - to discuss the currently typical type of rapists who are not distinguishable from the Good Guy Gregs out there. &gt;And I've come to suspect that \"teach rapists not to rape\" is an attempt - albeit not that clear one - to discuss the currently typical type of rapists who are not distinguishable from the Good Guy Gregs out there.\n\nThanks for saying this.  \n\nI really hate the \"We don't tell people not to rape\" thing.  It's poorly phrased.  We clearly DO tell people not to rape.  What it ought to be is \"We don't tell people what rape IS.\"  With so many people thinking rape is only a random attack in an alley, with so many men who will admit to rape only if the word \"rape\" isn't used, clearly the issue is that people don't have a clear view of what it means.\n\nVictims aren't prepared to prevent or deal with the effects of rape.  Perpetrators know that \"rape\" is wrong, but don't know that what they're doing is rape.  Clearly the conversation needs to be about what it is, how it happens, and how to prevent it.  Not just whether or not it's wrong.   I do think it is ok to teach children how to be safe and it is all correct to warn people as in \"there has been a lot of attacks in that area, I'd suggest you avoid it\".  Never the less, I have a few somewhat separate points why I don't think giving advice is that simple in a larger context.\n\n**Timing of advice**\nAdvice *before* anything happens in an unbiased way is perfectly fine. When it is said the same way you would talk about protecting your credit card pin code or wearing seatbelts when driving a car.\n\nWhat I *do* think is questionable, unhelpful and counts as victim blaming is to say \"Well, what did you expect?\" or \"You shouldn't have done/worn xyc.\" *after* the person already got raped. First of all, that is what they are torturing themselves with (just like people who are part of traffic accidents tend to do), second, this isn't helpful in anyway and only serves to make the victim feel worse.\n\n**It is problematic because it perpetuates the idea of what a real rape is**\nStudies have shown that people have a lot of sympathy with victims of what is perceived as \"real rape\"; the victim and rapist don't know each other, it happens outside, plenty of violence is used, victim has multiple injuries and victim fights actively back. This does happen, and the common advice given to women probably do, to certain extent, reduce the occurrence of rapes of this type. \n\nWhat, however, is not taken in count is that statistically speaking this tends to be the most rare case of rape. Hence, the advice is somewhat misplaced. It is like telling someone to be careful when booking a flight but ignore any safety instructions when driving a car. It also serves to keep up the illusion of \"rape only happens to stupid/bad/non-careful people\". Studies have also shown that many victims who got raped when outside were not coming home from a party through a bad neighbourhood wearing mini skirts. Instead, it was friends having a party and someone in the group raping another person in the same, it was people walking their dogs.\n\n**The advice given today is not particularly relevant for what the problem is today**\nEven though stranger-outside rape is not that common this is still where the discussion lies - even when the intent, like yours, is good. And in my opinion this is a huge problem. You don't avoid getting raped by a friend, friend of a friend, partner or family member by not walking home alone, thinking about what you wear (which, some studies argue, isn't even a factor as we think of it as for choosing a victim). \n\nIt seems like a common reaction to rape by someone you know is to not recognize it as rape and blaming one self for it on a whole different level. You did everything you were advised against - except you didn't do anything the next person wouldn't have. You were alone with the person, perhaps you were drunk, maybe the to-be-rapist offered to take you home so that you would be safe. The victim basically trusts the wrong person and it is extremely counter-productive and down-right ignorant to say \"you shouldn't have trusted him\". \n\nI don't have a solution to how to avoid this and that's why I think it is extremely important to discuss this! But every time rape comes up its about psychos luring in a park. It is very rarely about the most common rapist who is someone you know and mistaken for being a decent human being. And maybe they are,  outside of the rape. And I've come to suspect that \"teach rapists not to rape\" is an attempt - albeit not that clear one - to discuss the currently typical type of rapists who are not distinguishable from the Good Guy Gregs out there. &gt; \"Well, what did you expect?\" \n\nWho says this?  Am I one of a very, very small subset of women who *hate* being told we shouldn't walk alone at night?  I refuse to alter schedule my entire existence around fear of a very minute possibility.  I deserve to walk around at night if I so choose and I'm really tired to being told I should let fear dictate my decisions. \n\n*** and I don't think you're victim blaming, op.  I'm just really fucking tired of getting unsolicited advice about safety because I'm a fragile, delicate woman who will be attacked at any moment  I had to stop by the ATM at around 10:30 p.m. the other day. It's located on a plaza two minutes from my house, in a very safe, quiet, cookie-cutter  type neighborhood. \n\nA car rolls up, and a guy gets out. For a second, I was absolutely terrified. I whipped out my phone, and started dialing a friend. Just as my friend answers, the guy walks up to the ATM right next to me. And he withdraws some money. And he leaves. \n\nIn my head, I was so confused. Why had I been so absolutely terrified? My heart was *still* beating fast. Because that's what I've been taught. I've been taught that if it's night time, and I'm alone, and there's a man near me, it's a recipe for disaster. And it really fucking sucks. I hate living in fear, and I hate labeling every man I mean past 10 p.m. as a potential rapist.  Am I one of a very, very small subset of women who *hate* being told we shouldn't walk alone at night?  I refuse to alter schedule my entire existence around fear of a very minute possibility.  I deserve to walk around at night if I so choose and I'm really tired to being told I should let fear dictate my decisions. \n\n*** and I don't think you're victim blaming, op.  I'm just really fucking tired of getting unsolicited advice about safety because I'm a fragile, delicate woman who will be attacked at any moment  Am I one of a very, very small subset of women who *hate* being told we shouldn't walk alone at night?  I refuse to alter schedule my entire existence around fear of a very minute possibility.  I deserve to walk around at night if I so choose and I'm really tired to being told I should let fear dictate my decisions. \n\n*** and I don't think you're victim blaming, op.  I'm just really fucking tired of getting unsolicited advice about safety because I'm a fragile, delicate woman who will be attacked at any moment   I think there is a line between safety and victim blaming, but not everyone sees it that way. Sure in a perfect world, no one would rape... but it's the same perfect world that doesn't exist for robberies, burglaries, intentional damage to property, etc. Shit happens, you might as well be prepared. I don't walk in certain areas at night alone. I try to stay in well lit areas with lots of people. It pays to be safe for the same reasons you lock your doors at night. Bad people will do bad things, I'm just making it harder for them to do those things to me. My understanding of the line between advice and victim blaming involves two factors: whether the advice is solicited; and if the \"advice\" is coming after a victim has been assaulted. \n\nE.g. \"Walking through &lt;bad neighbourhood&gt; isn't a great idea\" vs. \"What were you expecting to happen walking through &lt;bad neighbourhood&gt;?\" Agreed. I also think it has a lot to do with the tone of the conversation. Its one thing to set down with someone and say, \"this is how we change the odds\" and another to say \"well, you were drunk alone with a guy...\" Agreed. I also think it has a lot to do with the tone of the conversation. Its one thing to set down with someone and say, \"this is how we change the odds\" and another to say \"well, you were drunk alone with a guy...\" My understanding of the line between advice and victim blaming involves two factors: whether the advice is solicited; and if the \"advice\" is coming after a victim has been assaulted. \n\nE.g. \"Walking through &lt;bad neighbourhood&gt; isn't a great idea\" vs. \"What were you expecting to happen walking through &lt;bad neighbourhood&gt;?\" I also just think the bad neighborhood advice is incredibly annoying and classist. First, I don't have any stats on hand to back this up, but it seems to me that I'd be more likely to get raped in a (middle class) college bar than a 'bad neighborhood' (and lets face it, bad neighborhood is a nicer way of saying poor neighborhood). And even beyond that, most people walking through bad neighorhoods aren't doing it for laughs. I live in one. There is literally no way for me to get home (short of taking a cab every night which is financially impossible) except to walk through my bad neighborhood.  You're both right and wrong, in my opinion. On the one hand, you're totally right that violent assault by a stranger is the least common type of sexual assault; assault while intoxicated by someone you already know is far more common, and really needs more attention given. \n\nOn the other hand, there is undeniably a correlation between the economic status of an area and it's crime rate. I'm lucky enough to live in an upper-middle-class neighbourhood, and there is very little crime reported. My girlfriend lives on the edge of an area with a poor reputation, and there is far more crime reported there.\n\nI realise that again we're talking about random crime, but if there is a statistical backing (more crime in area x than area y), is it classist because area x is generally of lower income?\n\nTo be clear: to me, a \"bad neighbourhood\" is made by its crime rate, not its median income. You can't necessarily infer the one from the other, despite a known correlation. \n\nAs to your personal situation, you don't have a choice in the matter at this point. If your neighbourhood has a higher crime rate, you are more likely to be the victim of crime. That is simple fact. That doesn't mean that you hold any responsibility if you are a victim of crime, or that I would feel less sympathy. All that I mean by \"bad neighbourhood\" advice is that if you have two routes, one with a high crime rate and one with a low crime rate, you would probably be safer taking the latter. \n\nApologies for any typos or formatting errors; I'm sending this from my phone But rape doesn't really follow the statistics of general crime.You're not necessarily more likely to get raped in the same places that you're more likely to get mugged, so the whole 'bad neighborhood' advice is generally wrong, and really a way for the middle class in the world to (falsely) separate themselves from rapists, by painting the rapists as different than them. It's a narrative that does way more harm than it does good. Let's be clear here. There are, broadly speaking, two kinds of sexual assault: assault by a stranger and assault by an acquaintance. The former absolutely follows the general crime statistics; the latter does not. Assault by an acquaintance is also much more common. So, on the whole, I agree with your statement. \n\nHowever! As has been stated, advice for the one case will not necessarily apply to the other. Therefore, I don't think it's problematic to give either piece of advice; this would be best delivered in a frank discussion about real (not perceived) risk and effective means of protection.  Assault by a stranger (in the manner I assume you're thinking of: a man with a ski mask threatens you with a knife in a dark alley) is such a negligible risk it's not really even worth being scared about. The fact that it's been brought up so many times as a \"valid\" safety tip in this thread speaks for itself. It's really a waste of our time to even bother discussing it because not only does it address such a small sub-category of sexual assault, but everyone also already knows about it (when's the last time you heard someone say \"oh shit, so you mean to say that bad neighborhoods AREN'T a good idea?!\"), and most people who walk through them do it out of necessity, not for the scenery. \n\nIt's condescending, useless, and a distraction from the real problems at hand. Like I said before, it does far more harm than good. \"In the vast majority of crimes of sexual assault, the accused is known to the victim (in 80% of sexual offences in 2002). Two fifths of all victims (41%) were assaulted by an acquaintance, 10% by a friend, 28% by a family member, and the remaining 20% were victimized by a stranger.\"\n\n\" Other sexual offences accounted for 10%, and the more serious levels 2 and 3 composed 2% of all sexual offences.\"\n\nSorry for the lack of formatting, I'm still on my phone. Here's the source: http://www.justice.gc.ca/eng/pi/rs/rep-rap/2006/rr06_vic2/p3_4.html#f98\n\nLevels 2 and 3 are what is traditionally referred to as rape, i.e. where violence is threatened or used. I would say that calling these cases negligible is a disservice to the victims. \n\nI will concede that the \"bad neighbourhood\" advice is more for general protection from crime, rather than sexual assault in particular. But I reject that it is a waste of our time. Another commenter has raised the point that common sense to us may well not be common to everyone, especially youths.\n\nAs to your point that for some, avoiding a dangerous route isn't an option, I understand that. In a previous post I qualified the advice with something along the lines of \"If you have the option\".\n\nI'm about to board an airplane, so I probably won't reply for a while, but I have enjoyed the discussion. If I have time after I land I'd be interested to discuss how we determine if something is doing more harm than good. \n\nHope you have a good day! I'm assuming that those statistics are for reported (or worse, prosecuted) sexual assaults? If that's the case, then they'd be massively skewed in favor of the stranger variety, because that's the kind that tends to get reported.\n\nI agree that young people need to learn about safety, but it's condescending to tell grown women the type of information that would only be news to a particularly naive youth, and then act like you're doing her a favor. And how is calling it a negligible risk a disservice? It's uncommon and unlikely; I don't understand how that takes away from the people who are unfortunate enough to suffer from it. \n You're both right and wrong, in my opinion. On the one hand, you're totally right that violent assault by a stranger is the least common type of sexual assault; assault while intoxicated by someone you already know is far more common, and really needs more attention given. \n\nOn the other hand, there is undeniably a correlation between the economic status of an area and it's crime rate. I'm lucky enough to live in an upper-middle-class neighbourhood, and there is very little crime reported. My girlfriend lives on the edge of an area with a poor reputation, and there is far more crime reported there.\n\nI realise that again we're talking about random crime, but if there is a statistical backing (more crime in area x than area y), is it classist because area x is generally of lower income?\n\nTo be clear: to me, a \"bad neighbourhood\" is made by its crime rate, not its median income. You can't necessarily infer the one from the other, despite a known correlation. \n\nAs to your personal situation, you don't have a choice in the matter at this point. If your neighbourhood has a higher crime rate, you are more likely to be the victim of crime. That is simple fact. That doesn't mean that you hold any responsibility if you are a victim of crime, or that I would feel less sympathy. All that I mean by \"bad neighbourhood\" advice is that if you have two routes, one with a high crime rate and one with a low crime rate, you would probably be safer taking the latter. \n\nApologies for any typos or formatting errors; I'm sending this from my phone It doesn't matter if there is more CRIME in general, we are talking about a very specific crime. Are there more thefts? Who cares. Are there more domestic assaults? Who cares. Are there more robberies? Who cares.\n\nThe only question about this advice, in this context, that matters is, \"Are there more rapes/sexual assaults?\" If that answer to that question is no, then advice about avoiding a bad neighborhood (to avoid rape) is unwarranted. Fair enough. That being said, if the crime rate is higher, it isn't unreasonable to assume that the rate of sexual assault is higher. \n\nAlso, in a general safety sense it's fine to give that advice. Who wants to be assaulted on their way home, sexual or otherwise? If given with that mindset, however, it really shouldn't be presented specifically as a way to reduce your chance of being targeted for sexual assault.  &gt; That being said, if the crime rate is higher, it isn't unreasonable to assume that the rate of sexual assault is higher.\n\nYes, I think it is unreasonable. Rape isn't like most other crimes. It would foolish to assume that it follows the same patterns.\n\nFor example: My former home was generally one of the safest cities you could possibly live in. People didn't get mugged, they didn't get murdered, and break-ins were so rare many people didn't lock their doors. It also had one of the highest sexual assault rates in the country.   I suspect the main reason that people get angry over this is that you can take every precaution in the world, and *still* get raped. And the worry is that if you give a women a list of things she should do to \"prevent\" rape, and the she still gets raped, the first thing she might think is, \"what did I do wrong? - I followed the list!\". You are just reinforcing the idea (in some people's minds) that women can prevent someone from raping them if they follow certain advice.\n\n\nThe reason we victim blame is because we all so desperately have to believe we are safe. I've realised that whenever I read about a rape in the press, I unconsciously look for things she did that I wouldn't have done. I wouldn't have gone where she went, I wouldn't have trusted the man she trusted. Of course it's made easier by the fact that the press always list the things she did \"wrong\". The truth is, it could be me next, but if I truly accepted that fact, I wouldn't be able to live my life to the full because of the fear.\n\nWe can tell ourselves all we want that we're just giving \"practical advice\", but in actual fact we're just saying things that make us feel better. To make us believe it won't be us. But even if it isn't us, it will still be someone else. The rape wasn't prevented, I just managed to avoid being the victim. \n\nThe only way to prevent rape, is to stop the rapists committing rape. Please do not belittle efforts to target rapists and persuade them not to rape. If you *only* focus on the victims actions, you reinforce the idea that the rapist will get away with it, because no-one pays any attention to who they are and what they're doing. They are just some shadowy unknown figure. They are dehumanised, which makes it easier for young men to tell themselves that they're not rapists. So often, when we talk about how to prevent rape, we don't even mention the rapist. I support the people who are trying to change that. I suspect the main reason that people get angry over this is that you can take every precaution in the world, and *still* get raped. And the worry is that if you give a women a list of things she should do to \"prevent\" rape, and the she still gets raped, the first thing she might think is, \"what did I do wrong? - I followed the list!\". You are just reinforcing the idea (in some people's minds) that women can prevent someone from raping them if they follow certain advice.\n\n\nThe reason we victim blame is because we all so desperately have to believe we are safe. I've realised that whenever I read about a rape in the press, I unconsciously look for things she did that I wouldn't have done. I wouldn't have gone where she went, I wouldn't have trusted the man she trusted. Of course it's made easier by the fact that the press always list the things she did \"wrong\". The truth is, it could be me next, but if I truly accepted that fact, I wouldn't be able to live my life to the full because of the fear.\n\nWe can tell ourselves all we want that we're just giving \"practical advice\", but in actual fact we're just saying things that make us feel better. To make us believe it won't be us. But even if it isn't us, it will still be someone else. The rape wasn't prevented, I just managed to avoid being the victim. \n\nThe only way to prevent rape, is to stop the rapists committing rape. Please do not belittle efforts to target rapists and persuade them not to rape. If you *only* focus on the victims actions, you reinforce the idea that the rapist will get away with it, because no-one pays any attention to who they are and what they're doing. They are just some shadowy unknown figure. They are dehumanised, which makes it easier for young men to tell themselves that they're not rapists. So often, when we talk about how to prevent rape, we don't even mention the rapist. I support the people who are trying to change that.  I'm concerned about the role of fear here. Some women I've talked to allow themselves to be controlled by the fear of rape, and I'm not convinced that's healthy. By all means take steps to be prepared in the event something bad happens, but fear tends to override the rational evaluation of risks. Risks cannot be addressed without first being rationally evaluated. \n\nI don't believe that the advice to not go out at night is victim blaming, but I do worry that it is motivated by excessive fear. To permit the fear to control you is to voluntarily subjugate yourself to the fiend. \n\nSaid advice, also, is not equally applicable in all places. Crime rates vary with location, and can do so widely within even a single city. At times, such advice feels as though it is underpinned by the assumption that a woman cannot be safe without a man at her side to defend her. If this assumption is present, then the advice does become patronizing.   I have a big, big problem with the usual advice of how to keep yourself safe as a woman.\n\n&gt; Telling a woman not to walk alone at night is not victim blaming.\n\nI actually agree that it's not victim blaming. I just think it's really stupid advice. Explain to me how exactly that is supposed to work in practice. Does that mean I can't leave my apartment after 8pm? Am I only supposed to go out at night if I have someone who will pick me up at my door and walk me home again afterwards? Should I seriously demand that my friends make an hour-long detour to take me home? Do I have to spend a fortune on taxis? But most taxi drivers are men, so there's a risk of them raping me. Are taxis a no-go as well?\n\nThe problem with this advice and others like it is that it basically tells women to give up huge amounts of personal freedom to keep themselves safe, completely ignoring the fact that the chances of being raped by a stranger are actually very low.\n\nSorry, I won't do that. I will wear whatever the hell I want, and I will walk home at night (because otherwise, I couldn't go out at night pretty much ever), and I will flirt with guys if I want to. I am not willing to give up my personal freedom, and I think it's not fair to tell women that they should, because even if you don't say it and even if you don't mean it that way at all, there's always a hint of \"or else it will be your fault\" in that kind of advice. I have a big, big problem with the usual advice of how to keep yourself safe as a woman.\n\n&gt; Telling a woman not to walk alone at night is not victim blaming.\n\nI actually agree that it's not victim blaming. I just think it's really stupid advice. Explain to me how exactly that is supposed to work in practice. Does that mean I can't leave my apartment after 8pm? Am I only supposed to go out at night if I have someone who will pick me up at my door and walk me home again afterwards? Should I seriously demand that my friends make an hour-long detour to take me home? Do I have to spend a fortune on taxis? But most taxi drivers are men, so there's a risk of them raping me. Are taxis a no-go as well?\n\nThe problem with this advice and others like it is that it basically tells women to give up huge amounts of personal freedom to keep themselves safe, completely ignoring the fact that the chances of being raped by a stranger are actually very low.\n\nSorry, I won't do that. I will wear whatever the hell I want, and I will walk home at night (because otherwise, I couldn't go out at night pretty much ever), and I will flirt with guys if I want to. I am not willing to give up my personal freedom, and I think it's not fair to tell women that they should, because even if you don't say it and even if you don't mean it that way at all, there's always a hint of \"or else it will be your fault\" in that kind of advice. What about risk/benefit analysis (which you may be making here)?   Is it wrong to tell someone to consider making such an analysis?\n\nAnd this doesn't ahve to be telling someone to stay at home.  It could be telling someone to take self defense classes.  Take a cab instead of walking.  Etc.\n\nI want you to consider this:  right now in Egypt, there are a bunch of fucking assholes who are taking advantage of the lawlessness and protests to rape women.  Would you make the proactive advice of telling someone (let's say they were passionate about the cause but were concerned about the risk of rape) to go to these protests knowing the risk of that person being raped then has increased (you can think of this as the converse of someone telling this person not to go because there was a risk of getting raped)?  It's weird, right?  No exact right answer.   First off, I am so so sorry about what you've gone through, and I'm so glad you opened up this conversation. You make a lot of really excellent points, and I definitely don't think that everyone who says \"Don't walk home by yourself at night\" is a victim-blamer. It's advice I would give to my friends and family (though tone and context is really important), and it's something I'm careful of myself.\n\nThe reason it's so fraught, though, is that it's very, very easy for that to turn into \"you should have known not to walk home by yourself at night; what were you thinking?\" And that, because women should know how to protect themselves, if I ever forget one of those steps, it's my fault for forgetting.\n\nIt's also dangerous because it promotes the mentality that if you follow all the magic steps (don't walk alone at night, don't take drinks from strangers, don't dress too provocatively), you'll be immune to rape. Here, we all know that it's completely untrue, that rape can happen to anyone even if you follow all the safety advice. But it makes people in general think that if something happened to you, you must not have been \"taking your safety into your own hands,\" you slipped up and forgot something, and that's why you got raped, but everyone else will be safe if they just follow the rules. Solid, practical advice-giving can end up sounding a little like \"smart girls who take this advice don't get raped,\" and that doesn't imply very good things about rape survivors.\n\nThat said, I don't think anyone's necessarily a bad person for warning their friends to carry pepper spray, and I completely understand that you have the best of intentions when you do so. But that's some of the reasoning behind why such advice gets the reaction you're talking about. Also, it gives a sliding scale to rape, making some victims more 'worthy' than others, which isn't healthy or helpful for anyone. First off, I am so so sorry about what you've gone through, and I'm so glad you opened up this conversation. You make a lot of really excellent points, and I definitely don't think that everyone who says \"Don't walk home by yourself at night\" is a victim-blamer. It's advice I would give to my friends and family (though tone and context is really important), and it's something I'm careful of myself.\n\nThe reason it's so fraught, though, is that it's very, very easy for that to turn into \"you should have known not to walk home by yourself at night; what were you thinking?\" And that, because women should know how to protect themselves, if I ever forget one of those steps, it's my fault for forgetting.\n\nIt's also dangerous because it promotes the mentality that if you follow all the magic steps (don't walk alone at night, don't take drinks from strangers, don't dress too provocatively), you'll be immune to rape. Here, we all know that it's completely untrue, that rape can happen to anyone even if you follow all the safety advice. But it makes people in general think that if something happened to you, you must not have been \"taking your safety into your own hands,\" you slipped up and forgot something, and that's why you got raped, but everyone else will be safe if they just follow the rules. Solid, practical advice-giving can end up sounding a little like \"smart girls who take this advice don't get raped,\" and that doesn't imply very good things about rape survivors.\n\nThat said, I don't think anyone's necessarily a bad person for warning their friends to carry pepper spray, and I completely understand that you have the best of intentions when you do so. But that's some of the reasoning behind why such advice gets the reaction you're talking about.  First of all, I don't think anyone really takes the \"How to Prevent Rape\" lists in a very serious context, because they're not meant to teach horrible people not to do those things. They are meant to provide a social commentary on a prevalent culture of victim blaming, where the safety of a woman entirely rests in her hands, and if somehow she gets raped, she has failed herself. They are meant to mock the excessive lists that show steps that women can take to protect themselves. \n\nAnd I don't want to attack anyone's circumstances or beliefs, but there's this notion that rape only happens at night, when a woman is walking alone. There is a notion that rape only happens when the person who raped you is a stranger. In fact, those kinds of attacks make up a much smaller percentage than people think. \n\nThere are so so many scenarios and ways in which a violent attack can play out. What is the rapist has a weapon? I'm not going to go and pepper spray someone who can shoot me. What if you get knocked out? What if you freeze up in fear? What if your attacker is a close person that you trust? What if the attack happens in the middle of the day, with people nearby? What if you scream out and nobody comes to help? What if you withdraw your consent in the middle of the act, but the attacker doesn't stop? Where is the nice pamphlet that shows how you can protect yourselves in those circumstances? \n\nNo one willingly puts themselves in dangerous situations. Advice like \"Don't go out at night\" is not only a bit redundant, but it leads women to believe that the attack was their fault.  'No one willingly puts themselves in dangerous situations'\n\nIt's a bit of an aside, but I can't really agree with you here. Millions of people around the world willingly put themselves in dangerous situations every day for fun, for the thrill of it, out of a self destructive urge, out of ignorance, out of desperation, because they feel like they have no other choice, because they're lazy, because they want to fit in... a myriad of different reasons. First of all, I don't think anyone really takes the \"How to Prevent Rape\" lists in a very serious context, because they're not meant to teach horrible people not to do those things. They are meant to provide a social commentary on a prevalent culture of victim blaming, where the safety of a woman entirely rests in her hands, and if somehow she gets raped, she has failed herself. They are meant to mock the excessive lists that show steps that women can take to protect themselves. \n\nAnd I don't want to attack anyone's circumstances or beliefs, but there's this notion that rape only happens at night, when a woman is walking alone. There is a notion that rape only happens when the person who raped you is a stranger. In fact, those kinds of attacks make up a much smaller percentage than people think. \n\nThere are so so many scenarios and ways in which a violent attack can play out. What is the rapist has a weapon? I'm not going to go and pepper spray someone who can shoot me. What if you get knocked out? What if you freeze up in fear? What if your attacker is a close person that you trust? What if the attack happens in the middle of the day, with people nearby? What if you scream out and nobody comes to help? What if you withdraw your consent in the middle of the act, but the attacker doesn't stop? Where is the nice pamphlet that shows how you can protect yourselves in those circumstances? \n\nNo one willingly puts themselves in dangerous situations. Advice like \"Don't go out at night\" is not only a bit redundant, but it leads women to believe that the attack was their fault.  Lots of people willingly get completely falling-on-their-ass drunk with people they don't know, and then get raped and can't even remember what happened, let alone fight back while it's happening.\n\nAre you really going to not tell people \"Don't get shit-faced with strangers\" because if they end up getting raped they'll feel like it's their fault? Do you not tell people to buckle their seat belt, because then if they get hurt in an accident they'll feel like it's their fault? Yes, we shouldn't deny that getting shit-faced drunk with strangers is a risky choice, for multiple reasons. Getting shit-faced drunk with friends doesn't seem very safe either. People do stupid things when they are drunk. How many women have been abandoned in unsafe situations by their drunk friends? How many women have been raped at a house party by a supposed \"friend?\" People make risky choices and getting drunk really ups your chance of being raped. \n\nI am sad for those who had this happen to them, I know they may see this as victim-blaming, but cautionary tales have a purpose and may help someone new avoid the same terrible experience. First of all, I don't think anyone really takes the \"How to Prevent Rape\" lists in a very serious context, because they're not meant to teach horrible people not to do those things. They are meant to provide a social commentary on a prevalent culture of victim blaming, where the safety of a woman entirely rests in her hands, and if somehow she gets raped, she has failed herself. They are meant to mock the excessive lists that show steps that women can take to protect themselves. \n\nAnd I don't want to attack anyone's circumstances or beliefs, but there's this notion that rape only happens at night, when a woman is walking alone. There is a notion that rape only happens when the person who raped you is a stranger. In fact, those kinds of attacks make up a much smaller percentage than people think. \n\nThere are so so many scenarios and ways in which a violent attack can play out. What is the rapist has a weapon? I'm not going to go and pepper spray someone who can shoot me. What if you get knocked out? What if you freeze up in fear? What if your attacker is a close person that you trust? What if the attack happens in the middle of the day, with people nearby? What if you scream out and nobody comes to help? What if you withdraw your consent in the middle of the act, but the attacker doesn't stop? Where is the nice pamphlet that shows how you can protect yourselves in those circumstances? \n\nNo one willingly puts themselves in dangerous situations. Advice like \"Don't go out at night\" is not only a bit redundant, but it leads women to believe that the attack was their fault.  &gt;There are so so many scenarios and ways in which a violent attack can play out. What is the rapist has a weapon? I'm not going to go and pepper spray someone who can shoot me. What if you get knocked out? What if you freeze up in fear? What if your attacker is a close person that you trust? What if the attack happens in the middle of the day, with people nearby? What if you scream out and nobody comes to help? What if you withdraw your consent in the middle of the act, but the attacker doesn't stop? Where is the nice pamphlet that shows how you can protect yourselves in those circumstances?\n\nSo because we can't protect ourselves from rape in all circumstances we shouldn't take ANY steps to protect ourselves?  I think it's more the idea that if a woman fails to do one of those basic things to help protect herself and ends up being raped she is somehow at least partially responsible for being victimized because she didn't do that thing that EVERYONE knows would have protected her. I'm not so naive as to go prancing around dark alleys with headphones in my ears; I actively try to keep myself safe by walking with friends, staying alert, and keeping to well lit, populated areas, but it's certainly happened before where I've found myself walking alone at night due to circumstances beyond my control. If something were to happen to me, it would still be IN NO WAY MY FAULT. \n\nI feel like it's kind of insulting to me to reiterate basic safety advice that has been drilled into me my whole life and is frankly just plain common sense.\n\nThe reason that \"safety advice\" is often construed as victim blaming is because it is often presented as though it's a fool proof way of protecting yourself from sexual assault without taking into consideration that the vast majority of sex crimes are perpetrated by someone we know and trust. It gives women the idea that if they end up being raped it is somehow their fault because we've all been taught our whole lives the actions we should take to keep ourselves safe. \n\nPeople often compare this sort of safety advice with things like \"If you walk through a bad part of town covered in bling and fanning yourself with a wad of cash, you're making yourself a target. It's just common sense to put your jewelry under your clothes and your wallet in your pocket.\" The reality is most rapes are more comparable to inviting a friend into your home and having them rob you blind. If people treated that advice to help prevent muggings the way they do advice to \"keep you from being raped\" you'd start having victims of theft rationalizing it to themselves: \"well I shouldn't have invited him into my home in the first place,\" \"I gave him some money once in the past so of course he thought it was ok to just come in and help himself to more,\" \"it's my fault for just having all my nice stuff out where he could see it, he couldn't help himself,\" and \"it's not really theft, everyone knows theft happens on the street at gunpoint.\" When that starts to happen, victims stop reporting the crime, which leaves more perpetrators on the street who are then able to become repeat offenders as well as giving others the idea that it's not a big deal to do the same thing. It's not like they're going to get in trouble or anything, and really it's not even theft if they're taking from somebody they know and not threatening bodily harm.\n\nKind of went on a rant there...\nTL;DR: It's not that the advice itself is bad, but it trivializes the many other types of rape by giving people the impression that women have the power to prevent rape through their actions alone. But to address the actual vast majority of sexual violence and rapes; the ones perpetrated by persons known and trusted by the victim - better advice is to encourage people not to drink around friends or strangers whom they don't absolutely trust, in part because of the shocking percentage of sexual assaults in which either one or both parties were intoxicated to some degree. \n\nThis is certainly not something that is advised after something has happened, but is likely more effective advice than any \"rape safety\" advice which would be directed at the random street attack. \n\nI think it should be entirely possible to teach people both that it is *always* the rapist's fault for what has happened, *and* that there are ways to take an active role in defining one's personal safety.  But to address the actual vast majority of sexual violence and rapes; the ones perpetrated by persons known and trusted by the victim - better advice is to encourage people not to drink around friends or strangers whom they don't absolutely trust, in part because of the shocking percentage of sexual assaults in which either one or both parties were intoxicated to some degree. \n\nThis is certainly not something that is advised after something has happened, but is likely more effective advice than any \"rape safety\" advice which would be directed at the random street attack. \n\nI think it should be entirely possible to teach people both that it is *always* the rapist's fault for what has happened, *and* that there are ways to take an active role in defining one's personal safety.  But even taking an active role does not stop rape or guarantee personal safety. You can never drink a drop of alcohol and still be raped.\n\nYes, alcohol is a factor in some assaults (and for many reasons), an even more shocking number, in fact all of them!!, include a person sexually assaulting another person. That is the common denominator.\n\nFor all this talk we hear about how women should take steps to protect themselves, people continue to be raped every minute of every day. And relatively speaking, very little attention is paid to working to address why rape continues to occur or the root causes (like the commonly held sexual attitudes towards women).\n\nHowever, as you said, I agree there is a time and a place. I think the consensus that it's all about tone and timing applies.  You know what I'm a little tired of...people misunderstanding the entire idea behind \"teach rapists not to rape.\" Too many people are missing the point, including you. That phrase is a satirical reference to the very real issue of many, many people not understanding the concept of *consent* - both victims and perpetrators. Because I can't really explain it better than it's been explained before, here's a [link](http://yesmeansyesblog.wordpress.com/2009/11/12/meet-the-predators//) to an article that should help you understand why \"precautions\", though they have POTENTIAL to help you, can very, very quickly become a hindsight bias. Also, you can't possibly quantify the efficacy of any one piece of advice. If you look at at actual statistics and actual descriptions, you basically have to be hypervigilant as a woman *all the time*. \n\nEdit: I read your comment on what you learned through your experience, and the advice that you give is absolutely what people need to hear. But just understand that the campaigns \"aimed at rapists\" are not at all implying that disturbed sociopaths need to be kindly asked to stop raping. \n\nI am sorry that you had to go through that experience. One thing I'd like to highlight is the importance of victims themselves being able to speak up and speak out. I'm sure many people would be able to relate to you, or take your experience as a lesson learned for themselves. \n You know what I'm a little tired of...people misunderstanding the entire idea behind \"teach rapists not to rape.\" Too many people are missing the point, including you. That phrase is a satirical reference to the very real issue of many, many people not understanding the concept of *consent* - both victims and perpetrators. Because I can't really explain it better than it's been explained before, here's a [link](http://yesmeansyesblog.wordpress.com/2009/11/12/meet-the-predators//) to an article that should help you understand why \"precautions\", though they have POTENTIAL to help you, can very, very quickly become a hindsight bias. Also, you can't possibly quantify the efficacy of any one piece of advice. If you look at at actual statistics and actual descriptions, you basically have to be hypervigilant as a woman *all the time*. \n\nEdit: I read your comment on what you learned through your experience, and the advice that you give is absolutely what people need to hear. But just understand that the campaigns \"aimed at rapists\" are not at all implying that disturbed sociopaths need to be kindly asked to stop raping. \n\nI am sorry that you had to go through that experience. One thing I'd like to highlight is the importance of victims themselves being able to speak up and speak out. I'm sure many people would be able to relate to you, or take your experience as a lesson learned for themselves. \n  &gt;Rapists are rapists for a reason. They're not good, reasonable people.\n\nMy rapist was my boyfriend. We'd been together for three and a bit years. I would have called him a good person. In fact, I also would have called him reasonable.  It happened once. Not because I ended it. We were together for almost two more years. I didn't even view it as rape until a year after we broke up.\n\nOne of the reasons I didn't get that it was rape was because of the mental image of a rapist - the stranger in the park. \n\nI *couldn't* have prevented my rape. And unless I never ever spend a single second alone with a man, there is no way for me to guarantee that doesn't happen again. I was betrayed by someone I loved. The only way of preventing that kind of rape from happening is for people to not rape other people.\n\nNow, I'm not saying I'm not careful when I'm out alone at night. I'm saying most rapists are people you know. Preventing those rapes have nothing to do with being in a bad area of town. But historically, the prevention advice has been directed that way. \n\nThat's why it's upsetting for me to listen to people telling me to walk home with a friend, or whatever else they say is going to help me not get raped. It happened in my home, in my *bed*, and by someone who was meant to keep me safe. No one is saying that *all* rapes are preventable. \n\nBut then, *no* crime is 100% preventable - that doesn't mean that we're *completely* powerless, nor that we should just fold our hands in our laps and hope for the best. \n\nSaying that there are steps we can take to minimize (note: I did not say \"eliminate\") risk is *much* more empowering than saying \"welp, nothing I can do about this.\" I'm not even remotely saying that all the advice out there is worthwhile, but let's not throw out the baby with the bathwater.\n\nLook at it this way: house fires happen for any number of reasons; some of them can be prevented or minimized, and some are completely beyond your control. So what do you do? Do you get a loose outlet fixed, do you make sure to turn off your stove, do you avoid overloading outlets, do you burn candles well away from flammables? You can still have a house fire if you take all those precautions - does that mean you shouldn't bother to take them, or to get upset when other people mention them? I'm not saying it's bad advice, I'm saying it's advice directed towards a *minority* of incidents. \n\nTo follow your metaphor (even though I think it's slightly flawed) it would be like telling homeowners to be careful to make sure their phone doesn't set their pillow on fire and giving this as the *main advice* in preventing fires. Sure, it may have happened, but if the myth is spread that this is the best way of preventing it, it suggests that that is the definition of a house fire, even though most fires were probably caused by other things. It's not a myth that taking precautions helps, like watching your surroundings and avoiding being alone in places where you can easily be grabbed.  The fact that most rapes are committed in other scenarios is at least partially due to the fact that women have collectively made it more difficult for strangers to commit rape by taking these precautions.\nFor example, we know of many instances of women practicing the buddy system figuring out that a buddy's drink was drugged and being there to prevent the woman from being further violated. No one is saying that *all* rapes are preventable. \n\nBut then, *no* crime is 100% preventable - that doesn't mean that we're *completely* powerless, nor that we should just fold our hands in our laps and hope for the best. \n\nSaying that there are steps we can take to minimize (note: I did not say \"eliminate\") risk is *much* more empowering than saying \"welp, nothing I can do about this.\" I'm not even remotely saying that all the advice out there is worthwhile, but let's not throw out the baby with the bathwater.\n\nLook at it this way: house fires happen for any number of reasons; some of them can be prevented or minimized, and some are completely beyond your control. So what do you do? Do you get a loose outlet fixed, do you make sure to turn off your stove, do you avoid overloading outlets, do you burn candles well away from flammables? You can still have a house fire if you take all those precautions - does that mean you shouldn't bother to take them, or to get upset when other people mention them?   THANK YOU! I was kicked out of SRS for telling women to be aware of their surroundings. Since when is that victim blaming? That's just common sense to me. Bunch of hypocrites.  People forget that this advice was far more valid...even as little as 10 to 15 years ago! We are now safer walking alone at night because most women are smart enough to either have a phone in hand, mace, buddy system, whatever your strategy.\n\nI think of it this way, just because most of society knows how to do simple addition does that mean we should stop teaching it and stop talking about it? No! Then we'd lose all progress we'd made.  It's interesting that OP has only given one (rather useless) bit of 'advice' for avoiding rape (which, as a poor woman living in a city, is not something I would ever be able to follow all the time).What OP has ignored in her posts is that, in order to \"avoid rape\", women would actually have to avoid relationships, dates out with new guys, would have to spend a shit tonne of money getting taxis between 2 streets just in case they get raped in one of them, maybe should avoid the taxi because - you guessed it - in cities some rapists drive taxis... the list is exhaustive.  Like she said, rapists are bad, manipulative people.  Does she think we're not looking out for these people ALREADY?  This is so patronising.  Rapists are most commonly partners, husbands, and guys that we go on dates with.  There is no hard and fast way to spot them.  Most of them are multiple rapists and we should be focusing on changing the system that stops us from acknowledging or reporting rape, rather than giving women 'advice' that is unlikely to work in any case.  The key to stopping date rape, for example, is removing date rapists from the streets and teaching our children that it's not okay to 'take advantage' of 'sluts' and drunk girls.  OP would suggest, I'm guessing, that instead we ask women to 'be careful' about how much they drink; but again, we already tell them this!  We tell everyone this!  We have ads about drinking responsibly on every channel.\n\nWhat interesting is that there is no other crime where this 'advice' is paralleled, and the end result of women following this 'advice' is that we live in fear constantly.  Women are already hyper-aware of their vulnerability because of their gender; read some Elizabeth Stanko and see that you don't need to educate them about safety.  This really really aggravates me. It's interesting that OP has only given one (rather useless) bit of 'advice' for avoiding rape (which, as a poor woman living in a city, is not something I would ever be able to follow all the time).What OP has ignored in her posts is that, in order to \"avoid rape\", women would actually have to avoid relationships, dates out with new guys, would have to spend a shit tonne of money getting taxis between 2 streets just in case they get raped in one of them, maybe should avoid the taxi because - you guessed it - in cities some rapists drive taxis... the list is exhaustive.  Like she said, rapists are bad, manipulative people.  Does she think we're not looking out for these people ALREADY?  This is so patronising.  Rapists are most commonly partners, husbands, and guys that we go on dates with.  There is no hard and fast way to spot them.  Most of them are multiple rapists and we should be focusing on changing the system that stops us from acknowledging or reporting rape, rather than giving women 'advice' that is unlikely to work in any case.  The key to stopping date rape, for example, is removing date rapists from the streets and teaching our children that it's not okay to 'take advantage' of 'sluts' and drunk girls.  OP would suggest, I'm guessing, that instead we ask women to 'be careful' about how much they drink; but again, we already tell them this!  We tell everyone this!  We have ads about drinking responsibly on every channel.\n\nWhat interesting is that there is no other crime where this 'advice' is paralleled, and the end result of women following this 'advice' is that we live in fear constantly.  Women are already hyper-aware of their vulnerability because of their gender; read some Elizabeth Stanko and see that you don't need to educate them about safety.  This really really aggravates me. It's interesting that OP has only given one (rather useless) bit of 'advice' for avoiding rape (which, as a poor woman living in a city, is not something I would ever be able to follow all the time).What OP has ignored in her posts is that, in order to \"avoid rape\", women would actually have to avoid relationships, dates out with new guys, would have to spend a shit tonne of money getting taxis between 2 streets just in case they get raped in one of them, maybe should avoid the taxi because - you guessed it - in cities some rapists drive taxis... the list is exhaustive.  Like she said, rapists are bad, manipulative people.  Does she think we're not looking out for these people ALREADY?  This is so patronising.  Rapists are most commonly partners, husbands, and guys that we go on dates with.  There is no hard and fast way to spot them.  Most of them are multiple rapists and we should be focusing on changing the system that stops us from acknowledging or reporting rape, rather than giving women 'advice' that is unlikely to work in any case.  The key to stopping date rape, for example, is removing date rapists from the streets and teaching our children that it's not okay to 'take advantage' of 'sluts' and drunk girls.  OP would suggest, I'm guessing, that instead we ask women to 'be careful' about how much they drink; but again, we already tell them this!  We tell everyone this!  We have ads about drinking responsibly on every channel.\n\nWhat interesting is that there is no other crime where this 'advice' is paralleled, and the end result of women following this 'advice' is that we live in fear constantly.  Women are already hyper-aware of their vulnerability because of their gender; read some Elizabeth Stanko and see that you don't need to educate them about safety.  This really really aggravates me. &gt; Like she said, rapists are bad, manipulative people. Does she think we're not looking out for these people ALREADY? This is so patronising.\n\nThe fact that YOU know who to look out for doesn't mean that everyone does. I was raped by my first relationship. I didn't know that his level of sexual aggression wasn't normal. \n\n&gt;What interesting is that there is no other crime where this 'advice' is paralleled\n\nYeah, except for kidnapping, mugging, robbery, carjacking, and basically every other victim crime.  But sexual aggression in men, even abnormal levels, does not mean they are rapists, and in a lot of scenarios it would not be possible to use that factor (on it's own) to decide that you were at risk.  I also really hope that you don't blame yourself for being raped by your first partner; it's not as simple as 'just leaving', as I'm sure you know, even if you were aware that things were not normal.  Even if you were aware that his behaviour was scary and you were terrified it might happen, that still doesn't mean you would have left.  I agree that controlling and manipulative behaviour should be taught to women as 'red flags', but again, although a lot of women know this is doesn't actually help them to avoid abusive r/ships because abusers often know how to get what they want.   \n\nAnyway, back to SA.  Basically, rapists come from all classes and backgrounds and displays hundreds of different approaches to rape; giving women a checklist of things they should looks out for is problematic because there is no consistent list of these things, and as I said, women will end of not feeling comfortable in a host of scenarios for fear of rape (as, illustrated here, they already do).\n\nWhat I meant by that last point is there is no other crime where people are asked to completely change the way that act and move about public space.  For example, carjacking.  When did someone last tell you you shouldn't drive because you might get carjacked?  Or you should stay off quiet roads?  In regards to mugging and robbery - yes, there are things like keeping your valuables out of sight and locking you doors, but these are actually direct physical measure to stopping the robber/mugger from getting at your stuff.  These measures are more comparable to women taking self-defence classes or carrying pepper spray, not avoiding certain places and roads (often not possible), judging men on the basis of certain characteristics that might make them a rapist, changing the way they dress and limiting their enjoyment of alcohol and public spaces.  Can you see that these things are not the same?  \n\nFinally, a lot of people are simply missing the point.  We know from comparing rape in South Africa and in war-torn countries, to rape in countries like the US and UK, that actually, sexual violence is often controlled not by possible victims, but by social discourse around gender and sexuality, and the legitimisation and encouragement of male aggression and violence.  This is so robustly supported that it is used as a cornerstone of all United Nations policies on sexual violence.  So yeah... telling a woman to 'avoid' certain people and places, whilst futile, is also not going to change things unless society changes.\n\n &gt; Like she said, rapists are bad, manipulative people. Does she think we're not looking out for these people ALREADY? This is so patronising.\n\nThe fact that YOU know who to look out for doesn't mean that everyone does. I was raped by my first relationship. I didn't know that his level of sexual aggression wasn't normal. \n\n&gt;What interesting is that there is no other crime where this 'advice' is paralleled\n\nYeah, except for kidnapping, mugging, robbery, carjacking, and basically every other victim crime.  &gt; Like she said, rapists are bad, manipulative people. Does she think we're not looking out for these people ALREADY? This is so patronising.\n\nThe fact that YOU know who to look out for doesn't mean that everyone does. I was raped by my first relationship. I didn't know that his level of sexual aggression wasn't normal. \n\n&gt;What interesting is that there is no other crime where this 'advice' is paralleled\n\nYeah, except for kidnapping, mugging, robbery, carjacking, and basically every other victim crime.     Maybe drop the walking alone part and talk about this:\n&gt; I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves.\n\nThat's the part people need to hear IMO. Maybe drop the walking alone part and talk about this:\n&gt; I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves.\n\nThat's the part people need to hear IMO. Maybe drop the walking alone part and talk about this:\n&gt; I want girls to know to watch out for red flags in a partner like getting angry when denied sex, or drinking excessively to the point of becoming aggressive, and knowing what resources they have to protect themselves.\n\nThat's the part people need to hear IMO. I don't think I should drop it. \n\nI live in one of the biggest cities in the US. One of the biggest malls in our city is located on arguable the most dangerous street in the city. When one of my friends moved to town recently for college, I told her to avoid that mall area at night because it's a bad area and really not safe. Our mutual friend, a male, said 'gee, I thought you'd be above victim-blaming\". And this isn't new. Read any post on reddit about \"avoiding walking there alone at night\" and you'll see the person who said it get attacked for it.  I don't think I should drop it. \n\nI live in one of the biggest cities in the US. One of the biggest malls in our city is located on arguable the most dangerous street in the city. When one of my friends moved to town recently for college, I told her to avoid that mall area at night because it's a bad area and really not safe. Our mutual friend, a male, said 'gee, I thought you'd be above victim-blaming\". And this isn't new. Read any post on reddit about \"avoiding walking there alone at night\" and you'll see the person who said it get attacked for it.  Think about this for a minute. You're telling a story about being told you were victim blaming. You said a friend moved to your city and you warned her about not walking in a certain neighbourhood, which your male friend who was present called victim blaming. You think this advice is perfectly reasonable, because it will reduce the risk of something bad happening to her. Which is understandable. \n\nWhat's really ironic about your story, and PERFECTLY illustrates the point being made by a LOT of people in this thread, is that statistically, to reduce your friend's risk of rape as much as possible, your advice **should have been** to avoid being alone with your male friend, and not to take a ride home with him when out, and not to ever accept a drink from him unless she sees it being poured. Because statistically, as a friend, she's **significantly** more likely to get raped by him than by a stranger in an alleyway.\n\nYou however are incapable of seeing this because he's your friend and you therefore don't see him as a threat, you trust him. And in real life, this man, your friend who you trust implicitly and would never dream of making sure you can SEE a drink he gets you from where it's poured right to your hand? This man is the one who's likely to be the perpetrator of an attack against you or your friend.\n\nSo when people are getting angry at the same old tired advice about not walking in dark alleys, and watching what you're wearing (even though *actual* stranger rapists couldn't care less what you're wearing), it's because figuring out whether your friend is a rapist or not is almost impossible until and unless he rapes one of you. So the only way to completely avoid being raped is to avoid being alone with any man ever. \n\nPersonally I'm not willing to consider men like that. I know several men that I like and trust implicitly, and I'm willing to take the risk that I might be wrong in order to be able to have meaningful relationships with them. But I also won't blame myself if I get raped. And I don't believe the tiny increase in safety I'll get from never leaving my house after dark is worth the fear that is engendered by those lists of stupid, tired, pointless lists of \"here's how to not get raped\". \n\nI understand that you're saying you don't mean that advice, you mean what's wrong with teaching young women to recognise warning signs of abusers. I think that's a great idea. Except that idea is NEVER what people are told when they're being given advice. ALL the advice given is how to avoid stranger rape, which represents a tiny fraction of actual rape. If advice re: rape was along these lines - 50% teaching young men and women about how consent works (including the fact that they are not entitled to sexual activity so YES getting actual verbal consent is necessary), 30% about how to have healthy relationships and notice the warning signs of abuse, and 10% how sexual assault affects victims, and 10% safety tips about how to avoid stranger rape, then I would consider that a reasonable curriculum and not victim blaming. The current model of 100% telling women how to avoid stranger rape and behaving as if that will stop all rapes from happening, is just shit, and perpetuates the idea that most rapes happen this way and that it's in some way your fault if you do get raped. ESPECIALLY if you WERE in a poor neighbourhood at night, and regardless of your reason for being there.\n\nTL:DR - It's not the specific giving of advice that's the problem, it's our whole model of approaching sexual assault and consent that needs to change. Starting with educating people ACCURATELY about what situations they are likely to get raped in. Continually telling women not to walk alone at night or in dark alleys is like if ALL road safety information was about avoiding getting in cars with drunk drivers, while all the time every single driver was going around without a seat belt on. YES, technically that advice may reduce your chances of being in an accident, but it's ignoring a MUCH bigger problem that is FAR more likely to get you killed.       I don't think I should drop it. \n\nI live in one of the biggest cities in the US. One of the biggest malls in our city is located on arguable the most dangerous street in the city. When one of my friends moved to town recently for college, I told her to avoid that mall area at night because it's a bad area and really not safe. Our mutual friend, a male, said 'gee, I thought you'd be above victim-blaming\". And this isn't new. Read any post on reddit about \"avoiding walking there alone at night\" and you'll see the person who said it get attacked for it.   I agree completely. In an ideal world, bad things would never happen to people. We don't live in an ideal world though. \n\nWe shouldn't *have* to worry about safety when walking alone at night, but the fact is there is a danger in it, and because of that, it as a best naive, and at worse grossly negligent to tell somebody that they shouldn't try to be safe solely because it isn't their fault if anything happens. It is true that it isn't their fault, but an individual has very little power of what a rapist is going to do. There is a distinction to be made. I think it is fine to give guidelines on general safety, but not on personal things.\n\nAdvice like \"Don't travel alone at night in dangerous neighborhoods\" is fine. Advice like \"Don't wear skimpy clothes\" is not.  \n\nI'm hesitant to use analogies when discussing things of such serious nature, but I feel that in this case this analogy fits fairly well:\n\nWhen I cross a street at a stoplight, even though the pedestrian light shows the 'go' man, I look both ways before crossing, because even though I was clearly entitled to cross the street safely, I am not going to make assumptions that just because I should be able to cross the street safely that a car isn't going to burn a red light and hit me, because they have no regard for the law. I have very little power over what a driver is going to do. In fact, no power at all, it is entirely up to them if they decide to burn that red light. \n\nShould we have to look both ways when crossing the street? No. But it isn't bad advice to do so. While I do agree with you in general and personally take precautions and encourage others to do so as well... there is a slight fear mongering and misplaced attention to safety here. \n\nFirstly, men are more likely to end up as victims of violence when outisde. Yet, this is almost never discussed and there does not seem to be a common gender based fear of going outside alone among guys. However, studies have shown that a substantial number of women are afraid of going out after dark  (and this is in Sweden, where it gets dark around 3-4pm during winter times!) that is not set in relation to the likelihood of something happening. \n\nSecond, stranger-in-the-bush type of rape is not currently the most likely type of rape. In other words, you are installing shit ton of alarms, double looks and bullet proof glass on your windows but never mind locking the door. Especially, when going out at odd hours can be quite a difficult thing to avoid in real life. That would mean that you, as a woman, can not accept shift work jobs or can't have a dog because both of those things require being out from your home at dark.  But the \"don't walk alone at night\" is just one example. Another is ''use the buddy system at parties and don't go home with someone you don't know\" \n\nNo one is saying \"girls who go home with guys they don't know and get raped deserved it\"\n\nthey're saying \"be careful, if you don't know someone, don't trust them fully\"  But the \"don't walk alone at night\" is just one example. Another is ''use the buddy system at parties and don't go home with someone you don't know\" \n\nNo one is saying \"girls who go home with guys they don't know and get raped deserved it\"\n\nthey're saying \"be careful, if you don't know someone, don't trust them fully\"  But the \"don't walk alone at night\" is just one example. Another is ''use the buddy system at parties and don't go home with someone you don't know\" \n\nNo one is saying \"girls who go home with guys they don't know and get raped deserved it\"\n\nthey're saying \"be careful, if you don't know someone, don't trust them fully\"  This is actually really, really simple. Let's list all the situations on which people are \"likely\" to be raped and advise them to avoid those situations. I'll start and you can add to the list if you like.\n\nPeople have been raped drinking, sober, drinking with strangers, drinking with friends, walking home at night, walking to work, at work, at home, in alleys, in church, in war zones, at playgrounds, in fields, in barns, at concerts, in movie theatres, at school, etc, etc.\n\nSo the best rape prevention advice would be to simply stay at home, and never interact with anyone who might rape you, which could be anyone, so perhaps it's just better to avoid people all together. See, this sort of attitude is incredibly unhelpful. \n\nDo you really believe that there is **nothing** you can do to minimize risks of rape? That a person who takes self-defense classes has *no* advantages over one who doesn't? What a person who watches her (or his) drink is not even one iota safer than one who leaves it sitting on the counter for ten minutes while she uses the restroom? That a person who can recognize early signs of abusive or aggressive behavior is just as likely to end up in a bad situation as one who is completely oblivious?\n\nYou may not like *all* advice - and that's valid. You may believe that not all rapes are preventable, and you'd be right. But do you really believe that there is **nothing at all** a person can do that will make **the slightest bit of difference whatsoever**? Because that's what it sounds like to me, and if you think that's somehow empowering, wellllll.... let's just say I disagree. See, this sort of attitude is incredibly unhelpful. \n\nDo you really believe that there is **nothing** you can do to minimize risks of rape? That a person who takes self-defense classes has *no* advantages over one who doesn't? What a person who watches her (or his) drink is not even one iota safer than one who leaves it sitting on the counter for ten minutes while she uses the restroom? That a person who can recognize early signs of abusive or aggressive behavior is just as likely to end up in a bad situation as one who is completely oblivious?\n\nYou may not like *all* advice - and that's valid. You may believe that not all rapes are preventable, and you'd be right. But do you really believe that there is **nothing at all** a person can do that will make **the slightest bit of difference whatsoever**? Because that's what it sounds like to me, and if you think that's somehow empowering, wellllll.... let's just say I disagree. Which of those things you listed do you think people really need to be told? This is actually really, really simple. Let's list all the situations on which people are \"likely\" to be raped and advise them to avoid those situations. I'll start and you can add to the list if you like.\n\nPeople have been raped drinking, sober, drinking with strangers, drinking with friends, walking home at night, walking to work, at work, at home, in alleys, in church, in war zones, at playgrounds, in fields, in barns, at concerts, in movie theatres, at school, etc, etc.\n\nSo the best rape prevention advice would be to simply stay at home, and never interact with anyone who might rape you, which could be anyone, so perhaps it's just better to avoid people all together. But this attitude suggests that women have no hope of discerning which circumstances are more risky than others, and I don't buy that. This is actually really, really simple. Let's list all the situations on which people are \"likely\" to be raped and advise them to avoid those situations. I'll start and you can add to the list if you like.\n\nPeople have been raped drinking, sober, drinking with strangers, drinking with friends, walking home at night, walking to work, at work, at home, in alleys, in church, in war zones, at playgrounds, in fields, in barns, at concerts, in movie theatres, at school, etc, etc.\n\nSo the best rape prevention advice would be to simply stay at home, and never interact with anyone who might rape you, which could be anyone, so perhaps it's just better to avoid people all together. This is *exactly* the problem. And also, sadly, there are women who have been at home, behind locked doors, and possibly even with their husband / family at home. And they *still* got raped when someone with a gun broke in.     I think the point is that limiting yourself too much because of the risk of getting raped is also letting into a world where women should live in fear. I also don't like when people call it stupid or reckless to go on dates with strangers, or have one night stands. I've done both things but I prioritize my own freedom over having 100% safety. I've also been raped, by boyfriends.     Jesus, I feel exhausted for the OP trying to slog through all this political correctness. I fully expect to be downvoted, but it seems unnecessary to pick this person apart so much. Welcome to 2XC, where your opinion is always respected and valued. \n\nUnless you don't fall into perfect lock-step with the prevailing opinion, in which case you're obviously an oppressed and oppressive victim-slash-perpetrator of patriarchal society. Oh, but we're *nothing like* the rest of Reddit!!\n\nI should seriously know to stay away from this subject by now. There are already certain topics I avoid to keep my blood pressure down - this is just one more.  There is no \"safe\" place, time, or manner of dress.  Rape happens in all sorts of circumstances.  Lots of rapes happen and are committed by people the victim knows and is close with.  Rapes happen to people no matter how they're dressed, no matter where they are.  You cannot preach an avoidance technique that could possibly encompass all the situations in which someone could (and has, historically) experience rape.  \n\n\nFrom this article: http://www.shakesville.com/2011/06/this-is-so-worst-thing-youre-going-to_02.html\n\n\"For what is probably the hundredth time: Left to my own devices, I never would have been raped. The rapist was really the key component to the whole thing. I was sober; hardly scantily clad, I was wearing sweatpants and an oversized t-shirt; I was at home; my sexual history was, literally, nonexistent—I was a virgin; I struggled; I said no. There have been times since when I have been walking home, alone, after a few drinks, wearing something that might have shown a bit of leg or cleavage, and I wasn't raped. The difference was not in what I was doing. The difference was the presence of a rapist.\"  Limit yourself to two alcoholic drinks during any evening is the best advice I was ever given. It is not victim blaming to take steps to protect yourself and getting drunk anywhere is not wise. Anytime I bring this up I get pilloried for victim blaming.\n\nI had a friend who worked as a bouncer in a bar and he said there were always guys claiming they knew the drunk girls and would be happy to give them a ride home. Many rapists are simply opportunists.\n\nHow many rapes do we hear of that occurred upstairs at a party where people had too much to drink.\n\nThe actual incidence of date-rape drug use is very small. What really is happening is women are getting drunk, raped and then think they must have been drugged. Well, they were. Alcohol is a drug.\n\nOK, commence telling me I am victim-blaming. I agree with OP. People don't want to hear reality and the reality is that if you are drunk your chances of being raped go up dramatically. Limit yourself to two alcoholic drinks during any evening is the best advice I was ever given. It is not victim blaming to take steps to protect yourself and getting drunk anywhere is not wise. Anytime I bring this up I get pilloried for victim blaming.\n\nI had a friend who worked as a bouncer in a bar and he said there were always guys claiming they knew the drunk girls and would be happy to give them a ride home. Many rapists are simply opportunists.\n\nHow many rapes do we hear of that occurred upstairs at a party where people had too much to drink.\n\nThe actual incidence of date-rape drug use is very small. What really is happening is women are getting drunk, raped and then think they must have been drugged. Well, they were. Alcohol is a drug.\n\nOK, commence telling me I am victim-blaming. I agree with OP. People don't want to hear reality and the reality is that if you are drunk your chances of being raped go up dramatically.                   It's not victim blaming if there's not a victim yet. If there is one, that's where such preventative advice seems like blame.       i agree, i find it strange that the very people who claim to want more power for women are the ones who tend to say that there's nothing the victim can do, effectively stripping the victim of any power or control over their lives.\n\nsure, there are things that are out of your control, but to put all your eggs into the \"stop the rapist\" basket isn't the smartest thing to do. in fact i'd say it's irresponsible and unrealistic.  I am shocked at the number of attacks I see in the comments here. OP, you are doing anything but blaming the victims. I'm sorry people aren't fully reading or comprehending your post. If they had done so before throwing up their battle armor, they would know you\n\nA) are in no way implying that the women should be scolded after the fact\nB) used walking at night as ONE example because its the easiest to understand, not because you assume all rapes could be prevented just by avoiding alleyways\nC) understand, FIRST HAND, the complexities of rape, and know that no one measure of prevention is going to stop a woman from being raped\nD) know, and make sure your girls know, that the blame for any rape lies on the rapist, not the victim, but acknowledge that women, unfortunately, cannot afford to be completely trusting of strangers or oblivious to their surroundings. \n\nI will probably be ridiculed for making this analogy, but I see it like this: I am a very good driver. I don't speed or text, I use my turn signals, I know what signs mean, and I know where I'm going before I get on the road. Despite all of that, I know there are horrible drivers out there. So I wear my seatbelt, I bought a car with airbags, I check my mirrors constantly so I know what's going on around me. I avoid certain highways at rush hour. If a car in front of me is driving poorly, I give it space, and if it's driving erratically, I call the police. NONE of this guarantees that I will never be crashed into, and I am fully aware that if a car does crash into me, there's nothing I could (or SHOULD) have done to prevent it. Because ultimately it was the other driver's fault for drinking or not paying attention or speeding or following too closely or WHATEVER. \n\nAnyway, OP, I'm sorry you're being attacked, and I'm so sorry for your rape. Thank you for teaching your girls ways to protect themselves in a world that doesn't. \n I am shocked at the number of attacks I see in the comments here. OP, you are doing anything but blaming the victims. I'm sorry people aren't fully reading or comprehending your post. If they had done so before throwing up their battle armor, they would know you\n\nA) are in no way implying that the women should be scolded after the fact\nB) used walking at night as ONE example because its the easiest to understand, not because you assume all rapes could be prevented just by avoiding alleyways\nC) understand, FIRST HAND, the complexities of rape, and know that no one measure of prevention is going to stop a woman from being raped\nD) know, and make sure your girls know, that the blame for any rape lies on the rapist, not the victim, but acknowledge that women, unfortunately, cannot afford to be completely trusting of strangers or oblivious to their surroundings. \n\nI will probably be ridiculed for making this analogy, but I see it like this: I am a very good driver. I don't speed or text, I use my turn signals, I know what signs mean, and I know where I'm going before I get on the road. Despite all of that, I know there are horrible drivers out there. So I wear my seatbelt, I bought a car with airbags, I check my mirrors constantly so I know what's going on around me. I avoid certain highways at rush hour. If a car in front of me is driving poorly, I give it space, and if it's driving erratically, I call the police. NONE of this guarantees that I will never be crashed into, and I am fully aware that if a car does crash into me, there's nothing I could (or SHOULD) have done to prevent it. Because ultimately it was the other driver's fault for drinking or not paying attention or speeding or following too closely or WHATEVER. \n\nAnyway, OP, I'm sorry you're being attacked, and I'm so sorry for your rape. Thank you for teaching your girls ways to protect themselves in a world that doesn't. \n O_O what??? being \"irresponsible\" and texting/speeding while driving is in no way comparable to 'walking alone' or wearing 'revealing' clothing. equating my potential to cause damage to other people [pedestrians, other motorists] to being \"irresponsible\" enough to wear a minidress while walking to a party at night is ....appalling. O_O what??? being \"irresponsible\" and texting/speeding while driving is in no way comparable to 'walking alone' or wearing 'revealing' clothing. equating my potential to cause damage to other people [pedestrians, other motorists] to being \"irresponsible\" enough to wear a minidress while walking to a party at night is ....appalling. Ah, there it is. I mentioned that I don't text or speed (along with the other examples) to show that I do everything I can to ensure that I don't cause an accident with a tree or a guard rail or another car (this isn't a perfect analogy, but please just go with it). All I'm saying is, I know that I can't prevent anyone from hitting me, but I CAN be aware of my surroundings. There's nothing wrong with that and it doesn't take any of the responsibility away from other bad drivers. I never used the word \"irresponsible\".\n\nI also said nothing about what I'm driving (i.e. wearing). Driving a flashy sports car (minidress) or a dinged-up van (oversized sweats) isn't going to make me any more or less likely to get hit, nor would it make me any more or less at fault.          Okay, I am very sorry about what happened to you, but I really think you're missing the point here. You ARE blaming but you see it as victim preventing. Some rapes can't be prevented which is why it sounds shitty when yet another person says, \" Oh, don't go out late at night! Don't drink! Why didn't you carry pepper spray! Throw up on yourself or pee on yourself!\" There are steps you can take to prevent rape, sure, but the rapist is at fault alone. \n\nI don't want to hear one more fucking person tell me about he endless steps I could take to prevent myself from being violated. It ends with me padlocked alone in an empty house. I'm glad you're safe but if you really think rape campaigns that target rapists themselves instead of giving their potential victims a checklist of correct behaviors is naive, then you're ignorant.  Okay, I am very sorry about what happened to you, but I really think you're missing the point here. You ARE blaming but you see it as victim preventing. Some rapes can't be prevented which is why it sounds shitty when yet another person says, \" Oh, don't go out late at night! Don't drink! Why didn't you carry pepper spray! Throw up on yourself or pee on yourself!\" There are steps you can take to prevent rape, sure, but the rapist is at fault alone. \n\nI don't want to hear one more fucking person tell me about he endless steps I could take to prevent myself from being violated. It ends with me padlocked alone in an empty house. I'm glad you're safe but if you really think rape campaigns that target rapists themselves instead of giving their potential victims a checklist of correct behaviors is naive, then you're ignorant.  &gt;Why didn't you carry pepper spray!\n\nSee, this is where you're failing to make the distinction. Telling someone \"you should've ___\" after they were raped is blaming them. Telling someone \"you should carry pepper spray just to be safe\" is not \"blaming\" anyone, it's taking precautions. \n\n&gt;if you really think rape campaigns that target rapists themselves instead of giving their potential victims a checklist of correct behaviors is naive, then you're ignorant.\n\nIt's not a \"checklist of correct behaviors\". It's awareness of what you can do to keep yourself safe. What your basically saying is \"Don't tell me to lock my doors at night, tell robbers not to break into houses!!\" Or \"don't tell me to lock my car, tell thieves not to steal cars!\" \n\nIf you think that tell rapists not to rape is going to stop rape, then YOU are ignorant.  Actually, the \"don't be that guy\" campaign has had [modest success.](http://www.theglobeandmail.com/news/british-columbia/dont-be-that-guy-ad-campaign-cuts-vancouver-sex-assaults-by-10-per-cent-in-2011/article1359241/)\n\nThe problem with focusing on educating women on how to protect themselves from stranger rape, is that the overwhelming majority of sexual assaults happen at the hands of someone that the victim knows and is possibly friends with.\n\nAlso, a lot of sexual assaults involve little to no physical coercion, and due to cultural conditioning and misinformation (if she was non-consenting, she'd try to fight her way free etc), the rapist may not even think that what they're doing is \"true\" rape.\n\nI don't feel that trying to help women take precautions is victim-blaming necessarily, but there's not much you can do to protect yourself against someone you trust. &gt;The problem with focusing on educating women on how to protect themselves from stranger rape,\n\nUgh, I wasn't saying we should focus on 'stranger rape' , I was just using the most basic example. I wasn't raped by a stranger, I was raped by someone I knew. My point wasn't about stranger rape, my point was just in general the distinction between precaution and \"victim blaming\"\n\nAlso, that article is terrible. There's no causation proven. They literally just say \"A came before B, therefore A caused B\". There's zero evidence given to prove that the campaign is what caused rape to go down.  So how do we protect ourselves from people we trust not to rape us? I'd rather not get assaulted again, so if there's a way to spot the potential rapists without becoming a paranoid recluse, I'd love to know. So how do we protect ourselves from people we trust not to rape us? I'd rather not get assaulted again, so if there's a way to spot the potential rapists without becoming a paranoid recluse, I'd love to know. Boom, no response.  Short answer; there is no way to 'spot a rapist'.  Most rapists are guys we know, charming and normal, husbands, boyfriends, dates, and not the Mac-wearing maniac.  There are no rules as to how to avoid rape OTHER THAN the basic safety rules that women have drummed into them from birth anyway.  As if we aren't already aware of our personal safety... Boom, no response.  Short answer; there is no way to 'spot a rapist'.  Most rapists are guys we know, charming and normal, husbands, boyfriends, dates, and not the Mac-wearing maniac.  There are no rules as to how to avoid rape OTHER THAN the basic safety rules that women have drummed into them from birth anyway.  As if we aren't already aware of our personal safety... &gt;Why didn't you carry pepper spray!\n\nSee, this is where you're failing to make the distinction. Telling someone \"you should've ___\" after they were raped is blaming them. Telling someone \"you should carry pepper spray just to be safe\" is not \"blaming\" anyone, it's taking precautions. \n\n&gt;if you really think rape campaigns that target rapists themselves instead of giving their potential victims a checklist of correct behaviors is naive, then you're ignorant.\n\nIt's not a \"checklist of correct behaviors\". It's awareness of what you can do to keep yourself safe. What your basically saying is \"Don't tell me to lock my doors at night, tell robbers not to break into houses!!\" Or \"don't tell me to lock my car, tell thieves not to steal cars!\" \n\nIf you think that tell rapists not to rape is going to stop rape, then YOU are ignorant.    I'm pretty tired of 'tell rapists not to rape' because they already know it's wrong, they're doing it for power and their own pleasure. We need tougher laws and less focus on 'well maybe she's lying, what if he's innocent' and more focus on actually prosecuting rapists, because right now the law isn't doing it's job to protect women and deal justice. I think that's 'what to blame' if anything.\n\nOn another note, I was raped and there was nothing I can see that I could have done to protect myself other than not trust my friend, I complied with his demands for fear of my own safety never suspecting him before hand of wanting to hurt me. It's hard to cover the whole aspect of sexual assault with a silly 10 point list anyway.  Some people *don't* know it's wrong because they don't realise it's rape. It's not about telling guys \"rape is wrong\", it's about telling guys \"if someone if passed out drunk, then having sex with them is rape because unconscious people can't consent\". They might understand \"no means no\", but they might not understand that silence doesn't mean that can assume a yes. Not every rapist is the same. \nWe had a UK member of parliament say publicly that having sex with someone who's asleep isn't rape, provided you've had sex with them previously. There are men out there who genuinely don't understand what rape is, and there's nothing wrong with trying to educate young men. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/19071u/im_tired_of_being_accused_of_victim_blaming_for/"
  }, {
    "id" : 22,
    "title" : "My sister just came out to me. ",
    "snippet" : "I love my sister. I always have and will and if she's happy with someone I can't be anything but happy for her, regardless of the gender of her SO. \n\nWe've always been close but we were raised in a Catholic Eastern European household... meaning that we didn't discuss relationships and feelings and all that because it's just not something we do. I know that she'd had some bad relationships with guys before and when she started talking to her girlfriend, I just thought they were friends. I made friends with my sister's girlfriend so I guess it wasn't such a weird thing to me when she said they were more than friends... it actually just made a lot of previous situations clearer. \n\nAgain, I'm happy for her but really sad at the same time... our family will never accept it. She has a huge varied group of friends and my parents didn't really like that before she moved out. My parents hated that one of her best friends is Hispanic and my mom didn't talk to her for a month when she THOUGHT my sister was going out with a black guy.  \n\nI dunno what to say here other than it's a sort of bittersweet situation. I'm glad she told me. She's been holding onto that secret for a while. I wish there was some way it wouldn't be painful for her to tell the rest of my family.   I grew up in a very strict, very Polish Orthodox Catholic house. I knew I was different as a kid. Had crushes on women, very tomboyish and suffered the stings and welts of my family calling me disgusting, unwanted, evil, corrupt and many times my mother screamed at and slapped my face saying, \"you are my daughter and will not be this way.\" \n\nI never really had to come out, but I did...and it was awful. I was a minor so I was sent away to a sexual reprogramming camp for gay teens. More abuse, more people tearing me down. \n\nI've contemplated suicide so many times. That religion has done nothing but make me feel as if I'm nothing, worthless, unworthy of love because \"all faggots choose to be faggots and if you pray hard enough, God will fix you.\" \n\nBe there for her.  Love her. Don't let her feel like she is at fault. Don't let her internalize her feelings, talk to her.  Show her you care and that she's still your sister and you got her back. \n\nShe's very lucky to have you as a sister.  I'm so, so sorry you had to go through that. Even when I was young, growing up in that church it was just like you said: nothing but guilt and hatred for the \"other.\" I knew I was an ally before I knew what the term for it was. I distinctly remember a sermon when the pastor talked about how all gays were going to hell and all bad things in this world can be blamed on fags being so prominent and \"accepted\" in American culture - and when we got home and I asked my mom if they were just trying to be happy and love, what did it matter? Got a great smack in the face for that. I support you, though! Be happy!   You'll have to be her family in a bigger way than before. Also, as sisters you'll outlive a lot of your other family together.  I think about this at times with my little sister...for some long portion of our lives (off in the future) we will be each others main family.\n\nIt means so much that she felt she could trust you.   Sucks about the rest of your family. But at least she has you (:      ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/191jv8/my_sister_just_came_out_to_me/"
  }, {
    "id" : 23,
    "title" : "[IFF] In a LDR. My SO sent me this in the mail with a note that says, \"I know I can't give you the world but maybe you can use this to save it.\" *swoon*",
    "snippet" : "         ",
    "url" : "http://imgur.com/LbSFhOT.jpg"
  }, {
    "id" : 24,
    "title" : "[IFF] I'm setting up a small jewellery business and I've never been more excited!",
    "snippet" : "  I'm a final year University student and I teach crafts on Friday nights at one of the Uni societies. I started making maille jewellery just for fun, and then people started asking I they could buy them and I decided to sell. They should be online for sale in the next week, just building up a bit of stock now.\n\nI have a [Facebook page](http://www.facebook.com/dragonflowerjewellery) if anyone is interested where I'll be posting updates when the shop goes online and asking what kind of colour combinations people want to see.\n\nThanks! =D What are the \"dragons?\" Are they bracelets? They are going to be keyrings, I'm working on sourcing a supply for D-rings and experimenting with possibly making them into bracelets. Could they possibly be pendants and smaller than 7 in? I would buy one in a heartbeat if it were so. Super cool! I can't really make the heads much smaller, but I could possibly shorten the body a little. I'll experiment and see what I can do! How long would you think maximum for a pendant?  I love the flowers especially!  Thanks! They will be available as pendants and I'm working on making them available as hair pins and brooches. Thanks! They will be available as pendants and I'm working on making them available as hair pins and brooches. I was wondering how you were supposed to wear the dragons. I would love to put one in my hair, great idea. Give us an update when we can buy them! :D Thanks! They will be available as pendants and I'm working on making them available as hair pins and brooches. I think they'd make cute stud earrings or a ring - I don't know many women who wear hair pins or brooches nowadays, it's harder to work them into an outfit.  Op...these are gorgeous!!! They look very professional. And I love that they are hand crafted! This always made the jewelry i bought from small boutiques unique and that is what I loved most about it. Plus the fact that I'm supporting a \"mom and pops\" boutique makes me happy. My uni area had a lot of these types of boutiques. Though your hands may get tired when your business lifts off! :)  Thank you! I'm so glad people like them! I'm building up some stock at the moment before the shop goes online so I can try and get as much out as possible when it does start selling. I'll be updating the Facebook page as soon as the shop goes live.  Wow! These are so unique and original! Please - keep creating!   Your  jewelry looks great! I hate to ask such a stupid question, but what does IFF stand for?  Your  jewelry looks great! I hate to ask such a stupid question, but what does IFF stand for?   That's really pretty, you have talent !   These are beautiful... do you know if any of the jewelry has nickle in it, specifically the earrings... I would buy some if there was some assurance there was no nickle! The links are made from adonized aluminium so they shouldn't contain any nickel, but I'm unsure about the current earring findings as I got them from a friend who had a bunch left over. Next time I buy some in I can get silver plated ones which shouldn't cause any allergic reactions. I'll make sure I post when that happens on the Facebook page! You do have to be careful with silver plated... a lot of them do contain Nickle... honestly unless it specifies as nickle free (in regards to silver), I would assume it has it.\n\nThank you for looking into it though! Ah ok, I'll definitely look into sourcing nickel free findings. I'll let you know!\n\nEdit: I can get nickel free gold plated earrings easily =3 To continue on a nickel free line of thought, be careful about how things are labelled: nickel free standards are different in Europe and the UK, for instance, and both contain a small (very small!) percentage of nickel. Some people are still unable to wear \"nickel free\" findings.... most of the vendors I know who shop with us (I work for a beading supply store) tend to keep a stock of sterling silver/gold filled ear findings just to make that option available - so if a customer is very sensitive, you can just change the ear findings to a pair of SS wires and still make that sale. :) These are beautiful... do you know if any of the jewelry has nickle in it, specifically the earrings... I would buy some if there was some assurance there was no nickle! When I wear bracelets or necklaces, I coat them with clear nail polish, so the nickel-containing metal isn't in direct contact with my skin.   How big are the flowers? Are they small enough to mount onto a post for stud earrings? They're a bit big for that I think, the big ring ones are 1.5in, the five petal flat ones are almost 2 and the six petal ones are 2. darn. I really like them, but the only jewelry I'm allowed to wear is stud earrings. Are you setting up an etsy shop? I might have to get something just to wear on weekends :)  I like the dragons, but how are you intended to wear them? I'm trying to get a decent supplier for D-rings so they can be put on keychains etc. Possibly also as big statement pendants, but they start at ~7 inches so I'm not sure if they'd be too big. i thought they were bracelets at first. I'm going to try and work out if that could be done, but it might be a bit tricky.  Cute! Will you be selling them online? I'd totally buy something from you. I will be! Currently just building up a little bit of stock before they go live, hopefully some time next week. I'll be posting updates on the [Facebook page](http://www.facebook.com/dragonflowerjewellery).  Ok, these....are....amazing! WOW  Thank you so much! Check out the [Facebook page](http://www.facebook.com/dragonflowerjewellery) if you're interested in updates, I'll be posting there when the shop goes up.  I love the dragons!  I love all the colors! Yup should make a chunky necklace with the flowers..somewhat avent garde. Something kind of like this..http://static.dailycandy.com/resource.jsp?id=41674&amp;name=LAS-sunflower-necklace.jpg  would look so gorgeous in your flowers. If you don't dig it, I won't be offended. Good luck with your business!  Those are awesome! Might I be able to PM you to ask some questions on weaves used? I've actually gotten into maille myself, and I'm curious as to what exactly the head is (I think I have an idea...), and what kinds of metals you use :).  Awesome work, good luck!!!    Do you have prices?  ",
    "url" : "http://imgur.com/a/ZYQF7"
  }, {
    "id" : 25,
    "title" : "The 18 official haircuts for North Korean women",
    "snippet" : "  This was proven to be bullshit in another thread on reddit yesterday. The photographer took a picture of ONE of the choices signs. This was for \"western dress\" and there's one for \"traditional dress\" and also \"men's styles\". This was proven to be bullshit in another thread on reddit yesterday. The photographer took a picture of ONE of the choices signs. This was for \"western dress\" and there's one for \"traditional dress\" and also \"men's styles\". Still. It doesn't matter if there are 100 signs with 100 styles each, the fact that there are \"allowed\" haircuts is ridiculous.  They're not \"allowed\" haircuts. They're just pictures of styles you might want to wear... like looking through the books at a salon or bringing in a picture of your favorite style. Still. It doesn't matter if there are 100 signs with 100 styles each, the fact that there are \"allowed\" haircuts is ridiculous.  What if the stylists are only taught how to cut these X number of cuts? It is all they CAN do, they don't know how to do any other stylings.  Straight out of the eighties.  Terrible choices.  There's even a mullet. Straight out of the eighties.  Terrible choices.  There's even a mullet.  What does \"encouraged\" mean here?  What does \"encouraged\" mean here?  As in.. \"May Eternal Leader hurt you and your family forever if you dare ask for Forbidden Hairstyle 19. Or.. the '22'.\" \n\nSeriously.. they made *TV programs* in that strange alien land where, if you have an unapproved haircut, in essence they shame you on the *only TV station that everyone is expected to watch!*. They would give your name, your address, and your work station... and essentially shame you into conforming! (Gods help you if, say, like me, you had hair long because it was connected to an underlying medical issue! I'm productive and intelligent.. but oh, no, hair too long, tsk tsk..  I hope it isn't rude of me to ask, but what medical condition causes long hair? I have always had a dislike of cutting my hair.. besides being a minor incarnation of my dysphoria, it's also connected to my autism.  Being that this is a country where they have very little trouble imprisoning you and three generations of your family for perceived treason, I don't think something like a dislike or minor incarnation of dysphoria counts (to them) as a medical issue.   Ugh they look horrible. I dont know which one I'd go with, if I had to... Probably 5 or 15. Ugh they look horrible. I dont know which one I'd go with, if I had to... Probably 5 or 15.       ",
    "url" : "http://www.guardian.co.uk/world/picture/2013/feb/21/eyewitness-pyongyang-north-korea?CMP=EMCNEWEML6619I2"
  }, {
    "id" : 26,
    "title" : "How gross is this?: \"Lulu App Lets Women Review Men Like Restaurants\"",
    "snippet" : "   Awful. We're human, not objects to be reviewed regardless of our gender.\n\nThe slander/libel alone... We don't like when people post revenge nudes of their ex, how the hell is this any different?\n\n&gt;\"[...] it’s wrong because it’s nonconsensual.\"\n\nBoom. Totally agree.  I find it especially scary that an app such as creates such a sexual commoditization of people without their permission. I would hate to find out that my exes are discussing my sexual prowess with guys I know casually and want to know if I am a good bang. I would feel very violated if I was any of these guys.\n\nedit: with to without     Considering I've already been rated on everything from my looks to my sexual history, I find it difficult to be outraged.  We all have been, including guys. Sometimes I've been judged by other women, sometimes other men, sometimes friends and family or strangers- it happens. And it SUCKS. There's no need to encourage it.\n\nAlso, this is the kind of place where you say good things about a guy you're dating/still hung up on, and slam guys you've had messy breakups with. Very few of the reviews will be carefully thought out and non-biased. Considering I've already been rated on everything from my looks to my sexual history, I find it difficult to be outraged.  Just because it's been done to you doesn't mean you should turn around and do it back.  Allowing something like this sends a message saying, \"It's okay to be overly judgmental.  See?  We do it too!\" Good answer, but I'm not a woman?  Good answer, but I'm not a woman?  Sorry you're getting a bit of slack for your comment.  I do think it is sad that we have a double standard that it is rude to judge women on these type of standards but perfectly acceptable to rank men based on things like wage, sexual history, or penis size.  So I do understand that you are not outraged because your probably not surprised that this exists. Good answer, but I'm not a woman?  Are you unsure about that?  Well, this isn't the first time I've been mistaken for one. Or the second. Or the third. Or the fourth. Etc, etc, etc. \n\nEven showing Reddit my photo didn't help.   At least this app still treats men like people with characteristics, it's better than the female counterpart [Playbook](http://techcrunch.com/2013/01/23/and-the-douchebag-app-of-the-year-award-goes-to/). \n\nI don't like it regardless, I don't think humans should ever be objectified like this at all.    My (F) reaction, and my single male sample were both similarly intrigued for how this could effect our first-impression based dating pool, for example serial cheaters that are very good at acting incredibly sweet and attentive.\n\nDownloaded the app to see what its like. As it is free I would encourage others to do the same before jumping bandwagon. \n\nIt's not *that* sexual. I agree it is unusually focused on dateability but the characterization of it as like a meat display, or focused on sexual prowess is fairly inaccurate.  ",
    "url" : "http://www.huffingtonpost.com/2013/02/08/lulu-app-review-rate-men-yelp_n_2647315.html"
  }, {
    "id" : 27,
    "title" : "[IFF] A reddit caricature of my boyfriend and I, highlighting our most frequent and passionate argument.",
    "snippet" : "  hah! That is awesome :D (Also, I'm totally on your boyfriend's side) hah! That is awesome :D (Also, I'm totally on your boyfriend's side)  My husband and I have that same argument.  Now we have to decide if our daughter is going to be raised in a Star Wars or a Star Trek home.  Is the argument whether R2D2 could shoot down the Enterprise?\n\nLove the image.    ",
    "url" : "http://i.imgur.com/5xkT3.jpg"
  }, {
    "id" : 28,
    "title" : "[IFF] My amazing baby sister \"the hot creepy one\" ",
    "url" : "http://i.imgur.com/ZcqbLKp.jpg"
  }, {
    "id" : 29,
    "title" : "[IFF] As an Art Therapy student, we always find different ways to express our anger.",
    "snippet" : "  A week later, and the gouache still hasn't fully come off yet... I am currently applying/choosing an art therapy school and was so excited when I saw your title! Can I pick your brain a bit??\nAlso sorry about the paint, gouache sucks lol Yes, please do! I'm currently at Endicott College in Beverly, MA and I love it. I've learned so much about the profession, and even about myself, since our assignments are 95% self-exploring art projects. Ask away! Yay that is very exciting! I am in California and hoping to get accepted to Loyola Marymount. Does your program require you to do personal therapy yourself. This school does and it is mandatory and expensive. Wondering why it is really nesesary. I guess if you could describe a normal day for you that would be awesome!\n I'll try my best to do it justice. We don't need to do any outside therapy, but we are required to do internships, which is such a fantastic idea for helping us get our foot in the door, get resume experience and decide if it's really what we want to do with our lives.\nI am currently taking Child &amp; Adolescent Psychology, Painting I, Intro to Special Needs, and CAT (Creative Arts Therapy) Studio I (which is like a CAT specific class where we talk about it, watch movies about it, and do experiential art.) \n\nI think you can sort of assume what the Psych courses are like, but the CAT Studio and other CAT-specific classes are really something. There is a mixture of having group discussions about our readings, and a great deal of experiential art, both in class and for homework. For these, we usually meditate for a minute or two if it is to be an experience like that, and then do art to express that emotion, or we just go for it and reflect upon it afterwards. This is to give us an idea of what we would do with clients, and what works for us. (We do a LOT of finger painting, drum circles, and dancing and yelling!) \n\nWe have a very, very knowledgable faculty. In fact, Shaun McNiff, an incredibly important name in Art Therapy, used to be a dean here! And we've had Pat Allen here all week visiting CAT classes, Art Club, lunch discussion groups and a lecture.\n\nI love it so much. So often, I leave the classroom feeling like I just went through a session of therapy myself. We're encouraged to forget about the \"formal\" qualities of making beautiful art, and just using the materials as a medium of expression, and I've learned so much about myself by creating that way. I'm so happy with my decision to study it :)   Okay, you got me curious. What IS Art Therapy? ",
    "url" : "http://i.imgur.com/ku8iPKZ.jpg"
  }, {
    "id" : 30,
    "title" : "I had a \"vaginal\" orgasm.",
    "snippet" : "I'm a little tricky to make cum, as I'm sensitive so I get uncomfortable easily. I have never had an orgasm quite like this.\n\nAfter some foreplay, I was using the Hitachi magic wand on the low setting with my underwear still on (without underwear I can't handle the strength of the Hitachi). I kept it right where my vaginal opening was and felt a burning sensation. Instead of mistaking it for discomfort, I kept it there until I had a mind-blowing, vagina-throbbing, full-body orgasm.\n\nClitoral orgasms are incredible, but I'm assuming this stimulated the much deeper areas of the clitoris. It was nothing like I've ever felt before. I always assumed I was one of those vagina owners who would never orgasm without direct clitoral stimulation.\n\nI would not have known this was possible if I hadn't made such an effort to get to know myself and my anatomy. It's sooo worth it. For anyone who has a vulva, treat yourself well and invest in good toys.   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/191yfc/i_had_a_vaginal_orgasm/"
  }, {
    "id" : 31,
    "title" : "\"As Blade weeps in court, we forget the Blonde is the victim\"",
    "snippet" : "  [deleted]",
    "url" : "http://www.smh.com.au/opinion/society-and-culture/as-blade-weeps-in-court-we-forget-the-blonde-is-the-victim-20130222-2ex07.html"
  }, {
    "id" : 32,
    "title" : "What should I wear? I have an event tonight and all they said was to \"dress elegant\". Which one?",
    "snippet" : "  The first one is the only one that comes across as elegant to me (the 2nd seems more businessy and the 3rd more casual) but the cleavage might be a bit much depending on the event. The first one is the only one that comes across as elegant to me (the 2nd seems more businessy and the 3rd more casual) but the cleavage might be a bit much depending on the event.  I like the second because the first may be showing off too much cleavage for an elegant event and the third is too casual. The first I can cover my girls easily.  Does that chance the opinion of it? Yeah, its a pretty dress.        ",
    "url" : "http://imgur.com/a/gxECr"
  }, {
    "id" : 33,
    "title" : "I cut my hymen -- why is that wrong?",
    "snippet" : "Hello ladies! I had a septate hymen (the one that's just a band across your vag) and it was causing me problems with inserting tampons, masturbation and so forth. So I had a trustworthy friend take a sterile set of scissors and cut it in the middle.\n\nThere was a little bit of pain, some cramping, and some blood (like there would be normally, I guess). Later everyone I talked to seemed to think I had done a horrible thing. I don't understand why it was so much more egregious to sever it myself, carefully, than to have some penis rip it apart. What do you think, XX?  maybe they thought it was 'horrible' because it sounds like you cut a part of your genitals with regular old scissors\n\nAlso  what do you mean \"everyone you talked to\" ? Not to be prudish but why were you telling people about it? Maybe they weren't down with hearing a graphic story about slicing flesh   Clinically speaking you would have been advice to have it cut surgically in a hospital. Cutting it with (semi)sterile scissors isn't really worse than having it ripped apart by a penis - but both are worse than having it being done in a hospital. \n\nWhy? \nRisk of infection. (Sterile set of scissors in the hands of a untrained person in a regular room tend not to be that sterile.)\n\nRisk of complications. What *if* it had not been hymen but a septate vagina? Depending on the severity you could have caused a lot of damage.    You could have got that done in the hospital. You may have a condition where your hymen is thicker, and yes it can grow back if not taken care of properly. There is no way the scissors were sterile. Were they in an autoclave and an air tight packaged seal? Doubtful. I don't think there is anything wrong with getting it done, however your choice of how you were getting it done is not safe. There should be no cramping and no pain and the blood should not last much longer then a cut on your finger would. Is your friend a medical professional? Cause she could have hit nerves and messed up your lady bits to the point where you may not feel as much as you should or at all. There is actually a lot of things that could have gone wrong. I don't think it's wrong, but I don't think your method of doing it was correct.     Anyone who says you did a \"horrible thing\" is a prudish idiot with archaic views on sexuality and women's \"purity.\"\n\nHowever, I don't know if that is at all healthy... I wish you could have had your doctor do it instead, but maybe can you go see a doctor now to make sure everything is healing correctly without infection? If not, just please check ourself out with a mirror daily and make sure you aren't getting an infection.\n\nBtw, what an awesome and *very close* friend you have to do that!! I don't think I could!  Eh... except that she was potentially putting her self in a very dangerous situation? Not to mention the risk of infections?\n\nI don't know if OP made sure what she had really was hymen but it could have been septate vagina in which case cutting it with scissors without medical knowledge could have ended badly.  It sounded to me like the people calling it \"horrible\" weren't talking about the health risk but rather simply that she purposefully cut her hymen. If they were talking about the health risk, I'd somewhat agree. Not sure I'd call it \"horrible\" but it does make me very nervous and I hope OP can see a doctor to make sure she's healing without infection. It sounded to me like the people calling it \"horrible\" weren't talking about the health risk but rather simply that she purposefully cut her hymen. If they were talking about the health risk, I'd somewhat agree. Not sure I'd call it \"horrible\" but it does make me very nervous and I hope OP can see a doctor to make sure she's healing without infection.  Im not sure why people would have strong feelings like this but, I guess I got the same reaction when I removed my own stitches. I would have done the same thing. ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1923xj/i_cut_my_hymen_why_is_that_wrong/"
  }, {
    "id" : 34,
    "title" : "Do your senses heighten before/during your period?",
    "snippet" : "I've noticed that when I PMS, my senses become heightened. Specifically, my sense of smell and taste. It sounds a little cool at first but really it's just annoying. Recently I couldn't even tolerate drinking water from the tap because it tasted \"off\".\n\nI'd love to hear whether you experience anything similar and/or have an explanation as to why this occurs.  [deleted]  Yes, definitely. Once I turned to my boyfriend and said \"pizza's here\" and the doorbell rang a minute later. \n\nHappened while I was pregnant too.   Happens to me, too but it is nothing too extreme.  I'm just a bit annoyed with scents I either tolerate or even like otherwise. On the bright side... the type of orgasm I have during my period is *very* intense.  Much more intense than any other orgasm I have ever had.  Is this weird?   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/192v8h/do_your_senses_heighten_beforeduring_your_period/"
  }, {
    "id" : 35,
    "title" : "[IFF] Went to the Vagina Monologues. Got some awesome stuff. ",
    "snippet" : "    love the shirt!! where to you buy them?",
    "url" : "http://imgur.com/a/s8Al2"
  }, {
    "id" : 36,
    "title" : "IFF: You ladies liked my last high school dance photo, so here's a picture of my mostly female group from last weekend's Sweethearts Dance.  I'm the purple-haired one in the middle :)",
    "snippet" : "    This reminds me of everything I loved about high school.  ",
    "url" : "http://i.imgur.com/rtJsI1u.jpg"
  }, {
    "id" : 37,
    "title" : "[IFF] It's been exactly 2 years since I've seen my baby sister.  This is one of my favorite photos of us.",
    "snippet" : "  My little sister is, by far, the most important person in my life. She's amazing. It would absolutely kill me to go two whole years without seeing her. [This](http://i.imgur.com/ryUFdXj.jpg) is her at Mardi Gras this year. :)  \n  \nWhy has it been so long since you've seen your sister?  \n",
    "url" : "http://i.imgur.com/riyUSbf.jpg"
  }, {
    "id" : 38,
    "title" : "So I was sexually assaulted when I was little and I don't know how to tell my family or ask for help.",
    "snippet" : "Okay so I am going to try and keep this as brief as possible.   \n\nWhen I was little (7-8ish) my aunt was with a guy who on repeated occasions tried to get me to have sex with him(my aunt left him shortly after due to their fighting). He threatened my family by saying that if I told anyone he would hurt them. So that's part of why I haven't told my family yet, the other part is I fear that they will over react. \n\nBecause this happened 8-9 years ago I don't feel the major need to press charges or really even contact the man. I would however like to go through therapy as I believe it will help me cope with what happened a lil better. \n\nAs of now I have been pushing the memories to the side, and avoiding talking about it when I can. I have told people close to me and they are helpful when I have breakdowns, but over the past several weeks my breakdowns have been more frequent, and I think now is the time I should go to therapy. My only problem is I cant tell my family that I want therapy with out telling them what happened. I don't want them to blow it out of proportion. \n\nHow should I go about telling them that would make them not freak out.   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/191seq/so_i_was_sexually_assaulted_when_i_was_little_and/"
  }, {
    "id" : 39,
    "title" : "IFF: Me and the best friend I grew up with; still best friends after nearly 22 years. :)",
    "snippet" : "  This is so special and important!! Work hard to bridge the gaps in geography to maintain friendship. It gets so much harder as you get older. I've been best friends with mine for 17 years. :)  Cute! Where are you guys in this picture? It looks beautiful. Thank you! It's a small town in Newfoundland, called Twillingate. It has amazing scenery, especially early summer when there are tons of icebergs. :)",
    "url" : "http://imgur.com/LCkgz"
  }, {
    "id" : 40,
    "title" : "[IFF] Tuesday I went to get a tattoo for my dad. Upon coming home from it, I found he had attempted suicide by gassing himself. I was able to resuscitate him, and he is alive and physically well. The car on my arm is actually the one he attempted the action with. Love you dad! ",
    "snippet" : "   I remember your post the other day. Has he talked about it yet? How is your family doing? We are okay. My dad has accepted his problems and is willing to stay there. He is going to stay at the hospital for 2 weeks and then we are sending him to a facility for people with brain injuries who have become mentally ill. He admitted that he over dosed on medication and his personality flipped and he decided it was a good idea. He says for the first time in months he is not afraid of himself.  ",
    "url" : "http://imgur.com/zFjYBN4"
  }, {
    "id" : 41,
    "title" : "[IFF] I dyed my hair last week. I couldn't love it more :)",
    "snippet" : "   ",
    "url" : "http://i.imgur.com/0LRz0so.jpg"
  }, {
    "id" : 42,
    "title" : "IUDs on the horizon: All about the new Skyla IUD",
    "snippet" : "  This is all so exciting!! I'm particularly fascinated by the IUB. Yeah, me too. I can't help but think of these: http://hoberman.com/fold/Sphere/sphere.htm ... No idea if I'm even in the right ballpark here but... how cool would it be if you could get one that glows in the dark? Y'know, so it's easier for your OB/GYN to see...? :P    This sounds fabulous. I have to get my copper IUD replaced this year. I've had it for 8 glorious child free years. I already have two 13 year old beasties, so I don't need any more. It's a blessing and other than heavier periods for about the first year I have had zero side effects. I'm considering the Mirena because my doc says it will eliminate my periods altogether. It's either that or I may pay out of pocket for ablation. \n\nSorry to hijack the thread. I am so scared of the pain of removing the damn thing. Any ladies out there had one removed? How was it?  I've been tossing the idea around of getting a copper IUD. Can you tell me your experiences with it? I had Mirena for a whole week before I had to have it removed because of side effects (no hormonal stuff for me), so I already know about insertion.\n\nRight now I'm only using condoms, but that always seems a little risky. How was the removal? \n\nI haven't had any issues on the copper, and like you I chose to use it because I can't handle hormones very well. I've never used a pill I liked. I even tried the NuvaRing at one time because it was slow release. I still didn't like it. \n\nI had the IUD inserted in May of 2005. I had it inserted on day 4 of my period. At the time my periods were about 5 days, sometimes 6 if I had a stressful month. It's been so long that I cannot tell you if the changes I have been through are related to the IUD or to my age. I'm 34 now. \n\nAfter the IUD I had to begin using heavier rated tampons while I sleep. I believe that my menstruations got heavier and lasted longer, but it was really gradual. \n\nI've had my periods go as long as 7 days. But the last three days are usually really light days and I can use light flow tampons or just panti liners. Pre-IUD I'd just be done after day five. \n\nSome people talk about spotting, I never ever spotted prior to the IUD. After the IUD I have spotting exactly two days before I start. It's like a little reminder that I have two days left of freedom. The spotting is brief and light. I get a cramp and I just notice the tiniest bit of blood in my discharge. Two days later and I start menstruating. \n\nAfter IUD My flow is heavier and denser, I have more blood clots. Hence the larger tampons. Again, might be age. Getting older is so much fun /sarcasm. \n\nPrior to IUD- I am like clockwork. I began menstruating at age 13 and by age 15 I was on a regular cycle 29 days. After IUD same clockwork. I never experienced days or weeks of bleeding like some people say they do. I got it inserted, my period ended 1-2 days later and I started right on time the next month. \n\nOh, cramps. Yes, I have them and sometimes they are really horrible. But never bad enough to miss work or life or anything. I just pop an ibuprofen and on with my life I go. \n Removal was no big deal. I was in and out within a few minutes. I was so sick (again, gorram hormones) by that time I didn't notice any pain and it was over very quickly. You should be fine. :) Thanks for the reply. I agree, I'll be fine! I am woman hear me roar. \n\nSomehow I've become a giant baby in the last few years and I'm afraid of all pain. Hard to imagine I had a natural birth.  This sounds fabulous. I have to get my copper IUD replaced this year. I've had it for 8 glorious child free years. I already have two 13 year old beasties, so I don't need any more. It's a blessing and other than heavier periods for about the first year I have had zero side effects. I'm considering the Mirena because my doc says it will eliminate my periods altogether. It's either that or I may pay out of pocket for ablation. \n\nSorry to hijack the thread. I am so scared of the pain of removing the damn thing. Any ladies out there had one removed? How was it?   I wonder how different the Skyla is from Mirena. I'm toying with the idea of an IUD and I love the idea that the Skyla is smaller and \"more comfortable.\" And I don't mind that it only lasts 3 years. My biggest question would be if insertion is easier since it's smaller (probably). [deleted] It's not just the pain I'm worried about, but thanks for the info. I will probably ask about anxiety/pain management options because that situation would probably induce a panic attack for me. [deleted]  I tired to get the Mirena (three times) but my cervix wasn't having it. :/ Maybe Skyla would be better friends with my cervix!  Word. I have had ParaGard inserted twice, and my cervix pushed it out over the course of a month each time :|   ",
    "url" : "http://bedsider.org/features/260?utm_content=Brith%20Control%20Support%20Network&amp;utm_campaign=Bedsider.org&amp;utm_source=sendgrid.com&amp;utm_term=Bedsider&amp;utm_medium=email"
  }, {
    "id" : 43,
    "title" : "What to get for a new mommy just home from the hospital?",
    "snippet" : "Hello!  My sister-in-law just had her first baby last night.  They will be going home either this evening or tomorrow morning.  I would like to bring her something that she could use to make herself more comfortable on her first day home.  I have never had children so I don't know what to get.  \n\nSo my question is:  Is there something that you wish a friend or family member had brought you to make your first day/week more comfortable?  \n\nShe's already had the baby showers, etc. so I'm not looking for something for the baby... but rather specifically for her.  Any input would be greatly appreciated!!  Thanks!!\n\n(If this is the wrong place to post this I apologize!)  FOOD.  \n\nA nice big fruit basket.  Or a meal, delivered at dinnertime, ready to eat, complete with paper plates, etc.  Healthy snacks (a platter of really nice dried fruit is awesome in many ways).  Your first few weeks as a new mom, it is hard to find time to get a decent meal in you, yet that is what you need the most.    Looks like food is the way to go! I'll head to the grocery store right now. Thank you!! Congrats on your new niece or nephew!  Looks like food is the way to go! I'll head to the grocery store right now. Thank you!!    So many things come to my mind..  Food of course, she is going to be a machine for the first month so eating and bathing and sleeping is really hard to do.  Watch the baby for her sometime?  Also cleaning the house,  again, she will be sore/tired/hungry and the clutter of all things baby will actually make her feel stressed out.  Get some of the laundry done and tidy the place up and she will be forever grateful.   For the long run, I don't know if you are close with her but go over for visits but don't make it about seeing the baby, remind her that she is someone outside of being a mom.  Watch some t.v. or just have a chit chat.  I know that even though I had friends when I had a baby, they all seemed to be too busy to just come hang out with me ya know, because I couldn't go out when most people were.  I got bored often and lonely.  Babies can't talk for a long time :(.   lol, FOOD! for me too! \n\nI really didn't want cakes or anything like that. I wanted beautiful fruit!\n(And casseroles for the freezer!)\n\nA voucher for a massage sometime when she is ready for it could be a lovely gift too.    Maybe not right away, but something at a spa? Like a manicure and pedicure, or maybe a new haircut to feel pretty when everything else is crazy? Or perhaps something she couldn't enjoy pregnant, like sushi or a nice bottle of champagne for the parents to enjoy when the baby finally (if ever) goes to sleep. Maybe not right away, but something at a spa? Like a manicure and pedicure, or maybe a new haircut to feel pretty when everything else is crazy? Or perhaps something she couldn't enjoy pregnant, like sushi or a nice bottle of champagne for the parents to enjoy when the baby finally (if ever) goes to sleep. She does love sushi! Any issues with fish (mercury) for nursing moms? Being child-less, I'm at a loss with these things...",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/191lzu/what_to_get_for_a_new_mommy_just_home_from_the/"
  }, {
    "id" : 44,
    "title" : "IFF: Drunk and happy with my husband :) ",
    "snippet" : "  This is not what being drunk looks like Should I have named it \"high-functioning drunk and happy\"?  Then... teach me how to do that! I'm afraid I cannot...since I don't even remember taking this picture!!!   I should post the morning after picture....yikes.  Do you drive a motorcycle? Then... teach me how to do that! Should I have named it \"high-functioning drunk and happy\"?  You're gorgeous! What a great pic, y'all look so happy!  He looks a bit like Tory from Mythbusters.  WHOA! You're a stunner!\n\n(hubby ain't bad either!)  You just described how I'd like my weekend to go! Cheers to happy couples and tasty beverages :)  I love your hair cut! It is so flattering.  You are both gorgeous. ",
    "url" : "http://i.imgur.com/TOL4vKN.jpg"
  }, {
    "id" : 45,
    "title" : "[IFF] Brought my little cousin to the library at my university so I could do homework. She went off on her own to find a book to read, and came back with a book on Feminist oral histories!",
    "snippet" : "   ",
    "url" : "http://imgur.com/q67uuuh"
  }, {
    "id" : 46,
    "title" : "What are some good websites/stores for unique, elegant prom dresses?",
    "snippet" : "I hate this sparkly sequin trend going on. All of the dresses look the same. My prom is very soon and I need to find a dress! One with a simple, vintage style would be great. Thank you! :)  ModCloth.com. I love all of their dresses!   I have the same dilemma and it seems etsy is the best bet; it's hard to look through but some of the designs are perfect. Just search prom dress in the vintage only. Also have your measurements handy for comparison. And if you find a dress you like that doesn't fit , you can maybe have one like it custom made!  This is a great idea! Thanks!\nI found a possible option. :) http://www.etsy.com/listing/120564802/sexy-evening-prom-dress?ref=sr_gallery_33&amp;ga_search_query=prom&amp;ga_order=most_relevant&amp;ga_view_type=gallery&amp;ga_ship_to=US&amp;ga_ref=auto2&amp;ga_explicit_scope=1&amp;ga_search_type=handmade   I don't know if there's an actual store anymore or if they're just online, but many years ago I got my dress at Jessica McClintock, and it wasn't sparkly or sequined.  My other one I got at I think Macy's.  Unless you know you'll fit into something you buy online it's still probably the best idea to just go to different stores to try to find something you really like so you can see how it actually looks on. I don't know if there's an actual store anymore or if they're just online, but many years ago I got my dress at Jessica McClintock, and it wasn't sparkly or sequined.  My other one I got at I think Macy's.  Unless you know you'll fit into something you buy online it's still probably the best idea to just go to different stores to try to find something you really like so you can see how it actually looks on.",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/192akd/what_are_some_good_websitesstores_for_unique/"
  }, {
    "id" : 47,
    "title" : "I had to actually defend my point of view on abortion for the first time and it was really awesome!",
    "snippet" : "http://imgur.com/a/rff3f\n\nSo I saw a video on /r/justiceporn earlier today and wanted to share it on facebook. Most of my friends are pro-choice so I didn't think I would get any controversial comments.\n\n\nThe first commenter is my cousin. We get along well just have different point of views clearly. The other person is a guy who lives in the same neighborhood as me. I saw he posted a picture before of him holding a sign outside a abortion clinic in our town so I'm not surprised he had the pro-life view but we don't really talk so I was surprised he commented.\n\n\nWhat is the awesome part for me is that I've never really had to defend my point of view before to others!! Most of the people I talk to have the same views as me so I never had to really go into detail. I actually wish the commenters put up more or a argument. I've never had disagreements over facebook, and as lame as it is to fight over facebook, it was exciting to talk about my beliefs and try to show my side!\n\n\nAnd I educated myself more when I looked up information about the propaganda video the second dude posted. I had never heard of that movie before so it was interesting to look up the views. I know I said the video was biased but I did find some of the facts from a Planned Parenthood pamphlet about the video so I am probably biased myself.\n\n\nBut whatevs! It was thrilling to have to support my point of view with information!! Also, I tried my best not to sound snippy with the second dude but that video pissed me off. I hope I got my point of view across well and got my facts right! \n\nI just needed to share with someone how awesome it feels to stand up for what you believe in!!\n\n  Well done. Keeping it factual.   Wow props for watching the video and responding accordingly. I really want to post my experiences with this. Had an amazing discussion on my FB about the topic, brought upon by my anger at seeing a pro-lifer and deciding to do something with my anger and donated to a prolife agency. Try to undo the negative with a supportive positive.   You did great.  /hugs",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/1919zn/i_had_to_actually_defend_my_point_of_view_on/"
  }, {
    "id" : 48,
    "title" : "Skinny shaming a former fattie (rant).",
    "snippet" : "Over the course of the last year, I have lost over 75 lbs. I have gone from a (US) size 20 to a (US) size 8. I am super proud of that accomplishment. I do not like to brag, because I'm ashamed of how fat I got. I just moved to across the country to a new state, and only 3 people know that I used to be huge. \n\nI've started getting dirty looks from larger girls. It is very hurtful! I was talking to a friend at work the other day, and mentioned that I'm down to an 8 for the first time since high school. Another girl came up on the last part of the conversation and looked at me with almost hatred. She was a bigger girl, and I told her that I've gone from a lot bigger to now. Only after she heard that I was a former fattie was it \"okay\" for me to be happy in my size. \n\nI don't know how to handle this negative attitude towards me just because I'm smaller. I'm not skinny (by any means), but I finally am within the \"normal\" weight range with a healthy BMI. I'm able to do things without the fat holding me back. And, I was FAT. I guess I'm just trying to understand. Ladies, please help me understand or at least learn to deal with this new found hatred towards me.    Among women who are heavy, it's common to talk about weight.  What you're trying not to eat, what you're working on, if you're extra motivated, or if you're sick of the whole thing and you're just going to eat a bag of chips.  There's an \"we're-all-in-this-together\" camaraderie.\n\nNow you're thin, and you CAN NOT discuss weight with anyone who is even one size larger than you.  Eliminate it from your conversational menu.  It's a bomb, a third rail, a fart in the elevator.  No matter what you do, someone in the group will take it badly.  You've been successful, they have not (yet), and weight is SUCH a loaded issue in our culture.  There is Not One Thing you can say that doesn't risk hurting someone's feelings.\n\nBeing excited, you might be tempted to share some of the methods for your success. Unless someone directly asks you how you did it, put a padlock on your mouth.    I have been dealing with it my entire life. I am 21, 5'4, and weight fluctuates from 95-100 (I get some seasonal weight). People don't think it's hurtful to insult skinny girls because we are \"ideal to society.\" I have been assumed to have eating disorders, self-esteem issues, and a show off. When I make a comment on my appearance I have been told I am not allowed to because I am thin. When I tell my friends they are not fat (when they keep saying they are), I have been told I wouldn't know because I am so small. People have assumed me to be a bitch, people tell me to go eat a burger or 2, people have commented that I am not a real woman, someone even said I look like a 12 year old boy from the back. You are never going to win with people. Being called fat and being told to go on a diet is just as hurtful as being told to go eat and anorexic. Be happy with yourself, and fuck what other people think. You can never please them, so please yourself. Congrats on all your hard work!  I honestly don't think I'll ever be at the point where someone will tell me to eat a burger, but I empathize your situation. I agree that being called fat is just as hurtful as being called anorexic. Either way, you're being judged for your body. And, thanks!   I dunno if my opinion on this is well thought-out, cos I've been thinnish all my life. But it seems that they might be reacting to *you* subtly shaming *them*. You seem to think that thin is much better than fat and that being fat is something to be ashamed of; while it's up to you to decide what to do with your own body, expressing that opinion around others can be hurtful. Even if you're not saying it directly, you might be expressing it in an indirect way when you talk about diets or size or clothes. \n\nYou may not even be saying anything different now than you would have said before you lost weight. But it sounds different coming from a thin person than a fat person. Let me give an analogy: a lot of queer people have internalized homophobic stereotypes. If a gay person posts \"I don't know if I should have children, it's not fair on them having gay parents\" then I'll feel sad for that person, and reassure them and show them research and resources about gay parenting. But if a straight person posts that gays shouldn't have children, I'll feel angry rather than sad, and I'll only bother to educate them if I have time and they seem particularly reasonable. I think it applies to all minority groups - someone who's part of the minority who hates themselves is a tragedy, someone who's not part of the minority and hates it is a threat.   Are you maybe imagining these looks of hatred? It could be your own insecurity that is making you believe that other people are giving you dirty looks. It's a classic symptom of anxiety. \n\nStop worrying so much? Unless someone actually says something, chalk it up to your imagination and insecurity trying to sabotage you.  Thanks for your opinion. Unfortunately, I'm not imagining the looks, or the comments. There's no anxiety going on here, I'm not hearing voices or the like. You didn't mention anything in your original post about them saying anything to you. \n\nAnd you realize that feeling a little anxious isn't the same as hearing voices, right? I didn't say you were mentally ill, just maybe that you're projecting your insecurities onto others around you (everyone does this to some degree or another). Don't assume the worst of others. \n\n Isn't that what you just did to her when you assumed that it was all in her head?   ",
    "url" : "http://www.reddit.com/r/TwoXChromosomes/comments/191jcx/skinny_shaming_a_former_fattie_rant/"
  }, {
    "id" : 49,
    "title" : "What do you think of this kiss? Describe your perfect kiss. ",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=kY8WimVNHfw"
  } ],
  "processing-time-source" : 51,
  "processing-result.title" : "twoxchromosomes4_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/home/ciara/Documents/programming/cs467/rtopics/r-topics/carrot2-cli-3.6.2/../data/twoxchromosomes4_reddit.xml"
  }
}