{
  "processing-time-total" : 1785,
  "clusters" : [ {
    "id" : 0,
    "size" : 10,
    "score" : 28.321971715045674,
    "phrases" : [ "Major" ],
    "documents" : [ 3, 12, 14, 53, 57, 60, 62, 74, 85, 89 ],
    "attributes" : {
      "score" : 28.321971715045674
    }
  }, {
    "id" : 1,
    "size" : 9,
    "score" : 42.6028215363418,
    "phrases" : [ "Place I Looked" ],
    "documents" : [ 13, 24, 53, 57, 59, 61, 62, 65, 70 ],
    "attributes" : {
      "score" : 42.6028215363418
    }
  }, {
    "id" : 2,
    "size" : 8,
    "score" : 34.10523489136156,
    "phrases" : [ "Good Question" ],
    "documents" : [ 5, 7, 14, 31, 57, 74, 82, 83 ],
    "attributes" : {
      "score" : 34.10523489136156
    }
  }, {
    "id" : 3,
    "size" : 8,
    "score" : 41.99063611227617,
    "phrases" : [ "There's no other Option" ],
    "documents" : [ 5, 7, 14, 27, 47, 53, 65, 70 ],
    "attributes" : {
      "score" : 41.99063611227617
    }
  }, {
    "id" : 4,
    "size" : 7,
    "score" : 77.78835745885404,
    "phrases" : [ "CS Class" ],
    "documents" : [ 7, 9, 12, 57, 74, 84, 89 ],
    "attributes" : {
      "score" : 77.78835745885404
    }
  }, {
    "id" : 5,
    "size" : 7,
    "score" : 31.876884827646233,
    "phrases" : [ "Ride" ],
    "documents" : [ 8, 10, 13, 33, 49, 80, 88 ],
    "attributes" : {
      "score" : 31.876884827646233
    }
  }, {
    "id" : 6,
    "size" : 6,
    "score" : 27.90158678306078,
    "phrases" : [ "Anybody" ],
    "documents" : [ 6, 45, 59, 68, 79, 85 ],
    "attributes" : {
      "score" : 27.90158678306078
    }
  }, {
    "id" : 7,
    "size" : 6,
    "score" : 29.84428789543158,
    "phrases" : [ "Buy" ],
    "documents" : [ 0, 13, 51, 58, 69, 87 ],
    "attributes" : {
      "score" : 29.84428789543158
    }
  }, {
    "id" : 8,
    "size" : 6,
    "score" : 36.26592341197372,
    "phrases" : [ "Hey" ],
    "documents" : [ 21, 26, 31, 47, 76, 90 ],
    "attributes" : {
      "score" : 36.26592341197372
    }
  }, {
    "id" : 9,
    "size" : 6,
    "score" : 44.25726961166459,
    "phrases" : [ "Run" ],
    "documents" : [ 14, 36, 53, 56, 81, 87 ],
    "attributes" : {
      "score" : 44.25726961166459
    }
  }, {
    "id" : 10,
    "size" : 6,
    "score" : 62.186021247672976,
    "phrases" : [ "Thanksgiving Break" ],
    "documents" : [ 28, 41, 51, 53, 57, 62 ],
    "attributes" : {
      "score" : 62.186021247672976
    }
  }, {
    "id" : 11,
    "size" : 6,
    "score" : 58.12790695312993,
    "phrases" : [ "Work Action" ],
    "documents" : [ 5, 14, 27, 38, 57, 62 ],
    "attributes" : {
      "score" : 58.12790695312993
    }
  }, {
    "id" : 12,
    "size" : 4,
    "score" : 53.0103026231314,
    "phrases" : [ "Football Game" ],
    "documents" : [ 35, 40, 50, 81 ],
    "attributes" : {
      "score" : 53.0103026231314
    }
  }, {
    "id" : 13,
    "size" : 4,
    "score" : 64.8162622780049,
    "phrases" : [ "Graduate Students Getting a Tuition Waiver" ],
    "documents" : [ 5, 14, 53, 62 ],
    "attributes" : {
      "score" : 64.8162622780049
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 41.61262183170087,
    "phrases" : [ "Cat" ],
    "documents" : [ 6, 27, 64 ],
    "attributes" : {
      "score" : 41.61262183170087
    }
  }, {
    "id" : 15,
    "size" : 3,
    "score" : 35.0380783382745,
    "phrases" : [ "Chancellor" ],
    "documents" : [ 1, 62, 72 ],
    "attributes" : {
      "score" : 35.0380783382745
    }
  }, {
    "id" : 16,
    "size" : 3,
    "score" : 30.491544102307106,
    "phrases" : [ "Open Tomorrow" ],
    "documents" : [ 11, 14, 16 ],
    "attributes" : {
      "score" : 30.491544102307106
    }
  }, {
    "id" : 17,
    "size" : 3,
    "score" : 49.14073288231447,
    "phrases" : [ "Optimistic for the Team" ],
    "documents" : [ 23, 32, 59 ],
    "attributes" : {
      "score" : 49.14073288231447
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 31.178718834091136,
    "phrases" : [ "Android" ],
    "documents" : [ 22, 78 ],
    "attributes" : {
      "score" : 31.178718834091136
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 44.653390628494805,
    "phrases" : [ "Crystal Lake Park is the only Place" ],
    "documents" : [ 41, 79 ],
    "attributes" : {
      "score" : 44.653390628494805
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 51.41828439617386,
    "phrases" : [ "Lex Express" ],
    "documents" : [ 33, 56 ],
    "attributes" : {
      "score" : 51.41828439617386
    }
  }, {
    "id" : 21,
    "size" : 2,
    "score" : 33.78580792477,
    "phrases" : [ "Madison" ],
    "documents" : [ 46, 86 ],
    "attributes" : {
      "score" : 33.78580792477
    }
  }, {
    "id" : 22,
    "size" : 2,
    "score" : 43.83711454380638,
    "phrases" : [ "PHYS 212" ],
    "documents" : [ 74, 77 ],
    "attributes" : {
      "score" : 43.83711454380638
    }
  }, {
    "id" : 23,
    "size" : 2,
    "score" : 65.5734134376545,
    "phrases" : [ "Physics Minor" ],
    "documents" : [ 60, 74 ],
    "attributes" : {
      "score" : 65.5734134376545
    }
  }, {
    "id" : 24,
    "size" : 2,
    "score" : 35.79335554379981,
    "phrases" : [ "Reason to Shoot eight Shots" ],
    "documents" : [ 27, 32 ],
    "attributes" : {
      "score" : 35.79335554379981
    }
  }, {
    "id" : 25,
    "size" : 2,
    "score" : 41.357260526155734,
    "phrases" : [ "Showing my Apartment" ],
    "documents" : [ 67, 70 ],
    "attributes" : {
      "score" : 41.357260526155734
    }
  }, {
    "id" : 26,
    "size" : 2,
    "score" : 40.99450385313725,
    "phrases" : [ "Sleep" ],
    "documents" : [ 81, 93 ],
    "attributes" : {
      "score" : 40.99450385313725
    }
  }, {
    "id" : 27,
    "size" : 2,
    "score" : 39.345901810456716,
    "phrases" : [ "Suburbs" ],
    "documents" : [ 10, 44 ],
    "attributes" : {
      "score" : 39.345901810456716
    }
  }, {
    "id" : 28,
    "size" : 2,
    "score" : 43.85643272331615,
    "phrases" : [ "Union Station" ],
    "documents" : [ 8, 13 ],
    "attributes" : {
      "score" : 43.85643272331615
    }
  }, {
    "id" : 29,
    "size" : 26,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 2, 4, 15, 17, 18, 19, 20, 25, 29, 30, 34, 37, 39, 42, 43, 48, 52, 54, 55, 63, 66, 71, 73, 75, 91, 92 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1686,
  "documents" : [ {
    "id" : 0,
    "title" : "Does anyone know if any buildings on campus are climbable?",
    "snippet" : "I heard that some of the buildings on campus have ladders or something on them and it's possible to climb up to the roof.  Anyone know which buildings these might be?  Did someone just buy an Assassin's Creed game? Did someone just buy an Assassin's Creed game?    I saw an experienced climber scale Altgeld just using the bumps of the stone and the ridges of the masonry. Since you're asking about ladder I'm guessing that may be out of your reach.     i heard rumors about the roof of the armory being accesible  When my brother went here, one of his ROTC friends broke into the Armory and played beer pong on the roof. Not legally accessible.   i heard rumors about the roof of the armory being accesible  Not a rumor, quite easy  Yes. \n\nIf you get caught on the wrong building by the wrong people at the wrong time you could get arrested/in reasonable trouble. \n\nBe careful.  This is slightly different, but didn't the last person who asked for tall building suggestions here commit suicide?  This thread reminds me a lot of that other one. [No, they didn't](http://www.reddit.com/r/UIUC/comments/za98n/trying_to_hangout_on_tall_buildings/c66hysp).        ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13u25c/does_anyone_know_if_any_buildings_on_campus_are/"
  }, {
    "id" : 1,
    "title" : "So I just got an email inviting me to the Chancellors Open House. The fuck is this and is it worth my time?",
    "snippet" : "  More importantly, is there free food? More importantly, is there free food? I immediately sent an email to the lady who sent out the email asking just this.\n\nCookies and punch will be provided.\n\nI was extremely disappointing.  [deleted]   Dude, I have gone to one of these before and it is fairly awkward, but the food is excellent. I plan on going, and not talking to a single soul while I jam buffet down my face hole.\n   What the shit was I the only person not invited? haha Damnit guys, read the invitation.\n\n\"All students, faculty and staff with the exception of Phil6x are welcome to the Chancellor's Open House. Please DO NOT tell Phil6x as we don't want him to feel bad.\"\n\nWell, I hope you're all happy now. Damn it Chancellor Wise... I told you I wouldnt come over drunk anymore. Why cant you just believe me     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13tdpg/so_i_just_got_an_email_inviting_me_to_the/"
  }, {
    "id" : 2,
    "title" : "Champaign Sunset tonight 11/25",
    "snippet" : "  This area seems to always get insanely cool sunsets in November. \n\nHere are a couple I took around the beginning of November 2 or 3 years ago.\n\nhttp://imgur.com/a/tmB2w#0  Wasn't the sunset today amazing? Nice shot. It's always hard to capture things like that in a photo. [It was as nice of a shot as this](http://btn.com/video/?select=SEJV1lbNfAMj)    [deleted]  Well Hello Corbin Well Hello Corbin",
    "url" : "http://imgur.com/yaH5t"
  }, {
    "id" : 3,
    "title" : "Changing Majors?",
    "snippet" : "So currently I'm an agri-finance major, sophomore, and currently taking Accy 201 and Finance 221...both of which I'm doing very poorly in and could possibly fail Finance 221 unless I do very well on the next two exams.\n\n I know the materials in both courses but the way they're presented on tests makes it difficult for me and I'm pretty sure this is how they're going to be presented for the next 2.5 years.\n\nPretty much is this the point when I should be thinking about another major? I did very well in Econ 102, 103 and 202 so maybe I should think about switching into Statistics or Economics?  So you want reddit to decide what your major should be?  Economics change would be easier just considering subject matter and I have heard of Finance majors enjoying the switch to Economics, a subject a little more broad and less technical. \n\nYou are going to have hard classes there as well. If you are demotivated by classes and are doing poorly because of this then you just have to snap out of it. Even if you enjoy a switch to Econ or Stats you are going to have  a lot of classes you don't find particularly interesting. Using that as an excuse to find yourself doing poorly is a self destructive path. I went down it and it wasn't pretty. \n\nStay positive, and don't make excuses. \nGood luck.   If you don't think you are going to do well in the class, you could always try for grade-replacement and continue with your major. Also consider talking to your professor and explaining the trouble you've been having. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13tqrv/changing_majors/"
  }, {
    "id" : 4,
    "title" : "Friends:\"Wanna hang out before break ends?\" Me:\"CAN'T\" [x-post from /r/funny]",
    "snippet" : "   YOU LIAR! THIS ISN'T A CROSS-POST, YOU STOLE IT FROM ME! \n\nhttp://www.reddit.com/r/funny/duplicates/13roor/so_true_right_now/ YOU LIAR! THIS ISN'T A CROSS-POST, YOU STOLE IT FROM ME! \n\nhttp://www.reddit.com/r/funny/duplicates/13roor/so_true_right_now/ Did you make this yourself? No? Then you can't claim the exclusive right to distribute it.",
    "url" : "http://i.imgur.com/LWhTT.jpg"
  }, {
    "id" : 5,
    "title" : "I am one of the co-presidents of the Graduate Employees' Organization. AMAA",
    "snippet" : "Hi everyone,\n\nMy name is Lindsay Anderson, and I am very happy to respond to your questions about a possible work action that is being faced by the Graduate Employees' Organization. We represent almost 2,400 teaching assistants and graduate assistants across the campus. You may have heard that we are on the edge of a work action, or strike. \n\nAs many of you already know, [the GEO has passed an authorization vote to go on strike](http://www.news-gazette.com/news/education/2012-11-16/geo-members-take-next-step-toward-strike.html). The state of Illinois requires that an authorization vote is taken before any strike can be declared, but in our organization, this vote does not mean we have declared a strike. Instead, based on our constitution, this vote creates a new committee with the executive power to declare, suspend, or call off a strike.\n\nFor those of you who already have a good grasp on the issues but want to know how to get involved, [signing our petition is a great start, even if you're not a member](http://www.change.org/petitions/university-of-illinois-community-and-supporters-help-us-protect-tuition-waivers-for-teaching-assistants-and-graduate-assistants).\n\nThis is an AMAA, so please be warned that there are a few topics I cannot speak to:\n\n* The start date of a work action/strike\n* Buildings that would be targeted for picket lines\n* How long a potential strike could last\n* Whether your own graduate instructors will hold or cancel classes\n* **Rampart**\n\nI am being helped by a member who is a steward in our union who is using the username \"uiuc_grad.\" I don't know if he will be given any flair, but he is working with me to answer questions in a timely fashion. Because this is a new account, I will have to obey the 8 minute cool down in between posts for awhile.\n\nLooking forward to your questions!\n\n--Lindsay Anderson\n\n**Edit:** After conferring with my colleague who is helping me answer questions, it has come to my attention that my responses are very long-winded. I am hoping that you all will find the depth of my answers useful and that's what you came to this AMAA with the expectation of receiving.\n\n**Second edit:** It's 2 pm, and duty calls for me to attend a variety of meetings very soon for which I must prepare. Thanks all who submitted questions and visited! Thanks to those who helped answer questions, as well! Finally, thanks to the mods for letting me host this here! =) Hopefully if I get some time later, I will be able to come back and answer any questions that cropped up. In the mean time, please join the GEO at the Union from 9 am - 1 pm Monday and show your support! =]  Verified. This is, indeed, the co-president of our GEO. Thanks for verifying me! Annnd flair. They ended up being a little big so that they'd show up right.\n\nAfter the AMAA is over I'll set it so that anyone can select it as flair. For now, it can be a mark of official-ness.     &gt;**from Lsndr_Spnr**\n\n&gt;How will the actions of the GEO help keep down tuition costs of undergraduate students? Lack of flexibility with respect to tuition waivers seems to only encourage the administration to pass the costs of education from graduate students at the university onto undergraduates at the university. What is the GEO doing to insure that the administration doesn't continue to pass these costs onto tax payers and undergraduate students?\n\nThis is a very reasonable question. Interestingly enough, when the University provides tuition waivers to graduate students, it is not spending any money that it must recoup through tuition. In fact, no money trades hands. It isn’t like one office at the University sends funds to another office. The amount of money the grad student would have paid is just “waived.” Also, at the current rate of tuition for in-state undergraduate tuition, it takes some very small number of students (I think it’s less than four students) to come up with most of our yearly wages. Let me say this another way: Based on the tuition paid by only four students, my entire year’s salary is earned by the university.\n\nThink to your own courses that are taught by graduate students and think about how many students are in those sections and it is easy to see that the University takes in significantly more money than it is paying out to wages for graduate employees. Now, I can fully acknowledge that the total tuition collected by the University also needs to go toward paying professors, providing lab equipment, paying the Service Employees (solidarity, SEIU!) who make your dorm meals and clean building bathrooms, and of course pay the administration at the top levels. Additionally, the number of administrators has increased by almost 20% over the last five years. This is where tuition dollars are really going.\n\nIncoming tuition from undergrads pays for just less than a quarter of all the income the University receives. The money that is definitely coming in has magically not gone to help campus workers: Service Employees and GEO members have gotten just a smidge of an increase over the past few years, while some administrators have gotten up to 27% increases in their salaries (many of whom were already in the six figures). On average, your typical SEIU worker has been on a pay freeze for the past two years, GEO members have seen a small increase to our minimum wages – bringing us up to $14,820 -- which still does not bring us to the cost of living for this community, and the administrators have seen increases up to 27%.\n\nIf it isn’t clear by now, what I am trying to say is that the GEO is not cornering the University into raising tuition for undergrads just so we can get paid more or make sure we have tuition waivers. Instead, what we see in the numbers is that when undergrad tuition goes up, *so do the salaries for administrators but not for anyone else*. When you speak of tuition flexibility, it really comes down to how the University is paying its top administrators instead of paying its other employees like grad employees and service workers. The GEO is drawing attention to the fact that the administration is paying itself loads while keeping wages low for other employees on campus, but it is only until students and parents start to make their dissatisfaction known to the Board of Trustees that anyone will be held accountable. The GEO cannot dictate where the funds come from to meet the financial aspects of our contract, but we are not interested in simply passing the buck to undergrads. We want higher education to be available to all sorts of people from all walks of life! However, we are also not afraid to point out to anyone who will listen that the funds are there to improve our wages and ensure our waivers, but the administration is acting like a sponge for those funds for everyone.\n\n**TL;DR:** The University definitely has the income to not raise tuition for undergrads and still meet contract requests by the GEO.  I decided to start answering questions that I received over the past day or so. Most of these questions had started to be addressed by uiuc_grad, but I wanted to provide some further context. Here are those responses:\n\n&gt;**from knpayne2** \n\n&gt;Why do you think the university is trying to eliminate tuition waivers if it makes our graduate programs much less competitive? Are they trying to eliminate tuition waivers across the board or just for specific programs?\n\nWe think that the University is moving into a corporate model of business (it is officially a non-profit institution) and is seeking to generate revenue. Right now, the tuition for undergraduates is hitting a type of saturation point where even in-state students might be hard-pressed to attend school here without financial aid and government assistance. An audit conducted every year by Howard Bunsis (accounting professor at Eastern Michigan University) shows that the undergrad tuition has jumped 151% in the last decade. University officials have been quoted by the News-Gazette saying that tuition is almost at a breaking point for undergrads. The lead counsel for the University told GEO bargaining team members in March that the University is now looking to turn to graduate students as a source of revenue.\n\nSo to connect the dots: The University wants to make more money to pay its highest administrators, so since it has been squeezing undergrads too hard, now it wants to squeeze grad students in the same way. Eliminating waivers and requiring students to pay would open the door for higher education to those who can afford it – a type of “pay to play,” if you will. \n\nWe believe that the University is starting to cater to specific departments because of how they generate money through research and patents, which means it doesn’t care very much if certain humanities departments lose national prestige and fall by the wayside. Bear in mind that the Board of Trustees just announced at least six PhD programs will be cut soon.\n\nWe do not believe that the University is trying to shut down tuition waivers for every single graduate employee. However, we do know that the University wants the GEO to agree to contract language that prevents us from bargaining changes in tuition waivers for future students. This is ultimately what is scary for us – the University might charge students in one department some number and students in another department another number, and students in a third department would never pay a portion of their tuition. And the University wants the GEO to contractually agree to never have a say in how those individual departments may change their tuition policies.\n\n*Edit:* I originally responded to three or four questions in this post. I posted them as separate comments and removed those responses from this comment.  How much does graduate tuition actually cost? If the university charged as they do with undergraduates, what would be the comparative cost? [Here is a chart I found that describes the base rates for tuition for resident and non-resident graduate students](http://registrar.illinois.edu/financial/tuition_1213/AY/grad.html). There is obviously some fluctuation based on which college you belong to. [Here is a similar chart for undergraduate tuition rates](http://registrar.illinois.edu/financial/tuition_1213/AY/ugrad_base.html).\n\nTIL that the University charges basically the same rate for both of us. \n\nI am not clear what you are asking about regarding comparative cost. Feel free to rephrase and I'll make every effort to respond before the AMAA closes at 2 pm! =)  How does the compensation at UIUC compare to other Big 10 colleges?  &gt;**from roz77** \n\n&gt;I suppose my question is a bit more general. I was just wondering what the justification was for graduate students getting a tuition waiver and a stipend. I realize that TA's and RA's actually work for the university which is why they get paid, but they also take classes. Could someone provide me some numbers or something to show that grad students should be getting both types of financial assistance?\n\n&gt;I am certainly not against grad students receiving both tuition waivers and a stipend, I'm just wondering what the actual reasons are. The only reason I really ask is that a friend of mine who is also an alumni brought up this point. He and I are both in law school and are currently taking out loans to pay for it. Is that not an option for grad students? If this sounds combative, I promise I'm not trying to be. I'm just looking for some reasons behind the amount of financial assistance that grad students have available to them.\n\nThis is a very good question, and I am glad that someone asked it! The GEO’s position is that as graduate employees, we teach a solid fifth of all course instruction on this campus. However, the University saves a *lot* of money by paying us very low wages (we don’t receive stipends, we earn wages) instead of paying faculty to teach those classes. If the University had *no* graduate assistants to teach its courses, then it would have to hire professors to do all of that work for triple and quadruple the amount we are paid. We are *kind of* okay with the low wages (we would still like to earn the cost of living for this area and stop being able to apply for WIC and government aid) because we realize that we get substantial tuition waivers. Something to keep in mind is that we never see a dime of those tuition waivers, so even though we receive them, we don’t actually “cash in” on them. However, we consider both waivers and wages as part of the compensation for the work we put into the University. \n\nUnlike other graduate students who receive no waivers (for example, students in the College of Law or College of Medicine), our labor props up this university. If you are interested in the specific numbers, [this website from the University shows that grad employees teach 20% of all classes and 36% of all 100-level courses]( http://www.dmi.illinois.edu/cp/). Without being able to offer competitive wages and waivers, the University will not be able to attract star graduate students. It is common sense that qualified graduate students will be courted from a variety of grad programs, and they will go where the money is, so to speak. It is the GEO’s position that better qualified graduate employees results in better educated undergraduates. Therefore, continuing to offer compensation (in the form of livable wages and tuition waivers) is how you attract highly qualified graduate employees. As I have mentioned elsewhere, the money that goes into the tuition waivers is not money that changes hands, so it is not the case that the Administration is *spending* any money on graduate employees in that sense.  &gt;**from roz77** \n\n&gt;I suppose my question is a bit more general. I was just wondering what the justification was for graduate students getting a tuition waiver and a stipend. I realize that TA's and RA's actually work for the university which is why they get paid, but they also take classes. Could someone provide me some numbers or something to show that grad students should be getting both types of financial assistance?\n\n&gt;I am certainly not against grad students receiving both tuition waivers and a stipend, I'm just wondering what the actual reasons are. The only reason I really ask is that a friend of mine who is also an alumni brought up this point. He and I are both in law school and are currently taking out loans to pay for it. Is that not an option for grad students? If this sounds combative, I promise I'm not trying to be. I'm just looking for some reasons behind the amount of financial assistance that grad students have available to them.\n\nThis is a very good question, and I am glad that someone asked it! The GEO’s position is that as graduate employees, we teach a solid fifth of all course instruction on this campus. However, the University saves a *lot* of money by paying us very low wages (we don’t receive stipends, we earn wages) instead of paying faculty to teach those classes. If the University had *no* graduate assistants to teach its courses, then it would have to hire professors to do all of that work for triple and quadruple the amount we are paid. We are *kind of* okay with the low wages (we would still like to earn the cost of living for this area and stop being able to apply for WIC and government aid) because we realize that we get substantial tuition waivers. Something to keep in mind is that we never see a dime of those tuition waivers, so even though we receive them, we don’t actually “cash in” on them. However, we consider both waivers and wages as part of the compensation for the work we put into the University. \n\nUnlike other graduate students who receive no waivers (for example, students in the College of Law or College of Medicine), our labor props up this university. If you are interested in the specific numbers, [this website from the University shows that grad employees teach 20% of all classes and 36% of all 100-level courses]( http://www.dmi.illinois.edu/cp/). Without being able to offer competitive wages and waivers, the University will not be able to attract star graduate students. It is common sense that qualified graduate students will be courted from a variety of grad programs, and they will go where the money is, so to speak. It is the GEO’s position that better qualified graduate employees results in better educated undergraduates. Therefore, continuing to offer compensation (in the form of livable wages and tuition waivers) is how you attract highly qualified graduate employees. As I have mentioned elsewhere, the money that goes into the tuition waivers is not money that changes hands, so it is not the case that the Administration is *spending* any money on graduate employees in that sense.   Just wanted to wish you guys good luck. You're fighting a good fight and I really hope you all get the fair pay and tuition waivers you deserve.  Just wanted to wish you guys good luck. You're fighting a good fight and I really hope you all get the fair pay and tuition waivers you deserve.    What can we do to help you guys? What can we do to help you guys?  If we, as undergrads, have day-to-day research obligations (that include assurance of animal welfare), how can we cross picket lines without looking like we oppose this movement? If it was just a class, I wouldn't cross the line, but since animal welfare and ongoing research is at stake, I may have to cross the line should the GEO strike. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13rgg6/i_am_one_of_the_copresidents_of_the_graduate/"
  }, {
    "id" : 6,
    "title" : "Anybody want to adopt a cat?",
    "snippet" : "So my friend was keeping a cat in her apartment and the apartment people found out and now she has to give her away. The cat is 4 years old, female, neutered and comes with a few accessories such as as litter box, food bowl, etc. Any takers? You can PM me if you like. \n\nEDIT : Sorry all, but the cat has found a taker. Thanks for your interest anyway.    Your friend is a dumbass.   tell me more, tell me more!  Erm, what exactly?\n for example, is the cat de-clawed, is it an indoor or outdoor cat, is it micro-chipped, is it up to date on its shots, it is child-friendly, what color is it, what breed...the options are endless for someone with a little imagination.  what he/she said. earth to redditor! boyfriend &amp; I are anxiously awaiting the details:)   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13sm1b/anybody_want_to_adopt_a_cat/"
  }, {
    "id" : 7,
    "title" : "Considering going for a Master's in computer science...",
    "snippet" : "I recently graduated from DePaul with a Bachelor's degree in computer science and am now working full-time for a small company in Chicago, but I'm still considering my options for a potential Master's degree. Right now UIUC is my top choice, but I'm torn over whether I should try to keep working and just take classes part-time or to quit working and go full-time.\n\nThe latter option is tempting, but I have a few questions that go along with it:\n\n1. I found [this post](http://www.reddit.com/r/UIUC/comments/i7m9c/cheap_semiregular_travel_tofrom_chicago/) discussing options for heavy travel to and from Chicago. How viable is it to keep living in the Chicago area while taking classes on campus? On-campus housing doesn't seem to be very expensive, but it would be kind of nice to not have to move.\n\n2. What benefits/downsides are there to taking the M.C.S. program over the thesis-based M.S.? Given a choice I'd prefer to take the thesis program, since I heard that it makes it easier to apply for a Ph.D. (an option I'd like to leave open for the time being), but ultimately I'm not sure what the difference is.\n\n3. How easy is it to get around on campus? Living in the city I'm used to biking everywhere and, failing that, taking a train or bus. If I opted to stay in Chicago and commute down to Champaign for classes, would I be able to take my bike with me? If I move down to Champaign, would a bike be enough, or should I look into getting a car?\n\nAny information would be very much appreciated. Thanks in advance!   I also have few questions for you.\n1) Why do you want a Masters?\n2) How badly do you want it?\n\nHere are my answers to your questions\n\n1. This sounds like a bad idea to me\n\n2. I have a friend currently going through the MCS program and his primary reason for doing this is because he wants to keep on working (income) and also get a CS degree from a solid CS program. I'm not sure what the employers will think when you have a MCS compared to a MS degree, but I'm sure they will give you credit for it. Also MS degree will definitely make it easier to apply for a PhD - I think getting to know the professors in person and getting a recommendation is the biggest upside, even more so than having a paper published during your Masters.\n\n3. It is easy to get around campus even without a bike. But again I think commuting between Chicago and Champaign is a bad idea.\n\nIf you are lucky/good you can qualify for a RA or TA position. This will waive your tuition and you will get some stipend to get by without shelling out 15k (tuition + living) per semester.\n\n-current masters student who worked for 2 years in Chicago before coming back to get a Masters in CS\n Long-term, I'd like to pursue a career in some academic aspect of computer science, such as research or teaching, or at the very least work towards an engineering position at an established software company like Google. Most of the open positions around here are for IT sysadmins or web application developers, which I don't find nearly as interesting.\n\nAs for how badly, I've sort of always known that I wanted to go for one, but learning more about UIUC's reputation makes me even more certain. I know that, financially, it would be a better idea to just keep working and climbing the corporate ladder, but I don't find that option quite as compelling.\n\nMind if I ask how your Master's degree is going? Long-term, I'd like to pursue a career in some academic aspect of computer science, such as research or teaching, or at the very least work towards an engineering position at an established software company like Google. Most of the open positions around here are for IT sysadmins or web application developers, which I don't find nearly as interesting.\n\nAs for how badly, I've sort of always known that I wanted to go for one, but learning more about UIUC's reputation makes me even more certain. I know that, financially, it would be a better idea to just keep working and climbing the corporate ladder, but I don't find that option quite as compelling.\n\nMind if I ask how your Master's degree is going? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13st4c/considering_going_for_a_masters_in_computer/"
  }, {
    "id" : 8,
    "title" : "Going to and from midway airport",
    "snippet" : "I was wondering about the best ways to get from midway to campus, and from campus to midway. As far as I can tell the only 2 buses that have trips are Lex and perioa(?) but both take upwards of four hours each way. Are there easier ways of traveling, like perhaps renting a zip car to get to midway and back?  You could fly.\n\nYou could take many busses/trains to Union Station downtown, then the orange line from Union Station to Midway.\n\nWhy Midway?\n  I took Lex from Midway yesterday and the ride took 2 hr 45 mins (direct) even though the ticket said it was ~ 4 hour ride. But if by chance they make you change buses halfway through, then it'll take almost 4 hours.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13rms5/going_to_and_from_midway_airport/"
  }, {
    "id" : 9,
    "title" : "Is this possible, or even legal?",
    "snippet" : "     Can't wait to see course seats on StubHub.    I kinda hope they get busted.  I kinda hope they get busted.  I kinda hope they get busted.     I don't see how this is possible unless they keep their business volume very low. Since they can't arbitrarily create new Enterprise accounts to register and hold classes, they would have to find willing students to register for them. Each student can only hold so much classes since the university doesn't allow you to register for classes if it causes a time conflict and, of course, those same students have to register for their own classes.\n\nLegality, no idea. Us grad students can register for 20 hours, register early,  and often only want to take a class or two.  but usually you have a different section, so undergrads can't use those seats anyway\n    I messaged them for a class, and they said they'd monitor it so maybe they have a way to grab spots as soon as they open. I know a few people who wrote scripts to get into classes by constantly checking availability. They got into some trouble for doing so. How did they get caught? I won't answer your question, but I will tell you the penalty -- you are no longer permitted to register for classes. After they catch you, you have to have your college office do your registration for you (and they tend not to do it very quickly!). I won't answer your question, but I will tell you the penalty -- you are no longer permitted to register for classes. After they catch you, you have to have your college office do your registration for you (and they tend not to do it very quickly!). That seems really stupid; if you are able to do something clever like that to increase your change of getting into the class you need, congrats. If it was a CS class, give them a reward. I won't answer your question, but I will tell you the penalty -- you are no longer permitted to register for classes. After they catch you, you have to have your college office do your registration for you (and they tend not to do it very quickly!). How did they get caught? ",
    "url" : "https://www.facebook.com/UiucCourseSeats"
  }, {
    "id" : 10,
    "title" : "South Suburbs to Champaign tomorrow --&gt; 1 spot available ",
    "snippet" : "Very last minute, but I'm leaving the south suburbs (Orland Park area) headed back to Champaign around 4pm or so (after the Bears game). If you need a ride and are willing to split some gas money let me know!",
    "url" : "http://www.reddit.com/r/UIUC/comments/13r52g/south_suburbs_to_champaign_tomorrow_1_spot/"
  }, {
    "id" : 11,
    "title" : "Thrift stores that sell used furniture in the CU area?",
    "snippet" : "Greetings,\n\nAs the title says, I'm looking for thrift stores that sell furniture in the area to try to find a couch.  If you know of any, please post in the comments.\n\nThanks in advance!\n\n*edit - thank you all for your replies.  We ended up finding a nice couch at goodwill.  start and end at habitat restore (2nd and university) Are they open sundays by any chance?  We only have access to a truck tomorrow :(  You should keep an eye on craigslist too. People get rid of furniture for very cheap pretty regularly.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13qugj/thrift_stores_that_sell_used_furniture_in_the_cu/"
  }, {
    "id" : 12,
    "title" : "I got accepted as a transfer (computer science) for this spring but I don't see how I can attend until the summer. I'm a little lost here can could use some advice.",
    "snippet" : "Yesterday I was accepted as a transfer into the CS program. I really need to have CS 225 out of the way on the first semester because so many more CS class require it. Not taking it means significant delays. An equivalent class is available at my community college and I've been able to work a semester there that would keep me on track, but that would obviously mean that I couldn't attend UIUC. Part of my plan of study includes taking two classes over the summer, not doing so would also cause a significant delay. \n\nIs it going to be a problem that I won't be able to attend this spring? I really don't want to have to apply again and everything, especially because that would ruin my chances of studying in the summer. If it is a problem is there anything I can do about it?\n\nThanks in advance.  Someone correct me if I'm wrong, but I believe that an acceptance is good for a year, ie, you could wait as long as Fall '13 or Spring '14 to register for classes without any major complications.  Speak with a dean of engineering about that topic; even if it's not a set policy, I'll bet they'd be willing to work with you to get everything squared away.  If you don't already have a contact at the dean's office, send an email to Dean Ivan Favila - he's extremely knowledgeable and friendly. This. I transferred here and I did what you are planning to do. When you register they will just have to release a hold and you will be all good. Someone correct me if I'm wrong, but I believe that an acceptance is good for a year, ie, you could wait as long as Fall '13 or Spring '14 to register for classes without any major complications.  Speak with a dean of engineering about that topic; even if it's not a set policy, I'll bet they'd be willing to work with you to get everything squared away.  If you don't already have a contact at the dean's office, send an email to Dean Ivan Favila - he's extremely knowledgeable and friendly. I'd say this should be your first plan. If it doesn't work for whatever reason, you CAN take 225 with several of the courses that have it listed as a pre-req. \n\nAs a bit of an aside, 225 is a really good class at UIUC. It is one of the cornerstones of CS so taking it at CC seems like something you want to put some careful consideration into. Just a thought. I agree with this. You should never take an easy way out with an entry level course for your degree. When you take the classes that require 225, they will expect you to know all of the material that was presented in a UIUC CS225 class. If you take it elsewhere, you will probably put yourself behind other students.  I'd say this should be your first plan. If it doesn't work for whatever reason, you CAN take 225 with several of the courses that have it listed as a pre-req. \n\nAs a bit of an aside, 225 is a really good class at UIUC. It is one of the cornerstones of CS so taking it at CC seems like something you want to put some careful consideration into. Just a thought.  Did you transfer from another university?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13r3d1/i_got_accepted_as_a_transfer_computer_science_for/"
  }, {
    "id" : 13,
    "title" : "Ride from Union Station to Chicago tommorrow?",
    "snippet" : "Long story short, due to my poor planning I have no way from Chicago to Chambana tomorrow (Sunday). Can any one give me a ride? My train get's into Union Station at 3:55 tomorrow (Sunday).  Went the the Amtrak counter this morning when I got on in Minneapolis and was like:\n\nMe: \"You guys really sold out? Any way you can help me.\"\n\nDude behind counter: \"Looks like there are actually three tickets left to Champaign from Chicago. That'll be $38 kind sir.\"\n\nMe: http://bit.ly/teY2zm  Not sure if stating the obvious, but there's a few trains that leave from Union station to Champaign. You can take the bus from the train station to campus. The online booking system is being weird right now - I'd keep checking, [but here's a pdf you can get an idea from](http://www.amtrak.com/ccurl/671/419/Illinois-Missouri-Service-Schedule-20120709.pdf)\n\nI'd check asap, as the spots they have are probably gone, plus it's gonna be super expensive.  I should have stated that all the amtrak trains are sold out. That was the first place I looked. Greyhound system is indeed being weird, mega bus is sold out, and Lex and Suburban only pick up from locations way far away from Union Station. I should have stated that all the amtrak trains are sold out. That was the first place I looked. Greyhound system is indeed being weird, mega bus is sold out, and Lex and Suburban only pick up from locations way far away from Union Station. I should have stated that all the amtrak trains are sold out. That was the first place I looked. Greyhound system is indeed being weird, mega bus is sold out, and Lex and Suburban only pick up from locations way far away from Union Station. Usually when Amtrak is sold out I get on it anyway and buy my ticket from the conductor. It's never COMPLETELY sold out.",
    "url" : "http://www.reddit.com/r/UIUC/comments/13r2qw/ride_from_union_station_to_chicago_tommorrow/"
  }, {
    "id" : 14,
    "title" : "I am one of the leaders of the Graduate Employees' Organization. I will be running an AMAA on Sunday between 10 am and 2 pm about the union, federal mediation, and a potential work action.",
    "snippet" : "My name is Lindsay Anderson, and I am one of the co-presidents of the [Graduate Employees' Organization](http://www.uigeo.org/) at UIUC. I have been a redditor for more than a year and thought that doing an AMAA would be a great chance to interact with students and answer questions. For those who are interested, I have verified with the moderators already.\n\nAs many of you already know, [the GEO has passed an authorization vote to go on strike](http://www.news-gazette.com/news/education/2012-11-16/geo-members-take-next-step-toward-strike.html). The state of Illinois requires that an authorization vote is taken before any strike can be declared, but in our organization, this vote does not mean we have declared a strike. Instead, based on our constitution, this vote creates a new committee with the executive power to declare, suspend, or call off a strike. \n\nFor those of you who already have a good grasp on the issues but want to know how to get involved, [signing our petition is a great start, even if you're not a member](http://www.change.org/petitions/university-of-illinois-community-and-supporters-help-us-protect-tuition-waivers-for-teaching-assistants-and-graduate-assistants).\n\nI teach two undergrad classes and have openly invited my students to e-mail me their direct questions or ask about rumors they have heard. I am inviting you to do the same. The goal of this is to help anyone who hasn't been a part of our negotiation process to understand what our priorities are, what has been achieved, and what we have yet to come to agreement on.\n\nThis is an AMAA, so please be warned that there are a few topics I cannot speak to:\n\n* The start date of a work action/strike\n* Buildings that would be targeted for picket lines\n* How long a potential strike could last\n* Whether your own graduate instructors will hold or cancel classes\n* **Rampart** \n\nI hope to bring in one or two other union leaders to help answer questions tomorrow! \n\nWarmly,\n\n--Lindsay Anderson  Why do you think the university is trying to eliminate tuition waivers if it makes our graduate programs much less competitive? Are they trying to eliminate tuition waivers across the board or just for specific programs?  Why do you think the university is trying to eliminate tuition waivers if it makes our graduate programs much less competitive? Are they trying to eliminate tuition waivers across the board or just for specific programs?   How will the actions of the GEO help keep down tuition costs of undergraduate students? Lack of flexibility with respect to tuition waivers seems to only encourage the administration to pass the costs of education from graduate students at the university onto undergraduates at the university. What is the GEO doing to insure that the administration doesn't continue to pass these costs onto tax payers and undergraduate students? How will the actions of the GEO help keep down tuition costs of undergraduate students? Lack of flexibility with respect to tuition waivers seems to only encourage the administration to pass the costs of education from graduate students at the university onto undergraduates at the university. What is the GEO doing to insure that the administration doesn't continue to pass these costs onto tax payers and undergraduate students?  If tuition waivers are such an important issue, why wasn't there explicit guarantees provided for them in the last contract after the last strike?\n\nIs the University currently in violation of its contractual obligations?  If so, why hasn't the GEO taken this matter to court rather than fighting it out in the classrooms?  A courtroom would seem to be the more appropriate setting for a dispute of this nature.  I realize the ILESRB has ruled in favor of the GEO, but my understanding is their ruling is more of an opinion and does not carry any legal clout to compel change. &gt; If tuition waivers are such an important issue, why wasn't there explicit guarantees provided for them in the last contract after the last strike?\n\nGuarantees were made in the last contract back in 2009. Unfortunately, that contract expired in Aug 2012. \n\n&gt; Is the University currently in violation of its contractual obligations? \n\nYes, UIUC violated the last contract.\n\n&gt; If so, why hasn't the GEO taken this matter to court rather than fighting it out in the classrooms? \n\nThe conflict first went into arbitration, which ruled in favor of the GEO. UIUC appealed that decision to the ILESRB who then ruled in favor of the GEO. UIUC may appeal the decision to the court system. \n\n&gt; A courtroom would seem to be the more appropriate setting for a dispute of this nature. I realize the ILESRB has ruled in favor of the GEO, but my understanding is their ruling is more of an opinion and does not carry any legal clout to compel change.\n\nActually, it is legally binding. UIUC can appeal the decision.\n\n\n You did not answer all of my questions. If tuition waivers are such an important issue, why wasn't there explicit guarantees provided for them in the last contract after the last strike?\n\nIs the University currently in violation of its contractual obligations?  If so, why hasn't the GEO taken this matter to court rather than fighting it out in the classrooms?  A courtroom would seem to be the more appropriate setting for a dispute of this nature.  I realize the ILESRB has ruled in favor of the GEO, but my understanding is their ruling is more of an opinion and does not carry any legal clout to compel change.   I suppose my question is a bit more general. I was just wondering what the justification was for graduate students getting a tuition waiver and a stipend. I realize that TA's and RA's actually work for the university which is why they get paid, but they also take classes. Could someone provide me some numbers or something to show that grad students should be getting both types of financial assistance? \n\nI am certainly not against grad students receiving both tuition waivers and a stipend, I'm just wondering what the actual reasons are. The only reason I really ask is that a friend of mine who is also an alumni brought up this point. He and I are both in law school and are currently taking out loans to pay for it. Is that not an option for grad students? If this sounds combative, I promise I'm not trying to be. I'm just looking for some reasons behind the amount of financial assistance that grad students have available to them.   Firstly: could you please respond to the email that everyone received from the Illinois Provost on November 15? How can you justify using tuition waiver security as an excuse to strike when the email states: \n\n\"Contrary to a steady stream of communications from the GEO, degree seeking graduate assistants do not need to fear that their assistantship tuition waiver support will be reduced or eliminated. Providing tuition support through assistantships, scholarships and other financial assistance is the cornerstone for maintaining the excellence of our graduate programs. The University has provided tuition waivers and other forms of financial support to graduate students for many years, and we are committed to doing so in the future. Providing tuition support is essential to our ability to recruit the best and brightest graduate students.\"\n\nSecondly: I am in the College of Fine and Applied Arts. I have heard that teaching assistantships in my college are at lot more at stake than for STEM majors. Is this true? The GEO issued an official response already: http://www.uigeo.org/2012/11/15/open-letter-to-geo-members/ The GEO issued an official response already: http://www.uigeo.org/2012/11/15/open-letter-to-geo-members/ Firstly: could you please respond to the email that everyone received from the Illinois Provost on November 15? How can you justify using tuition waiver security as an excuse to strike when the email states: \n\n\"Contrary to a steady stream of communications from the GEO, degree seeking graduate assistants do not need to fear that their assistantship tuition waiver support will be reduced or eliminated. Providing tuition support through assistantships, scholarships and other financial assistance is the cornerstone for maintaining the excellence of our graduate programs. The University has provided tuition waivers and other forms of financial support to graduate students for many years, and we are committed to doing so in the future. Providing tuition support is essential to our ability to recruit the best and brightest graduate students.\"\n\nSecondly: I am in the College of Fine and Applied Arts. I have heard that teaching assistantships in my college are at lot more at stake than for STEM majors. Is this true? [I respond to this question at this link](http://www.reddit.com/r/UIUC/comments/13rgg6/i_am_one_of_the_copresidents_of_the_graduate/).  How could it be possible for the university to function in any stem major without the aid of graduate assistance?  900 bucks a month at 25% as well as a waiver that seems to be a solid deal.  And the Geo takes a due out of each graduate students pay on a monthly basis, what happens with that?   How could it be possible for the university to function in any stem major without the aid of graduate assistance?  900 bucks a month at 25% as well as a waiver that seems to be a solid deal.  And the Geo takes a due out of each graduate students pay on a monthly basis, what happens with that?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13pisq/i_am_one_of_the_leaders_of_the_graduate_employees/"
  }, {
    "id" : 15,
    "title" : "Naperville-&gt;Champaign on Monday. Leaving 7:30, arriving 10 AM. 3 seats left.",
    "snippet" : "Chip in five bucks or so for gas (or a good cup of coffee) and you've got yourself a seat.  Come pick me up in Elgin, Albert.  Come pick me up in Elgin, Albert.  And god fucking damn you for using that name http://i.imgur.com/mwuxn.jpg  Only $5 a person for gas? That's really cheap. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13q7rl/napervillechampaign_on_monday_leaving_730/"
  }, {
    "id" : 16,
    "title" : "When dorms open",
    "snippet" : "Is noon the absolute earliest you can swipe into the dorms tomorrow?    Also, I'm not sure if the dorms still do this, but when I was in the dorms the kitchen would open on Monday, not Sunday. So if you're arriving tomorrow, be ready to go out to eat or bring some extra leftovers from home. nah dining halls will be open tomorrow The only thing that will be open tomorrow is 57 North.  \nhttp://www.housing.illinois.edu/Announcements/Home%20Page/Fallbreakdining.aspx http://www.youtube.com/watch?v=YADolfPnR4c I swear I read somewhere that the dining halls were gonna be open...looks like I'm having chipotle again tomorrow Yeah I remember my first year in the dorms, and my shock when I saw both the dining halls and late night were closed on Sunday after Thanksgiving.  So sad :( I think I had Chipotle too :P ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13qnt0/when_dorms_open/"
  }, {
    "id" : 17,
    "title" : "Does getting a minor matter? /what are you minoring in?",
    "snippet" : "Does getting a minor mean that it shows up on your diploma anywhere? Does it make you more employable? I am 2 classes away from an English minor, so the point is kind of moot for me (I'm already committed to finishing it), but I would like to know where this thing will show up after I have taken like 7 classes to acquire it.\n           ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13pzkg/does_getting_a_minor_matter_what_are_you_minoring/"
  }, {
    "id" : 18,
    "title" : "I know this is late, but my roommate and I are considering Tower at 3rd. Honest reviews please!",
    "snippet" : "We were pretty set to live at Tower at 3rd and then my future roommate read negative reviews online. If anyone has any opinions, positive or negative, please let us know about your experience. Even if it's neutral let us know. Thanks.          [deleted] [deleted] It's not a dorm. So I would think not.  I've visited a friend who lives there and it seems pretty collegey, in that there are empty beer cans in the pool. Also it doesn't appear that they regularly clean the entrance area. That's all I can offer. they don't have a pool. are you thinking of Bromley?",
    "url" : "http://www.reddit.com/r/UIUC/comments/13oqwk/i_know_this_is_late_but_my_roommate_and_i_are/"
  }, {
    "id" : 19,
    "title" : "I'm selling my touch screen laptop if anyone is interested.",
    "snippet" : "I'm looking to sell my laptop as I recently purchased a Microsoft Surface. \n\nLaptop is an HP Touchsmart tm2\n\n500gb hard drive\n\ntouch screen with digitizer pen (great for taking notes)\n\ni5 processor \n\nWin7 \n\ncomes with Office 2010 \n\nAlso still has about a year and a half of warranty left on it that protects even accidental drops and such\n\nIf anyone is interested or wants more details, just ask.  Not too sure about price, I guess make me an offer.\n\n**EDIT:**  [Here](http://imgur.com/a/Raowd) is a few pictures.  why are you selling it?   How much ram and how much money?  Actual model number of the computer and actual model number of the i5? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13pd5v/im_selling_my_touch_screen_laptop_if_anyone_is/"
  }, {
    "id" : 20,
    "title" : "UIUC-Chicago Ties Spurring Illinois Startup Growth",
    "url" : "http://techli.com/2011/11/chicago-and-champaign-spur-illinois-startup-growth/"
  }, {
    "id" : 21,
    "title" : "Chemistry tutor scam?",
    "snippet" : "Hey everyone,\nI'm listed on the Chemistry Learning Center tutor list, and I've been receiving some fishy emails from \"Amber\" and her hs age daughter. The daughter needs a \"brush up on her general chemistry skills\". I'm wary because the return address is from a UK web address, and I keep getting multiple generic sounding responses from Mother Amber. I vaguely remeber someone warning me about a scam involving parents of hs students, but I'm not sure. Does this sound familiar to anyone? Is this a scam? I don't want to be rude to someone who really wants help.  \nThanks everyone!\n\nEdit: I read the email again and saw that Amber wants me to meet with her daughter at a residence in Urbana. This also made me think it was fishy.  A while ago I put up an ad on craigslist offering tutoring services for all ages. I got a response from a British person named Roebert Hampton, asking if I could tutor his teenage daughter for a few weeks while he was in the area. The email was exactly as follows: http://www.scamradar.com/reports/3475/tutoring-scam-from-roeberthampton001gmail-com.html\n\nThankfully, I kind of picked up on his shitty english and the fact he was asking for a little too much personal info to realize it's a scam. Try googling the text of your email to see if there are any other reports out there.\n\nBottom line, if it involves anything with your bank account, DON'T DO IT!!!!! KEEP IT TO CASH TRANSACTIONS ONLY I have an honest question; what exactly IS the scam?   &gt;I'm wary because the return address is from a UK web address\n\nIf someone from UK were trying to trick you, wouldn't they use a gmail or yahoo account so as *not* to look fishy? It has a \".co.uk\" at the end. I might be ignorant of the rules, but can you get a yahoo/gmail account if you live outside the US?  It has a \".co.uk\" at the end. I might be ignorant of the rules, but can you get a yahoo/gmail account if you live outside the US?    Scammers are also trying the same thing in the physics department. Similar situation. Definitely a scam.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13mx2p/chemistry_tutor_scam/"
  }, {
    "id" : 22,
    "title" : "Anyone willing to sell an Android phone?",
    "snippet" : "My phone broke, and I'm looking for something to last until I'm due for an upgrade.  Anyone have an Android phone they'd like to sell me?  I need something that will work on AT&amp;T.\n\nComment or PM me with:\n\n1. Model\n\n2. Android version\n\n3. Asking price\n\n\nThanks y,all!   I have an unlocked Tmobile galaxy S3 (will work with at&amp;t's 3g, not LTE however) that comes with a case and a protector and all the accessories.\n\nPics are here: http://chambana.craigslist.org/mob/3412547175.html\n(my listing)\n\nAsking for around 500, negotiable however. PM me or send me an email if interested!   Just wait until they restock and get the Nexus 4 from Google  samsung nexus s Model A9020I\nandroid 4.1\nUnlocked\n$200 Is this the 4G model of the nexus s? samsung nexus s Model A9020I\nandroid 4.1\nUnlocked\n$200 Sounds nice but I'm only looking to spend around $100.  Would you be willing to do it for that? nahh im sorry  Ok, I can stretch a little bit.  How about $150? im sorry but i just checked ebay, its unlocked and its in white which is rare. 200 is actually a lot lower than what i should get for it  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13ni0i/anyone_willing_to_sell_an_android_phone/"
  }, {
    "id" : 23,
    "title" : "Illini Win Maui Invitational!",
    "snippet" : "  Didn't trail once during the entire tournament, pretty impressive! Alright, I keep reading this. Weren't we trailing significantly during the Hawaii game, especially in the first half? I mean, we needed a buzzer beater to eke out a one point win.  The Hawaii game wasn't a part of the tournament.  It was just a regular game that was scheduled right before the tournament.  Ah, John Groce. Do I have to donate money to the university now? Ah, John Groce. Do I have to donate money to the university now?   It's been an awesome start! I am cautious for now, I am waiting until we hit the conference schedule, but damn if this team looks amazing for now. Nice having BP3 and DJ look like their old selves shooting around Good decision to avoid jumping to conclusions on this team.  Last year's squad started the season 10-0.  I'm still really excited though.\n\nhttp://espn.go.com/mens-college-basketball/team/schedule/_/id/356/year/2012/illinois-fighting-illini Last year's squad struggled against crappy DII teams. This year's squad is blowing teams that we should massacre out of the water minus Hawaii. Last year's squad struggled against crappy DII teams. This year's squad is blowing teams that we should massacre out of the water minus Hawaii. Just out of curiosity, which teams played last year were DII?  The final RPI lists a perfect 0-0 record against non-Div I schools.\n\nhttp://web1.ncaa.org/app_data/weeklyrpi/2012MBBrpi1.html I was assuming schools like St Bonaventure and Lipscomb were DII. I'm probably wron but regardless, we should have been crushing them last year not holding on for life at the end.   I'm hesitant to get really excited considering who we've played, but damn this is fun to watch!  I'm optimistic for the team, but I've said it before in this subreddit:  if we don't hit our threes, then we're going to lose games.  So much of our scoring comes from DJ, the Griff, and BP3 knocking down tres, that if we have a bad night then we probably won't win. I'm optimistic for the team, but I've said it before in this subreddit:  if we don't hit our threes, then we're going to lose games.  So much of our scoring comes from DJ, the Griff, and BP3 knocking down tres, that if we have a bad night then we probably won't win.     Can't wait to be ranked next week! Let's just hope it isn't anything like last year after we got ranked. I believe we immediately lost the rank and the got destroyed for the rest of the season. They gotta beat Gardner-Webb before I would consider that a possibility. Can't wait to be ranked next week! Let's just hope it isn't anything like last year after we got ranked. I believe we immediately lost the rank and the got destroyed for the rest of the season. &gt; I believe we immediately lost the rank and the got destroyed for the rest of the season.\n\nWe were ranked for 3 weeks in December and then again for a week later in January.  ",
    "url" : "http://scores.espn.go.com/ncb/boxscore?gameId=323260356"
  }, {
    "id" : 24,
    "title" : "Places to eat for Thanksgiving?",
    "snippet" : "Self-explanatory. On campus during Thanksgiving and looking for a place to go out for dinner. Any recommendations within driving range?   mary ann's diner!  The Opulent Siebel Center Café  Jimmy John's might be open.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13mu62/places_to_eat_for_thanksgiving/"
  }, {
    "id" : 25,
    "title" : "Of course this happens the year I choose to do Orange Krush",
    "url" : "http://www.quickmeme.com/meme/3rvoch/"
  }, {
    "id" : 26,
    "title" : "Hey all! I've been contacted regarding a CoD: Black Ops II intercollegiate tournament. If you're interested in representing UIUC and can scrape up a team, please PM me ASAP!",
    "snippet" : "    ",
    "url" : "http://www.geforce.com/landingpage/rivalries"
  }, {
    "id" : 27,
    "title" : "Champaign police  officer shot at dogs ",
    "snippet" : "  Why doesn't the headline of this story include the fact that the officer killed a family pet?  I feel like that's an important detail.  He didn't just \"shoot at\" the dogs.  He killed one of them in front of a little girl.\n\nThis guy's judgement is clearly terrible.  He opened fire in a suburban area across the street from a high school to stop a dog fight.  [deleted] With the aim and decision making skills this officer demonstrated, the outcome could've been much worse.  He's lucky the girl didn't try to step in to save her dog.  He's lucky there weren't other kids nearby to catch a stray bullet.  Hell, he's lucky you didn't catch a stray bullet.\n\nUsing lethal force is a serious decision with serious consequences.  This officer cannot be trusted with that responsibility. [deleted]  While I think we can all agree this cop displayed very poor judgement, why was he dispatched to a dog fight? Does Champaign not have an animal control unit? If two dogs are fighting getting in the middle of it is dangerous, but animal control has the equipment to handle it.    What the fuck? What is with going straight for the gun? It's not like police officers are equipped with batons, tazers, or pepper spray. Geeze. Normally I'd be defending police in a situation like this, I think people are too critical of them.  But I think the issue here is he shot the family's dog (that did nothing but defend itself) instead of the pitbull with no owner that came out of nowhere and attacked it.\n\nedit:  are you saying you would attack a pitbull with a baton? He fired 8 shots(by the daughter's estimate), ONE hit the family dog, I think it's safe to say that one shot hit \"Dog\" by mistake.  \n\nI'm not defending the cop's bad decision, just read more carefully please What the fuck? What is with going straight for the gun? It's not like police officers are equipped with batons, tazers, or pepper spray. Geeze. I concur with the pepper spray idea...seems like a much better first option than the sidearm. Pepper spraying a dog won't make it stop, it'll make the situation much much worse. Now you'll have a dog who feels threatened by you. Even the most harmless pet can kill you if it feels like its life is in danger. I'll take my chances with a pepper-sprayed pet over it being shot. B/c the life of a dog is more valuable then the safety of your own body? \n While it's true people have noted that my actions have a tendency towards recklessness, in this case I am trying to state that if it were my dog in that situation, I would want pepper spray tried before shots being fired.  If it doesn't work, and there's no other option, then shoot.  But yes, I am willing to risk personal harm to save the life of my dog.  If that's irrational, so be it.  I say this having the experience of being attacked by two large, feral dogs at once in the middle of nowhere, and I managed to fend them off suffering a bite on my arm, bruises and scratches.  Had to get rabies shots and everything. I believe you and honestly if it was my dog, I'd completely agree. But it wouldn't be us in danger. It would be the officer. Police (espcially UIPD) are underpaid and underappreciated for all the work they do. A fair point - one I concede.   I believe you and honestly if it was my dog, I'd completely agree. But it wouldn't be us in danger. It would be the officer. Police (espcially UIPD) are underpaid and underappreciated for all the work they do. While it's true people have noted that my actions have a tendency towards recklessness, in this case I am trying to state that if it were my dog in that situation, I would want pepper spray tried before shots being fired.  If it doesn't work, and there's no other option, then shoot.  But yes, I am willing to risk personal harm to save the life of my dog.  If that's irrational, so be it.  I say this having the experience of being attacked by two large, feral dogs at once in the middle of nowhere, and I managed to fend them off suffering a bite on my arm, bruises and scratches.  Had to get rabies shots and everything. If you really have been attacked by two large feral dogs, and are condemning a police officer from protecting himself AND others in a situation almost identical. \n\nSeriously?\n I conceded the use of lethal force over pepper spray from the officer's point of view.  But that's not what I would do if it were my pet involved.  That's a risk I would definitely take.  So either I'm confident in my abilities to handle variations on situations which have previously been able to manage, or I'm a little nuts.  Take your pick, I don't really care which you go with. I'm very impressed with how rational this conversation has remain.  Part of the reason I think I feel so differently than you as I am sick of the human concept of valuing the life of a pet/animal over the life of another human being. \n\nDuring a presentation on the black death I was explaining how nearly a third of the earths population died, my classmates continued to listen to my speech.  When I mentioned that 25 million cats and dogs were killed in order to stop the spread/by the plague they were audibly and visibly upset.\n\nWtf people?!    Any cop who shoots at a dog that hasn't bitten him should be relieved of his employment and retrained for something more suitable to a coward, like stocking shelves in a warehouse. What's wrong with stocking shelves in warehouses? Any cop who shoots at a dog that hasn't bitten him should be relieved of his employment and retrained for something more suitable to a coward, like stocking shelves in a warehouse. Any cop who shoots at a dog that hasn't bitten him should be relieved of his employment and retrained for something more suitable to a coward, like stocking shelves in a warehouse. There's no need to be contemptuous of people who stock shelves, and label them cowards. Any cop who shoots at a dog that hasn't bitten him should be relieved of his employment and retrained for something more suitable to a coward, like stocking shelves in a warehouse. So a cop should not shoot a criminal that has a gun pointed at him until he is shot?  I'd say until he's been shot at, but there's a difference between \"a criminal\" and \"a dog\".  I'm got-damn tired of cops who are so afraid of being bitten by dogs that they blast away the instant they see one moving toward them.  Family pets who are curious about the new guy in the yard don't merit being shot, and a cop who is so fearful of his own safety around dogs that he opts to shoot first shouldn't be a cop -- because sooner or later, he'll do it to a person. &gt; family pet\n\nUnrestrained pit bull attacking a girl's dog   Let it go maybe the cop was a bad shot, maybe he meant to hit the pitbull but missed no one knows but the cop. What other way did the family expect the officer to break up the fight? Kicking was not doing it, maybe you could risk pepper spray. When the time comes to press charges they should all go to the pitbulls owner and not the cop. Why couldn't he use a tazer? Why couldn't he use a tazer? Let it go maybe the cop was a bad shot, maybe he meant to hit the pitbull but missed no one knows but the cop. What other way did the family expect the officer to break up the fight? Kicking was not doing it, maybe you could risk pepper spray. When the time comes to press charges they should all go to the pitbulls owner and not the cop. Nah, no reason to shoot eight shots. No reason to shoot at all. One person couldn't break up the dogs, but if the owner had gotten the leash of her dog, the officer could have restrained the other dog without use of a gun at all. Entirely unreasonable and not at all ok, I hope the officer is fired and/or suspended.  I really want to see you restrain a pitbull without a collar that is trying to kill another dog. Let me know how that goes for you. I really don't think people understand how a dogfight works. I really want to see you restrain a pitbull without a collar that is trying to kill another dog. Let me know how that goes for you. Nah, no reason to shoot eight shots. Let it go maybe the cop was a bad shot, maybe he meant to hit the pitbull but missed no one knows but the cop. What other way did the family expect the officer to break up the fight? Kicking was not doing it, maybe you could risk pepper spray. When the time comes to press charges they should all go to the pitbulls owner and not the cop.",
    "url" : "http://www.news-gazette.com/news/parks-and-recreation/2012-11-21/champaign-police-investigate-why-officer-shot-dogs.html"
  }, {
    "id" : 28,
    "title" : "Anyone on Campus over Thanksgiving Break? ",
    "snippet" : "looking for people to hang out with ... am on campus for the break and nothing to do.   So you want to meet up with some random person from reddit? This should go well. So you want to meet up with some random person from reddit? Our meetups have always been rather successful, actually.\n\nAnywho, I'm around, but prettty busy - almost a dozen relatives in town between me and my girlfriend.",
    "url" : "http://www.reddit.com/r/UIUC/comments/13lkyv/anyone_on_campus_over_thanksgiving_break/"
  }, {
    "id" : 29,
    "title" : "Why are there homeless people on Green Street?",
    "snippet" : "I never understood why there would be beggars in a college campus. Can anyone shed light as to why this is? I don't mean to be rude or anything like that ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13m6fa/why_are_there_homeless_people_on_green_street/"
  }, {
    "id" : 30,
    "title" : "Where can I meet a professor with a team on campus?",
    "snippet" : "This might be a silly question, but 4 engineering students(including me) have to meet with a professor in LAS somewhere on campus, and I cant decide where would be an appropriate place. Any suggestions?  Try Joe's Try Joe's  * The professor's office\n* Conference room in the department\n* A classroom\n* A coffee shop\n* Illini Union\n  Try to reserve one of the conference rooms in Siebel Center.  They're very nice.",
    "url" : "http://www.reddit.com/r/UIUC/comments/13lwl7/where_can_i_meet_a_professor_with_a_team_on_campus/"
  }, {
    "id" : 31,
    "title" : "Engineers Without Borders - Info please?",
    "snippet" : "Hey people,\n\nSo I kind of want to join engineers without borders since it sounds pretty rad but I missed all the meetings this year and their website is down: http://www.ewb-uiuc.org/\n\nDoes anyone know there meeting times and where they meet?\n\nAlso anyone who is involved I would love to hear your experiences with the organization.\n\nThanks.  Intern to one of the board members here.  We haven't had a general meeting in a little while, but we have 3 projects each with different meeting times.  \n\nCameroon water project: \nWed 6:00 PM   EH112\nSun 1:00 PM EH112\n\nGuatemala Water project:\nMon 6:00 PM   NCEB 1311\n\nNigeria Water Project:\nThu 8:00 PM   EH112\n\nI don't know enough about all the projects for me confidently give you a good description about them, so when you get the chance, come visit our office at 106A Engineering Hall!  Someone is almost always there, and they'll be happy to help you out! I'm interested in the Cameroon water project, I'll check out the meeting or head over to the office sometime.\n\nThanks for the info You can just show up to one of the meeting times. Either come a little early or stay afterwards and talk to the project leads. May be a little confusing or overwhelming at first, but if you're interested and willing to do a little learning, you can get caught up to speed pretty quick.\n\n(coming from a 2-year member and someone who joined mid-semester freshman year) Thanks for the tips, which project are you working on this semester? How do you like it? I'm on the cameroon project right now. I've been on it since freshman year and really enjoy it. The whole experience is kind of what you make it though. The guatemala project is getting close to the end (within a semester or 2 i believe), but there is plenty of work to do there. Exec is currently trying to find new members to help start up a brand new project completely from scratch so if you're interested in that, PM me and I can forward you the most recent email asking for people to apply to be a committee member for the new project. You could learn more about that by stopping in the office during someone's office hours. Let me know if you have any other questions",
    "url" : "http://www.reddit.com/r/UIUC/comments/13m0jg/engineers_without_borders_info_please/"
  }, {
    "id" : 32,
    "title" : "I &lt;3 Groce",
    "snippet" : "That is all.  The jury is still out for me. This core group of players has traditionally done fairly well the first half of the season, then completely fallen apart in the second half. I myself put a lot of the fault on Weber in that regard.\n\nBut even from these Maui games, the defense is intense and engaged the entire game, the players look to be enjoying themselves on both ends, and there is more emphasis on driving to the lane than there ever was under Weber (sans Dee/Deron/Luther).\n\nThere will be growing pains, but there's no reason they shouldn't be on the level of if not better than the second tier (Wisconsin/Minny/Purdue/NW) which would mean an NCAA appearance. The jury is still out for me. This core group of players has traditionally done fairly well the first half of the season, then completely fallen apart in the second half. I myself put a lot of the fault on Weber in that regard.\n\nBut even from these Maui games, the defense is intense and engaged the entire game, the players look to be enjoying themselves on both ends, and there is more emphasis on driving to the lane than there ever was under Weber (sans Dee/Deron/Luther).\n\nThere will be growing pains, but there's no reason they shouldn't be on the level of if not better than the second tier (Wisconsin/Minny/Purdue/NW) which would mean an NCAA appearance.   It's good to see that one of our coaches we got this year is making an impact. It's good to see that one of our coaches we got this year is making an impact. not to be a downer, but we haven't played anyone particularly good yet. i'm optimistic that groce will have an impact, but it's too early to say. i do like that he's a bit less of a dope than weber was.\n\nlooking forward to this game against butler (though i'm not really sure what to make of that team yet either). after barely putting up a fight against xavier, they picked off UNC (who, by the way, has been consistently overrated to start seasons as of late). not to be a downer, but we haven't played anyone particularly good yet. i'm optimistic that groce will have an impact, but it's too early to say. i do like that he's a bit less of a dope than weber was.\n\nlooking forward to this game against butler (though i'm not really sure what to make of that team yet either). after barely putting up a fight against xavier, they picked off UNC (who, by the way, has been consistently overrated to start seasons as of late).  Same + he looks like lance armstrong During the game, they had an interview with Groce saying people thought he was Jim Furyk.  Same + he looks like lance armstrong  Don't get too excited. I think we're still relying a little too heavily on the jump shot. It seems like we're making progress towards establishing more of an interior game. Instead of just countless pick and rolls, I know I've seen some of our forwards set the pick and then drop into the lane for the pass. We've been shooting relatively well from beyond the arc recently, and the real test is how we do when we're not shooting well from distance. \n\nHowever, I am willing to give Groce a pass on the first couple years because I think our backcourt way outshines our front court. Weber was obsessed with getting guards and it doesn't seem like we really acquired enough talent up front. Hopefully Groce can manage that situation while recruiting a more balanced team for the future.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13jtyt/i_3_groce/"
  }, {
    "id" : 33,
    "title" : "I am a guy who likes riding Lex Express AMA. ",
    "snippet" : "I don't get all the hate towards Lex; they're the only bus that lets you drink on it. I usually just bring a six pack with me and sit next to a cute girl and enjoy the ride. Obviously I sit next to a cute girl to internally debate whether or not I should talk to her and hope I'm not being super creepy in true Redditor fashion. \n\nAlso, their bus drivers will speed if you offer them a pack of Newport and a 40.   Opinion on the 49ers quarterback debate?  Proof? depending on what it's a six-pack of it's between 6-9 proof.   Lex is a shortening of \"**L**incolnland **Ex**press\" so isn't \"Lex Express\" redundant? Or is Lincolnland Express Express really the full name of the company?   They're sloppy with your credit card info. If that isn't a cause for hating them, I don't know what is. Source: personal experience They're sloppy with your credit card info. If that isn't a cause for hating them, I don't know what is. Source: personal experience Proof of this?  Would you rather fight 100 duck-sized horses or 1 horse-sized duck?    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13l6zl/i_am_a_guy_who_likes_riding_lex_express_ama/"
  }, {
    "id" : 34,
    "title" : "Highlights of the Illini being surprisingly good in a blowout vs USC",
    "snippet" : "   Looks like a pretty good Illinois crowd there.   I'm really having high hopes for this team, they're off to an amazing start.    ",
    "url" : "http://www.youtube.com/watch?v=kreLEpOVLrI&amp;"
  }, {
    "id" : 35,
    "title" : "In case you missed the Illini-USC game last night..",
    "snippet" : "  I'm very excited about Illini basketball. After the football season, I need something to look forward to sports-wise. I'm very excited about Illini basketball. After the football season, I need something to look forward to sports-wise.  ",
    "url" : "http://i.imgur.com/trap3.jpg"
  }, {
    "id" : 36,
    "title" : "I need a running buddy!",
    "snippet" : "UIUC!\n\nI'm planning to run the half for the Illinois Marathon. I keep falling off the bandwagon, so does anyone wanna train with me? I am pretty slow yet very encouraging so we can encourage each other.  Even if you're running a smaller race I just need someone to run with me.    I'd volunteer to run with you, but I hate running on campus (too many crosswalks, pedestrians, etc.).  says Kelly from the city. I'd volunteer to run with you, but I hate running on campus (too many crosswalks, pedestrians, etc.).   What times are you thinking for your running schedule ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13jxku/i_need_a_running_buddy/"
  }, {
    "id" : 37,
    "title" : "[x-post from AdviceAnimals] How I feel being in a college town during break.",
    "snippet" : "  Break is the best, because there are no students around. I can go to Maize and walk right in and order; I can go to Black Dog and walk right in and sit down; I have a million of these, but they pretty much all involve restaurants that I no longer have to wait for a table at.   ",
    "url" : "http://i.qkme.me/3rtxui.jpg"
  }, {
    "id" : 38,
    "title" : "Mario Tennis? [N64]",
    "snippet" : "What are the odds that someone on here has a copy of Mario Tennis for the N64 they would be willing to part with? (And maybe a controller or two?)\n\nI would like to surprise my girlfriend's son and my brother with some Mario to go along with the Thanksgiving festivities this weekend, and have been unable to casually find one. No GoodWill, Pawn Stop, Craigslist, etc.\n\nThanks guys, hope you all have a great holiday!  Have you tried Exile on Main St. or Live Action Games? If not, USB controllers &amp; an emulator. Yes to Exile, I've not heard of LAG, I'll look them up!\n\nEDIT: Wow, I work like a block away from LAG, not sure how I missed them...  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13ivfe/mario_tennis_n64/"
  }, {
    "id" : 39,
    "title" : "Anyone have good or bad experience with Johnson Rentals",
    "snippet" : "I've been searching for a 3 bedroom apartment for next fall after living in dorms for two years and Johnson Rentals seemed appealing, considering they were they were as cheap as CPM and University Group but didn't have as many complaints. I looked on the apartment threads on this subreddit and people seem to like them and they have had only had 2 complaints from the tenant union in the past four years. However on the Google reviews and mycampuslandlord.com they have been reviewed terribly, sounding worse than CPM. I know there is a trade-off for cheap apartments but when a company is called \"scam artists\" I am a bit hesitant to sign a lease with them. I was wondering if anyone here has had any experience with them and what they thought of the company.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13j97p/anyone_have_good_or_bad_experience_with_johnson/"
  }, {
    "id" : 40,
    "title" : "Illinois to the legends?",
    "snippet" : "Sounds like when  Maryland joins Illinois will move to the legends division. Anyone confirm this by chance?  For those of us who don't really know anything about NCAA sports, what impact would this have on our teams? If you have to ask this, you won't notice any impact. If you have to ask this, you won't notice any impact. For those of us who don't really know anything about NCAA sports, what impact would this have on our teams? I can give some considerations  for 3 teams bball fball and wrestling.\n\nFootball it would switch us to playing teams like Nebraska Michigan Michigan state and Iowa for a regular conference schedule. This honestly can be a positive thing because the leaders division will only get tougher once Ohio state and Penn state have their respective suspensions lifted. It will also be nice playing Iowa more so I can talk shit to my friends when we beat them.\n\nBasketball it will not matter because conference schedules usually involve playing each team one. One time at home and one time on the road. Will be interesting to see if they go to a tournament style for each side of the conference but I feel that would just be too tedious when you are already playing every team in the conference. \n\n\nWrestling I feel gives us a positive. I could be wrong but I think that gives us a chance to beat Iowa early for the conference championship? I could be wrong on there but the way our team looked last year I think they will have no problem winning the conference.  I can give some considerations  for 3 teams bball fball and wrestling.\n\nFootball it would switch us to playing teams like Nebraska Michigan Michigan state and Iowa for a regular conference schedule. This honestly can be a positive thing because the leaders division will only get tougher once Ohio state and Penn state have their respective suspensions lifted. It will also be nice playing Iowa more so I can talk shit to my friends when we beat them.\n\nBasketball it will not matter because conference schedules usually involve playing each team one. One time at home and one time on the road. Will be interesting to see if they go to a tournament style for each side of the conference but I feel that would just be too tedious when you are already playing every team in the conference. \n\n\nWrestling I feel gives us a positive. I could be wrong but I think that gives us a chance to beat Iowa early for the conference championship? I could be wrong on there but the way our team looked last year I think they will have no problem winning the conference.   &gt; When Maryland and Rutgers join they will move into the Leaders Division occupied by Ohio State, Penn State, Wisconsin, Purdue and Indiana, Loh told the board of regents. Illinois then would shift from the Leaders to the Legends Division.\n\n[Source.](http://espn.go.com/chicago/story/_/id/8651934/maryland-terrapins-rutgers-scarlet-knights-join-big-ten-sources-say) I would hate for this to happen, bad for us from football standpoint. It can only get worse. wrong. At this point we are only going to go up. Not saying this is an overnight ordeal but we will be fine in football. Just give beckman time to bring his class in. Don't forget the year after zook went 0 and 8 in conference play. wrong. At this point we are only going to go up. Not saying this is an overnight ordeal but we will be fine in football. Just give beckman time to bring his class in. Don't forget the year after zook went 0 and 8 in conference play. I would hate for this to happen, bad for us from football standpoint. Football wise yes. But just imagine from a basketball perspective. Literally the only \"tough\" teams would be Michigan and Michigan State. I dont know how this would work with 14 teams, but right now, we don't use divisions for basketball. We play 7 teams twice each year and the other 4 once for a total of 18 league games. The \"one plays\" rotate each year. But with two more teams, we would probably have to go by divisions, but I dont know how the big ten tournament seedings would work. Maybe have each division play a tournament, and the champs play each other for the Big Ten title. As you mention, there are no divisions for basketball now and there probably won't be in the near future. The Big East currently has 16 men's basketball teams and they do not have divisions. The Big East tournament uses a combination of a two-round bye and one-round bye.\n\n*Edit: Adding, the B1G could easily seed 3-14 with 1 &amp; 2 getting a one round bye. I dont know how this would work with 14 teams, but right now, we don't use divisions for basketball. We play 7 teams twice each year and the other 4 once for a total of 18 league games. The \"one plays\" rotate each year. But with two more teams, we would probably have to go by divisions, but I dont know how the big ten tournament seedings would work. Maybe have each division play a tournament, and the champs play each other for the Big Ten title. Looks like there would be more \"one play\" matchups per season, and will now take more seasons for the rotation to complete itself. I would hate for this to happen, bad for us from football standpoint.   Does this mean an end to Illibuck? That might actually be a good thing. Probably not.  Our currently protected rivalry game across divisions is Northwestern.  It would probably become tOSU.\n\nHowever, even if we did not play tOSU every year, the trophy game would remain and just not be played for as often. hahahaha tOSU. i lolled. \n\nDef going to start using that It's an easy way to distinguish between them and Oregon State and Oklahoma State.  They're so very very proud of their \"THE Ohio State University\".\n It's an easy way to distinguish between them and Oregon State and Oklahoma State.  They're so very very proud of their \"THE Ohio State University\".\n Probably not.  Our currently protected rivalry game across divisions is Northwestern.  It would probably become tOSU.\n\nHowever, even if we did not play tOSU every year, the trophy game would remain and just not be played for as often. Probably not.  Our currently protected rivalry game across divisions is Northwestern.  It would probably become tOSU.\n\nHowever, even if we did not play tOSU every year, the trophy game would remain and just not be played for as often.",
    "url" : "http://www.reddit.com/r/UIUC/comments/13gp4r/illinois_to_the_legends/"
  }, {
    "id" : 41,
    "title" : "fun stuff to do in urbana",
    "snippet" : "i've been in urbana and am a student at UofI, what are some fun things to do around campus in the city during thanksgiving break when everyone is MIA??    * The arboretum\n* Japan House\n* Curtis Orchard\n* Krannert Art Museum\n* Spurlock Museum\n* A movie at the art theater (or Beverly or Savoy)\n* A walk in Crystal Lake Park or Meadowbrook Park (a little cold for that now)\n* Brunch at Le Peep or Original Pancake House\n* Pastries from Mirabelle or Rick's Bakery\n* Shop at Market Place Mall  I second the Art Theater suggestion. It's nothing like Beverly or Savoy. Smaller theater that shows more indie/limited release/special interest/older films. I don't know if this is still the case, but you could go to later shows (10pm) for something like $3. * The arboretum\n* Japan House\n* Curtis Orchard\n* Krannert Art Museum\n* Spurlock Museum\n* A movie at the art theater (or Beverly or Savoy)\n* A walk in Crystal Lake Park or Meadowbrook Park (a little cold for that now)\n* Brunch at Le Peep or Original Pancake House\n* Pastries from Mirabelle or Rick's Bakery\n* Shop at Market Place Mall    diy shows that's not fun!! nothing education related is preferred after this frickkin semester that's not fun!! nothing education related is preferred after this frickkin semester [the silver bullet?](http://www.silverbulletbar.net/) [deleted]    go to Bunny's Food's good.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13hkff/fun_stuff_to_do_in_urbana/"
  }, {
    "id" : 42,
    "title" : "Best VPN service for Champaign/Urbana",
    "snippet" : "I'm looking to subscribe for a VPN service (not the school one, which I already have. This is for public, open internet). I'd like to minimize the slowdown from doing this and I'm wondering if anyone here has any experience with one. I've googled, etc, but haven't really found any reviews/ratings based on location.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13homz/best_vpn_service_for_champaignurbana/"
  }, {
    "id" : 43,
    "title" : "UofI on theverge",
    "url" : "http://www.theverge.com/2012/11/18/3660272/bio-bot-3d-printing-university-of-illinois"
  }, {
    "id" : 44,
    "title" : "I really should have taken an earlier bus home",
    "snippet" : "  congrats, you can actually do things on campus now  Ya, but now the short lines in Chipotle make it worth going.  ಠ_ಠ   You imply everyone lives in the suburbs... You imply everyone lives in the suburbs... [deleted]",
    "url" : "http://qkme.me/3rtxzu"
  }, {
    "id" : 45,
    "title" : "When do course overloads start?",
    "snippet" : "Hi. I registered for a course overload through LAS, but I'm not sure when I can begin registering for extra courses. On the website, it says it takes effect immediately, but I also think I remember seeing 11/19 somewhere when I made the request. Anybody know?  It happens whenever they type it in at your college office. I don't know if there is a policy about this. Why not just call 217-333-1705 and press 1?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13g760/when_do_course_overloads_start/"
  }, {
    "id" : 46,
    "title" : "Key found in Madison, WI",
    "snippet" : "I found a University of Illinois key while walking around my own campus, pm me if you lost one (perhaps where you think you lost it/identifying characteristics to validate that it's actually yours)   Wait, is it a dorm key? I'm visiting the Madison campus right now. Yeah I'm pretty sure it is",
    "url" : "http://www.reddit.com/r/UIUC/comments/13eunt/key_found_in_madison_wi/"
  }, {
    "id" : 47,
    "title" : "General interest poll: Magic The Gathering tournament",
    "snippet" : "Hey reddit,\n\nI'm the special events manager with the Social Gaming Club and we've been exploring the possibility of holding a Magic: The Gathering tournament next semester. I'm not entirely sure if there is a large enough Magic community on campus for us to be able to do this; I know of maybe a dozen Magic players, but that would probably not be enough. (I'm also not sure what kind of format we should use.) I understand there are a few Magic groups that meet up on Wednesday and Friday nights, but I've been having difficulty contacting them.\n\nIf any of you would be interested in such an event, or if you have any ideas for what sort of format we should use, leave a comment or PM me!  I've actually been learning and getting into the game for the first time recently, so I'd totally love to play events and get some experience (although I don't have a deck and am probably terribad :/).\n\nI think setting up a draft tourney would be really cool, because of the budget independence, and also because it doesn't exclude those with incomplete/nonexistent decks (like me XD).\n\nAlso if anyone knows of regular magic playing groups I would be interested if they allow newish people. :p My advice if you want to learn the game more deeply without putting in the money is trying out cockatrice.de.  It's a client to play magic online with free use of cards, so you can test decks and playstyles before you invest money. Yeah I've actually been playing with my friend and his ~2 year old decks. I also bought Duels of the Planeswalkers 2013 on Steam and have been having a ton of fun with that so I'm kinda yearning for more haha. Yeah I've actually been playing with my friend and his ~2 year old decks. I also bought Duels of the Planeswalkers 2013 on Steam and have been having a ton of fun with that so I'm kinda yearning for more haha. I got Duels of the Planeswalkers today, haha. I've been meaning to get back into playing for a while (haven't played since I was in 5th grade, and wasn't particularly good then). I decided to get an intro deck, and would love to get some experience playing against real people. If you'd want to set up a few games with someone else that's new-ish, let me know. Yeah that would be cool. I've been seriously enjoying DotP so I was gonna get the deck builder kit and maybe a fat pack.\n\nI'm probably going to get cards next week or something, if you want to play in the union or something that would be cool. Also I was gonna try to look into that magic club mentioned and maybe try awkwardly lurking around the Armored Gopher once I start feeling like I won't get rolled.   The Armored Gopher in Urbana has about 40 players every Friday for Magic, and they often don't have enough room for everyone.   A tournament would definitely be best be done with a limited format. I'd suggest sealed to start people off. I'll also link this thread to the Facebook group of the Magic Club people. Ideally, this would be the best option. However, this would mean that we would have to purchase cards before knowing how many people will show up, and that provides a certain element of risk.\n\nCould you link me the magic club page? I couldn't seem to be able to find it.  You do not to be a UIUC student to be in the magic club.\nWe meet on Wednesdays around 6pm in the basement of the Union by Sushi San (north side of the Union basement).  We draft, cube, test constructed formats, etc.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13euin/general_interest_poll_magic_the_gathering/"
  }, {
    "id" : 48,
    "title" : "Rutgers, Maryland in talks to join Big Ten-ESPN",
    "snippet" : "  Now how are they going to fit a \"14\" in the logo's negative space?  This has to be from a purely monetary decision, don't see how they really fit the \"big 10 model\" especially Rutgers. rutgers is definitely kinda weak academically to be in the big ten. I went out of state from NJ for a reason. rutgers is definitely kinda weak academically to be in the big ten. I went out of state from NJ for a reason.    Big 10 has been courting Rutgers for years.  They want that NYC market, but fail to recognize how little New Yorkers care about college sports.   you mean more teams to kill the Illinois football team? Thats just what we need. Actually Maryland had been kind of bad the last few years (went 2-10 last year, I don't know their record this year though, don't think it's very good though)\n\nRutgers is usually decent though.\n\n\n Maryland is 4-7 this year. I feel you though its not like the Big Ten is adding 2 power house elite schools but the way this season played out its been pretty hard to root for the Illini. ",
    "url" : "http://espn.go.com/college-football/story/_/id/8644587/maryland-terrapins-rutgers-scarlet-knights-talks-join-big-ten-conference-sources-say"
  }, {
    "id" : 49,
    "title" : "PSA - Fraudulent Charge on credit card - experian credit check",
    "snippet" : "I just got called by visa anti fraud services that someone's been charging my card for experian credit check.\n\nBesides the regular sliding around campus (off the top of my head, jimmy johns, cravings, walgreens, and quadshop in union), the biggest things I've done in the last few days is I've set up my thanksgiving transportation. I've set up rides with amtrak, megabus, and LEX.\n\n\nNow, I remember there was a thread on this about a year ago, but I'm posting this again, partially to remind people to check their statements, but also because I'd like some sort of inkling as to where it went wrong.\n\nPersonally, I've got a sneaking suspicion it was LEX.  Had this happen to me as well, had to get 4 charges adjusted from my credit card that went unnoticed. I, too, have ridden with LEX and they are already a really shady, illegitimate company so I have a big feeling you're correct. Had this happen to me as well, had to get 4 charges adjusted from my credit card that went unnoticed. I, too, have ridden with LEX and they are already a really shady, illegitimate company so I have a big feeling you're correct.  There was a [thread](http://www.reddit.com/r/UIUC/comments/y6ab6/another_reminder_to_check_your_bankcard_accounts/) about this some time back, and someone suggested that EatCU was to blame. I have both ridden LEX and ordered from EatCU, so I am not sure who is responsible for those charges on my credit card bill.   I find it ironic that someone is trying to check their credit report by committing credit card fraud.            ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13d5eg/psa_fraudulent_charge_on_credit_card_experian/"
  }, {
    "id" : 50,
    "title" : "D.J. Richardson game winning shot in OT against Hawaii (2:30 am CST)",
    "snippet" : "    I'm so confused.  I thought this game was happening tonight.  \n\nI guess when I checked espn to see when they were playing, they gave the times for eastern time zone.  Since it was an 11:30 start central time on Friday, that technically made it a Saturday \"morning\" start on the east coast.  I guess I stopped reading after I saw Saturday.\n You didn't miss much. The streaming video was unwatchable, and the radio play-by-play announcer was awful. \n\nFor checking out upcoming games, I usually stick with [IllinoisLoyalty](http://www.illinoisloyalty.com/)'s Football/Basketball schedules (right sidebar if you scroll down a ways).",
    "url" : "http://www.youtube.com/watch?v=YKZ_ohVuXoo&amp;feature=player_embedded"
  }, {
    "id" : 51,
    "title" : "advice for places to eat at during break",
    "snippet" : "So I'm stuck in the dorms over thanksgiving break and since dining halls are closed and I don't have access to a kitchen I'll be forced to eat out for breakfast, lunch, dinner every day. Anyone got any advice on some cheaper places I can go on campus so that I don't have to spend stupid amounts of money on food?    Are slow cookers allowed in the dorm? ~$20 on craigslist and you can make meals for cheap that last a week as leftovers. Chili, bbq, I like to make pork loin and coq au vin (but I'm fancy like that).    Flat Top, and get wraps. If you're good enough at stacking noodles or whatever, you can get several meals out of it. Stack veggies first, then rice if you want some, and noodles at the very top - those stick to the bowl and don't fall off, and you can make a huge mountain of food that way. However OP doesn't have a microwave so he can't reheat the food.   Stack veggies first, then rice if you want some, and noodles at the very top - those stick to the bowl and don't fall off, and you can make a huge mountain of food that way. However OP doesn't have a microwave so he can't reheat the food.    I believe there's a microwave in the undergrad library Espresso Royale.  There might be one in the Union, too, but I'm not sure. I believe there's a microwave in the undergrad library Espresso Royale.  There might be one in the Union, too, but I'm not sure. You can easily buy a microwave for $20-$25 on Craigslist.  Yes, that's true, but I was mentioning one or two that are free to use. Not sure what your point is.        Do you have access to a microwave, toaster and refrigerator? Then you don't have to buy breakfast at least, and even some of the other meals if you don't mind frozen food or reheated delivery/takeout food.  Nah I don't...sucks",
    "url" : "http://www.reddit.com/r/UIUC/comments/13ccal/advice_for_places_to_eat_at_during_break/"
  }, {
    "id" : 52,
    "title" : "Accident on I-57 South",
    "snippet" : "Just passed a huge 3 mile backup about 25 miles north of Champaign. There was a fairly large accident, and they've closed down a pretty large section of 57 South as a result. 57 North is still open. \n\nIf you have people coming down to pick you up, or are waiting for a bus, hope they don't take 57 and/or warn them to stay off of it.   For anyone interested: http://www.news-gazette.com/news/courts-police-and-fire/2012-11-16/motorist-dies-accident-north-rantoul.html  Yeah, I passed it an hour ago and it was only a mile long back up. But there were people out of their cars, so they knew it was going to be a while until it was cleared up. \n\nBut another heads up coming north bound. There's a pretty large speed trap on one of the overpasses right before you hit Monee. Slow down because they had about 5 cars pulling people over. Yeah, I passed it an hour ago and it was only a mile long back up. But there were people out of their cars, so they knew it was going to be a while until it was cleared up. \n\nBut another heads up coming north bound. There's a pretty large speed trap on one of the overpasses right before you hit Monee. Slow down because they had about 5 cars pulling people over.  People were driving over the grass between I-57 North to I-57 South. That's when you know people have been there for a while         can someone explain what happened exactly? The articles recap was confusing. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13bj87/accident_on_i57_south/"
  }, {
    "id" : 53,
    "title" : "GEO members authorize strike: \"The vote allows the committee to call a strike at any time.\"",
    "snippet" : "  If you read the article carefully, you'll note that the main issue of contention is with **graduate assistants**, not teaching assistants or research assistants. It has been mentioned before, but it is literally suicide for the university to remove tuition wavers from TA's and RA's. TA's teach classes, without whom the university would not function. RA's are funded by outside grants; the university actually makes money from RA's due to overhead costs. GA's on the other hand ..., I want to say the university is trying to eliminate them all together, as they do not provide a real benefit. \n\nThe GEO is fighting for their behalf (even though there are very few GA's) and they are dragging TA's and RA's into this, since no one would care if only the GA's went on strike. I'm not saying one side is right and the other is wrong, but this is my analysis of the situation.  If you read the article carefully, you'll note that the main issue of contention is with **graduate assistants**, not teaching assistants or research assistants. It has been mentioned before, but it is literally suicide for the university to remove tuition wavers from TA's and RA's. TA's teach classes, without whom the university would not function. RA's are funded by outside grants; the university actually makes money from RA's due to overhead costs. GA's on the other hand ..., I want to say the university is trying to eliminate them all together, as they do not provide a real benefit. \n\nThe GEO is fighting for their behalf (even though there are very few GA's) and they are dragging TA's and RA's into this, since no one would care if only the GA's went on strike. I'm not saying one side is right and the other is wrong, but this is my analysis of the situation.  There are several inaccuracies in your observations.  Although it is correct that this university does have three separate classifications, they are largely identical in payscale and all equally covered by the GEO's contract (pay being set at an hours per week worked rate).  Additionally, all graduate students working for the university receive their tuition waivers from the graduate college.  The \"funding\" you're talking about is only in terms of the source of their stipends (and even then, not all RAs are grant funded).  The GA classification is for those holding positions not involving research or teaching, but that does not mean they are unimportant.  Many GAs in my department hold administrative positions that will prepare them for appointments later in their careers even though they do not fit within the terms defining TA and RA appointments.\n\nBut most importantly, this contention is NOT solely about GA positions.  As several have pointed out, the News Gazette is not using \"graduate assistant\" in a nuanced fashion in that one particular sentence.  They're using it as a blanket term to cover all graduate employees holding assistantships.  The GEO wants contract language to protect waiver reduction or withdrawal for all graduate employees. After looking through the sources, I agree that this involves both TA's and GA's. It seems that the university either cannot afford to, or does not want to maintain a competitive program in the fine and applied arts. It is regrettable, but without funding, what can you do?\n\nAs for RA's, it is true that they receive tuition waivers from the graduate college, but when a PI receives funding for a graduate research assistant, 60%+ of that goes to the university as \"overhead\" , which is intended to cover tuition, among other things. The rest goes into lab equipment and the actual stipend for the RA.  If you read the article carefully, you'll note that the main issue of contention is with **graduate assistants**, not teaching assistants or research assistants. It has been mentioned before, but it is literally suicide for the university to remove tuition wavers from TA's and RA's. TA's teach classes, without whom the university would not function. RA's are funded by outside grants; the university actually makes money from RA's due to overhead costs. GA's on the other hand ..., I want to say the university is trying to eliminate them all together, as they do not provide a real benefit. \n\nThe GEO is fighting for their behalf (even though there are very few GA's) and they are dragging TA's and RA's into this, since no one would care if only the GA's went on strike. I'm not saying one side is right and the other is wrong, but this is my analysis of the situation.  sorry, but who is a 'GA'? A GA is a graduate assistant.  What does a graduate assistant do? If you read the article carefully, you'll note that the main issue of contention is with **graduate assistants**, not teaching assistants or research assistants. It has been mentioned before, but it is literally suicide for the university to remove tuition wavers from TA's and RA's. TA's teach classes, without whom the university would not function. RA's are funded by outside grants; the university actually makes money from RA's due to overhead costs. GA's on the other hand ..., I want to say the university is trying to eliminate them all together, as they do not provide a real benefit. \n\nThe GEO is fighting for their behalf (even though there are very few GA's) and they are dragging TA's and RA's into this, since no one would care if only the GA's went on strike. I'm not saying one side is right and the other is wrong, but this is my analysis of the situation.  If that's true, then I have very little sympathy for the union's position.  However, [this petition](http://www.change.org/petitions/university-of-illinois-community-and-supporters-help-us-protect-tuition-waivers-for-teaching-assistants-and-graduate-assistants) indicates that the administration is seeking to reduce tuition waivers for TA's as well.\n\nI don't really understand who GA's are: these are graduate students not teaching, and not supported by research?  If so, then yeah, they should be paying tuition, since they are receiving an education.  But TA's and RA's are not just students, they are also employees who provide a service to the university, and they have every right to deny the university those services if they receive inadequate compensation for their work. If that's true, then I have very little sympathy for the union's position.  However, [this petition](http://www.change.org/petitions/university-of-illinois-community-and-supporters-help-us-protect-tuition-waivers-for-teaching-assistants-and-graduate-assistants) indicates that the administration is seeking to reduce tuition waivers for TA's as well.\n\nI don't really understand who GA's are: these are graduate students not teaching, and not supported by research?  If so, then yeah, they should be paying tuition, since they are receiving an education.  But TA's and RA's are not just students, they are also employees who provide a service to the university, and they have every right to deny the university those services if they receive inadequate compensation for their work. I'd be interested in seeing an official source from the university seeking to reduce tuition waivers for TA's. Everything that I've read so far only mentions GA's.  I'll probably get downvoted to hell again, but so be it.  The last plan I was aware of involved calling the strike on the first day back from Thanksgiving break.  This is the time of the semester when it is essential to have class un-disrupted.  Calling the strike at this time will not put much additional pressure on the administration as a strike at some other time would; what it *will* do is wreak havoc among undergrads who are trying to get ready for finals.  The GEO is using undergrads as pawns in their battle against the administration, and that is downright despicable.  Striking during syllabus week in January will cause just as many headaches for the university, and virtually none for other students. [deleted] The university is broke; the state hasn't fulfilled its funding obligations since before I was a freshman in 2005.  The fact that lots of TAs want more money and tuition wavers won't magically make the money appear in the budget.....today's announcement from Hostess makes that abundantly clear. I'll probably get downvoted to hell again, but so be it.  The last plan I was aware of involved calling the strike on the first day back from Thanksgiving break.  This is the time of the semester when it is essential to have class un-disrupted.  Calling the strike at this time will not put much additional pressure on the administration as a strike at some other time would; what it *will* do is wreak havoc among undergrads who are trying to get ready for finals.  The GEO is using undergrads as pawns in their battle against the administration, and that is downright despicable.  Striking during syllabus week in January will cause just as many headaches for the university, and virtually none for other students. This time of the year is when TA's have maximum leverage over the university.  A strike at that time will anger the university's paying customers (students and their parents) and thereby imperil the university's revenues.  A strike at the beginning of the semester would have far less impact.  \n\nThis is the same strategy as Walmart employees striking on Black Friday.  Unions will always try to time their strike to maximize their leverage over their employer, since it maximizes their chances of success.  \n\nI don't see what's especially despicable about this.  Of course the unions are trying to get the undergrads involved, since only the undergrads (or their parents) have any leverage over the administration. Honestly striking at this time would make me upset at the union more than the administration. I feel that basically then the union is \"stooping\" to the level of the university- just being greedy. Sure you have maximum leverage but at the same time it shows that all you care about is yourself and money and not the actual students or work that you do... This time of the year is when TA's have maximum leverage over the university.  A strike at that time will anger the university's paying customers (students and their parents) and thereby imperil the university's revenues.  A strike at the beginning of the semester would have far less impact.  \n\nThis is the same strategy as Walmart employees striking on Black Friday.  Unions will always try to time their strike to maximize their leverage over their employer, since it maximizes their chances of success.  \n\nI don't see what's especially despicable about this.  Of course the unions are trying to get the undergrads involved, since only the undergrads (or their parents) have any leverage over the administration. I draw a distinction between wal-mart employees, who are legitimately being dicked over by greedy management, and university administration, who don't see personal financial gains by holding their position.  As I mentioned in my other comment, the school is pretty strapped for cash thanks to broken promises on the part of the General Assembly.\n\nThat said, if I were in their place, I can't say that I wouldn't look for every advantage I could get, either. I draw a distinction between wal-mart employees, who are legitimately being dicked over by greedy management, and university administration, who don't see personal financial gains by holding their position.  As I mentioned in my other comment, the school is pretty strapped for cash thanks to broken promises on the part of the General Assembly.\n\nThat said, if I were in their place, I can't say that I wouldn't look for every advantage I could get, either. You understand that is a lie right?  The money from the state is down but the numbers show the university is not \"strapped for cash\". I am making this comment now so I will come back and edit it with a link.\n\nFurthermore, the GEO's points are that if the University is in such \"dire\" needs why do they continue to pump money into overhead administrative costs that feed the salaries of those involved in scandals.  The amount of money the University has pumped into the legal battle over contracts is absurd at this point.  Undergrads should be appalled that their money is being used like this. This time of the year is when TA's have maximum leverage over the university.  A strike at that time will anger the university's paying customers (students and their parents) and thereby imperil the university's revenues.  A strike at the beginning of the semester would have far less impact.  \n\nThis is the same strategy as Walmart employees striking on Black Friday.  Unions will always try to time their strike to maximize their leverage over their employer, since it maximizes their chances of success.  \n\nI don't see what's especially despicable about this.  Of course the unions are trying to get the undergrads involved, since only the undergrads (or their parents) have any leverage over the administration. [deleted] So you think that all strikes are despicable?  Walmart employees are hired to work at walmart, and they time their strikes to maximize the disruption for their own benefit.  And the reason they do so is that this is the only way they can force their employer to bargain.  I see no difference with the graduate students. [deleted] I am with you man.  Being a TA is a privilege and not a right.  If the person doesn't hold a role of an educator they shouldn't be allowed the benefits.   Your logic is basically saying it's a privlege to have a job.  It comes down to the fact that the University needs TAs/RAs/GAs and ya they can replace them with shit but then their whole Research 1 status will go away pretty quickly when the caliber of student accepted by the various departments drops drastically.\n\nThe word is already spreading and when possible-future graduate students in various fields here that their tuition-waiver can be in jeopardy every 3 years, they don't want to come here. I am with you man.  Being a TA is a privilege and not a right.  If the person doesn't hold a role of an educator they shouldn't be allowed the benefits.   &gt; If the person doesn't hold a role of an educator they shouldn't be allowed the benefits. \n\nTA's do hold the role of educator and are trying to keep the benefits from being reduced. I have been a TA for several classes and portions of my pay do go right to the GEO. My department pays well enough for myself to live within my means.  I still hold firm that the job is a gift and not a right.  True a lot of profs would collapse if they had to grade or teach all of their students.  But to see the GEO banging and chanting on drums like in 2010 was just embarrassing.  If someone doesn't want to work.. there are lines of people who would gladly take their position. \n\nAlso the claws that \"Payment to support family\"  the departments do not pay \"your\" family to work.  The choice to marry and have kids in your 20's is not the concerns of the University.   &gt; I still hold firm that the job is a gift and not a right.\n\nAs long as the terms are mutually beneficial, then I can agree with that. UIUC gets to pay a TA much less than a professor to teach a class, while the TA also receives some of the benefits (not all) that a professor receives.\n\nI haven't heard the \"payment to support family\" claim. Can you clarify? This time of the year is when TA's have maximum leverage over the university.  A strike at that time will anger the university's paying customers (students and their parents) and thereby imperil the university's revenues.  A strike at the beginning of the semester would have far less impact.  \n\nThis is the same strategy as Walmart employees striking on Black Friday.  Unions will always try to time their strike to maximize their leverage over their employer, since it maximizes their chances of success.  \n\nI don't see what's especially despicable about this.  Of course the unions are trying to get the undergrads involved, since only the undergrads (or their parents) have any leverage over the administration. The TA's striking the week after we get back will do nothing but solidify animosity between me and a \"teaching assistant union\" Yeah, and I'm sure they couldn't care less if you hate them, as long as you pressure the administration to end the strike.  Your previous non-animosity did nothing to help them.  GEO handled the vote in a really shady way. They only allowed online voting for five hours each day over 3 days. I'd be surprised if very many members voted on the strike outside of the GAs with a vested interest. For the record, voter turnout among GEO members was over 50%. The claim that the way the vote was run was deliberately meant to discourage voting is downright ridiculous. Regardless of the motivations, the voting process left much to be desired.\n\nThere was little notification of the upcoming vote, voting itself was limited to a narrow time window, and the raw results were not published.\n\nRefusal to supply the news gazette with the actual vote count is completely unacceptable. Regardless of the motivations, the voting process left much to be desired.\n\nThere was little notification of the upcoming vote, voting itself was limited to a narrow time window, and the raw results were not published.\n\nRefusal to supply the news gazette with the actual vote count is completely unacceptable. GEO handled the vote in a really shady way. They only allowed online voting for five hours each day over 3 days. I'd be surprised if very many members voted on the strike outside of the GAs with a vested interest. This is factually incorrect. In-person voting booths were open 9am-5pm at Siebel, Temple Hoyne Buell, Krannert, and the GEO office. \n\nOnline voting was then held from 6pm-11pm to ensure that no one could double-vote.\n\nEDIT: Source for in-person voting: http://www.uigeo.org/2012/11/13/updated-voting-stations-wedneday-and-thursday/ I had no idea that voting in person was even an option. The email advertising the vote did not mention it \n\nI have no problem with the results of the authorization vote. There are some legitimate funding concerns and the strike authorization will hopefully lead to a resolution without the need to strike.\n\nI do have concerns regarding the voting process. A strike is a major event with wide reaching consequences for all graduate students not just those who actively participate in GEO meetings. It is important everyone be given a chance to understand the issues and weigh in.\n\nI would hope that if a future strike vote is required there is a more concerted effort to provide advanced notice that a vote will be taking place, inform the voters why the authorization is needed(this was done well here), explain the way people can vote, and then publish the results in full. \n\nAn email a week prior to voting explaining the issue at hand, announcing when the vote will take place, and explaining the voting process and options would go a long way to addressing these concerns. Emails sent out on 11/11, 11/13, 11/14 both had this information listed.  If are a member then you should have gotten those emails.\n\n I had no idea that voting in person was even an option. The email advertising the vote did not mention it \n\nI have no problem with the results of the authorization vote. There are some legitimate funding concerns and the strike authorization will hopefully lead to a resolution without the need to strike.\n\nI do have concerns regarding the voting process. A strike is a major event with wide reaching consequences for all graduate students not just those who actively participate in GEO meetings. It is important everyone be given a chance to understand the issues and weigh in.\n\nI would hope that if a future strike vote is required there is a more concerted effort to provide advanced notice that a vote will be taking place, inform the voters why the authorization is needed(this was done well here), explain the way people can vote, and then publish the results in full. \n\nAn email a week prior to voting explaining the issue at hand, announcing when the vote will take place, and explaining the voting process and options would go a long way to addressing these concerns.",
    "url" : "http://www.news-gazette.com/news/education/2012-11-16/geo-members-take-next-step-toward-strike.html"
  }, {
    "id" : 54,
    "title" : "Looking for a pet sitter over winter break? I'm available.",
    "snippet" : "I just thought I'd post this here to see if anyone is interested. I'll be around all winter break, and I've had experience with everything from dogs to horses. I enjoy taking care of animals, and I'm pretty reasonable with pricing. If you are interested, post here or send me a pm.   That's so nice!  I have 2 hamsters that need to be watched, what are your rates?  [Would you be willing to babysit my small pet?](http://www.omega-level.net/wp-content/uploads/2011/10/The-Brazilian-Wandering-Spider..png) \n\nHe doesn't like cages. So I expect you to let him freely wander your room. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13br4w/looking_for_a_pet_sitter_over_winter_break_im/"
  }, {
    "id" : 55,
    "title" : "Anyone go to BodyWork Associates? Other massage places to recommend?",
    "snippet" : "I got a gift certificate to [BodyWork Associates](http://www.bodyworkassociates.com), a massage therapy place (has a location in the ARC and one elsewhere in Champaign). Has anyone gone there? Good/bad experiences? Massage therapists to recommend or stay away from? Thanks!    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13c6hr/anyone_go_to_bodywork_associates_other_massage/"
  }, {
    "id" : 56,
    "title" : "LEX vows to fix safety violations [News-Gazette]",
    "snippet" : "    Why are the bus companies so corrupt and shitty around here? In Bloomington, IL everyone uses Peoria Charter and I've never even heard a complaint about them.  Why are the bus companies so corrupt and shitty around here? In Bloomington, IL everyone uses Peoria Charter and I've never even heard a complaint about them.  Why are the bus companies so corrupt and shitty around here? In Bloomington, IL everyone uses Peoria Charter and I've never even heard a complaint about them.    Still a better company than Suburban Express. Suburban might be run by a huge dick  but their buses are always clean and in order. Always on time. I hate Suburban Express but its the truth. Lex is a fucking joke, especially since everyone's credit cards number got stolen apparently from them. Suburban might be run by a huge dick  but their buses are always clean and in order. Always on time. I hate Suburban Express but its the truth. Lex is a fucking joke, especially since everyone's credit cards number got stolen apparently from them. You can pay cash.  Not anymore he closed the ticket counter at their office on 6th. You can pay the bus drivers in cash, and it's what I do everytime. it just doesn't guarantee a spot on the bus for you.  How do they determine the price when you pay cash? Their prices vary so much online.",
    "url" : "http://www.news-gazette.com/news/transportation/2012-11-16/champaign-bus-company-vows-fix-safety-violations.html"
  }, {
    "id" : 57,
    "title" : "Just got this official CLASSmail",
    "snippet" : "  Uploaded the image on imgur\n\nhttp://i.imgur.com/JULWU.png Uploaded the image on imgur\n\nhttp://i.imgur.com/JULWU.png You are a gentleman. You don't think he's a scholar...?  Is it sad that the first thing I noticed was the OP's amazing level of quota utilization (9.7 of 10.1 GB)? Prolly uses his gmail as a cloud to store his porn.   I received a similar email from \"Professor Hu,\" though it was way longer. Post the contents!\n [Here you are.](http://imgur.com/a/wPRuF#0)\n\nNote that the email was not sent through Hu's email, but by a student who was dumb enough to send it with his netID. [Here you are.](http://imgur.com/a/wPRuF#0)\n\nNote that the email was not sent through Hu's email, but by a student who was dumb enough to send it with his netID. [Here you are.](http://imgur.com/a/wPRuF#0)\n\nNote that the email was not sent through Hu's email, but by a student who was dumb enough to send it with his netID. [Here you are.](http://imgur.com/a/wPRuF#0)\n\nNote that the email was not sent through Hu's email, but by a student who was dumb enough to send it with his netID. [Here you are.](http://imgur.com/a/wPRuF#0)\n\nNote that the email was not sent through Hu's email, but by a student who was dumb enough to send it with his netID. I heard Professor Hu sent a followup. What'd that consist of? http://i.imgur.com/MIVzg.png [Here you are.](http://imgur.com/a/wPRuF#0)\n\nNote that the email was not sent through Hu's email, but by a student who was dumb enough to send it with his netID. I received a similar email from \"Professor Hu,\" though it was way longer.  sounds about right. there are so many things wrong with 385 i don't even know where to start. Pointed words on an anonymous forum are easy. What do you think needs changing in 385? I'd love to hear your thoughts. Fair enough.\n\nDisclaimer: My lab partner was the biggest piece of shit I've ever seen. Super senior complete stoner that cheated his way through undergrad. He had already taken part of the course and then dropped, saving it for his second to last semester. Still managed to be useless. Not a single piece of work delegated to him was done correctly. I did the final project singlehandedly. IF YOU ARE PLANNING ON TAKING ECE 385, HAVE A COMPETENT PARTNER CHOSEN AHEAD OF TIME.\n\nit's worth 2 credit hours. That in of itself is some kind of sick joke. I wouldn't have minded a few homework assignments throughout the semester to justify the extra credit hours. But in reality the extra hours are already justified.\n\nIf you have a bad lab partner you're completely fucked. More so than other lab courses in my experience.\n\nLecture was particularly useless in 385. I went most of the time, but I don't think I ever learned anything from lecture that the lecture slides wouldn't have told me. \n\nNot having access to the lab at all hours or a lab with all of the necessary materials. The keyboard lab in particular was bad for this. Lock up the expensive stuff, and give people swipe access  to the room :\\\n\n\"Difficulty points\" on the final project were pretty arbitrary. I did a mini-jack to VGA audio visualizer (with 2 modes) and got a 6 just like the group next to me that did the suggested, COMPLETELY ORIGINAL \"snake game\" with no extra functionality\n\nTo my knowledge the lab assignments have been identical for a few years. It's no wonder cheating is rampant in 385\n\n\"Here's how you're gonna learn VHDL: we're gonna shove you off a bridge and hope you don't die. After the drop date\" ***this one in particular bugged me. Sure, VHDL isn't that hard once you get the hang of it, but they just drop it on you with no guidance. Online documentation for VHDL is way worse than it is for non hardware descriptor languages, (Python, C, Java, etc.) so I think more guidance on that front would have made a huge difference. Also, Quartus was super buggy for me. Granted, ModelSim in 411 has been even worse in that you can't even get your own copy.\n\nI think the breadboard segment of the course is far too long in comparison to the FPGA segment. After 4 or so breadboard labs, I'm pretty sure any ECE that actually did the labs would be competent enough at laying down wires and TTL chips to do it in a situation where it is necessary.\n\n\n\n\nDid I learn a lot from 385? Yeah, but the course is inconvenient for the sake of being inconvenient and outdated. I'm just going to respond to a few sections of this.\n\nFirst off the lab partner, eh... that's not so much the course's fault so much as your own bad luck. A bad lab partner is what it is, you can always try changing and eventually it sucks, but doing it on your own.\n\nThis may or may not add to your argument but I was in a meeting with the admin about courses once and the reason 385 is only two hours is because if it were 4 (about what it should be) it would hurt too many people's GPAs. It's most people's first intense lab and they don't want to hurt anyone too badly.\n\nLectures, yeah, kind of useless. \n\nFor the lab, you could have always joined IEEE for help with the first labs with breadboards. They have the test boxes, very useful. That lab is used for so many other classes that they can't give access to everyone. \n\nI'm not sure about all the trouble you had with VHDL, the copy/paste lab has enough documentation that you can refer to it for 90% of your problems and if not ask your TA/google for it. My Senior Design Project was entirely based on VHDL and the only knowledge I had was 385. \n\nYes it has it's issues, I'm not sure how to fix it. But as you concluded with, the course ultimately accomplished its goal to teach you a lot.  If you want to improve it make sure you fill out your evaluations in detail, the TAs/teaches really do read those in detail. Yeah, it's hard, it's tough, but even a bad grade in the class will teach you more than an easy lab. \n\nEdit: I just want to say that no matter how hard ECE Illinois is, all these classes which seem hard for no reason, you're going to come out of the program HIGHLY desirable. So long as you graduate with an ECE degree, you are set for life and will be able to find a job. Depending on GPA and such it may be harder/easier, but it's not a matter of if you get a job, but what job you get. ECE 385, 411, 391, 445, plenty of times you have no idea why they're so hard, and they could be better  in plenty of ways, but by getting through them you've proven yourself. Just saying I'm from ECE Illinois is enough of a resume to plenty of people. I don't mean to argue your points, they are all perfectly valid in my eyes, and it's nice to see alternative viewpoints on 385. Just some thoughts:\n\n\nIf 385 were 4 instead of 2 credits, people would probably take one less class that semester and thus do better in the course. Maybe. Alternatively, splitting the course into 2 semesters of 2 credits with extra material tacked on at the end would be helpful too. \n\n\nThere's no way the ECE department doesn't have the resources to allocate a lab room just for one of its most important and grueling courses that is the first with a heavy lab component.\n\n\nI agree with the part about being desirable. My GPA is garbage, my non-academic resume is mediocre, and somehow I'm still managing to score interviews with great companies. Really excited for some upcoming on-site interviews on the west coast :)\n\nKeep your chins up underclassmen. It gets better when you've got money for all the video games, junk food, and alcohol your little heart could desire. (How I felt during my internship this summer) Be active and I guarantee you can find a job or internship (if you're a junior. no guarantees for sophomores and freshmen unfortunately. More of your classmates have yet to be weeded out!)\n\n\nECE 391 was the turning point in my college career. STEVE LUMETTA for prez 2016\n\n\nedit: really hoping the new ECE building has some really nice labs for 385, 391, and 411. with beds. and coffee machines. and ergonomic keyboards. DAT CARPAL TUNNEL. I'm guessing that they expect underclassmen to have heard the horror stories of 385 work and account accordingly. Plus everyone is supposed to have their advisers sign off on their schedule, in theory there are enough checks in place to make sure no one overloads. For that actually being the case... not as much as it should be. I wish it had been 4 hours, actually would have helped my GPA...\n\nYou'd be surprised about the lab space. The department really doesn't have the space to have a 385 only lab, lack of lab space is a major reason we're getting a new building. I don't think 385 is getting a dedicated lab, but there will be the open lab which everyone will have access to to work on 385. I haven't looked at the blueprints in a while.\n\nYeah, I got interviews with companies I was more than a tad shocked by (but very happy for) with my GPA. Good luck on your west coast interviews! My actual motivation to continue in ECE was realizing it was a source of unlimited karma on this subreddit.\n\nThanks for the good luck wishes dude. i think it's worth noting that if you are a CompE going for a software job - ECE screws you over big with classes like 385. The reasons are two fold:\n\n(1) You are directly competing with CS students, who don't really have classes like 385 or 391 - while the CompE is slaving away  for a B, the CS major is breezing through CS 232. Not only will they have a higher GPA - they will have more time to apply for jobs and beef up their resumes with extra-projects.\n\nGranted, it's my fault for not choosing CS - but the reason I bring this up is because I heard an engineering tour guide answer \"What's the difference between CompE and CS\" and not mention how much harder you will be working as a CompE and more importantly that CompE != Software Engineering\n\n...sorry for rambling ! (not really) I don't mean to argue your points, they are all perfectly valid in my eyes, and it's nice to see alternative viewpoints on 385. Just some thoughts:\n\n\nIf 385 were 4 instead of 2 credits, people would probably take one less class that semester and thus do better in the course. Maybe. Alternatively, splitting the course into 2 semesters of 2 credits with extra material tacked on at the end would be helpful too. \n\n\nThere's no way the ECE department doesn't have the resources to allocate a lab room just for one of its most important and grueling courses that is the first with a heavy lab component.\n\n\nI agree with the part about being desirable. My GPA is garbage, my non-academic resume is mediocre, and somehow I'm still managing to score interviews with great companies. Really excited for some upcoming on-site interviews on the west coast :)\n\nKeep your chins up underclassmen. It gets better when you've got money for all the video games, junk food, and alcohol your little heart could desire. (How I felt during my internship this summer) Be active and I guarantee you can find a job or internship (if you're a junior. no guarantees for sophomores and freshmen unfortunately. More of your classmates have yet to be weeded out!)\n\n\nECE 391 was the turning point in my college career. STEVE LUMETTA for prez 2016\n\n\nedit: really hoping the new ECE building has some really nice labs for 385, 391, and 411. with beds. and coffee machines. and ergonomic keyboards. DAT CARPAL TUNNEL. Not to sidetrack this but it is 2 days old so I feel like I can.\n\nWhat are some tips you can give for getting all those interviews?  I wasn't in ECE (I was in Math/CS) but my GPA was fine, my experience list was crap, yes, but I could never get far in any interview process at all and only worked one summer.  I blame it at first on me liking theoretical CS rather than software engineering, along with just being too scared to talk because I knew I had no experience and didn't know what I was looking for.\n\nNow I'm in graduate school in California, feeling poor as hell, seeing my classmates live \"the life\" so to speak, and I feel like I'm kind of stuck because I'm not in undergraduate school anymore, and if I (for whatever reason) had to drop out of this school, I keep thinking I'd have a very hard time getting hired.  But reading what you wrote, it seems like it would definitely still be possible. You need to understand that most of the other people getting jobs out of college don't have experience either. \"Knowing you have no experience\" is a terrible mindset with which to approach your job search. CS isn't one of those stereotypical fields where you \"need experience to get experience.\" Attend hackathons. Contribute to open source projects. Have a pet project. Any of those things count as experience for someone studying CS.\n\n\n Be aggressive about pursuing any job that seems remotely interesting to you. Go on Symplicity (or equivalent for the school you're currently attending) and send 20 resumes out in 30 minutes. Follow up with recruiters and interviewers when possible. \n\n\nDuring your interviews, you need to realize that for technical questions the interviewer is not necessarily looking for just the right answer (especially seemingly impossible problems that Google might throw at you). He's looking to see how you approach a difficult problem. Do you ask him questions to clarify what he's looking for? Do you clearly state assumptions and check for errors? All of these factors are not necessarily part of the answer itself, but can weigh positively or negatively on you.\n\n\nNot knowing what you're looking for is kind of a problem, but not necessarily a death knell. When an interviewer asks you what you're interested in, realize that they're not saying \"what would you like to lock yourself into doing for the rest of your life?\" People pivot in their careers all the time, and how you answer that question does not obligate you to stay in that field forever. However, you can't just act all surprised when they ask that question and give a shitty answer. Talk about projects, schoolwork, and courses that you found most interesting, and why. \n\n\nIf your interests are in theoretical CS, I think you made the right move going to grad school. Things should be easier as far as getting job now that you're in grad school. Meanwhile, don't worry about how your classmates are living \"the life.\" Money isn't everything, and some have called grad school \"the sweet spot in life.\" \n\n\nFinally, realize that CS at UIUC puts you at a distinct advantage over 99.9% of the other graduates out there. Be confident during your interviews, and good luck man. After all, luck is another huge factor in the hiring process. Fair enough.\n\nDisclaimer: My lab partner was the biggest piece of shit I've ever seen. Super senior complete stoner that cheated his way through undergrad. He had already taken part of the course and then dropped, saving it for his second to last semester. Still managed to be useless. Not a single piece of work delegated to him was done correctly. I did the final project singlehandedly. IF YOU ARE PLANNING ON TAKING ECE 385, HAVE A COMPETENT PARTNER CHOSEN AHEAD OF TIME.\n\nit's worth 2 credit hours. That in of itself is some kind of sick joke. I wouldn't have minded a few homework assignments throughout the semester to justify the extra credit hours. But in reality the extra hours are already justified.\n\nIf you have a bad lab partner you're completely fucked. More so than other lab courses in my experience.\n\nLecture was particularly useless in 385. I went most of the time, but I don't think I ever learned anything from lecture that the lecture slides wouldn't have told me. \n\nNot having access to the lab at all hours or a lab with all of the necessary materials. The keyboard lab in particular was bad for this. Lock up the expensive stuff, and give people swipe access  to the room :\\\n\n\"Difficulty points\" on the final project were pretty arbitrary. I did a mini-jack to VGA audio visualizer (with 2 modes) and got a 6 just like the group next to me that did the suggested, COMPLETELY ORIGINAL \"snake game\" with no extra functionality\n\nTo my knowledge the lab assignments have been identical for a few years. It's no wonder cheating is rampant in 385\n\n\"Here's how you're gonna learn VHDL: we're gonna shove you off a bridge and hope you don't die. After the drop date\" ***this one in particular bugged me. Sure, VHDL isn't that hard once you get the hang of it, but they just drop it on you with no guidance. Online documentation for VHDL is way worse than it is for non hardware descriptor languages, (Python, C, Java, etc.) so I think more guidance on that front would have made a huge difference. Also, Quartus was super buggy for me. Granted, ModelSim in 411 has been even worse in that you can't even get your own copy.\n\nI think the breadboard segment of the course is far too long in comparison to the FPGA segment. After 4 or so breadboard labs, I'm pretty sure any ECE that actually did the labs would be competent enough at laying down wires and TTL chips to do it in a situation where it is necessary.\n\n\n\n\nDid I learn a lot from 385? Yeah, but the course is inconvenient for the sake of being inconvenient and outdated. I know this may fall on dead ears, but here goes anyway.\n\nIt sucks to have bad lab partners, but in the end, you end up getting what you pay your tuition money for, skills/knowledge. The fact that the partner gets the same credit (most of the time) doesn't help from feeling as though you are being robbed, but it is quite the opposite. The amount of work that you had to do in order to get that grade, that work that your partner didn't do, it's not something extra that went nowhere, it went into your knowledge bank, not his/hers.\n\nAll my college career and even in my early grad career, I've had to deal with countless number of incompetent lab mates for one reason or the other, whether they were actual idiots or they just didn't have time (senior grad). Either way, I did the work, came out on top, and when I talk about the things I learned from those lab experiences, I am confident that I know what I'm talking about.\n\nThis trend seems to exist in other disciplines as well. My brother, who has a degree in Architecture, constantly complained how incompetent his studio partner was and he had to redo everything he did (or just do what he didn't do). That partner went nowhere with his degree after barely graduating, while my brother got in top grad programs.\n\nI've been there and I know how emotional you can get when slapped with such blatant injustice, but in the end, that really doesn't leave any lasting effect. What does have lasting impact, however, is the work that you do and the hours that you put into that measly two credits. Pointed words on an anonymous forum are easy. What do you think needs changing in 385? I'd love to hear your thoughts. Pointed words on an anonymous forum are easy. What do you think needs changing in 385? I'd love to hear your thoughts.     For the sake of people not in the class, can someone elaborate on what this is about? Is this a joke, or were such emails really sent out? Apparently they were. Just got an email from the head TA saying:\n\n\"Hi everyone,\n\n    Last night around 4am a classmail was sent out under a TA's account.  The email was unauthorized by the TA, and we are taking the proper actions to trace the source of this misconduct.  Please ignore the email (while continue to work on your final project over the Thanksgiving break).\n\n\nJoe\"\n\nI wonder how the supposed hacker got into another persons' account though? Apparently they were. Just got an email from the head TA saying:\n\n\"Hi everyone,\n\n    Last night around 4am a classmail was sent out under a TA's account.  The email was unauthorized by the TA, and we are taking the proper actions to trace the source of this misconduct.  Please ignore the email (while continue to work on your final project over the Thanksgiving break).\n\n\nJoe\"\n\nI wonder how the supposed hacker got into another persons' account though? Apparently they were. Just got an email from the head TA saying:\n\n\"Hi everyone,\n\n    Last night around 4am a classmail was sent out under a TA's account.  The email was unauthorized by the TA, and we are taking the proper actions to trace the source of this misconduct.  Please ignore the email (while continue to work on your final project over the Thanksgiving break).\n\n\nJoe\"\n\nI wonder how the supposed hacker got into another persons' account though? &gt; I wonder how the supposed hacker got into another persons' account though?\n\nWho is going to investigate this? I am assuming it shouldn't be that hard to find out, though from recent news events it seems like you need the FBI to investigate gmail accounts.   ",
    "url" : "http://imageshack.us/f/687/ece385email.png/"
  }, {
    "id" : 58,
    "title" : "Want to buy tickets for Dropkick Murphys!",
    "snippet" : "I need at least one ticket for dropkick murphys! If you have two that would be great. Text me at 908-967-1951  and we can work out a deal!  I swear this is like the third thread by someone wanting to buy these tickets. Should we have a huge Buy/Sell tickets thread?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13b648/want_to_buy_tickets_for_dropkick_murphys/"
  }, {
    "id" : 59,
    "title" : "I wonder how people on campus feel about the football coach...",
    "snippet" : "   Beckman is coaching Zook's shit classes no reason to fire him yet. Oh yes it is.  We are rebuilding our team. Give him a few years to coach his own team and we will see what will happen. It all depends on which recruits we land and what they become. Look at our stats this year not just the W/L record. Hopefully we can turn it around in the next coming years but who knows.  Beckman's done a shitty job this year. that being said the illini have a top-25 recruiting class by RIVALS including one of the top dual-threat QBs in the nation in Aaron Bailey. Hopefully with a half-decent QB the overly optimistic hopes of landing LaQuan Treadwell (5-star recruit) or, quite frankly, ANYBODY who can catch a damn ball, we'll see some improvement on offense. But Beckman, just like any other coach, needs some time to get his guys and system in place.  I started graduate school at UIUC in the fall of Nineteen Hunnert -n- Ninety One, and for nearly all of the 21 sad years elapsed, I've been seeing people point out that This Shitty Season will be the last because Look At That Recruiting Class.\n\nSee you this time next year when that top-25 recruiting class is, oh, 2-8. I didn't say any such thing. I'm saying you don't fire a head coach for a shitty first season, and that a good recruiting class brings possible reason for optimism     $1.6 million dollar salary. Which is why the workers at this university aren't getting raises: They have to save that money for raises on the salaries of the ELITES. For 1.6 million, I expect a better return on investment. $1.6 million dollar salary. Which is why the workers at this university aren't getting raises: They have to save that money for raises on the salaries of the ELITES. For 1.6 million, I expect a better return on investment.",
    "url" : "http://i.imgur.com/3A8c4.jpg"
  }, {
    "id" : 60,
    "title" : "Has anyone here changed their major junior year?",
    "snippet" : "Im kind of having a mid college career crisis right now..Im an transfer MCB student, and I always have that lingering thought of \"Did I choose the right major for me?\" Ive always had a dream to work at NASA one day, and I know NASA is basically strictly a physics/aeroengineering/mechinal engineering agency..\n\nIm probably going to declare a minor in astronomy, but I really dont know if i want to continue into being an MCB major or not or change into something like engineering. The biggest thing holding me back is that im a junior already, im scared of being stuck behind or seriously screwing up somehow, and of course money is always an issue. What are your guys opinions? Am i freaking out too much over here?          I switched from EE to CompE on the fourth day of this semester. And then applied to graduate this december on the next day. Very different from your situation though given that they're both in the ECE department.\n\nMCB to Engineering has very little crossover, and you'll almost certainly need a 5th year of college.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13aca5/has_anyone_here_changed_their_major_junior_year/"
  }, {
    "id" : 61,
    "title" : "Resources for a homeless student couple",
    "snippet" : "Hopefully someone here can help - this 21-yr-old grad student couple contacted me to sublease my apartment in the Spring semester. They're flying in from England December 10th. I ended up being unable to let them sublease my apartment due to an issue with the landlord. They found somewhere else to sublease, but they need a place to stay from the 10th-22nd of December. A hotel is most definitely out of their budget, but does the university/C-U area have any resources for those temporarily displaced? Does anyone have an empty room that the'yd be willing to let this couple stay in for a few days? They'd pay rent for the 12 days.\n\n**TL;DR** Looking for temporary housing for a pair of homeless grad students flying in December 10th    http://www.housing.illinois.edu/en/Future/Faculty/Short-Stay%20Lease%20Options.aspx http://www.housing.illinois.edu/en/Future/Faculty/Short-Stay%20Lease%20Options.aspx Too pricey for them, but thanks!       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13a9u3/resources_for_a_homeless_student_couple/"
  }, {
    "id" : 62,
    "title" : "Petition | University of Illinois Community and Supporters: Help us  Protect Tuition Waivers for Teaching Assistants and Graduate Assistants | Change.org",
    "snippet" : "  I'd like to hear the background story on this whole issue. I just got a massemail from the provost explaining how GEO's wording of the situation is misleading, and that they never even suggested cutting tuition waivers for TAs/RAs/GAs in the first place.\n\nDid they actually suggest that and retracted once the issue got some publicity? Or is this a conspiracy? If you wouldn't mind:  please read the open letter from the GEO in regards to the Provost's email.  Please note that their reply is intercalated.\n\n\nDear GEO members,\n\nYou likely received an email today from the Administration distorting and outright denying the claims we have made as a union. First, this type of correspondence from the Administration is not uncommon during this point of contract negotiations. Indeed, similar emails went out in the days leading up to and during the Strike of 2009. It means that our organizing efforts have caught their attention, and that is due to the hard work and dedication of our members.\n\nHowever, we would like to respond to the following assertions (listed below in quotes):\n\n1) \"Contrary to a steady stream of communications from the GEO, degree seeking graduate assistants do not need to fear that their assistantship tuition waiver support will be reduced or eliminated.\"\n\n· The administration’s actions do not support this claim. In November 2009, approximately 1,000 GEO members went on strike and successfully won tuition waiver protection in their contract.\n\n· During 2010-2011 academic year the University administration began to charge hundreds of dollars of tuition each semester for incoming graduate employees in the College of Fine and Applied Arts, in direct violation of our contract.\n\n· The GEO filed a grievance on this contract violation. In September 2011, a neutral arbitrator ruled in favor of the GEO. The administration continued to fight to be able to reduce these waivers. Just today the Illinois Educational Labor Relations Board found unanimously in favor (5-0) of the GEO supporting our tuition waiver contract language.\n\n· This means this Administration has already spent tens of thousands of dollars in legal fees trying to change tuition waivers.\n\n· A representative of this Administration has told officials of the GEO in a meeting held on March 2, 2012 that they actually see graduate tuition waivers as a means to “generate revenue.”\n\n· The Administration has continually refused to keep language in our contract that would protect tuition waivers for all of our members.\n\nIt is only logical to conclude that the administration sees graduate student tuition waivers as a source of revenue and is even willing to stand in violation of legally upheld contract language to make money on the backs of some of our lowest-paid members.\n\n2) \"The GEO's second recurring theme is that the University pay proposals are unfair and do not provide assistants with a livable wage. Such accusations are inaccurate. Under the GEO contract that just expired, teaching and graduate assistants are guaranteed a minimum annual rate which translates to an approximate hourly rate of $19.00 per hour. The average rate on campus is $22.03 per hour (or $17,183 per year for an assistant with a 50 percent 9 month appointment). Over the three years of the GEO contract that just expired, the minimum stipend level was increased by 10 percent. The University has presented wage proposals that would guarantee that continuing assistants would receive salary increases consistent with those given to other employees under the campus salary program.\"\n\n· This false and misleading. During bargaining, this Administration continually offers the majority of GEO members “the campus wage program.” The campus wage program means that the administration sets wages at their sole discretion, and provides no guarantee that anyone will receive any wage increase. It would be the equivalent of the GEO giving up the right to bargain salary if we agree to this misleading tactic. Both sides must bargain the entire salary and benefits package for each year the contract is in effect.\n\n· The $17,183 average cited by this Administration includes members who make far above the minimum wage as well as those who are paid at the lowest scale. Approximately a third of our bargaining unit makes the minimum wage for Teaching and Graduate Assistants, $14,820. The GEO has proposed bringing that minimum up to what this Administration itself calculates as the living wage for Urbana-Champaign (which for 2012-2013 is $16,926), and to date this Administration has not agreed to that proposal.\n\nWe welcome the opportunity to work with the administration at obtaining a fair and living wage; we sincerely hope they plan to meet us in this effort as much as they have just claimed.\n\n3) \"Despite the strike authorization vote taken by the GEO, we want you to know that a strike is neither inevitable nor necessary. The issues of tuition waivers and pay can be resolved through negotiation and mediation, as they have been in the past. We urge you to become familiar with the facts and make decisions based on all of the relevant information related to the negotiations process.\"\n\n· We wholeheartedly and emphatically agree with the Administration's statement that \"the issues of tuition waivers and pay can be resolved through negotiations and mediation, as they have been in the past.\"\n\n· However, the GEO has met with the Administration more than 20 times since last April. The GEO has been working without a contract since mid-August. Two sessions with a federal mediator have not garnered agreement on health care, tuition waivers or wages. We didn’t receive a proposal of any kind on tuition waivers until just yesterday. That proposal includes flawed language that places many graduate employees at risk. We still believe there is no need to change the current language, which assures all members tuition waiver protection.\n\n· We also “urge you to become familiar with the facts and make decisions based on all of the relevant information related to the negotiations process.” The GEO actively encourages all members to attend bargaining sessions. Dozens of members have sat through these sessions and have formed their own opinions based on this process.\n\nThe next two bargaining sessions are: November 26, 1 p.m. and 27, 8:30 a.m. at the Levis Faculty Center. We encourage all GEO members to join us at these sessions.\n\nThe GEO proposals are reasonable. The top 28 administrators on campus received an average 5.86 percent wage increase this year. That's over 5 percent added on to their six figure salaries. Compare that to the administration's best offer to date, which leaves hundreds of TAs below the standard of a living wage. Under the current GEO wage proposal, total salaries for members would account for only 2 percent of the yearly campus budget. To put this in perspective, we teach 20 percent of all classes on campus.\n\nFinally, the GEO has strong support on campus and beyond, that is growing every day. A petition on our behalf to the Board of Trustees has received more than 1,200 signatures in just 2 days. If you would like to add your name to the petition and send a message to the Illinois Board of Trustees, please follow this link to the petition: Solidarity Petition.\n\nSolidarity,\n\nThe GEO\n Thank you. Another user vikar above pasted this email correspondence and I have gone through it. This is exactly the kind of information I was looking for with my post. I'd like to hear the background story on this whole issue. I just got a massemail from the provost explaining how GEO's wording of the situation is misleading, and that they never even suggested cutting tuition waivers for TAs/RAs/GAs in the first place.\n\nDid they actually suggest that and retracted once the issue got some publicity? Or is this a conspiracy? I didn't check for other posts before I made a similar one about this petition. In mine I included a link with an email from the Vice Chancellor and a reply to it from the GEO about this situation in general. Here is the link: http://pastebin.com/UyJrZbKZ\n\nEdit: I a word. Great info. Thanks.  Could a research university even survive without providing graduate students with waivers? It would cost professors a shitload of money as I'm sure some of the slack would be picked up from their grants. As a prospective grad-student, I REALLY hope this type of thing doesn't catch on. Grad students get payed little as it is. Could a research university even survive without providing graduate students with waivers? It would cost professors a shitload of money as I'm sure some of the slack would be picked up from their grants. As a prospective grad-student, I REALLY hope this type of thing doesn't catch on. Grad students get payed little as it is. I agree, and I don't think we could survive without them. I wonder what, if any, support the faculty union is showing for and giving to their graduate students? Well there is no official faculty union, but after the last strike 3 years ago the started a coalition of sorts so that they could attempt a union.  The union's stance was 100% in favor of the GEO.  Remember that at the same time as contract renegotiations in 2008 the faculty suffered furloughs. I agree, and I don't think we could survive without them. I wonder what, if any, support the faculty union is showing for and giving to their graduate students? Could a research university even survive without providing graduate students with waivers? It would cost professors a shitload of money as I'm sure some of the slack would be picked up from their grants. As a prospective grad-student, I REALLY hope this type of thing doesn't catch on. Grad students get payed little as it is.  My TA told me today that they may go on strike after Thanksgiving break. Something to be informed of.    (Tuition waiver + (stipend * 4.5 paydays/semester))/(15 hrs/week * 16 weeks/semester) = $44.93/hr. You have English degrees. Stop complaining. (Tuition waiver + (stipend * 4.5 paydays/semester))/(15 hrs/week * 16 weeks/semester) = $44.93/hr. You have English degrees. Stop complaining. This is factually incorrect. TA's are typically either 25% or 50% appointments. Here's how much they get paid: http://www.ahr.illinois.edu/grads/Grad1112Rates.htm (Tuition waiver + (stipend * 4.5 paydays/semester))/(15 hrs/week * 16 weeks/semester) = $44.93/hr. You have English degrees. Stop complaining. (Tuition waiver + (stipend * 4.5 paydays/semester))/(15 hrs/week * 16 weeks/semester) = $44.93/hr. You have English degrees. Stop complaining. Totally agree. But I bet this will be downvoted to hell because this subreddit is defined by being hive-minded, entitled, and whiney.  I'm actually going to take back my down vote because I think you have a point. At the very least I don't feel comfortable participating in censoring someone for their opinion.",
    "url" : "http://www.change.org/petitions/university-of-illinois-community-and-supporters-help-us-protect-tuition-waivers-for-teaching-assistants-and-graduate-assistants"
  }, {
    "id" : 63,
    "title" : "Need something to do Friday night? Come check out some local music at Mike N Molly's (That's No Moon, Paper Anchors, and Dirty Laundry)",
    "snippet" : " ",
    "url" : "http://www.facebook.com/events/375625319179990/"
  }, {
    "id" : 64,
    "title" : "I lost my cat and I was hoping one of you guys might have seen him.",
    "snippet" : "  When did you notice he was gone? I saw a grey cat,  similar to your over on Locust yesterday.  Well, he was last seen on Friday the 9th and I thought he would come back after a while but he hasn't so I thought I'd start asking around. Have you tried contacting [animal control](http://www.co.champaign.il.us/ac/muniac.htm) or the [humane society](http://www.cuhumane.org/)? If he was picked up as a stray he would likely be taken to one of those places. Yea, I tried animal control and a shelter but the shelter said they send strays they get to animal control.  Yea, I tried animal control and a shelter but the shelter said they send strays they get to animal control.  When did you notice he was gone? I saw a grey cat,  similar to your over on Locust yesterday.        I haven't seen your cat, but I put this map together of the sightings mentioned thus far. I included the location, some or all of the original comment, and the date (or date range) of each sighting. Hopefully it allows you to narrow your focus. Good luck.\n\nhttp://goo.gl/Hdsre     My friends keep telling me about a kitten that kinda resembles this ones hangning around the ike/armory, good luck finding it      ",
    "url" : "http://imgur.com/W6G4s"
  }, {
    "id" : 65,
    "title" : "Anyone have experience living in Newman? I'm thinking about it for my soph year",
    "snippet" : "I was hoping to get a double suite with three other girls in north newman. I'm just curious to hear opinions on how strict it was there, how the rooms were, and how easy it was to meet people who were more on the 'liberal/going out to parties and such' type. I just wanted a nicer place to live, but did *not* want to stay in uni housing another year (staying in par now). \n\nMost of all, is it worth the cost? The cheapest option is 12,800 for 14 meals. Does anyone know how this compares to apartment life? \n\n\nThanks for any info!!  \n\n*Edit: Wow thanks so much guys-- I would really love an apartment but it's a bit difficult for me to find people to live with, however it sounds like a muuch better option. Maybe I'll look for an efficiency kinda thing for one person? Anyway thanks for the info!*     if you do wind up living there, don't forget flood insurance   For the most part, people do go out and party there, but most people tend to be much more conservative - you see a lot of very stereotypically \"white\", religious kids. Not that that's a bad thing whatsoever, but I'm just letting you know. The internet is horrible, and they block offensive sites like they did in high school. The RAs are a little more strict - no opposite gender on your floor past 2AM, etc are rules that you wouldn't find at other dorms. On the other hand, the rooms are very nice.   Hmm I thought meals at Newman was an honor system? Did they change it to a meal plan?  I have lived at Newman both my freshman and sophomore year. Location is great, food is relatively solid (still dorm food). As for the people, I'd say it's a mix between Catholic conservatives and partiers. People are pretty friendly. Cost is worth it *if* you like the location and are okay with there being pretty heavy conservatives there. The RA's aren't too strict; don't be stupid and have booze in plain sight and keep the noise down and you're fine. But Karaoke is so fun at night.. Trust me on this one: don't do karaoke. :(   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/139fle/anyone_have_experience_living_in_newman_im/"
  }, {
    "id" : 66,
    "title" : "Anyone fight on GRE ??",
    "snippet" : "I am going to prepare GRE after these midterms. But its so hard to concentrate on it myself. Anyone wanna make a group and prepare for it together?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/139awp/anyone_fight_on_gre/"
  }, {
    "id" : 67,
    "title" : "Best way to get CPM to replace furniture?",
    "snippet" : "Since moving in, I've been in need of replacements for my dresser and desk.  Also, the mirror in my room was not there when I moved in.  I filled out the move-in report stating that I needed these things replaced immediately and they never replaced any of it.\nI called maintenance twice and they just told me that they will get to it in due time.  It's November already for shit's sake.\nI'm also thinking of posting signs in my apartment demanding my maintenance requests to be taken up for when they start showing my apartment around.  It's hard to get CPM to do anything.  It took them 2 months to replace a broken window in my apt.!  We complained about multiple pieces of furniture at the beginning of the year and nothing got done.  If you talk to them personally, threaten to file a report with the tenant union (best recourse, but still pretty ineffective with CPM).  Good Luck!    My roommate called and bitched twice a week for a good two months for them to come and place our couches because they were old and just really gross. They kept telling us that they would be coming, then they wouldn't show, then we would continue to bitch. My roommate would express each time how many times they told us we would get them and all the previous dates that they guaranteed them by. After about 20 phone calls... we got big brown puffy mother fuckers last week. huh. we just got our big brown puffy mother fuckers a few days ago but all we did was file a request for new couches cuz some cpm dude who was showing our place around said we should So from what I gather, bitching twice a week for two months gets you a couch after 20 phone calls.\n\nBeing polite, patient, and filling out proper paperwork gives you a new couch in a few days.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1389z3/best_way_to_get_cpm_to_replace_furniture/"
  }, {
    "id" : 68,
    "title" : "Any meditation resources on campus?",
    "snippet" : "Besides books of course. I'm looking for groups or classes. I know the arc has some classes, but I've not heard anybody speak particularly well of them.  rlst 132    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/138dxp/any_meditation_resources_on_campus/"
  }, {
    "id" : 69,
    "title" : "CU Black Friday?",
    "snippet" : "What's it like? Is it as hectic as it is in other cities? I'll be staying on campus for the holidays since I'm an OOS.  North prospect will be crazy but that's about the extent of it.    What is an OOS? I believe they are referring to \"out-of-state\" as it is too expensive to travel home.  I went to Macy's last year to get a cheap coat early in the morning, and there weren't too many people in the store. It was pretty surprising. I did notice that all of the stores on North Prospect were pretty packed, especially Best Buy. This being my first Black Friday, I was a bit horrified by the madness. I went to Macy's last year to get a cheap coat early in the morning, and there weren't too many people in the store. It was pretty surprising. I did notice that all of the stores on North Prospect were pretty packed, especially Best Buy. This being my first Black Friday, I was a bit horrified by the madness.",
    "url" : "http://www.reddit.com/r/UIUC/comments/138hdv/cu_black_friday/"
  }, {
    "id" : 70,
    "title" : "Can landlords show your apartment without calling ahead? ",
    "snippet" : "It is becoming a real problem where every other day i get a knock on my door from cpm wanting to show my apartment without any notice at all. Do they have the right to do this?  Answer the door naked.  Alternatively, leave a giant black dildo on the dining table. That's what one apartment did last year when I was viewing. The leasing agent pretended not to notice it even though it was very obvious. Fun times. Alternatively, leave a giant black dildo on the dining table. That's what one apartment did last year when I was viewing. The leasing agent pretended not to notice it even though it was very obvious. Fun times. was this in green street towers by chance?  If you make it a habit to be drunk, shirtless, smoking a cigarette and sorrounded by 40 beer cans they eventually decide that there are other apts in the building they can show.  I could be wrong, but IIRC Urbana law requires 24 hours notice, but Champaign doesn't. Actually, this is NOT necessarily correct for this case.\n\nFirst, they can have mutual consent:\n\n&gt; The landlord shall not abuse the right of access to the rental unit or use it to harass the tenant. Except in cases of emergency **or by mutual consent**, the landlord or landlord's agents shall not enter the rental unit without first providing the tenant with at least twenty-four (24) hours advance notice of the entry and may enter only at reasonable times. Reasonable times shall be considered 10:00 a.m. to 8:00 p.m. on weekdays and 11:00 a.m. to 8:00 p.m. on weekends, or such other times agreed upon by the tenant and the landlord.\n\nSecondly, they could have access if the play is not leased yet for next year and they allowed you the option of choosing a schedule:\n\n&gt; From the time that either the landlord or the tenant notifies the other party that the rental agreement will not be renewed, the landlord shall have the right to access, without twenty-four (24) hours advance notice, for the purpose of showing the rental unit to prospective tenants, provided that:\n\n&gt; 1) The rental unit has not already been leased for the twelve-month period subsequent to the expiration of the rental agreement;\n\n&gt; 2) The landlord enters only during two (2) specific one-hour periods on weekdays and three (3) specific one-hour periods on weekends, selected by the tenant from among choices offered by the landlord, during which the landlord will have daily access; and\n\n&gt; 3) The landlord shall notify the tenant when the rental unit has been leased for the twelve-month period subsequent to the expiration of the rental agreement.\n\n\n can you link your source please? That way people here can tell their LL's where to shove it, thank you. I could be wrong, but IIRC Urbana law requires 24 hours notice, but Champaign doesn't. I could be wrong, but IIRC Urbana law requires 24 hours notice, but Champaign doesn't.  CMP posts a calendar on your door with daily showing times. It sucks, but technically this is your notice. CMP posts a calendar on your door with daily showing times. It sucks, but technically this is your notice. Did you live at 1010 W. Stoughton? When I lived there I got the calendar as well was this something they did last year?? Has anyone This year gotten the calendar?\n\nand i think you have gotten the calender because 1010 Stoughton is in urbana thus by Law they must tell you ahead of time.  I live off campus in Urbana in a CPM apartment. I've lived in and out of CPM apartments in Urbana (on and off campus) for the past few years, and I've always gotten a calendar. The only time I did not receive one is when my apartment was already leased for the next  year (hence no showings).   I leased with them for four years and was curious about this. I was given warning maybe once or twice, and easily had 40+ views of my unit in that time.  I live with CPM and the same thing happens to me. I don't think they're required to warn you but I could be wrong. If you're a neat and tidy person, you're gonna be stuck with them bringing people by. All these suggestions sound useful though! lol i really don't think they care if you are neat or not, my apartment is a mess and they keep coming back. I guess I did see some questionable apartments when I was apartment searching. i really don't think they care if you are neat or not, my apartment is a mess and they keep coming back. maybe if you clean it up and make it look AWESOME for one day, someone will lease it and they wont have to keep coming back? that's what i did with my apartment. i really don't think they care if you are neat or not, my apartment is a mess and they keep coming back. Did you check your lease? Is it in there? http://www.cpm-apts.com/files/Lease_sample.pdf\n\ni cant find anything about it.  http://www.cpm-apts.com/files/Lease_sample.pdf\n\ni cant find anything about it.  i really don't think they care if you are neat or not, my apartment is a mess and they keep coming back.  Plan A:\n\n* Hire a hobo.  Pay hobo in booze, food, and allow couch-lounging.  Request that they maintain a perpetually drunken state.\n\nPlan B:\n\n* Answer door partially naked in a drunken/high state. If male, have tip of penis poking through boxers.  If female, have boob hanging out of bra.\n\nPlan C:\n\n* Acquire several dildos.  Place dildos strategically.\n  * Bonus points -- Slather one or more dildos with Vaseline to the point where you can see the goop.  \n   * Bonus bonus points -- Mix Vaseline and brown food colouring and do the same as above.\n\nPlan D:\n\n* Answer door completely naked.  When I signed my lease, I was told I would have warning. I believe you could just refuse. It's the same as a landlord just barging in whenever they want.  Do you live in champaign or urbana?  I'm curious about this too. Our apartment (in Champaign) has been shown 2 or 3 times already without advanced notice. If it's illegal, we're definitely gonna ask for them to lower the rent. who is your landlord  I'm curious about this too. Our apartment (in Champaign) has been shown 2 or 3 times already without advanced notice. If it's illegal, we're definitely gonna ask for them to lower the rent.   Quick question, how about if they're breaking into locked doors? \n\nI've had my current landlord fail to give proper notice the last 3 showings, and this most recent time break into a locked door to show a room.  I came home once to a agent showing my apartment. They have keys to every apartment so i would assume they show it if you are not home to.  No, the locked door was to one of the rooms, not the apartment.  No, the locked door was to one of the rooms, not the apartment.   You could be like me and just maintain a sort of drunken, high, degenerate friend passed out at all times in plain sight.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/136y56/can_landlords_show_your_apartment_without_calling/"
  }, {
    "id" : 71,
    "title" : "Point out Knock out?",
    "snippet" : "Ok so my mom called me in a panic because someone we knew got the shit kicked out of them last weekend. Apparently these \"point out knock outs\" have been happening on campus a lot recently and it's the first I've heard of it. What do ya'll know about this? How seriously should I take this?\n  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/137ydv/point_out_knock_out/"
  }, {
    "id" : 72,
    "title" : "Chancellor Phyllis Wise Unveils Restored Alma Mater Statue",
    "snippet" : "    not sure why i'm upvoting this. anyone care to explain who the face is? The face is Chancellor Phyllis Wise\n not sure why i'm upvoting this. anyone care to explain who the face is?   [deleted] She has no accent at all that I can tell of.",
    "url" : "http://i.imgur.com/haZPl.png"
  }, {
    "id" : 73,
    "title" : "Fastest Internet on Campus...",
    "snippet" : "I have Pavlov at my apartment and need to download some serious GBs, where is the fastest place on campus to do this?  siebel center Siebel Center at 3am on a Friday night: https://dl.dropbox.com/u/307214/Screenshot.png Siebel Center at 3am on a Friday night: https://dl.dropbox.com/u/307214/Screenshot.png siebel center fact Awesome!  I'm guessing this is over ethernet?  If so, where are ethernet ports in Siebel? Awesome!  I'm guessing this is over ethernet?  If so, where are ethernet ports in Siebel?  I have heard siebel center. In the DCL via ethernet I got 90+ mbps down yesterday. Where are ethernet jacks in DCL? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/137xk2/fastest_internet_on_campus/"
  }, {
    "id" : 74,
    "title" : "Is a physics minor worth the grief?",
    "snippet" : "I'm a sophomore in aerospace right now, and I'm doing pretty well in 213 (yes, even after that redonkulously hard midterm) and saw that I'd need 4 more physics classes after 213 for a physics minor. This would scare the hell out of me if I thought they'd be anything like 211 or 212, but it seems like there's not as many labs/all that SmartPhysics bullshit. I actually enjoy having material presented and learning it on my own for the most part.\n\nIs it even worth it? Would a physics minor on a resume help me get a job any more than if I didn't have it? Anyone with a physics/other applicable minor have any input on this?  I'm a EE and have looked into getting a CS, physics, math, or Matse minor. After talking to various advisors and people in industry, I think I can confidently say that minors don't really matter at all. I would encourage you to take classes you find interesting, rather than trying to find classes that fit x requirement or y credits. When it eventually comes to applying to jobs, your \"minor\" will just be a very small bullet point on the entire page- below the far more important \"major.\" \n\nRather than highlighting the \"minor\" part, I would encourage you to think about how to present individual coursework you did; whether that amounts to course projects or theory you found interesting. Besides, given how lax quite a few of the requirements for minors are, I doubt you'll gain much knowledge or insight from a full fledged minor over just taking a few classes here and there. \n\nI guess my point is that if you need like 1 or 2 more classes for one or you're really excited about a particular field of study and find the required courses interesting, go for it. Otherwise, minors don't mean shit.     I have no idea if it would be useful, but as a physics major I can give some insight on how difficult it would be.\n\nThe first class you'd take after the 21X sequence is PHYS 255.  It's usually taught by Naomi Makins, who is a fantastic teacher, and it will give you a much better idea of how upper-lever courses are taught -- heavy reliance on homework, test averages that extend occasionally into the low 50's, emphasis on really understanding the material to the point where you can apply it.\n\nThe rest of the classes you'd take are probably 325, 435, and 486 (classical mechanics I, electrodynamics I, and quantum I respectively).  These courses cover the same material as 211, 212, and 214, but in much greater depth.  Instead of applying F=ma, you'll take F = dp/dt; you'll rederive all the equations from 212 using vector calculus (not as bad as it sounds) and actually USE maxwell's equations; Schrodinger's equation in QM is now a differential equation you solve for (albeit simple) potentials.\n\nYou can probably tell, I love my major.  It's not easy, but damn it's satisfying.  We have by and large good teachers for the upper level classes, and honestly if you apply yourself you will excel. Agree with everything you said, but it's 225, not 255   you have to take 325 to get a minor right (assuming the nomenclature hasn't changed- its the mechanics/relativity class with calculus)? I would take this, and see if you want to keep going. Compared to the 200's, its pretty brutal. you have to take 325 to get a minor right (assuming the nomenclature hasn't changed- its the mechanics/relativity class with calculus)? I would take this, and see if you want to keep going. Compared to the 200's, its pretty brutal. It's also more or less the weed-out course in the Physics department. Things may have changed in the ~5 years since I went through that sequence, but 325/6 were the two hardest courses I took in the physics department. So I would say take that, and if you are still interested, keep going, but just do it because it's fun---no one will care about what minors you do or don't have when you're applying for jobs/grad schools.   I'm not sure whether it's worth it, but PHYS 325 definitely isn't a weed out class. ECE 190 is a weed out class, this is a walk in the park compared to that. It just requires you actually use diffy Q, which you should be able to handle doing if you invest yourself in this. \n\nThe first week of homework is hard, but then you adjust and you know what questions you want to ask and can figure it out from there. The only thing this class requires to do well is a little time management. The homework doesn't take me more than three hours, and Gollin is available all the time to help you. You have plenty of time to complete his tests which are structured to be significantly easier than the homework. He doesn't give you a problem you haven't seen before AND his problems are funny. \n\nIt's an enjoyable class, and with respect to a lot of other classes, it's not hard at all. His last test average was a 78, curved only in the sense that he wrote one problem which was difficult and only a handful of people got (I ended up getting everything right except that problem, and I'm no genius by any means), so he accounted for that. Don't let people deter you from taking the class. I'm not sure how the other professor is, but I'd suggest taking it with Gollin because he makes class fun. Weaver's not bad, but from what I've heard Gollin's 325 is almost as good as Naomi's 225. Take it with him if you can.   [deleted] Holy hell. A double major with one of those being aero? .. . .. ... . . . . .. .... you're crazy. I'm impressed. [deleted] ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1372ig/is_a_physics_minor_worth_the_grief/"
  }, {
    "id" : 75,
    "title" : "Thursday 11/15 Screening of Switch: a film discussing some of the most important global energy questions",
    "snippet" : "The ECE Department is hosting a Screening of Switch: a film discussing some of the most important global energy questions.\n\nThe screening will take place in the newly renovated Lincoln Hall theater. Doors will open at 6:30 PM and the screening will begin at 7:00 PM. Following the screening, we will be holding a discussion with all those who are interested!\n\nFacebook event page:\nhttp://www.facebook.com/events/290937344339740/\n\nFor all upcoming Switch film screenings or to request your own screening please visit: http://www.switchenergyproject.com/screenings.php ",
    "url" : "http://www.reddit.com/r/UIUC/comments/136jcd/thursday_1115_screening_of_switch_a_film/"
  }, {
    "id" : 76,
    "title" : "Your UIUC Speech Team needs your help! Take half a minute to vote online to help them win 5K in ZipCar credits! ",
    "snippet" : "   hey kyle! Hey Josh! hey kyle!  These were the guys dressed up as 1890s candidates on the quad, right? I voted!  ",
    "url" : "http://www.facebook.com/events/209149992552535/?fref=ts"
  }, {
    "id" : 77,
    "title" : "ECE 205/206 concurrently with PHYS 212 and MATH 241",
    "snippet" : "The course catalog says PHYS 212 is a prerequisite, but is it feasible to do them at the same time? I have some background in circuits, but I don't know how much (if any) calc III or E&amp;M physics stuff is in ECE 205/206.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/137hwx/ece_205206_concurrently_with_phys_212_and_math_241/"
  }, {
    "id" : 78,
    "title" : "Just submitted an android app that lets you check the status of your dorm's laundry machines. Check it out! :D",
    "snippet" : "  This is awesome. How does it work? I would assume it pulls off information from this website:\nhttp://laundryalert.com/cgi-bin/urba7723/LMPage I would assume it pulls off information from this website:\nhttp://laundryalert.com/cgi-bin/urba7723/LMPage  Now listed on the [campus mobile computing site](http://publish.illinois.edu/mobilecomputing/list-of-mobile-apps-relevant-to-the-campus/)  Well it definitely looks better than the one I made. Good work!  Couple comments/suggestions.  It looks like it's pulling the names of halls and such off of a list somewhere.  Is that the best way to do it?  Wouldn't it be easier to just have a string array in your /values/string.xml?  Also, adding timers/specific machine data would be nice.  The UI is very pretty though, I like it.",
    "url" : "https://play.google.com/store/apps/details?id=com.robertkcheung.laundrytime&amp;feature=search_result#?t=W251bGwsMSwxLDEsImNvbS5yb2JlcnRrY2hldW5nLmxhdW5kcnl0aW1lIl0."
  }, {
    "id" : 79,
    "title" : "Where to fish?",
    "snippet" : "Not now, but perhaps in the spring, is there anywhere nearby where I can fish?   I usually go to Clinton Lake. It's about a half hour away on I-72.  Mroap:  All of these guys have good suggestions, there are also a couple more parks in Champaign up around Parkland, Heritage and Kaufman, that are pretty good for fishing too.  \n\nOn a side note, if your interested in fishing on and around campus I am a member of the University of Illinois Illini Bass Fishing Club and we get out and fish on campus all the time, and we also have a side that fishes competitive tournaments all over the country.  All skill sets are encouraged so come out and check us out!  http://www.fightingillinibassclub.com/   Came here to say the same thing. Though you forgot your favorite  spot to fish .....Crystal.  you can actually catch decent fish at crystal, I just have access to a boat so I don't like to shore fish.   In Champaign, you can fish at Heritage, Kaufman, and Mattis Parks.  The park district also lists Porter Family Park for fishing, but I've never been there.  My favorite of those is Mattis Park: it's lesser known and usually has a good number of waterfowl hanging around as well.\n\nIn Urbana, Crystal Lake Park is the only place I know of.  In my opinion, it's not that great for fishing with all the paddle boats and such, but it does have a snack bar some of the year. Wow Mattis is within walking distance. I'll probably check that out. In Champaign, you can fish at Heritage, Kaufman, and Mattis Parks.  The park district also lists Porter Family Park for fishing, but I've never been there.  My favorite of those is Mattis Park: it's lesser known and usually has a good number of waterfowl hanging around as well.\n\nIn Urbana, Crystal Lake Park is the only place I know of.  In my opinion, it's not that great for fishing with all the paddle boats and such, but it does have a snack bar some of the year. FWIW I've never had luck at Mattis Park, but I've caught a few small bass and a decent carp out of Kaufman. I usually go early evening.   Surprised no one has suggested the pond near crce. This has some great catfish in it. Also just going south on first yields some ponds. There's the one between 1st and Neil and church st, which had a few years before it gets great. There are a couple places like the one off of Devonshire drive and Neil to. Don't expect to be getting big bass at any of the local places though.  I enjoy fishing for catfish, never seen anybody fishing there though. Do you really think there's any fish in those little ponds?   Might do some googling. Crystal Lake Park is the only place near town I know of to fish. Homer lake, Lake of the woods, and Kickapoo/Kennekuk are the only other big parks for fishing I know of around here. crystal lake is also kind of a hit or miss kind of place. Some days the fish really bite and some days they dont hit any bait you place in the water ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1364nd/where_to_fish/"
  }, {
    "id" : 80,
    "title" : "Come see Michael Ian Black tonight at the Union!",
    "snippet" : "   Just got back from it. He was everything I expected (which is a good thing lol). He made fun of me for my introduction and I gave him a ride to his hotel :) Haha, that seemed rough to take.  Pretty hilarious way to start off his comedy though.  So are you planning to have a career in public speaking?  Jk.  Thanks for bringing him to U of I! I had absolutely NOTHING prepared for that haha. It was actually pretty awesome to have him make fun of me. I'm glad you liked having him here :) ",
    "url" : "http://www.facebook.com/events/443287505719434/"
  }, {
    "id" : 81,
    "title" : "I'm graduating in a month. What are some of the not well known things I should do before I leave?",
    "snippet" : "I feel like I've experienced most of the staples of the UIUC experience. Now I'm curious about some of the not-well known things that are interesting.  I made a list, which I've lost on my other laptop, and it is biased since I lived in Urbana and experienced that culture but:\n\nFood: Black dog, Courier Sunday brunch, Pizza M, Cravings (Chicken Gado gado), Zorbas (gyros), coffee at Cafe Kopi\n\nExplore: In order of ease of access, Arboretum, Carle Park, Busey Woods, Meadowbrook Park, Lake of the Woods, Allerton\n\nUIUC: Go to a basketball game, go to a football game, tailgate (even if you dont go to the game), go to a frat party (its part of the experience), Murphys Thursday, Clybourne Wine Night, go to a house show, Piano man, hit the ARC because it is AMAZING and I didn't utilize it early enough, go to a country concert at the rosebowl in DT Urbana.\n\nExperiences: Black out (while its still somewhat socially acceptable), make out with a stranger (while its still somewhat socially acceptable), skip class and drive somewhere to enjoy a beautiful day, sleep on the quad between classes, smoke weed (while its still easily accessible and decriminalized in Urbana), prank a class (and be creative!), write a fake paper about something insane for one of your courses under a fake name, do a keg stand, go to a barn dance.\n\nFarther out: Go to Springfield and get a horseshoe while you're close. Go to Jackson Falls to rock climb while you're close.\n\nMost importantly, enjoy having most of your friends in one place and easily accessible. People scatter around the country and the world after graduation.\n\nI'm going to get judged for some of these, and that's fine. I graduated last December, and I know what I miss. Just say yes to things. I made a list, which I've lost on my other laptop, and it is biased since I lived in Urbana and experienced that culture but:\n\nFood: Black dog, Courier Sunday brunch, Pizza M, Cravings (Chicken Gado gado), Zorbas (gyros), coffee at Cafe Kopi\n\nExplore: In order of ease of access, Arboretum, Carle Park, Busey Woods, Meadowbrook Park, Lake of the Woods, Allerton\n\nUIUC: Go to a basketball game, go to a football game, tailgate (even if you dont go to the game), go to a frat party (its part of the experience), Murphys Thursday, Clybourne Wine Night, go to a house show, Piano man, hit the ARC because it is AMAZING and I didn't utilize it early enough, go to a country concert at the rosebowl in DT Urbana.\n\nExperiences: Black out (while its still somewhat socially acceptable), make out with a stranger (while its still somewhat socially acceptable), skip class and drive somewhere to enjoy a beautiful day, sleep on the quad between classes, smoke weed (while its still easily accessible and decriminalized in Urbana), prank a class (and be creative!), write a fake paper about something insane for one of your courses under a fake name, do a keg stand, go to a barn dance.\n\nFarther out: Go to Springfield and get a horseshoe while you're close. Go to Jackson Falls to rock climb while you're close.\n\nMost importantly, enjoy having most of your friends in one place and easily accessible. People scatter around the country and the world after graduation.\n\nI'm going to get judged for some of these, and that's fine. I graduated last December, and I know what I miss. Just say yes to things. I made a list, which I've lost on my other laptop, and it is biased since I lived in Urbana and experienced that culture but:\n\nFood: Black dog, Courier Sunday brunch, Pizza M, Cravings (Chicken Gado gado), Zorbas (gyros), coffee at Cafe Kopi\n\nExplore: In order of ease of access, Arboretum, Carle Park, Busey Woods, Meadowbrook Park, Lake of the Woods, Allerton\n\nUIUC: Go to a basketball game, go to a football game, tailgate (even if you dont go to the game), go to a frat party (its part of the experience), Murphys Thursday, Clybourne Wine Night, go to a house show, Piano man, hit the ARC because it is AMAZING and I didn't utilize it early enough, go to a country concert at the rosebowl in DT Urbana.\n\nExperiences: Black out (while its still somewhat socially acceptable), make out with a stranger (while its still somewhat socially acceptable), skip class and drive somewhere to enjoy a beautiful day, sleep on the quad between classes, smoke weed (while its still easily accessible and decriminalized in Urbana), prank a class (and be creative!), write a fake paper about something insane for one of your courses under a fake name, do a keg stand, go to a barn dance.\n\nFarther out: Go to Springfield and get a horseshoe while you're close. Go to Jackson Falls to rock climb while you're close.\n\nMost importantly, enjoy having most of your friends in one place and easily accessible. People scatter around the country and the world after graduation.\n\nI'm going to get judged for some of these, and that's fine. I graduated last December, and I know what I miss. Just say yes to things. I made a list, which I've lost on my other laptop, and it is biased since I lived in Urbana and experienced that culture but:\n\nFood: Black dog, Courier Sunday brunch, Pizza M, Cravings (Chicken Gado gado), Zorbas (gyros), coffee at Cafe Kopi\n\nExplore: In order of ease of access, Arboretum, Carle Park, Busey Woods, Meadowbrook Park, Lake of the Woods, Allerton\n\nUIUC: Go to a basketball game, go to a football game, tailgate (even if you dont go to the game), go to a frat party (its part of the experience), Murphys Thursday, Clybourne Wine Night, go to a house show, Piano man, hit the ARC because it is AMAZING and I didn't utilize it early enough, go to a country concert at the rosebowl in DT Urbana.\n\nExperiences: Black out (while its still somewhat socially acceptable), make out with a stranger (while its still somewhat socially acceptable), skip class and drive somewhere to enjoy a beautiful day, sleep on the quad between classes, smoke weed (while its still easily accessible and decriminalized in Urbana), prank a class (and be creative!), write a fake paper about something insane for one of your courses under a fake name, do a keg stand, go to a barn dance.\n\nFarther out: Go to Springfield and get a horseshoe while you're close. Go to Jackson Falls to rock climb while you're close.\n\nMost importantly, enjoy having most of your friends in one place and easily accessible. People scatter around the country and the world after graduation.\n\nI'm going to get judged for some of these, and that's fine. I graduated last December, and I know what I miss. Just say yes to things.  Sneak into the pool at Europa House and skinny dip. Got the police called on me and some friends for that once. I think the cop was laughing harder than we were while we got dressed and left.  A) run naked at 3am from Foellinger Auditorium to Illini Union.\n\nsaw one guy doing it in my freshman year, day before school started, set the mood for all of my 3 years in here so far. He made my college days, and you can do that for someone else.\n\nB) Sleeping in 2nd floor of Grainger wearing pink tanktop and rainbow knee socks, bag full of liquor optional.  \n\nAlso happened in first month of my freshman year, I still see this guy, with more or less same fashion, around Downtown Champaign, personal hero.\n\nJust was commenting on some of the weird things I seen around here... Anyway, in all seriousness, urban exploration into steam tunnel is something very interesting if you are able to go in. I second exploring the steam tunnels! How does one access said tunnels? I second exploring the steam tunnels!  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1357s5/im_graduating_in_a_month_what_are_some_of_the_not/"
  }, {
    "id" : 82,
    "title" : "LON-CAPA... er Reddit? ",
    "snippet" : "  I never want to meet these people in real life. Fucking stupid.\n CHEM!\nWUT R U DUIN?!\nCHEM!\nSTAHP!!!\n\nThat one hurt to read...    Good to know you can always count on Mark A Dick to be the voice of reason.   Oh, CHEM 103. Also, I might suggest censoring the names on the sheets, because all our NetID's are bare too.        I remember when they had multiple true-false statements on one question with 99 tries. I was always lazy and always just tried every combination. For example, for one with 5 statements, i would try FFFFF, FFFFT, FFFTF, FFFTT, FFTFF, FFTFT, FFTTT, FTFFF, etc.\n\nWell, there was one homework with a question with 6 statements. I missed one combination and got to TTTTTT on the 63rd try. \n\nGood thing it doesn't count the same answers as multiple tries. That sucked. It explains my C in the class though. Instructors can see how many attempts you've used though. I remember when they had multiple true-false statements on one question with 99 tries. I was always lazy and always just tried every combination. For example, for one with 5 statements, i would try FFFFF, FFFFT, FFFTF, FFFTT, FFTFF, FFTFT, FFTTT, FTFFF, etc.\n\nWell, there was one homework with a question with 6 statements. I missed one combination and got to TTTTTT on the 63rd try. \n\nGood thing it doesn't count the same answers as multiple tries. That sucked. It explains my C in the class though.",
    "url" : "http://imgur.com/a/tSJjZ"
  }, {
    "id" : 83,
    "title" : "Academic probation question",
    "snippet" : "Here is the skinny. Taking 12 hours and doing really badly in one my classes. (3 4credit hour classes). I have been on probation before a year and a half ago but got off of it. I am actually doing pretty well in the other classes and I am sure that I would be over at least a 1 on my semester gpa and over 2 on my overall gpa with the school but under 2 for my semester GPA. My question to you good people today is that has anyone ever been on academic probation more than once? I have to say I am pretty worried that they are just going to kick me out for doing bad in one class. I have also had some health issues over the semester that have definitely not helped. Thanks for your time   I've been on probation multiple times, and I will be graduating next Fall (one semester late). You won't get dropped from the university unless you end up on academic probation for two consecutive semesters. Thanks allot. Sucks I might go back but at least I get to come back next semester and remedy it  Go talk to someone in your college office. They are the ones who do academic standing reviews, and it is much easier for things to go well for you if they have met with you. They don't look as kindly on students who slink off and hide, hoping that nothing goes wrong and that they will never need to talk about their problems. Go to them and talk earnestly about your situation. Good luck!  [deleted] I'm not making excuses. Sorry I had a legitimate worry about my academic future endeavors at the school  I'm not making excuses. Sorry I had a legitimate worry about my academic future endeavors at the school  [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/135gn5/academic_probation_question/"
  }, {
    "id" : 84,
    "title" : "I need to choose between the following CS Courses...",
    "snippet" : "I can only choose **one or two**, not sure which. I'm graduating next semester and have a job in a company's research division but haven't chosen a group yet, and want to pick a course that I can tentatively do research in. \nIn addition, I want an easy semester, but if it's interesting, I'm willing to make an exception ;)\n\nCS 410\n&gt; \n\nCS 418\n&gt; \n\nCS 425\n&gt; \n\nCS 440\n     I took 410. I actually found the material pretty interesting. The professor can be pretty monotone throughout each lecture, but he's actually a very nice and understanding guy. The homeworks at first look pretty lengthy, but they're more or less step-by-step instructions. There are lecture videos too in case you can't/don't feel like going to class.\n\nI managed to only go to class a handful of times throughout the semester and got an A, so it's pretty easy.  How was the semester-long project for 410? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/135ny8/i_need_to_choose_between_the_following_cs_courses/"
  }, {
    "id" : 85,
    "title" : "has anybody taken eng 360??\n",
    "snippet" : "has anybody taken eng 360?  its the same as te 360.  it seems like you just listen to guest speakers.  are the tests, homework?  There are quizzes based off of lectures and readings. Attendance is mandatory. is it easy for a non-engineer?  i'm an IB major so i do have some physics background.  worth taking senior year?",
    "url" : "http://www.reddit.com/r/UIUC/comments/1356z4/has_anybody_taken_eng_360/"
  }, {
    "id" : 86,
    "title" : "Anyone driving to Madison, Wi on 11/16 with an extra seat?",
    "snippet" : "I'm offering $25 in gas money!   Do you live in Madison? I do, and I haven't found anyone else here from my fair city. I'm actually taking a bus back on Friday though, sorry.",
    "url" : "http://www.reddit.com/r/UIUC/comments/134wtt/anyone_driving_to_madison_wi_on_1116_with_an/"
  }, {
    "id" : 87,
    "title" : "Sliders is closed.",
    "snippet" : "I was just getting really excited to order a veggie burger, when I noticed that Sliders was removed from EatCU. Tried calling local number, phone disconnected. Online ordering says the store is closed. I finally called customer service who informed me that the UIUC location is permanently closed. \n\nNo more mushroom and swiss veggie burgers for this cowboy.     Sweet, bring over a white castle instead, they're all too god damn far.  I agree completely. Where's the closest one? Where's the closest one?  i ate there once  Get an in-n-out here somehow.  Overpriced burgers gone?\n\nMaybe now we can get a new place in there, we've lacked a good by the slice pizza place since Antonios closed. There's Manolo's. Their empanadas are boss. The brownie one is my favorite heart attack. Dude. Mushroom Thyme. It is the most delicious empanada and I will fight anyone who disagrees* \n\n\n\n**I won't actually fight you. I am skinny like a twig, and easily breakable, also like a twig.* There's Manolo's. where is that? Is it on Green St? If not, useless to most students If you don't get off Green St, you don't know Champaign. If you don't get off Green St, you don't know Champaign. where is that? Is it on Green St? If not, useless to most students  How much longer until the Wendy's is up and running? on a side note Five Guys is opening up any day now I read several articles about its opening. They say around mid December apparently. I heard it opened yesterday. Last time I was by there (a week or so) they were bringing in all the chairs and setting up.  They did just open. I was there. I read several articles about its opening. They say around mid December apparently.  On the other hand, a Five Guys opened up on Prospect recently. [Google isn't finding it, but I promise, it's there](https://maps.google.com/maps?daddr=40.137397,-88.258587&amp;hl=en&amp;sll=40.137155,-88.258179&amp;sspn=0.003265,0.005284&amp;t=h&amp;mra=mift&amp;mrsp=1&amp;sz=18&amp;z=17) Obviously, a bit of a trip, but great food. is it actually open yet?  last I checked it was still being worked on Yup. I drove by there yesterday. Sign in the window saying they are open all weekdays (I think 10 to 10 or something). Happy people getting hamburgers, the whole shebang.     In other news, Jersey Mikes is coming early next year right next to Cold Stone on Green. I don't think many people know about it but they have fantastic subs and punch cards! In other news, Jersey Mikes is coming early next year right next to Cold Stone on Green. I don't think many people know about it but they have fantastic subs and punch cards!             Put in a f*****ing mcdonalds\n Put in a f*****ing mcdonalds\n Put in a f*****ing mcdonalds\n There used to be a McDonalds in the basement of the student union, but it went out of business. Not sure they'd be that eager to get back into the campus food market, even with a better location. Put in a f*****ing mcdonalds\n  [deleted] Really? Everyone on campus that I know uses EatCU. It is a lot more common than you think.  Easiest way to find all the menus and specials. Really? Everyone on campus that I know uses EatCU. It is a lot more common than you think.  Easiest way to find all the menus and specials. Yeah I use it all the time and on average pay about $5 more (delivery charge + EatCU charge + tips) than what going to the restaurant and picking up the food would cost. I was never charged by Eatcu only the delivery charge. most of the time i just order takeout now and drive and pick it up myself. This is what I do. Works wonders at getting specials on pizzas Yes it does, though pizza on campus sucks. I don't know... I think Manolo's is pretty good. I don't know... I think Manolo's is pretty good. I would have to try it. I am from chicago, if you think the best food is in champaign you have not lived. I am not from chicago. I don't think the best food ever is in Champaign. That said, Manolo's does make a really good pizza. Quality ingredients and the people there know what they're doing. If you can get by without judging me for a little caesar's addiction, then I highly recommend Manolo's. Go in and order any single slice and I'd be surprised if they don't win you over. I would have to try it. I am from chicago, if you think the best food is in champaign you have not lived. Yes it does, though pizza on campus sucks. I've taken to buying little caesar's constantly out on mattis. Mediocre sure, but with garlic butter and for the price I can't complain. I mostly get campus pizza if LC is closed lol I was never charged by Eatcu only the delivery charge. most of the time i just order takeout now and drive and pick it up myself. EatCU charges 40 cents per order (it might be called the transaction charge).",
    "url" : "http://www.reddit.com/r/UIUC/comments/133lyi/sliders_is_closed/"
  }, {
    "id" : 88,
    "title" : "anyone looking for rides to/from UIUC: I just made this rideshare facebook page.",
    "url" : "https://www.facebook.com/groups/295957753846551/"
  }, {
    "id" : 89,
    "title" : "Engineering Majors: Do classes ever stop sucking?",
    "snippet" : "Although I'm a Junior in GE, I'm finishing up a bunch of prereq classes this semester.  Long story short, IE 300 and TAM 251 are just plain awful.  Difficult, absurdly time-consuming, and mind-numbingly uninteresting.  I would gladly trade those classes for daily trips to the dentist.\n\nSo, engineers of r/uiuc, is there light at the end of the tunnel, or are all my classes going to be like that from here on out, requiring me to make peace with the fact that my life is going to suck for the next 3 semesters?  ECE never stops. 411 senior year, so time consuming. CompE got better for me when i got past the core ECE courses and got to take more tech electives in CS.\n\nTaking ECE 411 right now and it's pretty annoying, especially for someone that wants to go into a more software oriented career.  I'm not sure how it is in GE, but for ME, TAM251 is absolutely my least time consuming class this semester, and any upperclassman I've talked to in ME has considered it a very easy class as well.          ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1343dz/engineering_majors_do_classes_ever_stop_sucking/"
  }, {
    "id" : 90,
    "title" : "Survey for cyclists",
    "snippet" : "Hey everyone, my group is doing a research project for a certain writing class, and we'd appreciate it if anyone who owns a bike could take the quick five minutes to fill out this survey.\n\nhttp://tinyurl.com/NCBWSurvey\n\nor \n\nhttps://docs.google.com/spreadsheet/viewform?formkey=dG5CNWt0MGdFTTdWVG1kUmZoNlV0LWc6MQ",
    "url" : "http://www.reddit.com/r/UIUC/comments/134rle/survey_for_cyclists/"
  }, {
    "id" : 91,
    "title" : "Five Guys is open!",
    "snippet" : "   as a student living on the southeast side of campus: =( Where is it at? Where is it at? [Not close to campus at all](http://www.fiveguys.com/locations.aspx?fAddress=61801&amp;radius=5&amp;units=mi).  ",
    "url" : "https://sphotos-b.xx.fbcdn.net/hphotos-ash3/548940_10151257624044441_1233681672_n.jpg"
  }, {
    "id" : 92,
    "title" : "Is it plagiarism to use the same original paper for two different classes?",
    "snippet" : "I wrote a paper for one class last year, but it perfectly fits the description for another class this year.  If I use the same paper, is that cheating?  Or is it not because it is my original work that I created?  Yes ... you got gold for this? Are you implying this isn't a gold-deserving comment? How dare you. [deleted] [deleted] Yes *  &gt;  лог ин фор тхис ✏ лог ин фор тхис ✏ Yo soy un maestro completo, todavía tengo mis joyas лог ин фор тхис ✏ 我是法师满了，我仍然有我的饰品 我是法师满了，我仍然有我的饰品 лог ин фор тхис ✏ 我是法师满了，我仍然有我的饰品 &gt;   In short, [yes](http://www.admin.illinois.edu/policy/code/article1_part4_1-402.html). \n&gt; Substantial portions of the same academic work may not be submitted for credit more than once or by more than one student without authorization Technically, no.  Your link has a section specifically on plagiarism later that defines it as copying someone else's work.  You cant plagiarize yourself unless you were a co-author, or you signed away your rights to your own work, or something else like that.\n\nCopying your own work is dishonest and a violation of the student code, in most cases.  But you could always cite yourself as a source if you want to use a particular part, as you would any other author. Technically, no.  Your link has a section specifically on plagiarism later that defines it as copying someone else's work.  You cant plagiarize yourself unless you were a co-author, or you signed away your rights to your own work, or something else like that.\n\nCopying your own work is dishonest and a violation of the student code, in most cases.  But you could always cite yourself as a source if you want to use a particular part, as you would any other author. You're technically correct, and that means you don't deserve downvotes. It is a violation of the student code of conduct to reuse academic work. Whether or not that violation is termed \"plagiarism,\" you can still get in trouble for it. That was my only point.  It's like people saying that downloading music is patent infringement, or that Apple won a copyright case.  While people will understand, it isn't correct. Technically, no.  Your link has a section specifically on plagiarism later that defines it as copying someone else's work.  You cant plagiarize yourself unless you were a co-author, or you signed away your rights to your own work, or something else like that.\n\nCopying your own work is dishonest and a violation of the student code, in most cases.  But you could always cite yourself as a source if you want to use a particular part, as you would any other author. &gt; You cant plagiarize yourself unless you were a co-author, or you signed away your rights to your own work, or something else like that.\n\nIt is [self-plagiarism](http://turnitin.com/en_us/support/help-center/submitting-work-for-two-different-classes).  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/133rol/is_it_plagiarism_to_use_the_same_original_paper/"
  }, {
    "id" : 93,
    "title" : "Polyphasic sleep",
    "snippet" : "Has anyone here tried polyphasic sleep? I want to try it so I can have more time to work on my projects.  I've experienced several days of anphasic sleep... I'm a freshman playing around with that now.. Any advice on wake up tips? I sometimes sleep straight through both my alarm clock and my phones alarm   [deleted] [deleted] By veteran, do you mean you don't do it anymore? Would  you ever go back? Why? [deleted] [deleted] Tell me about your napping. I was on the Everyman-3 nap from August to October, and I was able to sleep on the Quad a lot. I'm going to get back into the Everyman next week, and I could use some advice on nap locations, pillows, headphones, etc.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1337j9/polyphasic_sleep/"
  } ],
  "processing-time-source" : 99,
  "processing-result.title" : "uiuc17_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc17_reddit.xml"
  }
}