{
  "processing-time-total" : 1669,
  "clusters" : [ {
    "id" : 0,
    "size" : 7,
    "score" : 44.18188162484094,
    "phrases" : [ "Majoring in Engineering" ],
    "documents" : [ 9, 19, 20, 23, 24, 44, 46 ],
    "attributes" : {
      "score" : 44.18188162484094
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 31.518678996851804,
    "phrases" : [ "There's Usually" ],
    "documents" : [ 9, 17, 24, 29, 30, 33 ],
    "attributes" : {
      "score" : 31.518678996851804
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 49.16633886100834,
    "phrases" : [ "Game" ],
    "documents" : [ 1, 9, 15, 19, 30 ],
    "attributes" : {
      "score" : 49.16633886100834
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 95.23821356406393,
    "phrases" : [ "Year you are in the House" ],
    "documents" : [ 4, 8, 9, 17, 24 ],
    "attributes" : {
      "score" : 95.23821356406393
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 89.26826358806673,
    "phrases" : [ "Campus is already Carry free for Students" ],
    "documents" : [ 9, 20, 24, 31 ],
    "attributes" : {
      "score" : 89.26826358806673
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 57.01861752409427,
    "phrases" : [ "Phone Number" ],
    "documents" : [ 11, 19, 33, 35 ],
    "attributes" : {
      "score" : 57.01861752409427
    }
  }, {
    "id" : 6,
    "size" : 3,
    "score" : 24.134795962888585,
    "phrases" : [ "Couple Months" ],
    "documents" : [ 4, 20, 49 ],
    "attributes" : {
      "score" : 24.134795962888585
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 49.36897565444941,
    "phrases" : [ "Drink" ],
    "documents" : [ 17, 30, 33 ],
    "attributes" : {
      "score" : 49.36897565444941
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 51.307639604937656,
    "phrases" : [ "Physics Major and Graduate School in Physics" ],
    "documents" : [ 2, 9, 23 ],
    "attributes" : {
      "score" : 51.307639604937656
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 46.482704007093396,
    "phrases" : [ "Popular" ],
    "documents" : [ 7, 9, 13 ],
    "attributes" : {
      "score" : 46.482704007093396
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 55.22640863175332,
    "phrases" : [ "President" ],
    "documents" : [ 2, 9, 27 ],
    "attributes" : {
      "score" : 55.22640863175332
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 56.844726391779055,
    "phrases" : [ "CS 418" ],
    "documents" : [ 10, 34 ],
    "attributes" : {
      "score" : 56.844726391779055
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 57.85728866387823,
    "phrases" : [ "Chem" ],
    "documents" : [ 9, 22 ],
    "attributes" : {
      "score" : 57.85728866387823
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 54.864011923904066,
    "phrases" : [ "Color" ],
    "documents" : [ 30, 32 ],
    "attributes" : {
      "score" : 54.864011923904066
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 47.94042340447443,
    "phrases" : [ "Downtown Champaign" ],
    "documents" : [ 24, 33 ],
    "attributes" : {
      "score" : 47.94042340447443
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 96.45923327105767,
    "phrases" : [ "Harlem Shake Videos are such a Stupid" ],
    "documents" : [ 0, 5 ],
    "attributes" : {
      "score" : 96.45923327105767
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 71.74203969838054,
    "phrases" : [ "Keyboard" ],
    "documents" : [ 6, 45 ],
    "attributes" : {
      "score" : 71.74203969838054
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 60.086440152590086,
    "phrases" : [ "Smell" ],
    "documents" : [ 21, 42 ],
    "attributes" : {
      "score" : 60.086440152590086
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 39.24790710010903,
    "phrases" : [ "Tax Exempt" ],
    "documents" : [ 19, 36 ],
    "attributes" : {
      "score" : 39.24790710010903
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 56.04623280943997,
    "phrases" : [ "Tournament" ],
    "documents" : [ 9, 40 ],
    "attributes" : {
      "score" : 56.04623280943997
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 77.98945265188628,
    "phrases" : [ "Wednesday" ],
    "documents" : [ 31, 43 ],
    "attributes" : {
      "score" : 77.98945265188628
    }
  }, {
    "id" : 21,
    "size" : 14,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 3, 12, 14, 16, 18, 25, 26, 28, 37, 38, 39, 41, 47, 48 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1578,
  "documents" : [ {
    "id" : 0,
    "title" : "Dear God that UIUC Harlem Shake video...",
    "snippet" : "Terribly done, poorly edited, and just obnoxious. Makes me embarrassed to say I'm from U of I :/   jesus fucking christ is the format really that difficult to follow?   [This is the video from yesterday on the quad](http://www.youtube.com/watch?v=O6sh487fBPE) They made the video private now. How strange... To hide their shame. [This is the video from yesterday on the quad](http://www.youtube.com/watch?v=O6sh487fBPE) Oh wow, that is pretty terrible.\n\nI did enjoy Bane with the shake weight though.\n\nThat had potential to be pretty awesome, I feel like someone needs to get the raw footage and make one that's a little more.... smooth. Oh wow, that is pretty terrible.\n\nI did enjoy Bane with the shake weight though.\n\nThat had potential to be pretty awesome, I feel like someone needs to get the raw footage and make one that's a little more.... smooth. I thought Bane ruined it for me. \n\nAssuming that's the same Bane as \"Chicago\" Bane, or the guy who does all of the tired and barely relevant Dark Knight parodies, I felt like Bane was a pretty shameless plug for himself. It's also just not funny anymore.   Well, that's fitting, because our TV commercials and most everything else are also terribly done, poorly edited, and just obnoxious.   Started from the bottom now we here [deleted] That shit is catchy.   Harlem Shake videos are such a stupid, annoying trend. They all look the same, what's the fucking point? That moment when you realize that you've become your parents.  Harlem Shake videos are such a stupid, annoying trend. They all look the same, what's the fucking point?    This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol You seem pretty upset. This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. You seem pretty upset. This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol Agreed. I guarantee the people that did this video had a blast doing it and do not have any remorse. People need to cool it worrying about a video that will be phased out in a couple weeks. If you are going to be embarrassed by a video that 500 people did in a school that has 10's of thousands of students then you are doing it all wrong.  This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol  At least Orange Krush did a [good version](http://www.youtube.com/watch?v=DQ8QKngspSA).  At least Orange Krush did a [good version](http://www.youtube.com/watch?v=DQ8QKngspSA). ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ycxj/dear_god_that_uiuc_harlem_shake_video/"
  }, {
    "id" : 1,
    "title" : "stream for the basketball game?",
    "snippet" : "anybody have a working online stream for the penn st game?\n  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18zwk8/stream_for_the_basketball_game/"
  }, {
    "id" : 2,
    "title" : "What RSO's are you surprised do not exist here?",
    "snippet" : "Doctor Who or generally any science fiction based club\n\nAnimation - Either for viewing or making\n\nComic Book - reading/collecting/discussing\n\nComputer Support- There are groups on campus that are CS related or employed groups. But not one devoted to \nfixing and maintaining computers pro bono.  &gt; not one devoted to fixing and maintaining computers **pro bono**\n\nBecause CS majors get enough of that from friends and family. &gt; not one devoted to fixing and maintaining computers **pro bono**\n\nBecause CS majors get enough of that from friends and family. also you can't put that on your resume (unless you are applying for a computer fixing job), so no one's interested.  Boxing. I know a few people that were on my high school team that want to start one. Tough to get started because you need a gym to train but it is a great sport.  I remember hearing people talking about wanting to start one up, but they were getting some flak from the university for it. We can have a group for every political belief on the planet, every stance on religion, every viewpoint ever. But we cannot have a club that promotes exercising and physical health. The logic is very flawed (unless you consider the constitution but still) . Sure there is a lot of head trauma in boxing but that is in actual fights. You rarely ever get put on your ass training. I see more injuries in football than I do in boxing. Yeah, go figure.  I think the rationale was that it wasn't \"cultured\" enough or some bs like that. We can have a group for every political belief on the planet, every stance on religion, every viewpoint ever. But we cannot have a club that promotes exercising and physical health. The logic is very flawed (unless you consider the constitution but still) . Sure there is a lot of head trauma in boxing but that is in actual fights. You rarely ever get put on your ass training. I see more injuries in football than I do in boxing. In football you have people paid to professionally monitor it all. With Boxing it may be that the school feels that if someone sustains(just one person) a serious injury......the school would be blamed.  The University is not affiliated with any RSO's on campus. If someone were to get injured during boxing the head of the RSO and its board members would be held accountable. All you have to do is make the members sign a contract saying that the RSO will not be held accountable and the the participants accepts all risks. Same thing I had to do in high school for boxing. Though while they have legal distance, anything done by their students on school property still comes back to them. Though there probably still is more to it though.  Though while they have legal distance, anything done by their students on school property still comes back to them. Though there probably still is more to it though.  Who says that a boxing club has to be on school property? Most of my clubs RSO events happen off campus. Boxing. I know a few people that were on my high school team that want to start one. Tough to get started because you need a gym to train but it is a great sport.   I'm surprised that there is not a Film Society. An older alum (graduated in the 70s) told me that there used to be an extremely active film society on campus. At some point a couple decades later, the film society ceased to exist. I am quite disappointed by this fact, as I love getting together with others to screen films and talk about them afterward. If I were better versed in how one starts an RSO, I would definitely try to get a Film Society going on our campus again. I can't be the only person on this campus who adores all kinds of cinema form classics to Japanese to Eastern European to Experimental film.\n\nWe do have IFV (Illini Film and Video), but they are geared toward making films and videos - not film study and appreciation.\n\nEdit: According to [University Archives](http://archives.library.illinois.edu/archon/?p=collections/controlcard&amp;id=2157), the former Film Society existed form 1955 to 1996, with involvement from Professor Steven P. Hill who passed away in 2010.\n\nAlso, there is the [Chinese Independent Film Society](https://www.facebook.com/UIUCCIFS?ref=stream), but that's a little more specific than what I am seeking. I had some friends who wanted to start a film related RSO. The University said they couldn't show movies as a RSO without essentially getting permission to exhibit the film (i.e. follow those rules that no one reads in the FBI warning). It was pretty cost prohibitive and that shut things down. I'm surprised that there is not a Film Society. An older alum (graduated in the 70s) told me that there used to be an extremely active film society on campus. At some point a couple decades later, the film society ceased to exist. I am quite disappointed by this fact, as I love getting together with others to screen films and talk about them afterward. If I were better versed in how one starts an RSO, I would definitely try to get a Film Society going on our campus again. I can't be the only person on this campus who adores all kinds of cinema form classics to Japanese to Eastern European to Experimental film.\n\nWe do have IFV (Illini Film and Video), but they are geared toward making films and videos - not film study and appreciation.\n\nEdit: According to [University Archives](http://archives.library.illinois.edu/archon/?p=collections/controlcard&amp;id=2157), the former Film Society existed form 1955 to 1996, with involvement from Professor Steven P. Hill who passed away in 2010.\n\nAlso, there is the [Chinese Independent Film Society](https://www.facebook.com/UIUCCIFS?ref=stream), but that's a little more specific than what I am seeking. I'm surprised that there is not a Film Society. An older alum (graduated in the 70s) told me that there used to be an extremely active film society on campus. At some point a couple decades later, the film society ceased to exist. I am quite disappointed by this fact, as I love getting together with others to screen films and talk about them afterward. If I were better versed in how one starts an RSO, I would definitely try to get a Film Society going on our campus again. I can't be the only person on this campus who adores all kinds of cinema form classics to Japanese to Eastern European to Experimental film.\n\nWe do have IFV (Illini Film and Video), but they are geared toward making films and videos - not film study and appreciation.\n\nEdit: According to [University Archives](http://archives.library.illinois.edu/archon/?p=collections/controlcard&amp;id=2157), the former Film Society existed form 1955 to 1996, with involvement from Professor Steven P. Hill who passed away in 2010.\n\nAlso, there is the [Chinese Independent Film Society](https://www.facebook.com/UIUCCIFS?ref=stream), but that's a little more specific than what I am seeking. First off, I love you for linking to University Archives. Secondly, I work there, and the date range at the top does not mean that's when the club was active, it just means that's the dates that the material is from. FYI...    Papercraft/origami. More just disappointed than surprised though.\n\nEdit: Would anyone be seriously interested in starting this? We would need 5 officers total, and the President and Treasurer would both have to pass quizzes. I guess the additional 3 unlabeled officers are optional, but would still be good to have. If anyone is interested enough to do it, PM me, and we might be able to get a new RSO going.  Papercraft/origami. More just disappointed than surprised though.\n\nEdit: Would anyone be seriously interested in starting this? We would need 5 officers total, and the President and Treasurer would both have to pass quizzes. I guess the additional 3 unlabeled officers are optional, but would still be good to have. If anyone is interested enough to do it, PM me, and we might be able to get a new RSO going.  Papercraft/origami. More just disappointed than surprised though.\n\nEdit: Would anyone be seriously interested in starting this? We would need 5 officers total, and the President and Treasurer would both have to pass quizzes. I guess the additional 3 unlabeled officers are optional, but would still be good to have. If anyone is interested enough to do it, PM me, and we might be able to get a new RSO going.  I do a ton of papercrafting, if anyone makes this, I'd probably come.\n\nActually, last time I posted an album of one of my models, someone recognized my hall from the background...  I was very surprised there isn't a chess club. There is a chess club on campus:\n\nhttps://www.facebook.com/IlliniChessClub I was very surprised there isn't a chess club.   Animation? Come to acm siggraph! We do 3D animation... or we have in the past and really plan to but those of us with enough experience are way too busy.  Science Fiction based? Isn't that what TechFront is? It meets in the DCL room 1320 on Saturdays. Times I'm not sure of but probably around 5 would be a good time to stroll in and see if people are there.\n\nAnimation well theres Japanese Animation Club (JAC) but thats more of viewing than making. they meet Saturdays in Siebel 1404 from 2-8pm\n\nThose are the ones I know of that seem relevant. Not too sure if those are what you were looking for but I'm sure you might find some kindred spirits there especially whovians. Give 'em a try if you haven't heard of them already :) Sci Fi- Looking at the entry, it's not about Sci Fi. Not all sci fi is about discussing tech. \n\nAnimation- Yeah Japanese animation but nothing western and I feel your basically getting a Japanese club with a hook. So I this case I would say more diversity here.\n\nAnd the last thing, well again there is no official group. Of course these people exist but no RSO does for it. Sci Fi- Looking at the entry, it's not about Sci Fi. Not all sci fi is about discussing tech. \n\nAnimation- Yeah Japanese animation but nothing western and I feel your basically getting a Japanese club with a hook. So I this case I would say more diversity here.\n\nAnd the last thing, well again there is no official group. Of course these people exist but no RSO does for it. Sci Fi- Looking at the entry, it's not about Sci Fi. Not all sci fi is about discussing tech. \n\nAnimation- Yeah Japanese animation but nothing western and I feel your basically getting a Japanese club with a hook. So I this case I would say more diversity here.\n\nAnd the last thing, well again there is no official group. Of course these people exist but no RSO does for it. Science Fiction based? Isn't that what TechFront is? It meets in the DCL room 1320 on Saturdays. Times I'm not sure of but probably around 5 would be a good time to stroll in and see if people are there.\n\nAnimation well theres Japanese Animation Club (JAC) but thats more of viewing than making. they meet Saturdays in Siebel 1404 from 2-8pm\n\nThose are the ones I know of that seem relevant. Not too sure if those are what you were looking for but I'm sure you might find some kindred spirits there especially whovians. Give 'em a try if you haven't heard of them already :) [deleted]  Overall probably one of the issues is the amount of people required. You need 5 people with two being treasurer and President.  You actually just need 2, the treasurer and the president. The other 3 authorized agents are optional. \"Step 3- Add your organization roster by providing the names of the president, treasurer, and three Authorized Agents.  You must have 5 members that fulfill those positions\"\n\nBut I have found there wording confusing here and there.  I'm an officer in a RSO and last year we only had the 2 positions officially filled. We had other officers but they weren't registered with the university.\n\nJust because it says you need 5 doesn't mean you actually need 5 :P  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18zyrm/what_rsos_are_you_surprised_do_not_exist_here/"
  }, {
    "id" : 3,
    "title" : "So how about that crime alert?",
    "snippet" : "A dumpster fire that happened two weeks ago?  I think the Division of Public Safety were thinking, \"Hey, we haven't put out a crime alert in a while.  What can we go with?\"   I thought the same thing too, until I realized that the purpose of the e-mail was to see if anyone recognizes the person in the video.  Think back to the iPad robbery last year - they sent that video out for the same reason.  Besides, arson can be pretty serious (it might have just been a dumpster but fire spreads).\n\nLaugh about it all you want, but ANY police department (including UIPD) relies on the community around them.  While it would be wonderful if UIPD/CPD/UPD/etc. could stop and solve every crime, that's just not practical.  I realize this thread is going to be full of \"UIPD is useless hahaha what a joke\" comments, but this is a pretty good way of handling this situation - which means they're actually addressing the situation.\n\nJust my thoughts on this. But why did they wait two weeks before turning to the community for help identifying this guy?  He has probably already hit the road, especially if he knows cops are looking for him.   Yeah and if this was the summer and that dumpster was near say dried out grass and a tree........\n\n But it isn't... ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18zj3y/so_how_about_that_crime_alert/"
  }, {
    "id" : 4,
    "title" : "Graduate housing at UIUC",
    "snippet" : "I'll be joining the MBA program as an international student in the fall, and I'm looking at the different options for housing at UIUC. What would you guys recommend? I'm looking for a cheap, secure place with laundry facilities nearby.  Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix If you mean Advantage Properties, I agree. I had zero issues in the two years I lived in one of their buildings. Their apartments have their own washer/dryer, which was really nice. Having covered parking for my car was also a bonus. Internet was included as well. How fast is the internet? I'm living at one of their places next year and I thought they said it's a local company, not like Comcast or AT&amp;T. How fast is the internet? I'm living at one of their places next year and I thought they said it's a local company, not like Comcast or AT&amp;T. How fast is the internet? I'm living at one of their places next year and I thought they said it's a local company, not like Comcast or AT&amp;T. Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix  I'm in Daniels Hall, and lived in Sherman Hall as well.  I really like Daniels, it's a pretty big room with your own bathroom. Feel free to PM me with any questions. $752 per month, yikes! That's a lot more than Goodwin-green, is the difference in cost really worth it?  I lived in Goodwin Green apartments my first year of graduate school.  They're not exactly cheap or luxurious, but very secure with good laundry facilities.  They're located right on campus, and I liked that since they are University housing, if I ever had a problem either maintenance or the graduate housing office was on top of it.   I lived in Goodwin Green apartments my first year of graduate school.  They're not exactly cheap or luxurious, but very secure with good laundry facilities.  They're located right on campus, and I liked that since they are University housing, if I ever had a problem either maintenance or the graduate housing office was on top of it.   Thanks! How is Orchard South? I would not recommend Orchard South. Depending on where you live in OS, the laundry building could be 4 blocks away. If you want to live in OD, choose an apartment close to one of the two laundry buildings. If you are going to be here for a couple of years, something on-campus like Goodwin-Green, or something with one of the better landlords (Advantage, Bailey) might be a better idea with regard to ease of getting to classes, being on several bus routes, etc.\n\nHowever, if you are an international student, depending on the country you are from, Orchard Downs might be a better place to stay if you don't know anyone here or there aren't many people from your country. Orchard Downs organizes many [community events](http://www.housing.illinois.edu/~/media/Files/Publications/ApartmentNewsletters/Neighbor-February2013.ashx), so you get to know other people who live there, and you wouldn't feel too isolated or lonely.  Jesus, what a bunch of unsubstantiated crap. Do you have any relevant PERSNONAL EXPERIENCE with any of this? Or are you just flapping your jaw because you like attention from some freshman to be who can't distingush between crap and actual information. Just wondering what your problem is. Jesus, what a bunch of unsubstantiated crap. Do you have any relevant PERSNONAL EXPERIENCE with any of this? Or are you just flapping your jaw because you like attention from some freshman to be who can't distingush between crap and actual information. Just wondering what your problem is.  I live at Indigo Place/The Place at 117. I've lived here for a year and a half, and will be living here for another year and a half. I have not had any issues with management, they have remodeled all of the common areas in the past year (New workout room/equipment, new clubhouse, revamped pool area, repaired hottub, repaved and resurfaced the parking, and got a pimpin new shuttle, which will be running extended hours starting in the fall).\n\nMany of my friends from law school moved to The Village at Colbert Park, but that property is literally adjacent to the train tracks. It may or may not be nicer in terms of the rental units, but it is also more expensive and gets a nasty rumble every few minutes from passing freight. How much is it for a room at Indigo Place? Looks highend.... I think its between 300-500 ish per room, depending on the number of rooms. I have a 3 bedroom to myself (with my wife) for about 1100 a month. This works out to less than 400/room. Oh, ok. Not as expensive as I thought it would be. The reviews I've seen online are a mixed bag, some people are really pleased with the place, others loathe it. I guess the bad reviews are from before the renovations....   [deleted]  Look in Champaign - housing is generally cheaper and you'll deal with fewer undergraduate shenanigans. Faron Properties, Wampler, Royce &amp; Brinkmeyer - google them, look at places online, give them a call. As a student, the bus is free, but you can easily walk too - you can be less than a mile from campus, in places and closer to other grad students. It's a whole different world from Campustown or Urbana.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18y84q/graduate_housing_at_uiuc/"
  }, {
    "id" : 5,
    "title" : "Enough with the fucking Harlem Shakes videos",
    "snippet" : "They're seriously annoying.  The only funny one is the one with the black dude pouring milk on his head.  Nobody wants to see you dance around for 15 seconds unless you're pouring milk on your head.  You do know you can just not watch them right?  I'd rather have 25 worthwhile links/text posts on the front page than 21 with a few videos of people flailing around like morons, especially on a sub as small as this one.  How do you really feel? I feel like these videos are fucking stupid. But how do you **really** feel? I feel like these videos are fucking stupid.  Oh no - this one is funny: http://www.youtube.com/watch?v=Ugl_eAm2OGY Fine.  Milk and bricks in dryers.  What about mine, Richie? Fine, you can pretend to be dead too.  That was actually really funny.  I should post it.    English and Poli Sci huh? I'm gunna need you to express your feelings a little bit better than this.  You want me to write you a fucking essay or something?  Unless you're pouring milk on your head I don't want to hear your shitty deadmau5 song.  Not that hard, buddy. If you're going to insult a form of music, at least get the genre right. At what point did I talk about genre in my comment? Deadmau5 and Baauer are different genres... I know it was an insult, but it would be like saying Elton John instead of Metallica.    but y u mad, tho? le reddit troll strieks agin lelelelel\n\nGo home.  It's not your fault I feel like it is though because I watched a few of them and that just makes people want to make them more.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18xzwl/enough_with_the_fucking_harlem_shakes_videos/"
  }, {
    "id" : 6,
    "title" : "EWS checking all lab computers for Keyloggers",
    "snippet" : "So I was working on the 4th floor ews lab of grainger, and two lab guys came around and used a thermal imaging gun to check all the keyboards for key-loggers. They said it was in response to the \"ECE Hacker\". Just thought it was interesting and nice that they're preemptively trying to prevent such things.    Hey, I was one of those guys! \n\nYes, we're checking all the keyboards (and I mean fucking all of them) just to double triple check that there are no more keyloggers in any of our keyboards. We're then putting sweet tamper proof stickers on all of them so we know in the future if they've been opened up. \n\nSomeone said it below, but I'll just confirm what he said so you all know. The thermal gun is used because we're checking for imbedded keyloggers. When you look at a keyboard, you'll see a hotspot at the keyboard controller (as /u/NegatedVoid said, all electronics produce heat when operating). We're looking for another obvious hotspot which would be a keylogger.  How did you get that job?\n He works engineering IT. I do too.\n\nYou can find the application online if you want. haha Yup, and then being promoted to Special Operations!  I got this promotion, but I can't fit a spec-ops shift into my schedule.\n\nI guess I'll never be as cool as cooluke.... Hey, I was one of those guys! \n\nYes, we're checking all the keyboards (and I mean fucking all of them) just to double triple check that there are no more keyloggers in any of our keyboards. We're then putting sweet tamper proof stickers on all of them so we know in the future if they've been opened up. \n\nSomeone said it below, but I'll just confirm what he said so you all know. The thermal gun is used because we're checking for imbedded keyloggers. When you look at a keyboard, you'll see a hotspot at the keyboard controller (as /u/NegatedVoid said, all electronics produce heat when operating). We're looking for another obvious hotspot which would be a keylogger.  Were cu police or police of any sort involved? I was in dcl last night and saw two cops walking about.  Hey, I was one of those guys! \n\nYes, we're checking all the keyboards (and I mean fucking all of them) just to double triple check that there are no more keyloggers in any of our keyboards. We're then putting sweet tamper proof stickers on all of them so we know in the future if they've been opened up. \n\nSomeone said it below, but I'll just confirm what he said so you all know. The thermal gun is used because we're checking for imbedded keyloggers. When you look at a keyboard, you'll see a hotspot at the keyboard controller (as /u/NegatedVoid said, all electronics produce heat when operating). We're looking for another obvious hotspot which would be a keylogger.  How much is the gun?  It'd be cool for Internet cafes. I think about $5K. Kinda of cool but hella expensive, haha. \n\nEdit: \n\nWe borrowed it from one of the engineering departments. No way does Engineering IT have that much expendable cash xD Sure you do. Just don't upgrade your servers for 3 years. Bam! $15k to blow on hookers and a infrared gun. :-P\n\nNo, but really: I bet the F&amp;S guys have them really nice ones too so they can find leaks in the steam lines.\n\nAdditionally, couldn't you find likely targets via the additional current required? If it's putting off detectable amounts of heat, it's gotta bump the power consumption out of spec. mA required is passed over the USB bus IIRC.  What? How do they use thermal imaging to check for keyloggers? We're talking about hardware keyloggers.\n\nI'm assuming they're checking for keyboards that have had one embedded in them. All electronics produce some heat when operating. I have a hard time imagining someone opening up all those keyboards and splicing in keyloggers, but I suppose someone has to check. I'd be more concerned with someone planting a device on the ethernet cable, between the computers and the outlet.\n\nAlso surprised that the keyloggers would generate enough heat, relative to room temperature, to be seen through the keyboard. That's exactly how his keyloggers worked. He opened up a keyboard and then soldered in the keylogger to the controller. It generates heat because its an electronic device, hooked up to power. Oh, and the thermal gun we're using is extremely sensitive. \n\nThe other device you speak of I think is a lot more obvious to find and know about (from the server side). I think from our end we would know if a device like that was hooked up to a computer's ethernet jack.   How you found any more of this dudes key loggers? Also I was at one of the computers while you took a pic of the keyboard. That gun was pretty cool That's exactly how his keyloggers worked. He opened up a keyboard and then soldered in the keylogger to the controller. It generates heat because its an electronic device, hooked up to power. Oh, and the thermal gun we're using is extremely sensitive. \n\nThe other device you speak of I think is a lot more obvious to find and know about (from the server side). I think from our end we would know if a device like that was hooked up to a computer's ethernet jack.   &gt; He opened up a keyboard and then soldered in the keylogger to the controller.\n\nThat seems like a ridiculous amount of risk. How many of these things did he manage to plant? I have a hard time imagining someone opening up all those keyboards and splicing in keyloggers, but I suppose someone has to check. I'd be more concerned with someone planting a device on the ethernet cable, between the computers and the outlet.\n\nAlso surprised that the keyloggers would generate enough heat, relative to room temperature, to be seen through the keyboard. We're talking about hardware keyloggers.\n\nI'm assuming they're checking for keyboards that have had one embedded in them. All electronics produce some heat when operating. This seems like such inefficient and probably ineffective way to check for hardware keyloggers. All electronics give off a little heat. They'd be able to see an unusual heat source inside the keyboard (remember, they probably own a buhzillion of the same keyboards).\n\nI think it'd be much less efficient to actually go around opening them all up. As another poster said, now they're putting tamper-proof stickers on them so they won't have to image again. Huh. I didn't know there was such a thing as a keylogger inside of a keyboard. That wouldn't help against something [like this one](http://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Keylogger-hardware-PS2-example-connected.jpg/175px-Keylogger-hardware-PS2-example-connected.jpg) though. Right, but they can simply order EWS staff to check for them on a regular basis. Perhaps they already do.\n\nThe tamper proof stickers would have to be checked, too. This seems like such inefficient and probably ineffective way to check for hardware keyloggers. We're talking about hardware keyloggers.\n\nI'm assuming they're checking for keyboards that have had one embedded in them. All electronics produce some heat when operating.  ATTENTION. Please Upvote this so people can SEE.\n\nI know these guys probably checked this as well, but whenever you use the computers PLEASE make sure to check the back of the computers to where the keyboard connects to see if there is an attached keylogger. There are many hardware keyloggers that people plug into the USB port and then plug the keyboard into that.\n\nSO if you think anything is weird with how the keyboard is connected....DON'T USE IT  So who is this ECE hacker? Sorry I guess I haven't been keeping up with uiuc news. I know there was some ece hacker like 2 months ago. Is it the same guy? Yep, same guy. Same guy who cancelled that ECE class last semester, glued a professor's/administrator's door shut, and put keyloggers in a bunch of computers in Everitt. \n\nDo some searching on this sub for \"ECE Hacker\" and you'll find the threads. \n\nThe TL;DR is: Guy did stupid shit. Guy thought he was smart shit. Guy got shit on by campus security and FBI. Guy got arrested. Guy posted bail. Guy awaiting trial.  So how did he get the professor's password(s) with keyloggers in the EWS keyboards? So how did he get the professor's password(s) with keyloggers in the EWS keyboards?  So what about software sided keyloggers. It's not that hard to add yourself to the sudoers file and be able to install a daemon keylogger.  Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. So what about software sided keyloggers. It's not that hard to add yourself to the sudoers file and be able to install a daemon keylogger. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18wluz/ews_checking_all_lab_computers_for_keyloggers/"
  }, {
    "id" : 7,
    "title" : "Cycling at the ARC when this guy runs by me...triple take that shit.",
    "snippet" : "  High-Altitude training mask..  Yep. Apparently they are gaining popularity. I've seen multiple people using these in the past few weeks.  Are you my mummy? Bravo\n      I always wonder about people who do this: Are they really in good enough shape to benefit from this form of training? ",
    "url" : "http://imgur.com/iGKgusp"
  }, {
    "id" : 8,
    "title" : "For those wondering: Champaign's Unofficial liquor restrictions",
    "snippet" : "  Ohohoh, I'll be having my party in Urbana! what are the restrictions in urbana?   They're not going to allow pitchers for the weekend? I've never been around for this madness in the past. Is that typical?  Not sure that these restrictions will have much impact. It hasn't in the past. I was at U of I the first year they put these extra restrictions in place.  Just pushed partying from the bars to apartment and house parties.   Not sure that these restrictions will have much impact.",
    "url" : "http://www.dailyillini.com/news/campus/article_2369fa70-7b76-11e2-b264-0019bb30f31a.html"
  }, {
    "id" : 9,
    "title" : "Greek Life at UIUC ",
    "snippet" : "Hello redditors of UIUC! \n\nI was accepted into UIUC recently and was wondering about sororities on campus. Is it beneficial to be a part of a sorority or a waste of time? From what I know about the university, it's pretty big into Greek life. Are most people on campus involved in it? Any thoughts? \n  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  This needs a counter point pretty badly because it's rather skewed.\n\nFirst of all, don't glorify the fact that greek systems are essentially access to a cheating pyramid. The fact that the university doesn't crack down on what is obviously cheating is beyond me. Frats/sororities do not hold to any standard of academic integrity at all. And the minimum GPA is not something all that hard to keep.It's not like you feel pressured to keep that GPA. What's your house's minimum GPA, out of curiosity? \n\nThe job network is rather convenient and does have obvious benefits. However, if you are smart with your connections (which I am not, sadly), you can network in a similar way you could with a fraternity or sorority. Talk to professors, take advantage of research opportunities, get involved in your department. This is a great college and the staff here are well connected in their fields.\n\nDon't start the whole philanthropic causes thing. First of all, a good portion of that money comes from alumn or people outside of the house. It is nice that greek life contributes to \"supplemental things\", but if those \"things\" are really important to you then you shouldn't need to join greek life to participate. Anyone can work in a soup kitchen or run a clothing drives. (Plus, I still firmly believe that habitat for humanity is just a way for a bunch of spoiled kids to have a morally fulfilling vacation in a town. There is nothing unemployed people in New Orleans can't to do build a house that your sorority can, sorry. If anything you're just stealing the jobs and local resources they have.)\n\nThe whole fun paragraph is nothing unique to greek life at all. I guess that was the point of typing it out, but chilling, pranking, buying shit, and pregaming are normal parts of college lifestyle for everyone. However, something not everyone has is the vindictive jealousy that goes with sorority sisters within their own house and at girls in other houses. So be wary of that.\n\nI'm not anti-greek. I have a lot of friends in top houses and I know it's a big part of life here. But I *hate* how the information they give out to draw in new members is skewed. The best piece of advice heander gave you, OP, was give it a try. See if you like it, but be aware that very few girls ever drop out of a pledge class and I don't really want to imagine how their ex-pledge sisters are to them. \n\nBest of luck, OP. Congrats on your acceptance.  I don't disagree with you iam0594. You made a lot of good points! But at the same time any time a person gives their opinion on a subject it will be skewed. I have a bias to being in a sorority because I love being in a house. \n\nI agree that the university is not on top of their game when it comes to \"cheating\" but I know of people who have access to old tests and quizzes just like I do, but instead of getting it from sisters or brothers they get information from friends. I have several GDI friends who pass around all of their information from previous semesters to their friends. How is that any different? I'm just explaining that being in a house has helped me with my school work. My house has a min. GPA of 2.6 (I think?) but some houses have a 3.0 requirement. \n\nWhen it comes to philanthropy when we raised money last semester it was from dinners, ice cream bar and a football tournament. All the money raised was from other students on campus. We weren't asking for donations from our alumni. And I never said that you had to join a house to volunteer and raise money, its just one of that added perks of being in a house. \n\nThe fun paragraph isn't unique to greek life. I completely agree with you on that one, but it is something that I love about being in my house. Any time someone wants you to join a club they're going to list out the benefits of being in a club. This is no different with me and my house. I love the volunteering aspect, I love hanging out, I love being able to go ask older girls in the house for help with school. While you may call it skewed, I'm just explaining why I love being greek. \n\nYou are also correct, very few girls drop out once they're actually in the house. Where most girls drop out is during the actual rush experience.  &gt; While you may call it skewed, I'm just explaining why I love being greek.\n\nRight, and I totally get and appreciate that. I'm not trying to bash you or sorority lifestyles at all. \n\nI'm pretty sure that you'd agree with me that in order for someone in a house to get access to previous tests and homeworks is much easier than it is for someone not in a house. So I guess in a way the main reason they are different is because of how readily available you have access to material you shouldn't. I know lots of people end up with stuff like that anyways and that professors usually change their material to prevent that from being an issue, but I feel like it's more implicit within a house. And not like that's necessarily a bad thing, I could use some answers for my engineering classes myself. But it is present and that's that.\n\nI'm very critical of philanthropy anyways so sorry to sound like I was attacking you on that. \n\nAnd yeah absolutely on you just listing the good sides of joining a sorority. If my sister were to come here and want to join a sorority I would likely tell her she absolutely should. I don't have broad, generalized notions anything against the people in them at all. Sorry if I came of as harsh! I was just defending why I love being in my house, but I can come off too strong to often!  Nope, you were one of the most respectable posters I've seen on here. I refuse to accept your apology.  Can I ask why we're banning Moruitelda? They had an [internet fight](http://www.reddit.com/r/UIUC/comments/18sncm/ruiuc_where_do_you_feel_unsafe_around_campus/c8hu294). Juicy. They should fight irl. I'd watch. Can I ask why we're banning Moruitelda? This needs a counter point pretty badly because it's rather skewed.\n\nFirst of all, don't glorify the fact that greek systems are essentially access to a cheating pyramid. The fact that the university doesn't crack down on what is obviously cheating is beyond me. Frats/sororities do not hold to any standard of academic integrity at all. And the minimum GPA is not something all that hard to keep.It's not like you feel pressured to keep that GPA. What's your house's minimum GPA, out of curiosity? \n\nThe job network is rather convenient and does have obvious benefits. However, if you are smart with your connections (which I am not, sadly), you can network in a similar way you could with a fraternity or sorority. Talk to professors, take advantage of research opportunities, get involved in your department. This is a great college and the staff here are well connected in their fields.\n\nDon't start the whole philanthropic causes thing. First of all, a good portion of that money comes from alumn or people outside of the house. It is nice that greek life contributes to \"supplemental things\", but if those \"things\" are really important to you then you shouldn't need to join greek life to participate. Anyone can work in a soup kitchen or run a clothing drives. (Plus, I still firmly believe that habitat for humanity is just a way for a bunch of spoiled kids to have a morally fulfilling vacation in a town. There is nothing unemployed people in New Orleans can't to do build a house that your sorority can, sorry. If anything you're just stealing the jobs and local resources they have.)\n\nThe whole fun paragraph is nothing unique to greek life at all. I guess that was the point of typing it out, but chilling, pranking, buying shit, and pregaming are normal parts of college lifestyle for everyone. However, something not everyone has is the vindictive jealousy that goes with sorority sisters within their own house and at girls in other houses. So be wary of that.\n\nI'm not anti-greek. I have a lot of friends in top houses and I know it's a big part of life here. But I *hate* how the information they give out to draw in new members is skewed. The best piece of advice heander gave you, OP, was give it a try. See if you like it, but be aware that very few girls ever drop out of a pledge class and I don't really want to imagine how their ex-pledge sisters are to them. \n\nBest of luck, OP. Congrats on your acceptance.  This needs a counter point pretty badly because it's rather skewed.\n\nFirst of all, don't glorify the fact that greek systems are essentially access to a cheating pyramid. The fact that the university doesn't crack down on what is obviously cheating is beyond me. Frats/sororities do not hold to any standard of academic integrity at all. And the minimum GPA is not something all that hard to keep.It's not like you feel pressured to keep that GPA. What's your house's minimum GPA, out of curiosity? \n\nThe job network is rather convenient and does have obvious benefits. However, if you are smart with your connections (which I am not, sadly), you can network in a similar way you could with a fraternity or sorority. Talk to professors, take advantage of research opportunities, get involved in your department. This is a great college and the staff here are well connected in their fields.\n\nDon't start the whole philanthropic causes thing. First of all, a good portion of that money comes from alumn or people outside of the house. It is nice that greek life contributes to \"supplemental things\", but if those \"things\" are really important to you then you shouldn't need to join greek life to participate. Anyone can work in a soup kitchen or run a clothing drives. (Plus, I still firmly believe that habitat for humanity is just a way for a bunch of spoiled kids to have a morally fulfilling vacation in a town. There is nothing unemployed people in New Orleans can't to do build a house that your sorority can, sorry. If anything you're just stealing the jobs and local resources they have.)\n\nThe whole fun paragraph is nothing unique to greek life at all. I guess that was the point of typing it out, but chilling, pranking, buying shit, and pregaming are normal parts of college lifestyle for everyone. However, something not everyone has is the vindictive jealousy that goes with sorority sisters within their own house and at girls in other houses. So be wary of that.\n\nI'm not anti-greek. I have a lot of friends in top houses and I know it's a big part of life here. But I *hate* how the information they give out to draw in new members is skewed. The best piece of advice heander gave you, OP, was give it a try. See if you like it, but be aware that very few girls ever drop out of a pledge class and I don't really want to imagine how their ex-pledge sisters are to them. \n\nBest of luck, OP. Congrats on your acceptance.  This needs a counter point pretty badly because it's rather skewed.\n\nFirst of all, don't glorify the fact that greek systems are essentially access to a cheating pyramid. The fact that the university doesn't crack down on what is obviously cheating is beyond me. Frats/sororities do not hold to any standard of academic integrity at all. And the minimum GPA is not something all that hard to keep.It's not like you feel pressured to keep that GPA. What's your house's minimum GPA, out of curiosity? \n\nThe job network is rather convenient and does have obvious benefits. However, if you are smart with your connections (which I am not, sadly), you can network in a similar way you could with a fraternity or sorority. Talk to professors, take advantage of research opportunities, get involved in your department. This is a great college and the staff here are well connected in their fields.\n\nDon't start the whole philanthropic causes thing. First of all, a good portion of that money comes from alumn or people outside of the house. It is nice that greek life contributes to \"supplemental things\", but if those \"things\" are really important to you then you shouldn't need to join greek life to participate. Anyone can work in a soup kitchen or run a clothing drives. (Plus, I still firmly believe that habitat for humanity is just a way for a bunch of spoiled kids to have a morally fulfilling vacation in a town. There is nothing unemployed people in New Orleans can't to do build a house that your sorority can, sorry. If anything you're just stealing the jobs and local resources they have.)\n\nThe whole fun paragraph is nothing unique to greek life at all. I guess that was the point of typing it out, but chilling, pranking, buying shit, and pregaming are normal parts of college lifestyle for everyone. However, something not everyone has is the vindictive jealousy that goes with sorority sisters within their own house and at girls in other houses. So be wary of that.\n\nI'm not anti-greek. I have a lot of friends in top houses and I know it's a big part of life here. But I *hate* how the information they give out to draw in new members is skewed. The best piece of advice heander gave you, OP, was give it a try. See if you like it, but be aware that very few girls ever drop out of a pledge class and I don't really want to imagine how their ex-pledge sisters are to them. \n\nBest of luck, OP. Congrats on your acceptance.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  Your sorority has test files from past upper level physics classes?  Your sorority has test files from past upper level physics classes?  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  ^^ This is why I wanna be friends with more Pi Phis (assumed from the Ice Cream, am I right?). You seem completely normal and unlike girls from what people consider to be \"top houses\". Shame my house never does anything with anyone but houses I don't like.\n\nWhen it comes to rushing both fraternities and sororities, a lot of people get turned off from it because they see how the people in the \"top houses\" act, and figure that if that's the top, then the ones beneath can't be good. But they're all wrong, because first of all, there are still plenty of great people in top houses, they just aren't seen as much. Secondly the other houses are usually more grounded and aren't all assholes which is the stereotype for guys, and fake for girls. I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.    I'm not in a sorority (dropped after the first day of recruitment, too much \"ra ra sisterhood\" for me), but one of my best friends is. Her biggest complaint to me is that her sisters get kinda catty and jealous if she hangs out with non-house members too often. I personally need lots of time alone. I don't know your personality, but it seems like theres always something you have to participate in in a sorority, which sounds like hell to me. I think that all depends on the house! My house encourages hanging out with non house members. We like being individuals, and by joining other clubs and hanging out with other friends you do just that. Just because you join a house doesn't mean that those girls have to be you're only friends.          It depends on what type of person you are. There are alpha-girl (ultra bitchy, extremely attractive) sororities and there are more average-joe girl sororities. If you can get along with these girls and want to spend a lot of your time with them, +12,000$$, go for it.\n Not sure why all the downvotes, probably just butthurt alpha-girls. Your implication is absolutely right though: more unique, interesting women that can carry stimulating conversation are probably best not conforming to Greek Life, while averagely interesting or egotistical girls will probably benefit greatly from it. The same can be said for men. It is a masturbational system at its core. It depends on what type of person you are. There are alpha-girl (ultra bitchy, extremely attractive) sororities and there are more average-joe girl sororities. If you can get along with these girls and want to spend a lot of your time with them, +12,000$$, go for it.\n I only know of one sorority that's that expensive. For the most part, they run from $3000-$6000/yr Just a guess but I assume he meant in aggregate.\n ($3k-$6k/year) * 4 years = $12k+\n\n Just a guess but I assume he meant in aggregate.\n ($3k-$6k/year) * 4 years = $12k+\n\n  Please keep in mind that your experience with one sorority should NOT be generalized with how other sororities are like.\n\nGive it a shot, the people in my fraternity are incredibly close to me. If the fit is right, these people become your best friends. Without Greek life, I would have lost a huge part of my support system and would have stressed myself out and dropped out of college. It's so great for relieving work stress.\n\nDon't get me wrong, I have just as many friends out of Greek life as I do in Greek life, but when you get to know upperclassmen and older students, you have a MASSIVE source of academically and socially experienced people. They really help you see things that you wouldn't have otherwise with your freshman friends in dorms.\n\nAnd for those wondering about the GPA argument, here is your source for GPA grade reports.\nhttp://www.odos.uiuc.edu/greek/scholarship/ifcGrades.asp I find the lower table more interesting - the All Female Undergraduate Student GPA is higher than the All Male Undergraduate Student GPA by 0.22, which is quite a big difference IMO.  I do see that to be really interesting actually, I didn't notice that earlier. What do you think the reason for that is?\n\nI want to believe it has (in part) something to do with the gender breakdown in engineering and other liberal arts majors. Thoughts anyone?    If you've read past posts on this subject, you'll probably find that there is a bias in this subreddit against the Greek life.  \n\nLikely stemming from a systemic and deep seeded jealousy of the popular by the self-depreciative masses that occupy this forum.   If you've read past posts on this subject, you'll probably find that there is a bias in this subreddit against the Greek life.  \n\nLikely stemming from a systemic and deep seeded jealousy of the popular by the self-depreciative masses that occupy this forum.   Downvoted because the truth hurts. No, downvoted because the idea of being \"popular\" because you are in a frat / sorority at a university of &gt;40k students is a relatively bizarre one.  Also, the idea that non-greek people are inherently jealous of you because know other greek people is false. \n I agree. Personally, I think it's a lot cooler to make your friends based on interest/personality rather than buy them. But I'm an unpopular god damn independent person so what do I know.  You don't buy your friends when you join greek life. The money goes towards benefiting both the individual and the community. But you wouldn't know that because you probably just judge it based on the actions of a few stupid frat boys and a few catty sorority girls who don't accurately represent greek life as a whole. Well, I chose not to pursue that lifestyle. You don't think kids join that bologna to make new friends when they come to school? It's the same reason people join clubs is to meet new people but they usually don't have to shove out a couple grand for it every so often. However, yeah, I don't know what I'm talking about after being here around these people for six years, having dated someone in a frat, and being friends with people from frats and sororities. God, I'm an idiot! Get a life, me.  I didn't say its for everyone or blame you for not joining it. I didnt tell you to get a life. I was simply pointing out that you are make a rude false assumption about something you aren't apart of.  No, downvoted because the idea of being \"popular\" because you are in a frat / sorority at a university of &gt;40k students is a relatively bizarre one.  Also, the idea that non-greek people are inherently jealous of you because know other greek people is false. \n ...and you think people actually have these ideas? No, downvoted because the idea of being \"popular\" because you are in a frat / sorority at a university of &gt;40k students is a relatively bizarre one.  Also, the idea that non-greek people are inherently jealous of you because know other greek people is false. \n  If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology. If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology. Almost 50% of my (very large) fraternity is in engineering. Another chunk is MCB. Our house GPA is above the average GPA of non-Greeks on campus - in fact most houses are, and it's in the top third of the school for Greek life.\n\nGet off your high horse, some people just know how to manage their time to include these things. I completely agree. There is a really bad stereotype that all greeks do is party. There are several engineers in my house, as well as bio majors, chem, prelaw, and business. Its all about time management! \n\nHere are some \"fun facts\" about Greek life. \n\nNationally, 71% of all Greeks graduate, while only 50% of non-Greeks graduate.\n\nThe All Greek GPA is higher than the overall collegiate GPA \n\nSince 1910, 85% of the Supreme Court Justices have been Greek.\n\n85% of the Fortune 500 key executives are Greek.\n\nOf the nation's 50 largest corporations, 43 are headed by Greeks.\n\n76% of Who's Who in America are Greek.\n\nAll but two Presidents since 1825 have been Greek.\n\n70% of the U.S. Presidents' cabinet members since 1900 have been Greek.\n\n76% of U.S. Senators are Greek.\n\nBoth women elected to the U.S. Supreme Court were sorority members.\n\nOver 85% of the student leaders on 730 campuses are members of Greek-letter organizations.\n\nLess then 2% of an average college students expenses go towards Greek membership dues. 76% of Who's Who in America are Greek.\n\nSerious Question: What the fuck is Who's Who in America supposed to mean? I just copied this off of a website. I actually have no idea. Shame on me for not being more careful with my sources I completely agree. There is a really bad stereotype that all greeks do is party. There are several engineers in my house, as well as bio majors, chem, prelaw, and business. Its all about time management! \n\nHere are some \"fun facts\" about Greek life. \n\nNationally, 71% of all Greeks graduate, while only 50% of non-Greeks graduate.\n\nThe All Greek GPA is higher than the overall collegiate GPA \n\nSince 1910, 85% of the Supreme Court Justices have been Greek.\n\n85% of the Fortune 500 key executives are Greek.\n\nOf the nation's 50 largest corporations, 43 are headed by Greeks.\n\n76% of Who's Who in America are Greek.\n\nAll but two Presidents since 1825 have been Greek.\n\n70% of the U.S. Presidents' cabinet members since 1900 have been Greek.\n\n76% of U.S. Senators are Greek.\n\nBoth women elected to the U.S. Supreme Court were sorority members.\n\nOver 85% of the student leaders on 730 campuses are members of Greek-letter organizations.\n\nLess then 2% of an average college students expenses go towards Greek membership dues. If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology. If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18vqtw/greek_life_at_uiuc/"
  }, {
    "id" : 10,
    "title" : "Walking into my CS 418 Midterm today. The professor had similar thoughts.",
    "snippet" : "    ",
    "url" : "http://www.quickmeme.com/meme/3say2r/"
  }, {
    "id" : 11,
    "title" : "My buddy's dog ran away",
    "snippet" : "I don't have a picture unfortunately because he's new, but it's a mutt mixed with yellow lab, german shepherd, rottweiler, and husky. It just looks like a smaller and bit furrier yellow lab, and his name is Marley. Any information on a sighting would be appreciated, THANK YOU! \n\nedit: i have a link to a picture of him on facebook: https://www.facebook.com/photo.php?fbid=102341316618243&amp;set=a.102333749952333.4943.100005271246756&amp;type=1&amp;theater  Saw him on Springfield between ~~Sixth~~ Fourth and Fifth.  Almost behind the JSM office.  He was running back and forth in that parking lot on springfield there\n\nUPDATE:\n\nI just searched the square from second and white to fifth and green and did not see any signs of him.  Based on the way he was running from fence to fence in the parking lot (between fourth and fifth on Springfield) at approximately 9:00 PM, I would guess he left the parking lot going north or west.  I'm sorry I can't be of more help, but I hope this gives you something to go on. Sorry I didn't stop him BTW...with no collar I didn't know where to take him (my apartment doesn't allow pets) and I wasn't sure if he had his shots to where I should be holding on to him for an extended period of time        What area was he last seen? Is he wearing collar/tags? he was last seen at 5th and green, but unfortunately he slipped out of his collar. When did this happen? earlier today, not sure the exact time.  Has he been found?     Any new news? I'm pulling for the pooch.  I hope you don't mind, I shared your picture of the dog on my Facebook.  I'm not in Champaign anymore, but I have friends who are.  I also included the phone number listed in the comments. I hope you don't mind, I shared your picture of the dog on my Facebook.  I'm not in Champaign anymore, but I have friends who are.  I also included the phone number listed in the comments.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18uqp6/my_buddys_dog_ran_away/"
  }, {
    "id" : 12,
    "title" : "Hey guys, help me fundraise for the Polar Plunge on March 2nd! All funding goes towards the Special Olympics - Illinois! ",
    "snippet" : " ",
    "url" : "https://www.firstgiving.com/fundraiser/sean-sullivan-6/2013-polar-plunge-decatur"
  }, {
    "id" : 13,
    "title" : "UIUC Professor's study makes popular website io9.",
    "snippet" : " ",
    "url" : "http://io9.com/5985199/how-one-mans-lies-almost-destroyed-the-comics-industry?utm_campaign=socialflow_io9_twitter&amp;utm_source=io9_twitter&amp;utm_medium=socialflow"
  }, {
    "id" : 14,
    "title" : "Hello Music Enthusiasts! Looking to Hear Local Talent? Come Out to Allen Hall, March 8th!",
    "snippet" : "Music for the Masses-a musical RSO- is hosting a show at Allen Hall, showing off the likes of local talent! We hosted an event there a few weeks back and had tons of fun! Here are some photos to prove how awesome it was.\n\nhttp://www.facebook.com/media/set/?set=a.599217350094681.148539.519985618017855&amp;type=3  Is this a new name for Coffee House? It looks like coffee house with slightly less poetry. Is this a new name for Coffee House? It looks like coffee house with slightly less poetry.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18vbet/hello_music_enthusiasts_looking_to_hear_local/"
  }, {
    "id" : 15,
    "title" : "On Saturday at 6PM, the finals of the UIUC League of Legends Championships will take place in Gregory Hall 100! yay esports!",
    "snippet" : "    Congrats to the people who made it. :) Thanks.  smoke weed You better give me some boy. u should use commas  Nothing brings me greater joy than watching a terrible game Nothing brings me greater joy than watching a terrible game Then step up and improve it.",
    "url" : "http://www.facebook.com/events/473422892706243"
  }, {
    "id" : 16,
    "title" : "Found this in the laundromat on green and fifth",
    "snippet" : "  Yeah, I don't want to shit on anyone's religion, but I will admit that when I see these I take all of them so that I can throw them away. Same goes for Watchtowers. Really any religious pamphlets. Scientology isn't even a religion as far as I'm concerned  I'm not sure what else you would call it at this point. A cult? Some would say that the difference between a cult and a religion is that a religion is a cult with a dead leader. But that saying itself presumes an awful lot about how we may or may not define both of those terms.\n\nA pyramid scheme? A scam? An international, transgenerational con? I couldn't possibly comment. Yeah, I don't want to shit on anyone's religion, but I will admit that when I see these I take all of them so that I can throw them away. Same goes for Watchtowers. Really any religious pamphlets. Yeah, I don't want to shit on anyone's religion, but I will admit that when I see these I take all of them so that I can throw them away. Same goes for Watchtowers. Really any religious pamphlets.  At least the Gideons give away FREE Bibles...  There is a church of Scientology near john and I think its state. It just looks like a house with a sign attached to it and I silently laugh to myself everytime I see it.  I live half a block away from them.  It's fun to take their tests.\n\n\"Have you ever been sad?\"\n\nYes.\n\nYOU NEED AUDITING. There is a church of Scientology near john and I think its state. It just looks like a house with a sign attached to it and I silently laugh to myself everytime I see it.  There is a church of Scientology near john and I think its state. It just looks like a house with a sign attached to it and I silently laugh to myself everytime I see it.   Actually green and fourth, I don't know streets so well No you were right - its Green &amp; 5th   ",
    "url" : "http://imgur.com/fx9XROn"
  }, {
    "id" : 17,
    "title" : "I don't drink, will six pack suck for me?",
    "snippet" : "How about Allen? I don't smoke either, though.  You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live. You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live. You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live. When I went we did have a choice...\n\nWe got to rank our top 3, and my group of friends and I, about 10 of us, all listed Weston and all ended up in Weston. This was in 05 though so things may have changed.\n\nI can attest to the six-pack being very multicultural with a lot of different types of people and a very fun place to live. Probably a lot nicer now that they have air conditioning. They allow you to rank preference by complex/cluster (so instead of Weston, you would have to list Ikenberry North).  That said, there's still no guarantee that you'll get put into your preference (I lived in PAR last year and that wasn't my preference).  Everything turned out okay, though.\n\nIf you renew your contract for the next year, though, you get to select any room in any building on a first-come first-serve basis. You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live.  You will drink. Haha yeah, give them a semester and they will. Everyone \"doesnt drink\" when they first arrive and then realize it isnt going to get them sent to hell. 4th semester in, still don't drink.  Although I know I am a very rare breed here...  4th semester was when i started haha. It's not a bad thing but it's not something that you need to do daily, it's fun once a week Yeah for some I get that, I really just have no desire to though.   Everyone's different, usually when I go out I get a heavy dark beer and enjoy that all night, usually just one or two. Not a huge shot person You will drink.   If you got Taft Hall, submit a transfer request asap.     My brother lived in Allen and loved it, apparently lots of theater people and musicians and it's a pretty tight-knit community. I lived in the six pack and enjoyed it just because you meet so many people, though may not be as good of friends with them as you would in Allen just because there are so many dorms and all eat at one dining hall. I'd say if you're into constant run-ins with new people and making lots of acquaintances then six pack should be fun even though you don't drink. Also location of classes might be a big factor in where you live. They're both pretty far from everything though. Allen hall is great because of it's people, and the events/lectures that take place within it. So are the classes and music rooms that they have too. Also, ground south is for lovers. Allen hall is great because of it's people, and the events/lectures that take place within it. So are the classes and music rooms that they have too. Also, ground south is for lovers. Ground South is the bastion of hope in a dorm filled with dirty hipsters and girls that are no fun. My brother lived in Allen and loved it, apparently lots of theater people and musicians and it's a pretty tight-knit community. I lived in the six pack and enjoyed it just because you meet so many people, though may not be as good of friends with them as you would in Allen just because there are so many dorms and all eat at one dining hall. I'd say if you're into constant run-ins with new people and making lots of acquaintances then six pack should be fun even though you don't drink. Also location of classes might be a big factor in where you live. They're both pretty far from everything though. My brother lived in Allen and loved it, apparently lots of theater people and musicians and it's a pretty tight-knit community. I lived in the six pack and enjoyed it just because you meet so many people, though may not be as good of friends with them as you would in Allen just because there are so many dorms and all eat at one dining hall. I'd say if you're into constant run-ins with new people and making lots of acquaintances then six pack should be fun even though you don't drink. Also location of classes might be a big factor in where you live. They're both pretty far from everything though.  They're just stereotypes for the two dorm locations... Just because you don't match the stereotype doesn't mean you won't have a good time.\n\nIt's not like everyone is going out 5-6 nights a week in the six pack, lol  whether you drink or not 6 pack is a great way to meet people and socialize. you'll still have lots of hilarious stories to tell people when you're done there  It's okaay to have a little bit of the sweet berry wine from time to time.  Just live in the six-prack.\nFor your dorms I appreciate the effort and love the show, but as a heads up novelty accounts don't work well on smaller subreddits It's okaay to have a little bit of the sweet berry wine from time to time.  Just live in the six-prack.\nFor your dorms     ISR is fine\n If a little smelly. Smelly? What?     LIVE IN ALLEN. No matter what, it's far superior to any other dorm.  It's this awesome community.   Being a sophomore here who doesn't drink, any building you will be in will have people drinking.  I lived in private housing and got lucky that my roommates really didn't drink in the room often, but regardless of where you are, the booze will follow.   Yeah I'm fine being around alcohol, it's not like I'm afraid of it or anything. It's just that I want to be able to have a good time without it, and I'm wondering if that's possible at six pack.     I haven't lived in either of those places, but my general experience is that people don't care whether you drink/smoke or not, and are certainly not going to shun you if you don't. Just have a good attitude and don't judge others for doing so, and after some time it will cease to be as big a deal as you are imagining it to be.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18utfq/i_dont_drink_will_six_pack_suck_for_me/"
  }, {
    "id" : 18,
    "title" : "Has anyone here taken or know someone who's taken SLAV 117? (Russian &amp; Eastern European Science Fiction)",
    "snippet" : "Hi! I don't plan on taking the class but I'm interested in what the required readings are. Does anyone happen to have a list?   When i took it Spring 2012 the required readings were: \"We\" \"R.U.R\" \"Saloris\" and \"The Star diaries\"\n\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/18v0j2/has_anyone_here_taken_or_know_someone_whos_taken/"
  }, {
    "id" : 19,
    "title" : "Student Athletes: The kings and queens of campus",
    "snippet" : "  What a surprise, the DI is still garbage.\n\nI don't really get why the author doesn't understand that athletes put in effort for what they get.  I hope her next article is going to be about why every scholarship/award/career fair giveaway she isn't receiving is hugely unfair. \"Why can't **I** have what **those** people have worked for?!\" What a surprise, the DI is still garbage.\n\nI don't really get why the author doesn't understand that athletes put in effort for what they get.  I hope her next article is going to be about why every scholarship/award/career fair giveaway she isn't receiving is hugely unfair. What a surprise, the DI is still garbage.\n\nI don't really get why the author doesn't understand that athletes put in effort for what they get.  I hope her next article is going to be about why every scholarship/award/career fair giveaway she isn't receiving is hugely unfair.   A lot of people are taking it to this writer in the comments, but I'd just like to note that while student-athletes devote a done of energy to the athletic parts of their life, there are many students who devote the same amount of energy to working (to help defray costs) and to internships on top of their schoolwork load. The real disconnect here, in my opinion, is that the 'money' sports of basketball and football have a whole set of advantages of available to those who participate in them that, say, tennis doesn't (unless you're a phenom who is able to go pro). It's the basketball and football folks who are the most well known and most likely to receive different treatment, wittingly or unwittingly, from people eager to see the big programs succeed.\n\n\nLastly, I'll note that someone in the comments on the DI article mentioned that the DIA is self-sustaining, but I would urge anyone who hasn't in the past to read up on athletic departments at major and non-major universities and colleges around the country. A couple of bad football/basketball seasons and then those same athletic departments are deep in the red feeding on the teat of the school. Just to think about it in a UIUC context for a moment, we may be asked in the upcoming student elections to add a fee for helping renovate Assembly Hall. Shouldn't the DIA have a better capital plan then relying on students for [nearly a fifth](http://www.news-gazette.com/news/university-illinois/2013-02-09/group-seeks-student-vote-fee-160-million-assembly-hall-renovatio) of costs? It's not like we get to go to games for free. Couple thoughts.  First of all, I agree with you, lots of students work their asses of with extracurricular activities.  And I think the football palum who said something along the lines of 'try walking a day in our shoes' gives current and former U of I athletes a bad name.  I'm fully aware that loads of people would have gladly worked their asses off to compete for U of I.  \n\nThe difference that I think is pretty important to note in regards to working/extracurricular vs sports is the time myself and many other athletes missed in the classroom.  I regularly had to miss classes/exams for competitions, hence the reason the DIA provides us with tutors.  With that said, I also regularly attended office hours too.  As a track athlete, I knew getting a degree was more important to my future than sports. \n\nAs far as Illini Athletics, the quick source I pulled from '09 said:\n\n&gt; Financially, Illinois operated in the black for the 17th straight year with a $70 million budget. \n\nwhich seems to show it's not quite as shaky as you're implying, those years including some garbage on the football and bball court\n\n[source](http://www.fightingillini.com/genrel/AnnualReport.html)  I didn't mean to imply that Illinois particularly is in bad shape, but just wanted to illustrate that a general trend in college athletics is very thin margins that disappear very fast for a lot of places. As for your link, it says Illinois was in the black for the 17th straight year at the end of 08-09, but that doesn't mesh with the N-G article I linked to which said that in 1997, the DIA was $1.3 million dollars in the red. One possibility is that under normal operations the DIA was scheduled or budgeted to run $1.3mln in the red in 97, but that passing the student fee then helped alleviate that.\n\nAlso, I wanted to mention that oftentimes non-athletes, like myself, overlook that athletes don't get to set their schedules the way a regular working student would so thanks for bringing that up. It's a lot easier to get a work/internship schedule around class and impossible to say, \"schedule this Big Ten conference matchup on another day please\" since athletes have no control over that. A lot of people are taking it to this writer in the comments, but I'd just like to note that while student-athletes devote a done of energy to the athletic parts of their life, there are many students who devote the same amount of energy to working (to help defray costs) and to internships on top of their schoolwork load. The real disconnect here, in my opinion, is that the 'money' sports of basketball and football have a whole set of advantages of available to those who participate in them that, say, tennis doesn't (unless you're a phenom who is able to go pro). It's the basketball and football folks who are the most well known and most likely to receive different treatment, wittingly or unwittingly, from people eager to see the big programs succeed.\n\n\nLastly, I'll note that someone in the comments on the DI article mentioned that the DIA is self-sustaining, but I would urge anyone who hasn't in the past to read up on athletic departments at major and non-major universities and colleges around the country. A couple of bad football/basketball seasons and then those same athletic departments are deep in the red feeding on the teat of the school. Just to think about it in a UIUC context for a moment, we may be asked in the upcoming student elections to add a fee for helping renovate Assembly Hall. Shouldn't the DIA have a better capital plan then relying on students for [nearly a fifth](http://www.news-gazette.com/news/university-illinois/2013-02-09/group-seeks-student-vote-fee-160-million-assembly-hall-renovatio) of costs? It's not like we get to go to games for free. Agreed.  I used to work for DIA.   While we are currently self sustaining, we spend money on the stupidest shit.  I would be specific but I'm sure my old boss or coworkers are on here and I don't want to be identified.  A lot of people are taking it to this writer in the comments, but I'd just like to note that while student-athletes devote a done of energy to the athletic parts of their life, there are many students who devote the same amount of energy to working (to help defray costs) and to internships on top of their schoolwork load. The real disconnect here, in my opinion, is that the 'money' sports of basketball and football have a whole set of advantages of available to those who participate in them that, say, tennis doesn't (unless you're a phenom who is able to go pro). It's the basketball and football folks who are the most well known and most likely to receive different treatment, wittingly or unwittingly, from people eager to see the big programs succeed.\n\n\nLastly, I'll note that someone in the comments on the DI article mentioned that the DIA is self-sustaining, but I would urge anyone who hasn't in the past to read up on athletic departments at major and non-major universities and colleges around the country. A couple of bad football/basketball seasons and then those same athletic departments are deep in the red feeding on the teat of the school. Just to think about it in a UIUC context for a moment, we may be asked in the upcoming student elections to add a fee for helping renovate Assembly Hall. Shouldn't the DIA have a better capital plan then relying on students for [nearly a fifth](http://www.news-gazette.com/news/university-illinois/2013-02-09/group-seeks-student-vote-fee-160-million-assembly-hall-renovatio) of costs? It's not like we get to go to games for free. Assembly hall is for far more than just the athletics.  One of the proposed features is air conditioning to host summer concerts and events.  Why should DIA have to pay for that?  ibooks are free...  ibooks are free...  ibooks are free...   There are so many things wrong with this article I do not even know where to start.  I mean I know this school isn't known for its liberal arts, but you would think a senior majoring in Journalism would know how to write a half-decent editorial. There are so many things wrong with this article I do not even know where to start.  I mean I know this school isn't known for its liberal arts, but you would think a senior majoring in Journalism would know how to write a half-decent editorial.   Pretty impressive how ignorant and self serving this article is\n\nEdit: Also impressive how out of control reaction is getting That's why I posted it... I'm friends with some people in athletics who freaked the fuck out.   Honestly, I think this all could mostly be resolved if the players were allowed to get paid like every other profession. College sports are really messed up in this way. Colleges provide special treatment to their athletes to attract and sustain good athletes because good athletes are cash cows to the universities.\n\nLet the athletes get paid, and people like this writer will see the economic worth of certain athletes. Also, then the athletes don't need to be afforded special treatment.  First students who've studied abroad and now student-athletes. Any guesses on which demographic of students will be the next target of scorn by a DI \"opinions\" columnist?  Engineering: why do they get their own computer labs and free printing? Why is their library so big and why are there so many engineering buildings?  First students who've studied abroad and now student-athletes. Any guesses on which demographic of students will be the next target of scorn by a DI \"opinions\" columnist?    The author doesn't seem to realize that the school needs these incentives to attract good athletes to the school, so the sports programs can continue to generate revenue for the school. You've been lied to my friend. You've bought into the mythos that College Athletics (a) make a profit, and (b) that profit (if it exists) is returned to the academic portion of the university. There are relatively few (think 4 or 5) universities in the nation where both (a) &amp; (b) occur. U of I is not one of those schools. \n\nWe, students/taxpayers/property owners, subsidize the costs of student athletes and collegiate athletics. It comes out of our tuition and taxes (sales/income/property). Any source for these claims?  http://usatoday30.usatoday.com/sports/college/story/2012-05-14/ncaa-college-athletics-finances-database/54955804/1\n\nIf you consider the subsidy, it's pretty much even. Thanks for the source, but those number still show that the athletic department made a profit. \n\n[This one states that as of '09:](http://www.fightingillini.com/genrel/AnnualReport.html)\n\n&gt; Financially, Illinois operated in the black for the 17th straight year with a $70 million budget.  Not sure what your point is.. Not yourself, but ewat85 claimed that the athletic department operates at a deficit, which is the reason I requested a source.  Your source says ewat85 is wrong.  I cannot show you a source because that is the problem with College Athletics; there is a MASSIVE reporting problem. The fact that I cannot show you a source has been the product of law review articles for decades. Because college Athletic Departments, and college athletics themselves, fall under the exempt function of each university there are very few requirements placed upon their financial accounting and reporting practices. As such, there is relatively little oversight into the expenses and revenue that the universities claim to be making and spending. The line between athletic and academic expenses is a blurry one and is being abused by most, if not all, universities in this country.\n\n\nFirst let me address your statement and your source. What does the statement \"Illinois operated in the black for the 17th straight year with a $70 million budget\" lead you to believe? It leads you to believe that U of I athletics netted a 70 million dollar profit. It is written to give you the impression that they made a ton of money. Now, look through the PDF provided with that statement. Where, under the finances section, does it say that U of I took in more revenue then it spent? Nowhere. Why is that? Because it's a BS statement. \n\nHow can we be sure that it is bullshit? Because under the finance section the total revenue and total expenses are exactly equal, down to the dollar. Go talk to a CPA, a business owner, an auditor, a tax attorney, anyone with oversight over a budget. Ask them how often total expenditures match total expenses. Now ask them how often it happens two years in a row. The answer will be NEVER. It never happens, and it ABSOLUTELY NEVER happens when your budget is $70+ million. So how is it possible for it to happen here? I mean surely U of I can't just lie about these numbers.\n\nIn fact, they can. The University of Illinois at Urbana-Champaign is a 501(c)(3) organization. It is tax exempt as both a government entity and as an education institution. The university files a form 990 every year in which they tell the IRS how much they make, how much their assets are worth, etc. etc. etc., what they don't tell them, and what they need not tell them, is how much money comes from each of their activities. It isn't required. Athletics is considered a tax exempt function and therefore is not broken down on the Form 990. The only information one receives is a single line under \"Miscellaneous Income\" that says \"Athletics Receipts.\" What does that mean? What is and is not included in \"Athletics Receipts.\" I can't find U of I's 2008 or 2009 return but in 2011-2012 U of I claimed ~ $3.5 million in athletics receipts. Lets just assume that U of I retained its perfect harmony on revenue and expenses for last year (which it will). What then is this $3.5 million in receipts? If expenses = revenue, what makes up this 3.5 million dollars? Why will this amount likely not be its own line on the DIA annual report? \n\nYour looking at this and saying \"So, what does any of this prove?\" \n\nSo... this shows you how little oversight there is. Athletics Receipts means something to the IRS but isn't a notation on the DIA expenses form. Expenses reported to the NCAA are different from expenses reported to the Department of Education, and different from expenses reported through the DIA. \n\nThere is no standardized accounting principle being employed by all the universities in the nation right now. There is no harmony between the numbers reported by the same institution to various organizations collecting data. What does this show? It shows that we have no idea what is being spent and where that money is coming from. Furthermore, there is little to no transparency within the Athletic Directors office. If U of I was doing such a great job of \"breaking even\" or \"turning a profit\" every year, one would think that they would be more than happy to release their books to the public. They don't and they won't. AD's are playing a shell game and they'll continue to do so until there is standardization, OR, until we once and for all treat college athletics like the money making enterprise it is and tax it. Until that time creative accounting will be used to hide the true costs of athletics from the people who are paying the price.\n\n\nSo, that wasn't very substantive, I know. However we can move on to a more concrete portion of my claim. If we take the USA Today table as true (which I would dispute) then you see that U of I averages ~$4 million in subsidies every year, or, $20 million from 2006 to 2011. That is money that comes from students and taxpayers. So ... that proves I'm correct at least to the extent that I claim that we, collectively, are subsidizing the Athletic Department. \n\n\nNow, I have a question for you. If U of I's athletic program gives back so much to the university, then, there should be some record of it somewhere. Why is it so hard to find that record?   I dont know, but you have my upvote - this was an incredibly well written explanation that deserves more upvotes than the athletics apologists in this thread. I cannot show you a source because that is the problem with College Athletics; there is a MASSIVE reporting problem. The fact that I cannot show you a source has been the product of law review articles for decades. Because college Athletic Departments, and college athletics themselves, fall under the exempt function of each university there are very few requirements placed upon their financial accounting and reporting practices. As such, there is relatively little oversight into the expenses and revenue that the universities claim to be making and spending. The line between athletic and academic expenses is a blurry one and is being abused by most, if not all, universities in this country.\n\n\nFirst let me address your statement and your source. What does the statement \"Illinois operated in the black for the 17th straight year with a $70 million budget\" lead you to believe? It leads you to believe that U of I athletics netted a 70 million dollar profit. It is written to give you the impression that they made a ton of money. Now, look through the PDF provided with that statement. Where, under the finances section, does it say that U of I took in more revenue then it spent? Nowhere. Why is that? Because it's a BS statement. \n\nHow can we be sure that it is bullshit? Because under the finance section the total revenue and total expenses are exactly equal, down to the dollar. Go talk to a CPA, a business owner, an auditor, a tax attorney, anyone with oversight over a budget. Ask them how often total expenditures match total expenses. Now ask them how often it happens two years in a row. The answer will be NEVER. It never happens, and it ABSOLUTELY NEVER happens when your budget is $70+ million. So how is it possible for it to happen here? I mean surely U of I can't just lie about these numbers.\n\nIn fact, they can. The University of Illinois at Urbana-Champaign is a 501(c)(3) organization. It is tax exempt as both a government entity and as an education institution. The university files a form 990 every year in which they tell the IRS how much they make, how much their assets are worth, etc. etc. etc., what they don't tell them, and what they need not tell them, is how much money comes from each of their activities. It isn't required. Athletics is considered a tax exempt function and therefore is not broken down on the Form 990. The only information one receives is a single line under \"Miscellaneous Income\" that says \"Athletics Receipts.\" What does that mean? What is and is not included in \"Athletics Receipts.\" I can't find U of I's 2008 or 2009 return but in 2011-2012 U of I claimed ~ $3.5 million in athletics receipts. Lets just assume that U of I retained its perfect harmony on revenue and expenses for last year (which it will). What then is this $3.5 million in receipts? If expenses = revenue, what makes up this 3.5 million dollars? Why will this amount likely not be its own line on the DIA annual report? \n\nYour looking at this and saying \"So, what does any of this prove?\" \n\nSo... this shows you how little oversight there is. Athletics Receipts means something to the IRS but isn't a notation on the DIA expenses form. Expenses reported to the NCAA are different from expenses reported to the Department of Education, and different from expenses reported through the DIA. \n\nThere is no standardized accounting principle being employed by all the universities in the nation right now. There is no harmony between the numbers reported by the same institution to various organizations collecting data. What does this show? It shows that we have no idea what is being spent and where that money is coming from. Furthermore, there is little to no transparency within the Athletic Directors office. If U of I was doing such a great job of \"breaking even\" or \"turning a profit\" every year, one would think that they would be more than happy to release their books to the public. They don't and they won't. AD's are playing a shell game and they'll continue to do so until there is standardization, OR, until we once and for all treat college athletics like the money making enterprise it is and tax it. Until that time creative accounting will be used to hide the true costs of athletics from the people who are paying the price.\n\n\nSo, that wasn't very substantive, I know. However we can move on to a more concrete portion of my claim. If we take the USA Today table as true (which I would dispute) then you see that U of I averages ~$4 million in subsidies every year, or, $20 million from 2006 to 2011. That is money that comes from students and taxpayers. So ... that proves I'm correct at least to the extent that I claim that we, collectively, are subsidizing the Athletic Department. \n\n\nNow, I have a question for you. If U of I's athletic program gives back so much to the university, then, there should be some record of it somewhere. Why is it so hard to find that record?   You're mostly just rambling here. This statement alone is enough nonsense to discredit everything else you said:\n\n&gt; First let me address your statement and your source. What does the statement \"Illinois operated in the black for the 17th straight year with a $70 million budget\" lead you to believe? It leads you to believe that U of I athletics netted a 70 million dollar profit. \n\nThat's not at all what that statement claims.  That's not what 'budget' means.  Even still, you've already lost all credibility by saying the athletic department operates at a deficit when sources prove otherwise. \n\nThe DIA pays for nearly everything with it's own revenue and donations from former athletes, such as myself, and not from your tax dollars or tuition costs.  Even without the subsidy, the athletic department made a profit. \n\nWith that said, these claims are far from the arguments brought up in the initial article.  You've been lied to my friend. You've bought into the mythos that College Athletics (a) make a profit, and (b) that profit (if it exists) is returned to the academic portion of the university. There are relatively few (think 4 or 5) universities in the nation where both (a) &amp; (b) occur. U of I is not one of those schools. \n\nWe, students/taxpayers/property owners, subsidize the costs of student athletes and collegiate athletics. It comes out of our tuition and taxes (sales/income/property). I wasn't aware that was the case here; however, the athletics benefit the school in other ways you may not have thought of.  For instance, it gives the school national attention, and sells lisenced merhandise.  Both of these things attract students who in turn pay those fees and taxes.  Just having your schools name out there increases applications. Out of state students also pay way higher tuition.  I do agree with your main point that the benefit of sports programs is overhyped.\n\nTyped on my phone in case there's grammar nazis.  Is Irwin open to all students? I saw a comment on the article saying that it was....but I didn't think so. I have heard of group projects happening there and student athletes inviting everyone to work at Irwin, but that's about it. It is open to all RSOs you must reserve a time spot which is pretty competitive but still open to people who are not NCAA athletes       Another gem from the DI.... ",
    "url" : "http://www.dailyillini.com/opinion/columns/article_826b725e-7a47-11e2-a1c6-001a4bcf6878.html"
  }, {
    "id" : 20,
    "title" : "Snobbery in the sub",
    "snippet" : "Hello /r/uiuc, I'm a big time lurker and I hate to break my trend of not-posting, but over the course of the past couple months I've noticed a worsening pattern of snobbery in this sub. There is an air of superiority among all the members here. I've never seen subscribers of the same sub, let alone student of the same school, tear each other apart like this.\n\nSo essentially, this is just me reminding everyone to notch it down a little bit.  There is no reason to get all aggressive and confrontational, nor is their reason to be condescending (that's a big one) or judgmental. We're supposed to be the best college sub, but if I were an objective observer and I just wandered into a random comment section, I wouldn't think so at all. Circlejerk central or dogs devouring dissenters left and right. So keep it classy, /r/uiuc, and let's remind everyone why we're the best sub around.     What the fuck did you just fucking say about me, you little bitch? Ill have you know I'm at the top of my class, and Ive been involved in numerous leadership roles in my school, and I have over 300 college recommendations. I am trained in writing essays and Im the top essayist in the entire US. You are nothing to me but just another anti-Intellectual. I will wipe your chances of ever being on the top of your class mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my professors and my network of college deans across the US and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your education. Youre fucking uneducated, kid. I can be anywhere, anytime, and I can ruin your chances of getting into UIUC in over seven hundred ways, and thats just with my bare hands. Not only am I extensively trained in memorizing SAT words, but I have access to the entire application process of the University and I will use it to its full extent to wipe your little miserable education off the face of the continent, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you could have held your fucking tongue. But you couldnt, you didnt, and now youre paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. Youre fucking uneducated, kiddo. haha exactly, only subtle and said through tone and downvotes. Although there are some blatant assholes, most people aren't as explicit as that. woosh OP realized it was a joke... Yeah, thank you. Good god some people make me question how they got  in here. Yeah, thank you. Good god some people make me question how they got  in here. What the fuck did you just fucking say about me, you little bitch? Ill have you know I'm at the top of my class, and Ive been involved in numerous leadership roles in my school, and I have over 300 college recommendations. I am trained in writing essays and Im the top essayist in the entire US. You are nothing to me but just another anti-Intellectual. I will wipe your chances of ever being on the top of your class mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my professors and my network of college deans across the US and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your education. Youre fucking uneducated, kid. I can be anywhere, anytime, and I can ruin your chances of getting into UIUC in over seven hundred ways, and thats just with my bare hands. Not only am I extensively trained in memorizing SAT words, but I have access to the entire application process of the University and I will use it to its full extent to wipe your little miserable education off the face of the continent, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you could have held your fucking tongue. But you couldnt, you didnt, and now youre paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. Youre fucking uneducated, kiddo.  I honestly don't know what you're talking about. The only topic where I find /r/uiuc to be very biased is Greek Life. But besides that, I feel it is a superb sub.\n\nOh and btw, awesome username.  There's some racism too. But overall it's largely civil, considering how people are prone to saying offensive things when they think they are anonymous. There's some racism too. But overall it's largely civil, considering how people are prone to saying offensive things when they think they are anonymous. There's some racism too. But overall it's largely civil, considering how people are prone to saying offensive things when they think they are anonymous. And engineering elitism, but let's be honest, it's warranted. Why do you think it's warranted?  And engineering elitism, but let's be honest, it's warranted. Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  I disagree. I'm basically being snobbish about spending $170,000 to get a piece of paper that improved my income potential by about 10%.  gnah, sorry, didn't mean to have it point at anyone in specific like that but that did eerily describe your flair haha. I edited it out.\n\nAnd, I understand that people work for their degrees, but I don't like when they expect credit for it on the internet. You don't have to edit it out. I only take offense to people who are trying to be assholes or know it alls (because in my mind, there's only room for one know it all in a conversation - me). Plus, I really only have energy for one feud at a time, and my energy's used up on /u/iam0594 haha alright well edited back in. \n\nYeah you and that guy get too heated and it's great to watch. Yeah it's amusing, I am trying to not read that thread for fear of laughing out loud and startling my officemate. haha alright well edited back in. \n\nYeah you and that guy get too heated and it's great to watch. haha alright well edited back in. \n\nYeah you and that guy get too heated and it's great to watch. You don't have to edit it out. I only take offense to people who are trying to be assholes or know it alls (because in my mind, there's only room for one know it all in a conversation - me). Plus, I really only have energy for one feud at a time, and my energy's used up on /u/iam0594 Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  Flair is helpful for context and sometimes pretty funny. \n\nI don't look at someone with \"English Major\" next to their username and think \"wow what a dumb fucker looks like someone's gonna be a barista someday\" the same way I don't see \"CS\" or \"CompE\" and think, \"great, another big dick smart motherfucker like me.\"\n\nYou're being overly sensitive. Most of the stupidity on this sub gets downvoted enough where you don't have to see it. Actually though, no, most of what gets downvoted is the dissenting opinion that the mass crowds disagree with. Rogue downvoting is one of the issues. Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  My flair describes my major Perhaps this is going over my head, but what major does the ampersand describe? Linguistics? Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  I honestly don't know what you're talking about. The only topic where I find /r/uiuc to be very biased is Greek Life. But besides that, I feel it is a superb sub.\n\nOh and btw, awesome username.   Isnt it snobberish to tell people how to behave on a college subreddit?  I've only been around about a month, but I think the grand majority of everyone here is pretty nice. I don't let the occasional asshole bother me -- I've seen much ruder things said in other subs.   My brain suffering from chronic lack of caffeine told me the title read \"snot in the sub\" and I came in looking to find out whether it was Jimmy Johns, Silver mine, subway, or the penn station. I'm relieved to learn that it was just me being stupid.  I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous. I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous. I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous. I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous.    Apparently everyone is disagreeing with you, but I think you're right.  It's hardly a circlejerk here. I say this as someone who is far from the core demographic: female and a Social Work major. I have never felt unwelcome in this subreddit due to snobbery or other reasons. Most of the snobbery you perceive is probably intended as humor. The only troublesome aspect of this subreddit is occasional racism, since even if something is meant as a joke, it can still be hurtful and unwelcoming. Also, I wish /r/uiuc had more members who are in non-STEM related majors, but this is reddit. Undergrad in TESLand Linguistics. Gogo minority majors! Yay. There's even less people in your major than in mine! It's hardly a circlejerk here. I say this as someone who is far from the core demographic: female and a Social Work major. I have never felt unwelcome in this subreddit due to snobbery or other reasons. Most of the snobbery you perceive is probably intended as humor. The only troublesome aspect of this subreddit is occasional racism, since even if something is meant as a joke, it can still be hurtful and unwelcoming. Also, I wish /r/uiuc had more members who are in non-STEM related majors, but this is reddit. Also, sexism is almost nonexistent, other than the stray comment now and then complaining about women in engineering getting fellowships.\n Women in engineering should not get fellowships. They should get babeships. &gt; Women in engineering should not get fellowships. They should get babeships.\n\nSuburban Express guy /u/lubosubo, why don't you limit yourself to comments disparaging LEX? Engineering is slightly harder than bashing a rival bus company and being nasty to passengers, so you might want to back off.  Examples plox? Calling the subreddit \"circlejerk central or dogs devouring dissenters left and right\" is a pretty hefty claim. Sorry, that's just me novelizing what I see, not nearly as bad as that phrase makes it. But I'm not going to single out a poster and put the blame on them. Again, it's more just mentality that slightly leaks through tone than blatant posts.  Give us examples you passive aggressive LAS pussy. /s\n\nedit: but seriously. give us some examples. wtf is LAS.   The core concept of a circlejerk and dogs devouring each other are two entirely different things...do you even know what a circlejerk is?  That's why I listed both of them. If they were the same I would just type one or the other. Fine, so I interpreted your use of \"or\"  in a way you didn't use it. Would you care to link us all to specific examples so we actually know what you are talking about?  The core concept of a circlejerk and dogs devouring each other are two entirely different things...do you even know what a circlejerk is?  http://www.reddit.com/r/uiuccirclejerk/ ohohoh   I have no clue what you're talking about.  Pretty much everyone in this sub is courteous.  Post some specific examples, or else I'll just assume you just posted this for attention. Actually, I guess the fact that I'm being accused of posting for attention immediately is proof in itself... Well when you make accusations you should have evidence.  I have no clue what you're talking about.  Pretty much everyone in this sub is courteous.  Post some specific examples, or else I'll just assume you just posted this for attention. I'd rather not post specific examples, and why would I post this for attention? This is my first post, ever. But the \"unsafe\" thread from the other day was particularly ridiculous.  You may be a little oversensitive.  I saw that post as \"Most of campus is pretty safe\", \"Unlit areas scare me\", and \"don't carry around a bunch of money\".  Not sure how that's \"snobbery\".   I doubt he is talking about that thread - the posts on that thread constitute the kind of stuff that would end up on subredditdrama. There have been posts like [this](http://www.reddit.com/r/UIUC/comments/18rkpz/why_does_it_smell_like_manure_near_isr/c8hj8pr?context=3) and [this](http://www.reddit.com/r/UIUC/comments/18h3kg/uiuc_sees_decline_in_asian_applicants_primarily/c8gr8rx?context=3), on the other hand, that are rather malicious. This is reddit.  Though those examples are bad, they are still not nearly as bad as reddit overall.  I'd say as far as reddit goes, this sub is pretty congenial.  The op didn't mention racism, or bigotry either.  For op's first post to be insulting the general user base is pretty offensive.  I'd say the vast majority of posters on this sub are pretty friendly.     You may be a little oversensitive.  I saw that post as \"Most of campus is pretty safe\", \"Unlit areas scare me\", and \"don't carry around a bunch of money\".  Not sure how that's \"snobbery\".  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18tx3a/snobbery_in_the_sub/"
  }, {
    "id" : 21,
    "title" : "What is the cause of that smell in the roger adams lab?",
    "snippet" : "  Probably has something to do with all the chemicals and shit\n  I wonder this every Tuesday and Thursday morning ASTRO 330 with bigdog? Ha yes    As long as it doesn't smell like almonds, you're probably fine. As long as it doesn't smell like almonds, you're probably fine.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18tj4j/what_is_the_cause_of_that_smell_in_the_roger/"
  }, {
    "id" : 22,
    "title" : "Tutor help for Math 234 and Chem 103",
    "snippet" : "I have my first hour exam tomorrow and I'm just going to spend all day in the Chemistry Learning Center, but for future reference, is there anyone who could possibly help me with these two subjects? Doesn't have to be the same person of course, but I am being swamped and stressed out by these two classes. If there's anyone who could help, please let me know as soon as possible. Much appreciated.\n\nEdit: I mean Chem 102  Chem 103 is a lab that doesn't have a midterm. I'm assuming that you mean Chem 102? Oh yeah XD Chem 102.  I got a B+ in it last semester, so I reckon I could help a bit with it. That would be fantastic! I mean I took 101 last semester and the sigma pi bonds and hybridization just went over my head  I'm in Chem 102 as well and I agree about hybridization being a bit confusing. He went over it too fast. :/\n\nHopefully you are able to get it by tomorrow evening. Good luck! :) That would be fantastic! I mean I took 101 last semester and the sigma pi bonds and hybridization just went over my head  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ut16/tutor_help_for_math_234_and_chem_103/"
  }, {
    "id" : 23,
    "title" : "Physics Majors",
    "snippet" : "So I'm looking to go into a physics major here at UIUC. I wanna ask all the physics undergrads and grads here: what's it like being a major in physics? and: What do graduate school look at when they evaluate your application? Do u feel worried that you won't find a job? Do you question your decision at times? What advice would you give to someone looking at a physics major and graduate school in physics in terms of research, specialization etc.?   I wasn't a student here, but I can answer some of your more general questions.\n\n&gt;What do graduate school look at when they evaluate your application? \n\nGrades, research experience, recommendation letters, subject GRE scores. An admissions person (at a *very* highly ranked school) told me once that they're looking for people who have at least three of those rated excellent or two outstanding.\n\n&gt;Do u feel worried that you won't find a job?\n\nNot really, but I'm not interested in a faculty position. The unemployment rate for physics PhDs is around 1%. If you're willing to sell your soul to the semiconductor or defense industries or go to the financial sector, you won't have any trouble. One of my friends who washed out of grad school (aka left with a masters) went and got a medical physics degree and is now quite happy doing medical imaging.\n\n&gt;Do you question your decision at times?\n\nI probably should have been an engineer or a chemist, but that's just me. I haven't closed any doors, but I certainly haven't been on the fastest path to get where I think I'm heading.\n\n&gt;What advice would you give to someone looking at a physics major and graduate school in physics in terms of research, specialization etc.?\n\nGet exposure to as many fields as you can. You never know what's going to actually strike a chord with you.  \n\nGet involved in research as soon as you can, but don't be afraid to change labs if it's a bad fit. That goes for grad school as well.  \n\nTake courses outside what's required. You never know when knowing how to write an efficient algorithm, speak a foreign language or quote classic literature is going to help you -- those are all real examples from my career so far!\n\nRelated to that: cross disciplinary work is the future for the sciences. Learn how to talk to chemists, biologists, etc. They're going to speak a very different language from you, especially in terms of mathematics. Who would you recommend a physics major too? As in, I am passionate about physics but am not sure if I have a very romanticized view of physics. What are some misconceptions that you might have had about a physics major that came up by surprise?     Senior in majoring in Engineering Physics atm. \n\nI came in with ap credit for Calc I and phys 211. I chose to take phys 211 to start where most other people did. The phys 211-214 courses weren't tough to me. I was in the first phys 225 course and enjoyed it because of the instructors that taught it at that time. I then took phys 325, and while it was tough, thoroughly enjoyed it because it was my first real physics course. Beyond this I have taken all of the regular physics curriculum (E&amp;M: 435/436, Quantum: 486/487, Stat Mech: 427, Labs: 401/403) and then some others (Thesis track: 496/499, Subatomic: 470), plus some upper astronomy courses. If you have questions on those feel free to ask. A lot of my time was working homework sets that could take anywhere from 1 to 10 hours depending on the course/professor. \n\nGraduate schools look at your GPA, GRE, PGRE (GRE physics subject test), research conducted, letters of recommendation, and personal statement. If you want to attend graduate school you should have some research done as an undergrad. This is not hard to obtain though. You can either go knocking on professors' doors or apply to external research programs such as REUs (Research Experience for Undergraduates). I did both, first by asking around the department when I was a sophomore to do research over that summer. Then by applying to REUs and getting to accepted to one at the Uni of Neb-Lincoln. I did physics and astronomy education research during these projects. Besides research you'll want some strong letters of recommendation which you can obtain from professor by doing research or being a really good student in their course (going to office hours, answering questions, etc.). Basically getting them to know your name and yourself. The other credentials come down to you studying and working hard in your courses and preparing for the standardized tests if you need too. \n\nI do not feel worried that I won't find a job because I'm choosing to stay in academia, a.k.a. going to graduate school. I was worried at first that I wouldn't get into a graduate school, so I applied to 11 schools. Some were \"safety\" schools, while others were hard to reach programs. I have gotten into several schools and will make my decision later this semester. I do not regret my decision to pursue graduate school because I am passionate about research and know this is what I want to do after talking to multiple professors about staying in academia. If you're interested in doing graduate school for physics keep this in mind, most programs will fund you if you are choosing to pursue a doctorate degree (which takes about 5-7 years). They will fund you through either a teaching assistant-ship, research assistant-ship, fellowship, or scholarship. For example, for the several places I've been accepted they are offering me a full tuition wavier and a stipend for being a teaching assistant during the school year. \n\nFor advice, I would say make sure physics is something you are passionate about. If you do not know what field you are interested in, start going to colloquiums here to get an idea of what each subfield is like. Also, you can get an idea about which field you like when you take the respective courses. For advice on finding research, just start asking professors through email, or knock on their door and ask them in person.  Don't give up and keep trying. \n\nUnfortunately I cannot give advice on being in graduate school, but I'm sure others can help with that. \n\nIf you have any specific questions about the undergraduate program here, feel free to ask.  Can you tell us what schools you applied to and where you got in. Really want to gauge myself to see where im headed for grad school. If you could give us info about the critical stuff (GPA, GRE, PGRE, LoRs, Research Experience) will be super helpful. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ty99/physics_majors/"
  }, {
    "id" : 24,
    "title" : "/r/UIUC, where do you feel unsafe around campus?",
    "snippet" : "I'm living around Springfield/Gregory next year, and I feel a little unsafe walking around at night.  So, tell me, is that a safe neighborhood?  Where don't you feel safe?  Where should the average person avoid at night while carrying lots of cash?  Anywhere South of Green. Us engineers fear the outside world. Anywhere South of Green. Us engineers fear the outside world. Everything north of Green, there is no liquor north of there for biz majors. :p  I wish they would fix some of these lights. There are points where it's just pitch black.  Parts of Urbana simply don't *have* street lights. Many of the neighborhood streets off of Washington, east of Vine, for instance. They cause light pollution or some such.\n\nSeemed to me to be just a greater liability to hit a pedestrian. To be fair, if you live east of Vine, you're probably not a student here. That is a long ways away. Farthest I've seen someone live without a parking pass on campus was Vine and Florida, and he usually just skips class because of the distance. To be fair, if you live east of Vine, you're probably not a student here. That is a long ways away. Farthest I've seen someone live without a parking pass on campus was Vine and Florida, and he usually just skips class because of the distance. To be fair, if you live east of Vine, you're probably not a student here. That is a long ways away. Farthest I've seen someone live without a parking pass on campus was Vine and Florida, and he usually just skips class because of the distance. I wish they would fix some of these lights. There are points where it's just pitch black.   Okay, first strike, don't carry large amounts of cash. In addition to possibly being robbed, you can also lose it. TCF and the UIUC Credit Union have free checking accounts for students and they give you a debit card. Use them. You can cancel a lost/stolen debit card. You can't get cash back if you lose it or it is stolen. \n\nSecondly, the only place I'd feel unsafe at night is north of University or on Green St at like 4am. But don't be an idiot. Be aware of your surroundings.  Don't use a checking account to store money in a bank if safety concerns you. It's not hard for someone to mug you at an ATM and force you to withdraw $1000 in less than a minute. Instead, you want to get a savings account attached to your bank account and only store a necessary amount in the checkings account. There's no way to access the savings account at an ATM. In all seriousness is that really a thing?  My credit union allows me to withdrawal from checking or savings from any ATM.  I thought this was universal. I used to deposit my pay checks directly to my checkings account at the local bank and a bank teller once told me that it was \"not safe\" for me to have all my money in a checkings account for this reason. Perhaps she was just trying to get me to start a savings account? I'm assuming you're right.  I don't know much about banking, but if I had to guess I'd say banks can't invest with your checking but can with savings.  That's probably why savings generate interest and most checking accounts don't. Banks can't legally invest in regular savings accounts, that's why the return on them is shit.  There is no risk in checking or savings.   In all seriousness is that really a thing?  My credit union allows me to withdrawal from checking or savings from any ATM.  I thought this was universal. I think they used to be much more separate than they are now. In all seriousness is that really a thing?  My credit union allows me to withdrawal from checking or savings from any ATM.  I thought this was universal. Don't use a checking account to store money in a bank if safety concerns you. It's not hard for someone to mug you at an ATM and force you to withdraw $1000 in less than a minute. Instead, you want to get a savings account attached to your bank account and only store a necessary amount in the checkings account. There's no way to access the savings account at an ATM. There's usually a $500 daily ATM withdrawal limit on those, so no. Right, because losing $500 is something you brush off. \n\nEDIT: Sorry, I misread Perrys comment and thus misunderstood yours. You are right, carry on.  I merely refuted his statement about checking accounts and a thousand bucks. Chill out. What part of that comment made you think I'm not chill? I'm falling asleep as I type. \n This is just beyond stupid. Please go on. Ok...? Did you not start it with your comment you thought was funny? Making more friends, I see. Don't use a checking account to store money in a bank if safety concerns you. It's not hard for someone to mug you at an ATM and force you to withdraw $1000 in less than a minute. Instead, you want to get a savings account attached to your bank account and only store a necessary amount in the checkings account. There's no way to access the savings account at an ATM.  Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... *White Street*? The *Six Pack*? Jesus, dude, I thought I was over-cautious. \n\nI'd call anything south of Columbia or Vine in Champaign about as safe as you can get (there are like $500,000 homes on Park, Church, and Hill). The only real problem is when you start getting up toward Bradley. Bradley and McKinley is no fun, but the most dangerous parts of the entire area are downtown Champaign and Green Street, frankly. (E: I'm thinking of Champaign west of the tracks, not east. Yeah, you don't want to be north of University in Champaign east of the tracks.)\n\nAnd the six pack? I never lived on campus, but isn't that the group of residences north of the ARC? I've never felt even slightly uncomfortable there except when I first visited Champaign (on Unofficial) and there were some loudmouth assholes there. But that's Unofficial, not a problem with the Six Pack. *White Street*? The *Six Pack*? Jesus, dude, I thought I was over-cautious. \n\nI'd call anything south of Columbia or Vine in Champaign about as safe as you can get (there are like $500,000 homes on Park, Church, and Hill). The only real problem is when you start getting up toward Bradley. Bradley and McKinley is no fun, but the most dangerous parts of the entire area are downtown Champaign and Green Street, frankly. (E: I'm thinking of Champaign west of the tracks, not east. Yeah, you don't want to be north of University in Champaign east of the tracks.)\n\nAnd the six pack? I never lived on campus, but isn't that the group of residences north of the ARC? I've never felt even slightly uncomfortable there except when I first visited Champaign (on Unofficial) and there were some loudmouth assholes there. But that's Unofficial, not a problem with the Six Pack. *White Street*? The *Six Pack*? Jesus, dude, I thought I was over-cautious. \n\nI'd call anything south of Columbia or Vine in Champaign about as safe as you can get (there are like $500,000 homes on Park, Church, and Hill). The only real problem is when you start getting up toward Bradley. Bradley and McKinley is no fun, but the most dangerous parts of the entire area are downtown Champaign and Green Street, frankly. (E: I'm thinking of Champaign west of the tracks, not east. Yeah, you don't want to be north of University in Champaign east of the tracks.)\n\nAnd the six pack? I never lived on campus, but isn't that the group of residences north of the ARC? I've never felt even slightly uncomfortable there except when I first visited Champaign (on Unofficial) and there were some loudmouth assholes there. But that's Unofficial, not a problem with the Six Pack. Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... &gt;Anywhere north of White on the Champaign side between 1st and Wright\n\nWell, shit. I never really considered the area I live in (and am returning to next year) to be unsafe. I would say that University is the absolute cutoff, and White is actually a little better because of the constant stream of buses (Yellow, Brown, Teal, Red) that traverse it. &gt;Anywhere north of White on the Champaign side between 1st and Wright\n\nWell, shit. I never really considered the area I live in (and am returning to next year) to be unsafe. I would say that University is the absolute cutoff, and White is actually a little better because of the constant stream of buses (Yellow, Brown, Teal, Red) that traverse it. Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible...  I feel the campus is quite safe.  Most people have blown it out of proportion due to overuse of crime alerts. I feel the campus is quite safe.  Most people have blown it out of proportion due to overuse of crime alerts. Agreed, I used to go on long walks late at night on the Urbana side of campus and never once felt remotely threatened.  I don't know, maybe that wasn't the smartest thing to do, but some people act like if you step foot outside after dark you are _definitely_ going to get mugged/murdered/raped.  Sadly, campus is actually the unsafe part of town.\n\nhttps://www.crimereports.com/map?CRSearch=urbana%20il\n\nStudents have the valuable property, so many times the bad elements come to campus to do their crimes. Sadly, campus is actually the unsafe part of town.\n\nhttps://www.crimereports.com/map?CRSearch=urbana%20il\n\nStudents have the valuable property, so many times the bad elements come to campus to do their crimes.  I feel unsafe near 1st and healy at 3am.  I'm so confused. Aren't Springfield/Gregory parallel?  I'm so confused. Aren't Springfield/Gregory parallel?        I lived near Elm/Busey last year, and I had to walk down Western Ave (it's more an alley to be honest) at all hours of the day and night to get to lab. It's a bit sketchy I'll admit, but no one ever bothered me. I know someone was robbed earlier this year getting into a car in the parking lot at Springfield/Goodwin, but I don't think that was more chance than anything. In short, the neighborhood's alright.\n\n&gt; Where should the average person avoid at night while carrying lots of cash?\n\nEverywhere. Why would you carrying large amounts of cash at night?   Saferides are pretty awesome and free. Use them     Springfield and Gregory is quite safe.  I spent 2 years living on Springfield and Lincoln (and two years before that right over on Springfield and Green, and then one year after that just a block over on Springfield and Coler), never any issues in the area.  I'd say don't go North of University in the middle of the night and you're fine.  I feel much less safe south of Green st and West of 6th to be honest.\n\nIn general though, if you can avoid walking around alone in the middle of the night, do so.   I lived at stoughton and harvey, a block north from what you say... i never really had any problems... public safety building right there. but... keep south of university. also, who carries cash these days? There are very few crimes north of University unless you're near the student housing on Lincoln. No one's around looking for trouble since it's just a neighborhood. I walk back from downtown Champaign down Washington/Beslin/Fairview a couple times a year, and mostly it's nice old ladies out watering their flowers and some kids on bikes... It just looks super shady. Walk through the neighborhood at night alone when it gets warmer out. You won't feel safe. \n\nAnd technically you can classify every group of residences as \"just a neighborhood.\" Some neighborhoods are way worse than others. And some of these neighborhoods are right next to each other. \n\nExample: My parents live in an area where the average home is $500,000+ and there is little crime. I work 10 miles away in an area with stabbings, robberies, shootings, etc.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18sncm/ruiuc_where_do_you_feel_unsafe_around_campus/"
  }, {
    "id" : 25,
    "title" : "Looking for a ride",
    "snippet" : "My buddy and I are looking for a ride back to Chicago on friday/friday night-ish.  I live in Schaumburg and he's on the northside but really we'd just like to get anywhere near there.  So if you've got some extra room and would like some company we'll certainly pitch in for gas.\n\nThanks ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ua0t/looking_for_a_ride/"
  }, {
    "id" : 26,
    "title" : "Found some interesting books in the law library. ",
    "snippet" : "   Take it from someone who works in the library - there's a lot more interesting stuff in there. go on... -hardcore pornography\n\n-journal of the National Association for Gravestone Studies (only interesting to me? okay)\n\n-diaries of cult leaders\n\n-firsthand accounts of alien abductions\n\n-Encyclopedia of Girl Culture\n\n-Voynich manuscript\n\n-fundamentalist Christian sex manuals\n\n-minstrel show catalogs\n\n-newspapers from the last two centuries (ever wonder what the front page said on D-Day? or the day Kennedy was assassinated?)\n\n-so much pornography\n\n-did I mention the porn\n\nAnd this is just off the top of my head. I should really start keeping a list of some of the weirdest requests we've gotten. All of this is in the law library? go on... I agree, if you know better post better! We're interested.   Are you Justin Trapp",
    "url" : "http://i.imgur.com/T1oxXhZ.jpg"
  }, {
    "id" : 27,
    "title" : "Urban Outfitters celebrates Presidents Day by showcasing one of our greatest presidents, Benjamin Franklin. ",
    "snippet" : "  Also seems to be a founding father of ICP  Alice Cooper?   There's an asterisk in fine print on the bottom that acknowledges that Ben Franklin wasn't a President. Then there's something about today being all about the Benjamins.  There's an asterisk in fine print on the bottom that acknowledges that Ben Franklin wasn't a President. Then there's something about today being all about the Benjamins.  [deleted] What does that have to do with anything? Is he.... flirting with us? [deleted] [deleted]      ",
    "url" : "http://i.imgur.com/pYdipg7.jpg"
  }, {
    "id" : 28,
    "title" : "Anyone work at Courier Cafe?",
    "snippet" : "Their milkshakes are amazing. Anyone know what kind of ice cream they use?  blue bunny.  i work at silvercreek and make the maintenance dude bring me a strawberry from time to time.  thanks! do you know if they use strawberry ice cream for the strawberry milkshakes? or just plain vanilla all the way? yeah i want a recipe these are the jam blue bunny.  i work at silvercreek and make the maintenance dude bring me a strawberry from time to time.  Hey, can you tell the head chef something?  I love eating at Silvercreek, but the last few times I've gone in there there's been *nothing* on the menu that didn't include either mushrooms or seafood - and I'm allergic to both.  A little variety would be nice, and if I'm gonna pay $20 for a plate of food I shouldn't have to eat around parts of it.\n\nIt's making me pretty sad, because the times I've eaten there in the past, the food and service were wonderful! we take subs on all our items or like in the instance of the filet, we could whip you up some demi glace without shrooms.  im glad to hear you enjoy us tho. we are always trying to send out the best and most creative dishes in CU! Yeah, but you've got them in all the potatoes too... they said there was no way to get non-shroomy potatoes. :(\n\nThanks! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18sovr/anyone_work_at_courier_cafe/"
  }, {
    "id" : 29,
    "title" : "To date, my favorite spot on campus.",
    "snippet" : "  why? For a few reasons:\n\n1. There's usually nobody around, so it's a nice place to mellow out and study. \n\n2. There's three floors of math texts, which is freakin' awesome.\n\n3. The glass floors give it a special ambiance that I haven't yet been able to duplicate anywhere else.\n\n4. I've got a feeling that there's probably a secret passage somewhere, that I've yet to find. It's Altgeld, after all.\n\nBut yeah. You should check it out sometime! This submission is funny because it comes close to the /r/bestof problem.\n\n* \"What is your favorite subreddit?\"\n* \"My favorite subreddit is this one, because there are so few people there that I can mellow out\"\n* Subreddit permanently ruined For a few reasons:\n\n1. There's usually nobody around, so it's a nice place to mellow out and study. \n\n2. There's three floors of math texts, which is freakin' awesome.\n\n3. The glass floors give it a special ambiance that I haven't yet been able to duplicate anywhere else.\n\n4. I've got a feeling that there's probably a secret passage somewhere, that I've yet to find. It's Altgeld, after all.\n\nBut yeah. You should check it out sometime! Hmm, we need a math building...I know, let's duplicate a German castle! For a few reasons:\n\n1. There's usually nobody around, so it's a nice place to mellow out and study. \n\n2. There's three floors of math texts, which is freakin' awesome.\n\n3. The glass floors give it a special ambiance that I haven't yet been able to duplicate anywhere else.\n\n4. I've got a feeling that there's probably a secret passage somewhere, that I've yet to find. It's Altgeld, after all.\n\nBut yeah. You should check it out sometime! Will do my friend. Btw...WHERE IS THIS! I know you said altgeld, but where in altgeld? (im a new transfer student.)   my room is my favorite spot (really). i don't understand why some people don't like being in their rooms  Gonna have to check this out before I graduate. Never been inside this part of Altgeld. Just follow the signs to \"stacks\" behind the desk Is anyone allowed in there? I always thought that the librarians had to get those books for you!   Where exactly in altgeld is this? I thought the library only had one floor...   ",
    "url" : "http://i.imgur.com/sJnRQQv.jpg"
  }, {
    "id" : 30,
    "title" : "Triptych Brewing opening up today in chambana",
    "snippet" : "The tasting room will be open, beginning today, with normal hours from 3pm to 10pm. \n\n 1703 Woodfield Drive\nhttp://triptychbrewing.com.\n\n\nWhat's on tap?\n\n\n\n* De Light Blonde - A light, crisp American blonde featuring a touch of citrusy hops.\n\n* Dirty Hippy - A Dark English mild, this low alcohol beer is overflowing with notes of toffee and caramel.\n\n* 70 Minus - Another low alcohol session beer featuring a strong malt backbone followed by characterful earthy and woody highlights. Finishes with a touch of smoke.\n\n* Spring in Amarillo - A red ale dominated by a fruity maltiness and finishing with a touch of citrus from the exclusive use of Amarillo hops.\n\n* Blueberry Blonde - Our Light blonde with a twist: lots of blueberry. This pink/purple ale features a sweet, blueberry aroma. Flavored with blueberry juice and a touch of blueberry concentrate for aroma.\n\n* Pale Ale - One of our many pale ale recipes, this iteration contains a mix of piney and spicy hops. While it finishes decidedly crisp and bitter, there is also a persistent maltiness for balance.\n\n* Skajaquada - \"Ska-jack-wa-dah\" is our take on a Cascadian Dark Ale. While dark, almost black in color, it lacks the roasty, acrid character usually associated with black beers and instead features copious amounts of hops giving it a firmly bitter finish.\n\n* Valentine - Demonstrating our seasonal whimsy, this chocolate cherry stout was brewed especially for our February opening. Aged on a combination of all-natural Montmorency cherry puree and cocoa nibs, this is truly a dessert beer. Served on nitrogen for a creamy, luscious finish.  I don't hit reddit often but when someone mentioned this thread in the tasting room last night, I thought I would bite.\n\nI am the head brewer at Triptych, one of the three owners, and I suppose you can ask me anything. Here are some answers to the other questions:\n\n* What is the deal with the low ABV beers?\n\nAs someone else already mentioned, ABV doesn't really correspond to flavor. Our tasting room is meant to be a place you can hang out for a while, play a game of chess/cribbage/cards/whatever, and since it is the middle of winter and a little bit off the beaten path, I thought it might be nice to have some beers that you can enjoy quite a lot of without getting hammered. I did this with mostly British styles, following the tradition of a British \"session\", see http://en.wikipedia.org/wiki/Drinking_culture#Session_drinking Also, I knew a lot of our initial visitors would be our Kickstarter supporters, many of whom were friends and family that while they appreciate our dream, they aren't quite craft beer enthusiasts yet, and so I wanted to have a range that they could enjoy as well.\n\n* Perhaps super high alcohol beers take longer to brew?\n\nThe time difference is pretty negligible, the answer is pretty much the same. I wanted to encourage some social session engagement without making it impossible for people to get back home after an evening at the tasting room. When spring and summer start rolling around and it becomes biking weather, I'll put some more higher abv beers on.\n\n* Growlers\n\nFills are currently between $14-16. And until March 2nd, we're participating in a food drive so if you bring in a non-perishable canned good, we're taking a buck off a growler fill. We sell growlers but we are also happy to fill ANYONE ELSE's 64oz growler too.\n\n* Future beers\n\nI have a significant stable of beer recipes; the idea is that every couple of weeks there is something new on tap at the tasting room. Immediately coming up we have an Imperial IPA and an English Pale ale. Following that will be a number of German lagers. We also have a couple of beers aging in Buffalo Trace Bourbon barrels.\n\nI hope folks will give us a chance. I think our prices are competitive with craft offerings you find elsewhere and as someone else mentioned, we've tried to set up a space/place/brewery that is pretty much all about beer.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  &gt; - 3. Spring in Amarillo\n&gt; \n&gt; Red Ale, 30 IBU, 5.9% ABV\n&gt;\n&gt; - 6. Pale Ale\n&gt;\n&gt; American Pale Ale, 47 IBU, 4.6% ABV\n&gt;\n&gt; - 7. Skajaquada\n&gt;\n&gt; Cascadian Dark Ale, 90 IBU, 6.8% ABV\n&gt;\n&gt; - 8. Valentine\n&gt; Cherry Chocolate Stout, 23 IBU, 6% ABV\n\nThere might be some correlation with just opening and not having super high alcohol beers. Perhaps they take longer to brew? I saw that. Still somewhat low for what they are in my opinion. Your point is definitely valid. For me, drinking a 3% ABV sounds like drinking water, especially at the cost I imagine they are charging for them.  I saw that. Still somewhat low for what they are in my opinion. Your point is definitely valid. For me, drinking a 3% ABV sounds like drinking water, especially at the cost I imagine they are charging for them.  I saw that. Still somewhat low for what they are in my opinion. Your point is definitely valid. For me, drinking a 3% ABV sounds like drinking water, especially at the cost I imagine they are charging for them.  Does Guiness taste like water to you? It's weaker than Bud Lite. There's more to beer than ABV - if you're looking for ABV, go buy some cheap vodka. Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.    What are the prices per growler? What are the prices per growler?     That's a terrible location.  Wish you guys the best, but you will have trouble staying in business that far away from campus and the downtowns. Perhaps, but I guess I should also mention that you will find our beer at several downtown locations in the near future. I heard that the order of distribution will be Radio Maria, Blind Pig and Big Grove Tavern (in that order). Can you confirm? That's a terrible location.  Wish you guys the best, but you will have trouble staying in business that far away from campus and the downtowns. That's a terrible location.  Wish you guys the best, but you will have trouble staying in business that far away from campus and the downtowns.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rv6o/triptych_brewing_opening_up_today_in_chambana/"
  }, {
    "id" : 31,
    "title" : "This week at ISS...",
    "snippet" : "This Wednesday (2/20/2013), the ISS will consider (item - summary):\n\nExecutive Orders\n\n1. EXO.2013.28 (ISS) Committee Appointments - Filling vacancies on ISS internal committees.\n\nResolutions for Action\n\n1. IA.2013.34 Reporting for Campus Referendums - The Campus Student Election Commission is urged to track student money spent in support of referenda questions.\n2. IA.2013.35 A Resolution to Support Student Invention &amp; Innovation - A taskforce is created to award small grants to students wishing to file patents.\n3. FA.2013.30 Student Invention Support - The grants for the taskforce are allocated.\n4. *Statement Against a Nuclear Capable Iran** - The ISS stands in solidarity with the letter [\"Prevent Iranian Nuclear Capability\"](http://www.aipac.org/en/resources/aipac-publications/publication?pubpath=PolicyPolitics/Press/AIPAC%20Statements/2012/12/AIPAC%20PRAISES%20STRONG%20BIPARTISAN%20SENATE%20LETTER%20URGING%20FURTHER%20PRESSURE%20ON%20IRAN) (scroll down for full text of the letter).\n\nResolutions for Information\n\n1. Support for Marriage Equality - Supports marriage equality legislation in Illinois.\n2. Carry Free Campus: Statement of Inclusion to the General Assembly - Discussed statements made to the Illinois House Judiciary Committee and their inclusion in law.\n3. Carry Free Campus:Thank You - Thanks people involved in the Carry Free Campus initiative.\n4. Clerks - Adding additional senate clerks to spread the workload.\n5. Increased Autonomy of Committees = Allows ISS committee chairs to add additional committee members.\n\nReports for Information\n\n1. State of the Carry Free Implementation Status\n\n*This resolution has not been approved by the ISS Committee on Community and Governmental Affairs, but it might be soon. Expect it to be added to the Agenda at the meeting.\n\nThe full agenda can be found [here](http://ge.tt/7bZlUqY/v/0?c).  So... can we make this *not* a carry free campus? Is anyone with me in supporting an initiative to the contrary? The campus is already carry free *for students, faculty, and staff*. They're trying to make it totally carry free, so the police can turn away people trying to bring weapons onto an unarmed campus. So, how does this get enforced?  Exactly. How much is enforcing this ridiculous addition to make it totally carry free going to cost us? The campus is already carry free *for students, faculty, and staff*. They're trying to make it totally carry free, so the police can turn away people trying to bring weapons onto an unarmed campus. The campus is already carry free *for students, faculty, and staff*. They're trying to make it totally carry free, so the police can turn away people trying to bring weapons onto an unarmed campus. So... can we make this *not* a carry free campus? Is anyone with me in supporting an initiative to the contrary?   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18stwb/this_week_at_iss/"
  }, {
    "id" : 32,
    "title" : "Orange Krush reveal their true colors at Northwestern Sunday night",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=E_pUy-x3cUo&amp;feature=youtu.be"
  }, {
    "id" : 33,
    "title" : "Tin Roof Tavern Urbana?",
    "snippet" : "I'm wondering if anyone has been to this bar yet?  The interwebs still don't have info about whether it has opened yet, or even a phone number.  I appreciate the neglected small neighborhood bars.  They are super rare down here.  Back home there was a neighborhood bar every few blocks (Irish-German blue collar town).  Drinks are cheap, and there's no pretentiousness in the people or the food.  I went to Mug Shots a few times and thought it was okay, and I really like Boomerangs.  Only (possible) problem with Boomerangs is that most women usually don't want to go, because we normally end up at the Bullet.\n\nIf you've been, reviews?  Haven't been but I'm pretty sure it is the same owner at Mug Shots. If you like those types of bars you should also check out Pias, Tumble Inn, JonEB's, Hubers, The Ice House, and D.R. Diggers. Also, in downtown Urbana Bunny's and Rose Bowl are right up that alley and in downtown Champaign the Brass Rail and the Pheonix are like that too. Haven't been but I'm pretty sure it is the same owner at Mug Shots. If you like those types of bars you should also check out Pias, Tumble Inn, JonEB's, Hubers, The Ice House, and D.R. Diggers. Also, in downtown Urbana Bunny's and Rose Bowl are right up that alley and in downtown Champaign the Brass Rail and the Pheonix are like that too. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18t0ks/tin_roof_tavern_urbana/"
  }, {
    "id" : 34,
    "title" : "Is anyone in CS 418 and interested in meeting up to study for the exam tonight?",
    "snippet" : "I posted in the Piazza to no interest. I think studying with one or two other people could be great considering we have no received no guidance for the exam.   hahahah\nthat was gold when he showed it.\nsorry bro, I would have loved to but was too busy figuring out wtf was gonna be on the exam to check reddit lol\nnext time?  Haha next time for sure. I bombed that exam. \n  no",
    "url" : "http://www.reddit.com/r/UIUC/comments/18sdse/is_anyone_in_cs_418_and_interested_in_meeting_up/"
  }, {
    "id" : 35,
    "title" : "What happened with this Juicy J show? Looking for sources. Whoever has them message me here or send e-mail to music@readbuzz.com",
    "snippet" : "  From what I heard someone who was supposed to back the event withdrew a bunch of money and they didn't have enough money to pay Juicy.  Sucks too, I'm out $60 for 3 tickets and have been shut down in every way regarding refunds. From what I heard someone who was supposed to back the event withdrew a bunch of money and they didn't have enough money to pay Juicy.  Sucks too, I'm out $60 for 3 tickets and have been shut down in every way regarding refunds. From what I heard someone who was supposed to back the event withdrew a bunch of money and they didn't have enough money to pay Juicy.  Sucks too, I'm out $60 for 3 tickets and have been shut down in every way regarding refunds.  The domain was registered through DomainsByProxy. The phone number is a crappy little disposable Cricket phone. The page is so hilariously shitty, it's incredibly unlikely that the person who made it had any intention of coming off as \"professional.\"\n\nIn short, it was a scam. The domain was registered through DomainsByProxy. The phone number is a crappy little disposable Cricket phone. The page is so hilariously shitty, it's incredibly unlikely that the person who made it had any intention of coming off as \"professional.\"\n\nIn short, it was a scam. ",
    "url" : "http://readbuzz.com/music/2013/whos-got-the-juice"
  }, {
    "id" : 36,
    "title" : "Fellow grad students, did you get paid less this month?",
    "snippet" : "People in my department are getting smaller paychecks than we usually do (by $50-100) for February. Word on the street is that we are paying social security now, which was exempt for full time students previously. Can anyone verify this? HR has been unhelpful beyond stating the withheld amount is correct.    I voted for an increase in taxes in November! #Obama2012!! Woohoo!!! Why are my taxes higher now? WTF?  Full-time students are still exempt. Go talk to payroll in Henry Admin Building. The nice young lady (if you needed more incentive than money to go, she's cute, but married) is fully aware that this is a problem and is working to try to fix it... but she needs to know who she needs to fix it for.  It has to do with social security, according to another T.A. complaining about this issue on facebook. http://blogs.wsj.com/economics/2013/01/01/payroll-tax-cut-expires-how-much-more-will-you-pay/\n\nand Obama was the one to push the payroll tax in the first place, YouCanThankObama. Neither party pushed it through this time around, so you can thank both democrats and republicans.  It has to do with social security, according to another T.A. complaining about this issue on facebook. http://blogs.wsj.com/economics/2013/01/01/payroll-tax-cut-expires-how-much-more-will-you-pay/\n\nand Obama was the one to push the payroll tax in the first place, YouCanThankObama. Neither party pushed it through this time around, so you can thank both democrats and republicans.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18s999/fellow_grad_students_did_you_get_paid_less_this/"
  }, {
    "id" : 37,
    "title" : "Are there ever raves at UIUC?",
    "snippet" : "So my friends and I got into going to concerts like Paper Diamond, Emancipator and Baauer, and we wanted to go to an actual rave, are there ever any here?  The closest thing to a rave you'll get in Champaign is a show at the Canopy Club.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rsb0/are_there_ever_raves_at_uiuc/"
  }, {
    "id" : 38,
    "title" : "Humanist Meeting Tuesday at 7",
    "snippet" : "Hey guys, if you identify yourself as a(n) humanist, atheist or agnostic, come out on Tuesday to this discussion group! This week we will be discussing Feminism and Atheism+.\n\nLocation: English Building Room 107b (there will be a sign outside the door)  What about it? Any particular topics?   is this a student group? sounds like my kind of thing. Yes, a student group, you should come try it out! i might. how long do the meetings last? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18s20j/humanist_meeting_tuesday_at_7/"
  }, {
    "id" : 39,
    "title" : "Has anyone lost a cell phone outside of CRCE on February 18th in the morning? I might have it :)",
    "snippet" : "I found it as I was walking to catch the Teal and I assumed it would be easy to find the owner but I didn't realize I can't unlock it or read texts that say who to contact if the phone is found. I figure I'll post here in the mean time.\n\nPM me the details of the cell phone so I can verify that you're the owner and I will try to get it back to you as soon as possible.\n\nEdit: CRCE has the phone now so if you were the one who lost it, you can pick it up over there  Give it to member services at CRCE. I called CRCE and gave them my contact information. When I'm around that area, I'll give it to them.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18r9te/has_anyone_lost_a_cell_phone_outside_of_crce_on/"
  }, {
    "id" : 40,
    "title" : "Would anyone be up for a FIFA 13 tournament on the PS3?",
    "snippet" : "I was thinking maybe a 16-32 player tournament.  I'd be in also. Anyway we could make it for the Xbox 360?      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ry5u/would_anyone_be_up_for_a_fifa_13_tournament_on/"
  }, {
    "id" : 41,
    "title" : "lost an iPad in everitt",
    "snippet" : "I was in the student lounge and left my iPad on the desk. it'd be great if anyone could help. I already checked the lost and found.  do you have find my iPhone activated on it?\n \"everyone who owns an ipad has an iphone, yes that's so very true.\"\n-owner of an ipad and android phone    I accidentally left it behind after I left Everitt. I know for sure someone picked it up and accessed my Facebook through his/her home internet connection. I'm just thinking about how much authorities could do if I reported it along with the IP address. Unfortunately, find my iPhone was not activated.   does anyone know who specifically I should report this to for best results? campus police, champaign police, urbana police? don't really know. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rc98/lost_an_ipad_in_everitt/"
  }, {
    "id" : 42,
    "title" : "Why does it smell like manure near ISR?",
    "snippet" : "There is a pungent smell of farm animals all around the ISR area. It subsides as you walk West but over here by ISR it smells like Wilbur's smelly butthole.  wind coming in off south farms most likely wind coming in off south farms most likely   I'm assuming you're new to the area. The first week of spring, if you live on campus, you will smell like horse shit. There is no way to get around this.  Horse shit? From the South Farms? There are mainly cattle at the South Farms. So basically, you don't know shit.  Wind carrying smell from the farms south of campus. Its just fertilizer     high concentration of foreigners is to blame  [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rkpz/why_does_it_smell_like_manure_near_isr/"
  }, {
    "id" : 43,
    "title" : "Free burritos this Wednesday from Cactus Grill",
    "snippet" : "   ",
    "url" : "http://deals.centralillinoissavings.com/deal/cactus-grill"
  }, {
    "id" : 44,
    "title" : "Let's make an \"Easy A\" list! What's the easiest class you've taken at UIUC?",
    "snippet" : "I feel like this would be a really useful list for everyone looking to boost that GPA. Try to give as much info about the class as possible i.e. professors, major assignments, etc.\n\nMy contribution: Sociology 160: Social Change and Global Development.\n\nThe course met twice a week, ended early every day, like 6 lecture got cancelled during the semester, one super easy paper, and two easy tests that were essay style and you got 100% is you had attended the review session the night before. Ended the class with 124% - A+++ lol  I know I'm \"that guy\" but I'd like to implore you all not to take a class for an \"easy A\". \n\nYou will inevitably be too busy the rest of your life to just sit and learn about things that interest you. You'll have a job, a family, and grown up social things to do, so you probably won't have time to learn about american indian history, or how to skate properly. \n\nSo if you really want that A, then yeah, go for it. But if you see a class that's a *little bit* harder but actually interests you, do it instead. You'll still get an A if you actually like learning about it. \n\nYou're supposed to be here to expand your mind and find your interests, not get a GPA. But if all you're here for is to learn about your future employers and make them think you're smart, you can go ahead and do that too. some of the easiest classes unrelated to my major have been some of the most interesting I have taken though. I by no means want a career in horticulture or meteorology, but hort 105 and atms 120 are pretty interesting in addition to being generally easy  It's been a while, so I don't remember the names... but...\n\nbowling, tennis, ice skating, weight lifting, sex ed, and an Asian Studies class taught by a gay Filipino man from Chicago chronicling the life of a gay Filipino man from Chicago. The Prof was very most likely Manalansan.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  A trained monkey could pass ATMS100. ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.   STAT 100 with Fireman was really easy and fun. STAT 100 with Fireman was really easy and fun.  For engineers with a tech elective requirement, I'd recommend NPRE 402. HW is due every lecture, but it might take 20 minutes at the most. Basic chemistry and algebra. For engineers with a tech elective requirement, I'd recommend NPRE 402. HW is due every lecture, but it might take 20 minutes at the most. Basic chemistry and algebra. For engineers with a tech elective requirement, I'd recommend NPRE 402. HW is due every lecture, but it might take 20 minutes at the most. Basic chemistry and algebra.  * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n Is FSHN 304 even still offered anymore? * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n    My freshman year Acting professor also taught THEA 101. I never took it, but he himself said it was the easiest class on campus. J.W.? Yip I took the theatre major equivalent. One of my favorite professors I've had at this university. My freshman year Acting professor also taught THEA 101. I never took it, but he himself said it was the easiest class on campus.   ASTR 100 with Bryan Dunne was easy and fun. any 100 level with Dunne! I got an A+ in the class! \n  I think it should also be listed what gen-ed requirements they fill.  ANTH 143. It met once a week, had no tests, and there was only a little bit of homework.    Adv 300 - advertising 100\n\nStat 100 and 200  Could you elaborate on Advertising? I am interested in taking a few advert classes and was wondering what they are like in term of the materials, how the classes were run, and workloads.     MCB 432      HTLR420 NPRE 481    CLCV 116 and LING 100 were pretty easy and also thoroughly interesting.            ATMS 120 - awesome class, in it now\nNRES 100 \nANSC 250 -cats and dogs fun class\nACE 161 - alex lo is the man and it is just on microsoft office programs\n       IB361 was an easy A for me.  ECON 202, didn't go to lecture so I missed a quiz or two, but got an A in the class.   ITT: CS and ECE kids joke about CS 473, ECE 391 being easy, having hot chicks. Both ECE391 and CS473 are easy for me. For those people who don't think them easy, ask yourself, do you really spend every minute in your life on that class? No pay, no gain.\n Those classes were designed to be difficult, those who are motivated or enjoy the subject do well because they dont mind the work that it requires, those who are not struggle. This goes for many of the other upper level classes people find hard\n  PHYS 583. Easiest class ever.  Care to elaborate? I'm interested in physics, but I'm ChemE and looking to take some easy, fun physics classes.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18q3uu/lets_make_an_easy_a_list_whats_the_easiest_class/"
  }, {
    "id" : 45,
    "title" : "Does anyone know of a place on campus where I can get my laptop keyboard repaired? (PC)",
    "snippet" : "Title says it all. One of the keys, along with the rubber cap, fell off of the keyboard. CITES doesn't do hardware repairs, and the Illini Tech Center only services Apple computers, so I'm not sure what to do. Thanks guys.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rfwh/does_anyone_know_of_a_place_on_campus_where_i_can/"
  }, {
    "id" : 46,
    "title" : "Technical Systems Management with a Business Minor - your thoughts?",
    "snippet" : "I am cosidering majoring in TSM and getting a Business Minor. I am just wondering if anyone here is in TSM, or knows somebody who is in it. How did they like the classes, the department, the job prospects, etc. Just trying to get a general opinion.\n\nhttp://abe.illinois.edu/courses/tsm  Ask Dr. Harper how difficult it is as a TSM major to get into the business minor program.  I plan on applying to the business minor next January (they only accept applications in January now, and I missed it this time around).\n\nLast I heard, it wasn't too difficult as long as you met the GPA/prerequisite class requirements.\nAre you implying it is easy or difficult for TSM majors?\n\nI've been taking BADM and ACCY classes in preparation for this, so it would be a real bummer if I wasn't able to get in.\n\n\n\nedit: I misspoke. The May application period is still active until January 2014 I was in TSM for a semester. I got rejected while I was in it. I switched back to stats/cs and was accepted. My gpa did go up but not by too much. As for the TSM major, it wasn't what I thought it'd be and it sure as hell wasn't for me.   I am good friends with 2 people who are graduating from the program this May, both of which already have solid jobs lined up with energy/ag companies. What companies, and what positions? If you dont mind me asking.  I'm currently in TSM with 2 semesters left after transferring from Ag &amp; Bio Engineering, but am not really familiar with the business minor.\n\nAs far as the major itself I am really enjoying it. You have to take some 100/200 level soils/cropsci/etc but for the most part you are able to choose from a pretty wide selection of TSM, ABE, and ACE classes. \n\nBased on this flexibility, the job prospects are strong in number and diversity. I know of seniors in my classes who have secured jobs with ADM, John Deere, Caterpillar, countless farming input sales, and other commercial construction/farming companies (as well as some random trading and accounting). TSM is already under under ABE I thought?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18qono/technical_systems_management_with_a_business/"
  }, {
    "id" : 47,
    "title" : "Looking for a partner for CS 450 homework!",
    "snippet" : "This class is much more difficult than I thought, and I'm in desperate need for someone to work with. Please PM me if you're interested in getting a group together to finish this work. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18qnso/looking_for_a_partner_for_cs_450_homework/"
  }, {
    "id" : 48,
    "title" : "New UI Dining app for Android and iOS",
    "snippet" : "  This isn't necessarily new. It's just and update. They added a feature to check your balance which is a very nice improvement.  This isn't necessarily new. It's just and update. They added a feature to check your balance which is a very nice improvement.    Do you guys still get nut encrusted pork loin every other day? ",
    "url" : "http://www.housing.illinois.edu/app"
  }, {
    "id" : 49,
    "title" : "Best Caffeine Pills?",
    "snippet" : "Vivarin or generics... need something to get me through MT season... any thoughts?   Ummm... just don't.  Get sleep.  You can do it.  I'm going to be graduating undergrad in 4 years total with a Masters in CS and I sleep 9 hours a day... you will be more productive overall and anything else is just trading your health for grades, a really bad idea in the long run. I can't stand this response. It's possible to get through any program here sleeping 12 hours a day. You just can't do anything else. If you'd actually like to push yourself and take advantage of the ridiculous tuition, *try*. It gets easier in a couple months, and you're actually doing shit. Not sure I agree.  I feel I do more than most of my peers here.  I tend to do 15 hours of all technical classes per semester, plus a 20 hour a week part time job and an EOH exhibit.  Sure I'm not really in RSO's (except a few brief ACM stints), but like I said I have a plenty active social life on top of the resume crap.  I actually get much more done sleeping 7-9 hours than I did sleeping 3.  That's not to say that I never pull the odd all-nighter when deadlines pile up, but I really think that your cognitive skills decrease with lack of sleep and though you can convince yourself you're doing more you're actually limiting academic performance and in my experience mental health (I've had some pretty intense depersonalization periods after a few months of &lt;3hrs/night). Like I said, it gets better after a couple months. And there are plenty of ways to avoid the dead end thinking that happens during severe sleep deprivation, not the least of which is doing work with classmates. I'm extremely active in a number of RSOs, while founding another. It makes it worth it. That being said, I've also been sick relatively often, and the crashes over breaks are hard. So there may be a better middle ground. Ummm... just don't.  Get sleep.  You can do it.  I'm going to be graduating undergrad in 4 years total with a Masters in CS and I sleep 9 hours a day... you will be more productive overall and anything else is just trading your health for grades, a really bad idea in the long run. [deleted] I consider my social life just fine.  Plenty of friends and a relationship that takes up quite a bit of my time. Then you are a more efficient man than I.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18q837/best_caffeine_pills/"
  } ],
  "processing-time-source" : 91,
  "processing-result.title" : "uiuc1_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/uiuc1_reddit.xml"
  }
}