{
  "processing-time-total" : 2075,
  "clusters" : [ {
    "id" : 0,
    "size" : 11,
    "score" : 36.124036247550706,
    "phrases" : [ "UIUC" ],
    "documents" : [ 3, 4, 7, 8, 21, 28, 38, 40, 42, 46, 49 ],
    "attributes" : {
      "score" : 36.124036247550706
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 59.17793672388779,
    "phrases" : [ "CS Class" ],
    "documents" : [ 4, 28, 30, 31, 33, 40 ],
    "attributes" : {
      "score" : 59.17793672388779
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 43.15497294239442,
    "phrases" : [ "Good god some People make me Question" ],
    "documents" : [ 3, 4, 7, 14, 38, 40 ],
    "attributes" : {
      "score" : 43.15497294239442
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 48.70125396882022,
    "phrases" : [ "Phone" ],
    "documents" : [ 3, 17, 19, 23, 25 ],
    "attributes" : {
      "score" : 48.70125396882022
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 33.25976687529511,
    "phrases" : [ "Probably not a Student" ],
    "documents" : [ 4, 7, 8, 13, 40 ],
    "attributes" : {
      "score" : 33.25976687529511
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 57.2311286973336,
    "phrases" : [ "Carry free Campus" ],
    "documents" : [ 4, 8, 15, 26 ],
    "attributes" : {
      "score" : 57.2311286973336
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 37.35560078943841,
    "phrases" : [ "Email" ],
    "documents" : [ 7, 40, 43, 47 ],
    "attributes" : {
      "score" : 37.35560078943841
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 42.434786323631634,
    "phrases" : [ "Friday" ],
    "documents" : [ 9, 39, 48, 49 ],
    "attributes" : {
      "score" : 42.434786323631634
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 103.78728340922059,
    "phrases" : [ "Physics Program" ],
    "documents" : [ 7, 28, 40, 42 ],
    "attributes" : {
      "score" : 103.78728340922059
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 50.14626346515604,
    "phrases" : [ "Student Group" ],
    "documents" : [ 3, 8, 22, 39 ],
    "attributes" : {
      "score" : 50.14626346515604
    }
  }, {
    "id" : 10,
    "size" : 4,
    "score" : 42.1441335144391,
    "phrases" : [ "Urbana Champaign" ],
    "documents" : [ 8, 17, 25, 42 ],
    "attributes" : {
      "score" : 42.1441335144391
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 40.31207887107367,
    "phrases" : [ "Color" ],
    "documents" : [ 14, 16, 47 ],
    "attributes" : {
      "score" : 40.31207887107367
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 38.562705486944225,
    "phrases" : [ "Drink" ],
    "documents" : [ 1, 14, 17 ],
    "attributes" : {
      "score" : 38.562705486944225
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 30.45221348088933,
    "phrases" : [ "IMPORTANT" ],
    "documents" : [ 3, 38, 41 ],
    "attributes" : {
      "score" : 30.45221348088933
    }
  }, {
    "id" : 14,
    "size" : 3,
    "score" : 57.48232904013365,
    "phrases" : [ "Wednesday" ],
    "documents" : [ 15, 27, 48 ],
    "attributes" : {
      "score" : 57.48232904013365
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 33.32947493940333,
    "phrases" : [ "Android" ],
    "documents" : [ 25, 32 ],
    "attributes" : {
      "score" : 33.32947493940333
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 46.79219462819544,
    "phrases" : [ "Caffeine Pills" ],
    "documents" : [ 33, 37 ],
    "attributes" : {
      "score" : 46.79219462819544
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 51.58508080310662,
    "phrases" : [ "Cash Games" ],
    "documents" : [ 3, 39 ],
    "attributes" : {
      "score" : 51.58508080310662
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 58.5210829901275,
    "phrases" : [ "Law Library" ],
    "documents" : [ 3, 10 ],
    "attributes" : {
      "score" : 58.5210829901275
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 40.82686286078786,
    "phrases" : [ "Musicians" ],
    "documents" : [ 1, 44 ],
    "attributes" : {
      "score" : 40.82686286078786
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 62.734320971925015,
    "phrases" : [ "Smell" ],
    "documents" : [ 5, 26 ],
    "attributes" : {
      "score" : 62.734320971925015
    }
  }, {
    "id" : 21,
    "size" : 13,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 2, 6, 11, 12, 18, 20, 24, 29, 34, 35, 36, 45 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1473,
  "documents" : [ {
    "id" : 0,
    "title" : "Found this in the laundromat on green and fifth",
    "snippet" : "  Yeah, I don't want to shit on anyone's religion, but I will admit that when I see these I take all of them so that I can throw them away. Same goes for Watchtowers. Really any religious pamphlets. Yeah, I don't want to shit on anyone's religion, but I will admit that when I see these I take all of them so that I can throw them away. Same goes for Watchtowers. Really any religious pamphlets. Scientology isn't even a religion as far as I'm concerned  I'm not sure what else you would call it at this point. A cult? Some would say that the difference between a cult and a religion is that a religion is a cult with a dead leader. But that saying itself presumes an awful lot about how we may or may not define both of those terms.\n\nA pyramid scheme? A scam? An international, transgenerational con? I couldn't possibly comment. Yeah, I don't want to shit on anyone's religion, but I will admit that when I see these I take all of them so that I can throw them away. Same goes for Watchtowers. Really any religious pamphlets.  At least the Gideons give away FREE Bibles...  There is a church of Scientology near john and I think its state. It just looks like a house with a sign attached to it and I silently laugh to myself everytime I see it.  I live half a block away from them.  It's fun to take their tests.\n\n\"Have you ever been sad?\"\n\nYes.\n\nYOU NEED AUDITING. There is a church of Scientology near john and I think its state. It just looks like a house with a sign attached to it and I silently laugh to myself everytime I see it.  There is a church of Scientology near john and I think its state. It just looks like a house with a sign attached to it and I silently laugh to myself everytime I see it.   Actually green and fourth, I don't know streets so well No you were right - its Green &amp; 5th   ",
    "url" : "http://imgur.com/fx9XROn"
  }, {
    "id" : 1,
    "title" : "I don't drink, will six pack suck for me?",
    "snippet" : "How about Allen? I don't smoke either, though.   You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live. You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live. You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live. When I went we did have a choice...\n\nWe got to rank our top 3, and my group of friends and I, about 10 of us, all listed Weston and all ended up in Weston. This was in 05 though so things may have changed.\n\nI can attest to the six-pack being very multicultural with a lot of different types of people and a very fun place to live. Probably a lot nicer now that they have air conditioning. They allow you to rank preference by complex/cluster (so instead of Weston, you would have to list Ikenberry North).  That said, there's still no guarantee that you'll get put into your preference (I lived in PAR last year and that wasn't my preference).  Everything turned out okay, though.\n\nIf you renew your contract for the next year, though, you get to select any room in any building on a first-come first-serve basis. You're going to have people that drink and people that don't drink no matter where you live.  People make a huge deal out of which building they live in (as if they really have a choice their first year) but honestly, I think that especially your freshman year, the experience is what you make of it.  Wherever you end up, you have to try to make it feel like home.\n\ntl;dr you'll be fine wherever you live.    If you got Taft Hall, submit a transfer request asap.  You will drink. Haha yeah, give them a semester and they will. Everyone \"doesnt drink\" when they first arrive and then realize it isnt going to get them sent to hell. 4th semester in, still don't drink.  Although I know I am a very rare breed here...  4th semester was when i started haha. It's not a bad thing but it's not something that you need to do daily, it's fun once a week Yeah for some I get that, I really just have no desire to though.   Everyone's different, usually when I go out I get a heavy dark beer and enjoy that all night, usually just one or two. Not a huge shot person You will drink.  My brother lived in Allen and loved it, apparently lots of theater people and musicians and it's a pretty tight-knit community. I lived in the six pack and enjoyed it just because you meet so many people, though may not be as good of friends with them as you would in Allen just because there are so many dorms and all eat at one dining hall. I'd say if you're into constant run-ins with new people and making lots of acquaintances then six pack should be fun even though you don't drink. Also location of classes might be a big factor in where you live. They're both pretty far from everything though. Allen hall is great because of it's people, and the events/lectures that take place within it. So are the classes and music rooms that they have too. Also, ground south is for lovers. Allen hall is great because of it's people, and the events/lectures that take place within it. So are the classes and music rooms that they have too. Also, ground south is for lovers. Ground South is the bastion of hope in a dorm filled with dirty hipsters and girls that are no fun. My brother lived in Allen and loved it, apparently lots of theater people and musicians and it's a pretty tight-knit community. I lived in the six pack and enjoyed it just because you meet so many people, though may not be as good of friends with them as you would in Allen just because there are so many dorms and all eat at one dining hall. I'd say if you're into constant run-ins with new people and making lots of acquaintances then six pack should be fun even though you don't drink. Also location of classes might be a big factor in where you live. They're both pretty far from everything though. My brother lived in Allen and loved it, apparently lots of theater people and musicians and it's a pretty tight-knit community. I lived in the six pack and enjoyed it just because you meet so many people, though may not be as good of friends with them as you would in Allen just because there are so many dorms and all eat at one dining hall. I'd say if you're into constant run-ins with new people and making lots of acquaintances then six pack should be fun even though you don't drink. Also location of classes might be a big factor in where you live. They're both pretty far from everything though.  They're just stereotypes for the two dorm locations... Just because you don't match the stereotype doesn't mean you won't have a good time.\n\nIt's not like everyone is going out 5-6 nights a week in the six pack, lol     whether you drink or not 6 pack is a great way to meet people and socialize. you'll still have lots of hilarious stories to tell people when you're done there  It's okaay to have a little bit of the sweet berry wine from time to time.  Just live in the six-prack.\nFor your dorms I appreciate the effort and love the show, but as a heads up novelty accounts don't work well on smaller subreddits It's okaay to have a little bit of the sweet berry wine from time to time.  Just live in the six-prack.\nFor your dorms       Being a sophomore here who doesn't drink, any building you will be in will have people drinking.  I lived in private housing and got lucky that my roommates really didn't drink in the room often, but regardless of where you are, the booze will follow.   Yeah I'm fine being around alcohol, it's not like I'm afraid of it or anything. It's just that I want to be able to have a good time without it, and I'm wondering if that's possible at six pack.    ISR is fine\n If a little smelly. Smelly? What?  LIVE IN ALLEN. No matter what, it's far superior to any other dorm.  It's this awesome community.   I haven't lived in either of those places, but my general experience is that people don't care whether you drink/smoke or not, and are certainly not going to shun you if you don't. Just have a good attitude and don't judge others for doing so, and after some time it will cease to be as big a deal as you are imagining it to be.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18utfq/i_dont_drink_will_six_pack_suck_for_me/"
  }, {
    "id" : 2,
    "title" : "Has anyone here taken or know someone who's taken SLAV 117? (Russian &amp; Eastern European Science Fiction)",
    "snippet" : "Hi! I don't plan on taking the class but I'm interested in what the required readings are. Does anyone happen to have a list?   When i took it Spring 2012 the required readings were: \"We\" \"R.U.R\" \"Saloris\" and \"The Star diaries\"\n\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/18v0j2/has_anyone_here_taken_or_know_someone_whos_taken/"
  }, {
    "id" : 3,
    "title" : "Student Athletes: The kings and queens of campus",
    "snippet" : "  ibooks are free...  ibooks are free...  ibooks are free...    There are so many things wrong with this article I do not even know where to start.  I mean I know this school isn't known for its liberal arts, but you would think a senior majoring in Journalism would know how to write a half-decent editorial. There are so many things wrong with this article I do not even know where to start.  I mean I know this school isn't known for its liberal arts, but you would think a senior majoring in Journalism would know how to write a half-decent editorial.   What a surprise, the DI is still garbage.\n\nI don't really get why the author doesn't understand that athletes put in effort for what they get.  I hope her next article is going to be about why every scholarship/award/career fair giveaway she isn't receiving is hugely unfair. \"Why can't **I** have what **those** people have worked for?!\" What a surprise, the DI is still garbage.\n\nI don't really get why the author doesn't understand that athletes put in effort for what they get.  I hope her next article is going to be about why every scholarship/award/career fair giveaway she isn't receiving is hugely unfair. What a surprise, the DI is still garbage.\n\nI don't really get why the author doesn't understand that athletes put in effort for what they get.  I hope her next article is going to be about why every scholarship/award/career fair giveaway she isn't receiving is hugely unfair.  First students who've studied abroad and now student-athletes. Any guesses on which demographic of students will be the next target of scorn by a DI \"opinions\" columnist?  Engineering: why do they get their own computer labs and free printing? Why is their library so big and why are there so many engineering buildings?  First students who've studied abroad and now student-athletes. Any guesses on which demographic of students will be the next target of scorn by a DI \"opinions\" columnist?   A lot of people are taking it to this writer in the comments, but I'd just like to note that while student-athletes devote a done of energy to the athletic parts of their life, there are many students who devote the same amount of energy to working (to help defray costs) and to internships on top of their schoolwork load. The real disconnect here, in my opinion, is that the 'money' sports of basketball and football have a whole set of advantages of available to those who participate in them that, say, tennis doesn't (unless you're a phenom who is able to go pro). It's the basketball and football folks who are the most well known and most likely to receive different treatment, wittingly or unwittingly, from people eager to see the big programs succeed.\n\n\nLastly, I'll note that someone in the comments on the DI article mentioned that the DIA is self-sustaining, but I would urge anyone who hasn't in the past to read up on athletic departments at major and non-major universities and colleges around the country. A couple of bad football/basketball seasons and then those same athletic departments are deep in the red feeding on the teat of the school. Just to think about it in a UIUC context for a moment, we may be asked in the upcoming student elections to add a fee for helping renovate Assembly Hall. Shouldn't the DIA have a better capital plan then relying on students for [nearly a fifth](http://www.news-gazette.com/news/university-illinois/2013-02-09/group-seeks-student-vote-fee-160-million-assembly-hall-renovatio) of costs? It's not like we get to go to games for free. Couple thoughts.  First of all, I agree with you, lots of students work their asses of with extracurricular activities.  And I think the football palum who said something along the lines of 'try walking a day in our shoes' gives current and former U of I athletes a bad name.  I'm fully aware that loads of people would have gladly worked their asses off to compete for U of I.  \n\nThe difference that I think is pretty important to note in regards to working/extracurricular vs sports is the time myself and many other athletes missed in the classroom.  I regularly had to miss classes/exams for competitions, hence the reason the DIA provides us with tutors.  With that said, I also regularly attended office hours too.  As a track athlete, I knew getting a degree was more important to my future than sports. \n\nAs far as Illini Athletics, the quick source I pulled from '09 said:\n\n&gt; Financially, Illinois operated in the black for the 17th straight year with a $70 million budget. \n\nwhich seems to show it's not quite as shaky as you're implying, those years including some garbage on the football and bball court\n\n[source](http://www.fightingillini.com/genrel/AnnualReport.html)  I didn't mean to imply that Illinois particularly is in bad shape, but just wanted to illustrate that a general trend in college athletics is very thin margins that disappear very fast for a lot of places. As for your link, it says Illinois was in the black for the 17th straight year at the end of 08-09, but that doesn't mesh with the N-G article I linked to which said that in 1997, the DIA was $1.3 million dollars in the red. One possibility is that under normal operations the DIA was scheduled or budgeted to run $1.3mln in the red in 97, but that passing the student fee then helped alleviate that.\n\nAlso, I wanted to mention that oftentimes non-athletes, like myself, overlook that athletes don't get to set their schedules the way a regular working student would so thanks for bringing that up. It's a lot easier to get a work/internship schedule around class and impossible to say, \"schedule this Big Ten conference matchup on another day please\" since athletes have no control over that. A lot of people are taking it to this writer in the comments, but I'd just like to note that while student-athletes devote a done of energy to the athletic parts of their life, there are many students who devote the same amount of energy to working (to help defray costs) and to internships on top of their schoolwork load. The real disconnect here, in my opinion, is that the 'money' sports of basketball and football have a whole set of advantages of available to those who participate in them that, say, tennis doesn't (unless you're a phenom who is able to go pro). It's the basketball and football folks who are the most well known and most likely to receive different treatment, wittingly or unwittingly, from people eager to see the big programs succeed.\n\n\nLastly, I'll note that someone in the comments on the DI article mentioned that the DIA is self-sustaining, but I would urge anyone who hasn't in the past to read up on athletic departments at major and non-major universities and colleges around the country. A couple of bad football/basketball seasons and then those same athletic departments are deep in the red feeding on the teat of the school. Just to think about it in a UIUC context for a moment, we may be asked in the upcoming student elections to add a fee for helping renovate Assembly Hall. Shouldn't the DIA have a better capital plan then relying on students for [nearly a fifth](http://www.news-gazette.com/news/university-illinois/2013-02-09/group-seeks-student-vote-fee-160-million-assembly-hall-renovatio) of costs? It's not like we get to go to games for free. Agreed.  I used to work for DIA.   While we are currently self sustaining, we spend money on the stupidest shit.  I would be specific but I'm sure my old boss or coworkers are on here and I don't want to be identified.  A lot of people are taking it to this writer in the comments, but I'd just like to note that while student-athletes devote a done of energy to the athletic parts of their life, there are many students who devote the same amount of energy to working (to help defray costs) and to internships on top of their schoolwork load. The real disconnect here, in my opinion, is that the 'money' sports of basketball and football have a whole set of advantages of available to those who participate in them that, say, tennis doesn't (unless you're a phenom who is able to go pro). It's the basketball and football folks who are the most well known and most likely to receive different treatment, wittingly or unwittingly, from people eager to see the big programs succeed.\n\n\nLastly, I'll note that someone in the comments on the DI article mentioned that the DIA is self-sustaining, but I would urge anyone who hasn't in the past to read up on athletic departments at major and non-major universities and colleges around the country. A couple of bad football/basketball seasons and then those same athletic departments are deep in the red feeding on the teat of the school. Just to think about it in a UIUC context for a moment, we may be asked in the upcoming student elections to add a fee for helping renovate Assembly Hall. Shouldn't the DIA have a better capital plan then relying on students for [nearly a fifth](http://www.news-gazette.com/news/university-illinois/2013-02-09/group-seeks-student-vote-fee-160-million-assembly-hall-renovatio) of costs? It's not like we get to go to games for free. Assembly hall is for far more than just the athletics.  One of the proposed features is air conditioning to host summer concerts and events.  Why should DIA have to pay for that?  Pretty impressive how ignorant and self serving this article is\n\nEdit: Also impressive how out of control reaction is getting That's why I posted it... I'm friends with some people in athletics who freaked the fuck out.   Honestly, I think this all could mostly be resolved if the players were allowed to get paid like every other profession. College sports are really messed up in this way. Colleges provide special treatment to their athletes to attract and sustain good athletes because good athletes are cash cows to the universities.\n\nLet the athletes get paid, and people like this writer will see the economic worth of certain athletes. Also, then the athletes don't need to be afforded special treatment.   Is Irwin open to all students? I saw a comment on the article saying that it was....but I didn't think so. I have heard of group projects happening there and student athletes inviting everyone to work at Irwin, but that's about it. It is open to all RSOs you must reserve a time spot which is pretty competitive but still open to people who are not NCAA athletes     Another gem from the DI....   The author doesn't seem to realize that the school needs these incentives to attract good athletes to the school, so the sports programs can continue to generate revenue for the school. You've been lied to my friend. You've bought into the mythos that College Athletics (a) make a profit, and (b) that profit (if it exists) is returned to the academic portion of the university. There are relatively few (think 4 or 5) universities in the nation where both (a) &amp; (b) occur. U of I is not one of those schools. \n\nWe, students/taxpayers/property owners, subsidize the costs of student athletes and collegiate athletics. It comes out of our tuition and taxes (sales/income/property). Any source for these claims?  http://usatoday30.usatoday.com/sports/college/story/2012-05-14/ncaa-college-athletics-finances-database/54955804/1\n\nIf you consider the subsidy, it's pretty much even. Thanks for the source, but those number still show that the athletic department made a profit. \n\n[This one states that as of '09:](http://www.fightingillini.com/genrel/AnnualReport.html)\n\n&gt; Financially, Illinois operated in the black for the 17th straight year with a $70 million budget.  Not sure what your point is.. Not yourself, but ewat85 claimed that the athletic department operates at a deficit, which is the reason I requested a source.  Your source says ewat85 is wrong.  I cannot show you a source because that is the problem with College Athletics; there is a MASSIVE reporting problem. The fact that I cannot show you a source has been the product of law review articles for decades. Because college Athletic Departments, and college athletics themselves, fall under the exempt function of each university there are very few requirements placed upon their financial accounting and reporting practices. As such, there is relatively little oversight into the expenses and revenue that the universities claim to be making and spending. The line between athletic and academic expenses is a blurry one and is being abused by most, if not all, universities in this country.\n\n\nFirst let me address your statement and your source. What does the statement \"Illinois operated in the black for the 17th straight year with a $70 million budget\" lead you to believe? It leads you to believe that U of I athletics netted a 70 million dollar profit. It is written to give you the impression that they made a ton of money. Now, look through the PDF provided with that statement. Where, under the finances section, does it say that U of I took in more revenue then it spent? Nowhere. Why is that? Because it's a BS statement. \n\nHow can we be sure that it is bullshit? Because under the finance section the total revenue and total expenses are exactly equal, down to the dollar. Go talk to a CPA, a business owner, an auditor, a tax attorney, anyone with oversight over a budget. Ask them how often total expenditures match total expenses. Now ask them how often it happens two years in a row. The answer will be NEVER. It never happens, and it ABSOLUTELY NEVER happens when your budget is $70+ million. So how is it possible for it to happen here? I mean surely U of I can't just lie about these numbers.\n\nIn fact, they can. The University of Illinois at Urbana-Champaign is a 501(c)(3) organization. It is tax exempt as both a government entity and as an education institution. The university files a form 990 every year in which they tell the IRS how much they make, how much their assets are worth, etc. etc. etc., what they don't tell them, and what they need not tell them, is how much money comes from each of their activities. It isn't required. Athletics is considered a tax exempt function and therefore is not broken down on the Form 990. The only information one receives is a single line under \"Miscellaneous Income\" that says \"Athletics Receipts.\" What does that mean? What is and is not included in \"Athletics Receipts.\" I can't find U of I's 2008 or 2009 return but in 2011-2012 U of I claimed ~ $3.5 million in athletics receipts. Lets just assume that U of I retained its perfect harmony on revenue and expenses for last year (which it will). What then is this $3.5 million in receipts? If expenses = revenue, what makes up this 3.5 million dollars? Why will this amount likely not be its own line on the DIA annual report? \n\nYour looking at this and saying \"So, what does any of this prove?\" \n\nSo... this shows you how little oversight there is. Athletics Receipts means something to the IRS but isn't a notation on the DIA expenses form. Expenses reported to the NCAA are different from expenses reported to the Department of Education, and different from expenses reported through the DIA. \n\nThere is no standardized accounting principle being employed by all the universities in the nation right now. There is no harmony between the numbers reported by the same institution to various organizations collecting data. What does this show? It shows that we have no idea what is being spent and where that money is coming from. Furthermore, there is little to no transparency within the Athletic Directors office. If U of I was doing such a great job of \"breaking even\" or \"turning a profit\" every year, one would think that they would be more than happy to release their books to the public. They don't and they won't. AD's are playing a shell game and they'll continue to do so until there is standardization, OR, until we once and for all treat college athletics like the money making enterprise it is and tax it. Until that time creative accounting will be used to hide the true costs of athletics from the people who are paying the price.\n\n\nSo, that wasn't very substantive, I know. However we can move on to a more concrete portion of my claim. If we take the USA Today table as true (which I would dispute) then you see that U of I averages ~$4 million in subsidies every year, or, $20 million from 2006 to 2011. That is money that comes from students and taxpayers. So ... that proves I'm correct at least to the extent that I claim that we, collectively, are subsidizing the Athletic Department. \n\n\nNow, I have a question for you. If U of I's athletic program gives back so much to the university, then, there should be some record of it somewhere. Why is it so hard to find that record?   I dont know, but you have my upvote - this was an incredibly well written explanation that deserves more upvotes than the athletics apologists in this thread. I cannot show you a source because that is the problem with College Athletics; there is a MASSIVE reporting problem. The fact that I cannot show you a source has been the product of law review articles for decades. Because college Athletic Departments, and college athletics themselves, fall under the exempt function of each university there are very few requirements placed upon their financial accounting and reporting practices. As such, there is relatively little oversight into the expenses and revenue that the universities claim to be making and spending. The line between athletic and academic expenses is a blurry one and is being abused by most, if not all, universities in this country.\n\n\nFirst let me address your statement and your source. What does the statement \"Illinois operated in the black for the 17th straight year with a $70 million budget\" lead you to believe? It leads you to believe that U of I athletics netted a 70 million dollar profit. It is written to give you the impression that they made a ton of money. Now, look through the PDF provided with that statement. Where, under the finances section, does it say that U of I took in more revenue then it spent? Nowhere. Why is that? Because it's a BS statement. \n\nHow can we be sure that it is bullshit? Because under the finance section the total revenue and total expenses are exactly equal, down to the dollar. Go talk to a CPA, a business owner, an auditor, a tax attorney, anyone with oversight over a budget. Ask them how often total expenditures match total expenses. Now ask them how often it happens two years in a row. The answer will be NEVER. It never happens, and it ABSOLUTELY NEVER happens when your budget is $70+ million. So how is it possible for it to happen here? I mean surely U of I can't just lie about these numbers.\n\nIn fact, they can. The University of Illinois at Urbana-Champaign is a 501(c)(3) organization. It is tax exempt as both a government entity and as an education institution. The university files a form 990 every year in which they tell the IRS how much they make, how much their assets are worth, etc. etc. etc., what they don't tell them, and what they need not tell them, is how much money comes from each of their activities. It isn't required. Athletics is considered a tax exempt function and therefore is not broken down on the Form 990. The only information one receives is a single line under \"Miscellaneous Income\" that says \"Athletics Receipts.\" What does that mean? What is and is not included in \"Athletics Receipts.\" I can't find U of I's 2008 or 2009 return but in 2011-2012 U of I claimed ~ $3.5 million in athletics receipts. Lets just assume that U of I retained its perfect harmony on revenue and expenses for last year (which it will). What then is this $3.5 million in receipts? If expenses = revenue, what makes up this 3.5 million dollars? Why will this amount likely not be its own line on the DIA annual report? \n\nYour looking at this and saying \"So, what does any of this prove?\" \n\nSo... this shows you how little oversight there is. Athletics Receipts means something to the IRS but isn't a notation on the DIA expenses form. Expenses reported to the NCAA are different from expenses reported to the Department of Education, and different from expenses reported through the DIA. \n\nThere is no standardized accounting principle being employed by all the universities in the nation right now. There is no harmony between the numbers reported by the same institution to various organizations collecting data. What does this show? It shows that we have no idea what is being spent and where that money is coming from. Furthermore, there is little to no transparency within the Athletic Directors office. If U of I was doing such a great job of \"breaking even\" or \"turning a profit\" every year, one would think that they would be more than happy to release their books to the public. They don't and they won't. AD's are playing a shell game and they'll continue to do so until there is standardization, OR, until we once and for all treat college athletics like the money making enterprise it is and tax it. Until that time creative accounting will be used to hide the true costs of athletics from the people who are paying the price.\n\n\nSo, that wasn't very substantive, I know. However we can move on to a more concrete portion of my claim. If we take the USA Today table as true (which I would dispute) then you see that U of I averages ~$4 million in subsidies every year, or, $20 million from 2006 to 2011. That is money that comes from students and taxpayers. So ... that proves I'm correct at least to the extent that I claim that we, collectively, are subsidizing the Athletic Department. \n\n\nNow, I have a question for you. If U of I's athletic program gives back so much to the university, then, there should be some record of it somewhere. Why is it so hard to find that record?   You're mostly just rambling here. This statement alone is enough nonsense to discredit everything else you said:\n\n&gt; First let me address your statement and your source. What does the statement \"Illinois operated in the black for the 17th straight year with a $70 million budget\" lead you to believe? It leads you to believe that U of I athletics netted a 70 million dollar profit. \n\nThat's not at all what that statement claims.  That's not what 'budget' means.  Even still, you've already lost all credibility by saying the athletic department operates at a deficit when sources prove otherwise. \n\nThe DIA pays for nearly everything with it's own revenue and donations from former athletes, such as myself, and not from your tax dollars or tuition costs.  Even without the subsidy, the athletic department made a profit. \n\nWith that said, these claims are far from the arguments brought up in the initial article.  You've been lied to my friend. You've bought into the mythos that College Athletics (a) make a profit, and (b) that profit (if it exists) is returned to the academic portion of the university. There are relatively few (think 4 or 5) universities in the nation where both (a) &amp; (b) occur. U of I is not one of those schools. \n\nWe, students/taxpayers/property owners, subsidize the costs of student athletes and collegiate athletics. It comes out of our tuition and taxes (sales/income/property). I wasn't aware that was the case here; however, the athletics benefit the school in other ways you may not have thought of.  For instance, it gives the school national attention, and sells lisenced merhandise.  Both of these things attract students who in turn pay those fees and taxes.  Just having your schools name out there increases applications. Out of state students also pay way higher tuition.  I do agree with your main point that the benefit of sports programs is overhyped.\n\nTyped on my phone in case there's grammar nazis.  ",
    "url" : "http://www.dailyillini.com/opinion/columns/article_826b725e-7a47-11e2-a1c6-001a4bcf6878.html"
  }, {
    "id" : 4,
    "title" : "Snobbery in the sub",
    "snippet" : "Hello /r/uiuc, I'm a big time lurker and I hate to break my trend of not-posting, but over the course of the past couple months I've noticed a worsening pattern of snobbery in this sub. There is an air of superiority among all the members here. I've never seen subscribers of the same sub, let alone student of the same school, tear each other apart like this.\n\nSo essentially, this is just me reminding everyone to notch it down a little bit.  There is no reason to get all aggressive and confrontational, nor is their reason to be condescending (that's a big one) or judgmental. We're supposed to be the best college sub, but if I were an objective observer and I just wandered into a random comment section, I wouldn't think so at all. Circlejerk central or dogs devouring dissenters left and right. So keep it classy, /r/uiuc, and let's remind everyone why we're the best sub around.     What the fuck did you just fucking say about me, you little bitch? I’ll have you know I'm at the top of my class, and I’ve been involved in numerous leadership roles in my school, and I have over 300 college recommendations. I am trained in writing essays and I’m the top essayist in the entire US. You are nothing to me but just another anti-Intellectual. I will wipe your chances of ever being on the top of your class mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my professors and my network of college deans across the US and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your education. You’re fucking uneducated, kid. I can be anywhere, anytime, and I can ruin your chances of getting into UIUC in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in memorizing SAT words, but I have access to the entire application process of the University and I will use it to its full extent to wipe your little miserable education off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you could have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking uneducated, kiddo. haha exactly, only subtle and said through tone and downvotes. Although there are some blatant assholes, most people aren't as explicit as that. woosh OP realized it was a joke... Yeah, thank you. Good god some people make me question how they got  in here. Yeah, thank you. Good god some people make me question how they got  in here. What the fuck did you just fucking say about me, you little bitch? I’ll have you know I'm at the top of my class, and I’ve been involved in numerous leadership roles in my school, and I have over 300 college recommendations. I am trained in writing essays and I’m the top essayist in the entire US. You are nothing to me but just another anti-Intellectual. I will wipe your chances of ever being on the top of your class mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my professors and my network of college deans across the US and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your education. You’re fucking uneducated, kid. I can be anywhere, anytime, and I can ruin your chances of getting into UIUC in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in memorizing SAT words, but I have access to the entire application process of the University and I will use it to its full extent to wipe your little miserable education off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you could have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking uneducated, kiddo.  I've only been around about a month, but I think the grand majority of everyone here is pretty nice. I don't let the occasional asshole bother me -- I've seen much ruder things said in other subs.   I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous. I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous. I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous. I have noticed this as well. I don't think I would enjoy meeting a large percentage of the users on here. Comments are often full of engineering snobbery, racism, or just general distain for anything that isn't fully serving the core demography of /r/uiuc, which is mostly STEM related. \n\nAlso, the negativity expressed towards the university, which all us of willingly attend, is not constructive in the least. I'm not saying don't criticize the university (after all, I am criticizing all of you) but at least don't turn every thread into a circlejerk about how tuition or admin pay is too high. \n\nAnd about tuition - for fucks sake - this is one of the top universities in the world (especially so if you are engineering), its a god damn good deal for the kind of education we are getting and the opportunities it will afford us in the future. Quit whining and realize your life is better than 99.99% of humanity ever had. The fucking *rage* that goes on here because of, what will eventually amount to in your life, a very small amount of money, is fucking ridiculous.  I honestly don't know what you're talking about. The only topic where I find /r/uiuc to be very biased is Greek Life. But besides that, I feel it is a superb sub.\n\nOh and btw, awesome username.  There's some racism too. But overall it's largely civil, considering how people are prone to saying offensive things when they think they are anonymous. There's some racism too. But overall it's largely civil, considering how people are prone to saying offensive things when they think they are anonymous. And engineering elitism, but let's be honest, it's warranted. Why do you think it's warranted?  And engineering elitism, but let's be honest, it's warranted. Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  I disagree. I'm basically being snobbish about spending $170,000 to get a piece of paper that improved my income potential by about 10%.  gnah, sorry, didn't mean to have it point at anyone in specific like that but that did eerily describe your flair haha. I edited it out.\n\nAnd, I understand that people work for their degrees, but I don't like when they expect credit for it on the internet. You don't have to edit it out. I only take offense to people who are trying to be assholes or know it alls (because in my mind, there's only room for one know it all in a conversation - me). Plus, I really only have energy for one feud at a time, and my energy's used up on /u/iam0594 haha alright well edited back in. \n\nYeah you and that guy get too heated and it's great to watch. Yeah it's amusing, I am trying to not read that thread for fear of laughing out loud and startling my officemate. haha alright well edited back in. \n\nYeah you and that guy get too heated and it's great to watch. haha alright well edited back in. \n\nYeah you and that guy get too heated and it's great to watch. You don't have to edit it out. I only take offense to people who are trying to be assholes or know it alls (because in my mind, there's only room for one know it all in a conversation - me). Plus, I really only have energy for one feud at a time, and my energy's used up on /u/iam0594 Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  Flair is helpful for context and sometimes pretty funny. \n\nI don't look at someone with \"English Major\" next to their username and think \"wow what a dumb fucker looks like someone's gonna be a barista someday\" the same way I don't see \"CS\" or \"CompE\" and think, \"great, another big dick smart motherfucker like me.\"\n\nYou're being overly sensitive. Most of the stupidity on this sub gets downvoted enough where you don't have to see it. Actually though, no, most of what gets downvoted is the dissenting opinion that the mass crowds disagree with. Rogue downvoting is one of the issues. Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  My flair describes my major Perhaps this is going over my head, but what major does the ampersand describe? Linguistics? Exactly. Loads of engineering elitism, but what bothers me is upperclassman elitism. In all honesty, I feel flairs should be removed from this sub. Listing yourself as a double major in NucE and Mathematics or a \"triple JD from way back when\" just seems very snobbish. I understand that it's your major and you work for it, but it promotes an attitude of superiority.  There's some racism too. But overall it's largely civil, considering how people are prone to saying offensive things when they think they are anonymous. I honestly don't know what you're talking about. The only topic where I find /r/uiuc to be very biased is Greek Life. But besides that, I feel it is a superb sub.\n\nOh and btw, awesome username.   Isnt it snobberish to tell people how to behave on a college subreddit?   My brain suffering from chronic lack of caffeine told me the title read \"snot in the sub\" and I came in looking to find out whether it was Jimmy Johns, Silver mine, subway, or the penn station. I'm relieved to learn that it was just me being stupid.   It's hardly a circlejerk here. I say this as someone who is far from the core demographic: female and a Social Work major. I have never felt unwelcome in this subreddit due to snobbery or other reasons. Most of the snobbery you perceive is probably intended as humor. The only troublesome aspect of this subreddit is occasional racism, since even if something is meant as a joke, it can still be hurtful and unwelcoming. Also, I wish /r/uiuc had more members who are in non-STEM related majors, but this is reddit. Undergrad in TESLand Linguistics. Gogo minority majors! Yay. There's even less people in your major than in mine! It's hardly a circlejerk here. I say this as someone who is far from the core demographic: female and a Social Work major. I have never felt unwelcome in this subreddit due to snobbery or other reasons. Most of the snobbery you perceive is probably intended as humor. The only troublesome aspect of this subreddit is occasional racism, since even if something is meant as a joke, it can still be hurtful and unwelcoming. Also, I wish /r/uiuc had more members who are in non-STEM related majors, but this is reddit. Also, sexism is almost nonexistent, other than the stray comment now and then complaining about women in engineering getting fellowships.\n Women in engineering should not get fellowships. They should get babeships. &gt; Women in engineering should not get fellowships. They should get babeships.\n\nSuburban Express guy /u/lubosubo, why don't you limit yourself to comments disparaging LEX? Engineering is slightly harder than bashing a rival bus company and being nasty to passengers, so you might want to back off.  Apparently everyone is disagreeing with you, but I think you're right.  Examples plox? Calling the subreddit \"circlejerk central or dogs devouring dissenters left and right\" is a pretty hefty claim. Sorry, that's just me novelizing what I see, not nearly as bad as that phrase makes it. But I'm not going to single out a poster and put the blame on them. Again, it's more just mentality that slightly leaks through tone than blatant posts.  Give us examples you passive aggressive LAS pussy. /s\n\nedit: but seriously. give us some examples. wtf is LAS.   The core concept of a circlejerk and dogs devouring each other are two entirely different things...do you even know what a circlejerk is?  http://www.reddit.com/r/uiuccirclejerk/ ohohoh The core concept of a circlejerk and dogs devouring each other are two entirely different things...do you even know what a circlejerk is?  That's why I listed both of them. If they were the same I would just type one or the other. Fine, so I interpreted your use of \"or\"  in a way you didn't use it. Would you care to link us all to specific examples so we actually know what you are talking about?   I have no clue what you're talking about.  Pretty much everyone in this sub is courteous.  Post some specific examples, or else I'll just assume you just posted this for attention. Actually, I guess the fact that I'm being accused of posting for attention immediately is proof in itself... Well when you make accusations you should have evidence.  I have no clue what you're talking about.  Pretty much everyone in this sub is courteous.  Post some specific examples, or else I'll just assume you just posted this for attention. I'd rather not post specific examples, and why would I post this for attention? This is my first post, ever. But the \"unsafe\" thread from the other day was particularly ridiculous.  You may be a little oversensitive.  I saw that post as \"Most of campus is pretty safe\", \"Unlit areas scare me\", and \"don't carry around a bunch of money\".  Not sure how that's \"snobbery\".   I doubt he is talking about that thread - the posts on that thread constitute the kind of stuff that would end up on subredditdrama. There have been posts like [this](http://www.reddit.com/r/UIUC/comments/18rkpz/why_does_it_smell_like_manure_near_isr/c8hj8pr?context=3) and [this](http://www.reddit.com/r/UIUC/comments/18h3kg/uiuc_sees_decline_in_asian_applicants_primarily/c8gr8rx?context=3), on the other hand, that are rather malicious. This is reddit.  Though those examples are bad, they are still not nearly as bad as reddit overall.  I'd say as far as reddit goes, this sub is pretty congenial.  The op didn't mention racism, or bigotry either.  For op's first post to be insulting the general user base is pretty offensive.  I'd say the vast majority of posters on this sub are pretty friendly.     You may be a little oversensitive.  I saw that post as \"Most of campus is pretty safe\", \"Unlit areas scare me\", and \"don't carry around a bunch of money\".  Not sure how that's \"snobbery\".   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18tx3a/snobbery_in_the_sub/"
  }, {
    "id" : 5,
    "title" : "What is the cause of that smell in the roger adams lab?",
    "snippet" : "  Probably has something to do with all the chemicals and shit\n   I wonder this every Tuesday and Thursday morning ASTRO 330 with bigdog? Ha yes   As long as it doesn't smell like almonds, you're probably fine. As long as it doesn't smell like almonds, you're probably fine.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18tj4j/what_is_the_cause_of_that_smell_in_the_roger/"
  }, {
    "id" : 6,
    "title" : "Tutor help for Math 234 and Chem 103",
    "snippet" : "I have my first hour exam tomorrow and I'm just going to spend all day in the Chemistry Learning Center, but for future reference, is there anyone who could possibly help me with these two subjects? Doesn't have to be the same person of course, but I am being swamped and stressed out by these two classes. If there's anyone who could help, please let me know as soon as possible. Much appreciated.\n\nEdit: I mean Chem 102  Chem 103 is a lab that doesn't have a midterm. I'm assuming that you mean Chem 102? Oh yeah XD Chem 102.  I got a B+ in it last semester, so I reckon I could help a bit with it. That would be fantastic! I mean I took 101 last semester and the sigma pi bonds and hybridization just went over my head  I'm in Chem 102 as well and I agree about hybridization being a bit confusing. He went over it too fast. :/\n\nHopefully you are able to get it by tomorrow evening. Good luck! :) That would be fantastic! I mean I took 101 last semester and the sigma pi bonds and hybridization just went over my head  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ut16/tutor_help_for_math_234_and_chem_103/"
  }, {
    "id" : 7,
    "title" : "Physics Majors",
    "snippet" : "So I'm looking to go into a physics major here at UIUC. I wanna ask all the physics undergrads and grads here: what's it like being a major in physics? and: What do graduate school look at when they evaluate your application? Do u feel worried that you won't find a job? Do you question your decision at times? What advice would you give to someone looking at a physics major and graduate school in physics in terms of research, specialization etc.?   I wasn't a student here, but I can answer some of your more general questions.\n\n&gt;What do graduate school look at when they evaluate your application? \n\nGrades, research experience, recommendation letters, subject GRE scores. An admissions person (at a *very* highly ranked school) told me once that they're looking for people who have at least three of those rated excellent or two outstanding.\n\n&gt;Do u feel worried that you won't find a job?\n\nNot really, but I'm not interested in a faculty position. The unemployment rate for physics PhDs is around 1%. If you're willing to sell your soul to the semiconductor or defense industries or go to the financial sector, you won't have any trouble. One of my friends who washed out of grad school (aka left with a masters) went and got a medical physics degree and is now quite happy doing medical imaging.\n\n&gt;Do you question your decision at times?\n\nI probably should have been an engineer or a chemist, but that's just me. I haven't closed any doors, but I certainly haven't been on the fastest path to get where I think I'm heading.\n\n&gt;What advice would you give to someone looking at a physics major and graduate school in physics in terms of research, specialization etc.?\n\nGet exposure to as many fields as you can. You never know what's going to actually strike a chord with you.  \n\nGet involved in research as soon as you can, but don't be afraid to change labs if it's a bad fit. That goes for grad school as well.  \n\nTake courses outside what's required. You never know when knowing how to write an efficient algorithm, speak a foreign language or quote classic literature is going to help you -- those are all real examples from my career so far!\n\nRelated to that: cross disciplinary work is the future for the sciences. Learn how to talk to chemists, biologists, etc. They're going to speak a very different language from you, especially in terms of mathematics. Who would you recommend a physics major too? As in, I am passionate about physics but am not sure if I have a very romanticized view of physics. What are some misconceptions that you might have had about a physics major that came up by surprise?     Senior in majoring in Engineering Physics atm. \n\nI came in with ap credit for Calc I and phys 211. I chose to take phys 211 to start where most other people did. The phys 211-214 courses weren't tough to me. I was in the first phys 225 course and enjoyed it because of the instructors that taught it at that time. I then took phys 325, and while it was tough, thoroughly enjoyed it because it was my first real physics course. Beyond this I have taken all of the regular physics curriculum (E&amp;M: 435/436, Quantum: 486/487, Stat Mech: 427, Labs: 401/403) and then some others (Thesis track: 496/499, Subatomic: 470), plus some upper astronomy courses. If you have questions on those feel free to ask. A lot of my time was working homework sets that could take anywhere from 1 to 10 hours depending on the course/professor. \n\nGraduate schools look at your GPA, GRE, PGRE (GRE physics subject test), research conducted, letters of recommendation, and personal statement. If you want to attend graduate school you should have some research done as an undergrad. This is not hard to obtain though. You can either go knocking on professors' doors or apply to external research programs such as REUs (Research Experience for Undergraduates). I did both, first by asking around the department when I was a sophomore to do research over that summer. Then by applying to REUs and getting to accepted to one at the Uni of Neb-Lincoln. I did physics and astronomy education research during these projects. Besides research you'll want some strong letters of recommendation which you can obtain from professor by doing research or being a really good student in their course (going to office hours, answering questions, etc.). Basically getting them to know your name and yourself. The other credentials come down to you studying and working hard in your courses and preparing for the standardized tests if you need too. \n\nI do not feel worried that I won't find a job because I'm choosing to stay in academia, a.k.a. going to graduate school. I was worried at first that I wouldn't get into a graduate school, so I applied to 11 schools. Some were \"safety\" schools, while others were hard to reach programs. I have gotten into several schools and will make my decision later this semester. I do not regret my decision to pursue graduate school because I am passionate about research and know this is what I want to do after talking to multiple professors about staying in academia. If you're interested in doing graduate school for physics keep this in mind, most programs will fund you if you are choosing to pursue a doctorate degree (which takes about 5-7 years). They will fund you through either a teaching assistant-ship, research assistant-ship, fellowship, or scholarship. For example, for the several places I've been accepted they are offering me a full tuition wavier and a stipend for being a teaching assistant during the school year. \n\nFor advice, I would say make sure physics is something you are passionate about. If you do not know what field you are interested in, start going to colloquiums here to get an idea of what each subfield is like. Also, you can get an idea about which field you like when you take the respective courses. For advice on finding research, just start asking professors through email, or knock on their door and ask them in person.  Don't give up and keep trying. \n\nUnfortunately I cannot give advice on being in graduate school, but I'm sure others can help with that. \n\nIf you have any specific questions about the undergraduate program here, feel free to ask.  Can you tell us what schools you applied to and where you got in. Really want to gauge myself to see where im headed for grad school. If you could give us info about the critical stuff (GPA, GRE, PGRE, LoRs, Research Experience) will be super helpful. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ty99/physics_majors/"
  }, {
    "id" : 8,
    "title" : "/r/UIUC, where do you feel unsafe around campus?",
    "snippet" : "I'm living around Springfield/Gregory next year, and I feel a little unsafe walking around at night.  So, tell me, is that a safe neighborhood?  Where don't you feel safe?  Where should the average person avoid at night while carrying lots of cash?  I wish they would fix some of these lights. There are points where it's just pitch black.  Parts of Urbana simply don't *have* street lights. Many of the neighborhood streets off of Washington, east of Vine, for instance. They cause light pollution or some such.\n\nSeemed to me to be just a greater liability to hit a pedestrian. To be fair, if you live east of Vine, you're probably not a student here. That is a long ways away. Farthest I've seen someone live without a parking pass on campus was Vine and Florida, and he usually just skips class because of the distance. To be fair, if you live east of Vine, you're probably not a student here. That is a long ways away. Farthest I've seen someone live without a parking pass on campus was Vine and Florida, and he usually just skips class because of the distance. To be fair, if you live east of Vine, you're probably not a student here. That is a long ways away. Farthest I've seen someone live without a parking pass on campus was Vine and Florida, and he usually just skips class because of the distance. I wish they would fix some of these lights. There are points where it's just pitch black.   Anywhere South of Green. Us engineers fear the outside world. Everything north of Green, there is no liquor north of there for biz majors. :p Anywhere South of Green. Us engineers fear the outside world.  Sadly, campus is actually the unsafe part of town.\n\nhttps://www.crimereports.com/map?CRSearch=urbana%20il\n\nStudents have the valuable property, so many times the bad elements come to campus to do their crimes. Sadly, campus is actually the unsafe part of town.\n\nhttps://www.crimereports.com/map?CRSearch=urbana%20il\n\nStudents have the valuable property, so many times the bad elements come to campus to do their crimes.  I feel unsafe near 1st and healy at 3am.  I'm so confused. Aren't Springfield/Gregory parallel?  I'm so confused. Aren't Springfield/Gregory parallel?    I feel the campus is quite safe.  Most people have blown it out of proportion due to overuse of crime alerts. I feel the campus is quite safe.  Most people have blown it out of proportion due to overuse of crime alerts. Agreed, I used to go on long walks late at night on the Urbana side of campus and never once felt remotely threatened.  I don't know, maybe that wasn't the smartest thing to do, but some people act like if you step foot outside after dark you are _definitely_ going to get mugged/murdered/raped.  Okay, first strike, don't carry large amounts of cash. In addition to possibly being robbed, you can also lose it. TCF and the UIUC Credit Union have free checking accounts for students and they give you a debit card. Use them. You can cancel a lost/stolen debit card. You can't get cash back if you lose it or it is stolen. \n\nSecondly, the only place I'd feel unsafe at night is north of University or on Green St at like 4am. But don't be an idiot. Be aware of your surroundings.  Don't use a checking account to store money in a bank if safety concerns you. It's not hard for someone to mug you at an ATM and force you to withdraw $1000 in less than a minute. Instead, you want to get a savings account attached to your bank account and only store a necessary amount in the checkings account. There's no way to access the savings account at an ATM. In all seriousness is that really a thing?  My credit union allows me to withdrawal from checking or savings from any ATM.  I thought this was universal. I think they used to be much more separate than they are now. In all seriousness is that really a thing?  My credit union allows me to withdrawal from checking or savings from any ATM.  I thought this was universal. I used to deposit my pay checks directly to my checkings account at the local bank and a bank teller once told me that it was \"not safe\" for me to have all my money in a checkings account for this reason. Perhaps she was just trying to get me to start a savings account? I'm assuming you're right.  I don't know much about banking, but if I had to guess I'd say banks can't invest with your checking but can with savings.  That's probably why savings generate interest and most checking accounts don't. Banks can't legally invest in regular savings accounts, that's why the return on them is shit.  There is no risk in checking or savings.   In all seriousness is that really a thing?  My credit union allows me to withdrawal from checking or savings from any ATM.  I thought this was universal. Don't use a checking account to store money in a bank if safety concerns you. It's not hard for someone to mug you at an ATM and force you to withdraw $1000 in less than a minute. Instead, you want to get a savings account attached to your bank account and only store a necessary amount in the checkings account. There's no way to access the savings account at an ATM. There's usually a $500 daily ATM withdrawal limit on those, so no. Right, because losing $500 is something you brush off. \n\nEDIT: Sorry, I misread Perrys comment and thus misunderstood yours. You are right, carry on.  I merely refuted his statement about checking accounts and a thousand bucks. Chill out. What part of that comment made you think I'm not chill? I'm falling asleep as I type. \n This is just beyond stupid. Please go on. Ok...? Did you not start it with your comment you thought was funny? Making more friends, I see. Don't use a checking account to store money in a bank if safety concerns you. It's not hard for someone to mug you at an ATM and force you to withdraw $1000 in less than a minute. Instead, you want to get a savings account attached to your bank account and only store a necessary amount in the checkings account. There's no way to access the savings account at an ATM.   Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... *White Street*? The *Six Pack*? Jesus, dude, I thought I was over-cautious. \n\nI'd call anything south of Columbia or Vine in Champaign about as safe as you can get (there are like $500,000 homes on Park, Church, and Hill). The only real problem is when you start getting up toward Bradley. Bradley and McKinley is no fun, but the most dangerous parts of the entire area are downtown Champaign and Green Street, frankly. (E: I'm thinking of Champaign west of the tracks, not east. Yeah, you don't want to be north of University in Champaign east of the tracks.)\n\nAnd the six pack? I never lived on campus, but isn't that the group of residences north of the ARC? I've never felt even slightly uncomfortable there except when I first visited Champaign (on Unofficial) and there were some loudmouth assholes there. But that's Unofficial, not a problem with the Six Pack. *White Street*? The *Six Pack*? Jesus, dude, I thought I was over-cautious. \n\nI'd call anything south of Columbia or Vine in Champaign about as safe as you can get (there are like $500,000 homes on Park, Church, and Hill). The only real problem is when you start getting up toward Bradley. Bradley and McKinley is no fun, but the most dangerous parts of the entire area are downtown Champaign and Green Street, frankly. (E: I'm thinking of Champaign west of the tracks, not east. Yeah, you don't want to be north of University in Champaign east of the tracks.)\n\nAnd the six pack? I never lived on campus, but isn't that the group of residences north of the ARC? I've never felt even slightly uncomfortable there except when I first visited Champaign (on Unofficial) and there were some loudmouth assholes there. But that's Unofficial, not a problem with the Six Pack. *White Street*? The *Six Pack*? Jesus, dude, I thought I was over-cautious. \n\nI'd call anything south of Columbia or Vine in Champaign about as safe as you can get (there are like $500,000 homes on Park, Church, and Hill). The only real problem is when you start getting up toward Bradley. Bradley and McKinley is no fun, but the most dangerous parts of the entire area are downtown Champaign and Green Street, frankly. (E: I'm thinking of Champaign west of the tracks, not east. Yeah, you don't want to be north of University in Champaign east of the tracks.)\n\nAnd the six pack? I never lived on campus, but isn't that the group of residences north of the ARC? I've never felt even slightly uncomfortable there except when I first visited Champaign (on Unofficial) and there were some loudmouth assholes there. But that's Unofficial, not a problem with the Six Pack. Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible... &gt;Anywhere north of White on the Champaign side between 1st and Wright\n\nWell, shit. I never really considered the area I live in (and am returning to next year) to be unsafe. I would say that University is the absolute cutoff, and White is actually a little better because of the constant stream of buses (Yellow, Brown, Teal, Red) that traverse it. &gt;Anywhere north of White on the Champaign side between 1st and Wright\n\nWell, shit. I never really considered the area I live in (and am returning to next year) to be unsafe. I would say that University is the absolute cutoff, and White is actually a little better because of the constant stream of buses (Yellow, Brown, Teal, Red) that traverse it. Springfield/Gregory in Urbana is actually pretty safe IMO. I walk past there regularly (live on Springfield/Busey) and I think that the Urbana area east of north quad is actually safer than a lot of areas in Champaign. \n\nPlaces where I don't feel safe: Anywhere north of White on the Champaign side between 1st and Wright, and the area around the six pack.\n\n\"Where should the average person avoid at night while carrying lots of cash?\"\n\nEverywhere? I'd avoid carrying lots of cash if at all possible...    I lived near Elm/Busey last year, and I had to walk down Western Ave (it's more an alley to be honest) at all hours of the day and night to get to lab. It's a bit sketchy I'll admit, but no one ever bothered me. I know someone was robbed earlier this year getting into a car in the parking lot at Springfield/Goodwin, but I don't think that was more chance than anything. In short, the neighborhood's alright.\n\n&gt; Where should the average person avoid at night while carrying lots of cash?\n\nEverywhere. Why would you carrying large amounts of cash at night?   Saferides are pretty awesome and free. Use them      Springfield and Gregory is quite safe.  I spent 2 years living on Springfield and Lincoln (and two years before that right over on Springfield and Green, and then one year after that just a block over on Springfield and Coler), never any issues in the area.  I'd say don't go North of University in the middle of the night and you're fine.  I feel much less safe south of Green st and West of 6th to be honest.\n\nIn general though, if you can avoid walking around alone in the middle of the night, do so.   I lived at stoughton and harvey, a block north from what you say... i never really had any problems... public safety building right there. but... keep south of university. also, who carries cash these days? There are very few crimes north of University unless you're near the student housing on Lincoln. No one's around looking for trouble since it's just a neighborhood. I walk back from downtown Champaign down Washington/Beslin/Fairview a couple times a year, and mostly it's nice old ladies out watering their flowers and some kids on bikes... It just looks super shady. Walk through the neighborhood at night alone when it gets warmer out. You won't feel safe. \n\nAnd technically you can classify every group of residences as \"just a neighborhood.\" Some neighborhoods are way worse than others. And some of these neighborhoods are right next to each other. \n\nExample: My parents live in an area where the average home is $500,000+ and there is little crime. I work 10 miles away in an area with stabbings, robberies, shootings, etc.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18sncm/ruiuc_where_do_you_feel_unsafe_around_campus/"
  }, {
    "id" : 9,
    "title" : "Looking for a ride",
    "snippet" : "My buddy and I are looking for a ride back to Chicago on friday/friday night-ish.  I live in Schaumburg and he's on the northside but really we'd just like to get anywhere near there.  So if you've got some extra room and would like some company we'll certainly pitch in for gas.\n\nThanks ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ua0t/looking_for_a_ride/"
  }, {
    "id" : 10,
    "title" : "Found some interesting books in the law library. ",
    "snippet" : "   Take it from someone who works in the library - there's a lot more interesting stuff in there. go on... -hardcore pornography\n\n-journal of the National Association for Gravestone Studies (only interesting to me? okay)\n\n-diaries of cult leaders\n\n-firsthand accounts of alien abductions\n\n-Encyclopedia of Girl Culture\n\n-Voynich manuscript\n\n-fundamentalist Christian sex manuals\n\n-minstrel show catalogs\n\n-newspapers from the last two centuries (ever wonder what the front page said on D-Day? or the day Kennedy was assassinated?)\n\n-so much pornography\n\n-did I mention the porn\n\nAnd this is just off the top of my head. I should really start keeping a list of some of the weirdest requests we've gotten. All of this is in the law library? go on... I agree, if you know better post better! We're interested.   Are you Justin Trapp",
    "url" : "http://i.imgur.com/T1oxXhZ.jpg"
  }, {
    "id" : 11,
    "title" : "Urban Outfitters celebrates Presidents Day by showcasing one of our greatest presidents, Benjamin Franklin. ",
    "snippet" : "  Alice Cooper?  Also seems to be a founding father of ICP  There's an asterisk in fine print on the bottom that acknowledges that Ben Franklin wasn't a President. Then there's something about today being all about the Benjamins.  There's an asterisk in fine print on the bottom that acknowledges that Ben Franklin wasn't a President. Then there's something about today being all about the Benjamins.  [deleted] What does that have to do with anything? Is he.... flirting with us? [deleted] [deleted]       ",
    "url" : "http://i.imgur.com/pYdipg7.jpg"
  }, {
    "id" : 12,
    "title" : "Anyone work at Courier Cafe?",
    "snippet" : "Their milkshakes are amazing. Anyone know what kind of ice cream they use?  blue bunny.  i work at silvercreek and make the maintenance dude bring me a strawberry from time to time.  thanks! do you know if they use strawberry ice cream for the strawberry milkshakes? or just plain vanilla all the way? yeah i want a recipe these are the jam blue bunny.  i work at silvercreek and make the maintenance dude bring me a strawberry from time to time.  Hey, can you tell the head chef something?  I love eating at Silvercreek, but the last few times I've gone in there there's been *nothing* on the menu that didn't include either mushrooms or seafood - and I'm allergic to both.  A little variety would be nice, and if I'm gonna pay $20 for a plate of food I shouldn't have to eat around parts of it.\n\nIt's making me pretty sad, because the times I've eaten there in the past, the food and service were wonderful! we take subs on all our items or like in the instance of the filet, we could whip you up some demi glace without shrooms.  im glad to hear you enjoy us tho. we are always trying to send out the best and most creative dishes in CU! Yeah, but you've got them in all the potatoes too... they said there was no way to get non-shroomy potatoes. :(\n\nThanks! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18sovr/anyone_work_at_courier_cafe/"
  }, {
    "id" : 13,
    "title" : "To date, my favorite spot on campus.",
    "snippet" : "  why? For a few reasons:\n\n1. There's usually nobody around, so it's a nice place to mellow out and study. \n\n2. There's three floors of math texts, which is freakin' awesome.\n\n3. The glass floors give it a special ambiance that I haven't yet been able to duplicate anywhere else.\n\n4. I've got a feeling that there's probably a secret passage somewhere, that I've yet to find. It's Altgeld, after all.\n\nBut yeah. You should check it out sometime! This submission is funny because it comes close to the /r/bestof problem.\n\n* \"What is your favorite subreddit?\"\n* \"My favorite subreddit is this one, because there are so few people there that I can mellow out\"\n* Subreddit permanently ruined For a few reasons:\n\n1. There's usually nobody around, so it's a nice place to mellow out and study. \n\n2. There's three floors of math texts, which is freakin' awesome.\n\n3. The glass floors give it a special ambiance that I haven't yet been able to duplicate anywhere else.\n\n4. I've got a feeling that there's probably a secret passage somewhere, that I've yet to find. It's Altgeld, after all.\n\nBut yeah. You should check it out sometime! Hmm, we need a math building...I know, let's duplicate a German castle! For a few reasons:\n\n1. There's usually nobody around, so it's a nice place to mellow out and study. \n\n2. There's three floors of math texts, which is freakin' awesome.\n\n3. The glass floors give it a special ambiance that I haven't yet been able to duplicate anywhere else.\n\n4. I've got a feeling that there's probably a secret passage somewhere, that I've yet to find. It's Altgeld, after all.\n\nBut yeah. You should check it out sometime! Will do my friend. Btw...WHERE IS THIS! I know you said altgeld, but where in altgeld? (im a new transfer student.)  my room is my favorite spot (really). i don't understand why some people don't like being in their rooms   Gonna have to check this out before I graduate. Never been inside this part of Altgeld. Just follow the signs to \"stacks\" behind the desk Is anyone allowed in there? I always thought that the librarians had to get those books for you!   Where exactly in altgeld is this? I thought the library only had one floor...   ",
    "url" : "http://i.imgur.com/sJnRQQv.jpg"
  }, {
    "id" : 14,
    "title" : "Triptych Brewing opening up today in chambana",
    "snippet" : "The tasting room will be open, beginning today, with normal hours from 3pm to 10pm. \n\n 1703 Woodfield Drive\nhttp://triptychbrewing.com.\n\n\nWhat's on tap?\n\n\n\n* De Light Blonde - A light, crisp American blonde featuring a touch of citrusy hops.\n\n* Dirty Hippy - A Dark English mild, this low alcohol beer is overflowing with notes of toffee and caramel.\n\n* 70 Minus - Another low alcohol session beer featuring a strong malt backbone followed by characterful earthy and woody highlights. Finishes with a touch of smoke.\n\n* Spring in Amarillo - A red ale dominated by a fruity maltiness and finishing with a touch of citrus from the exclusive use of Amarillo hops.\n\n* Blueberry Blonde - Our Light blonde with a twist: lots of blueberry. This pink/purple ale features a sweet, blueberry aroma. Flavored with blueberry juice and a touch of blueberry concentrate for aroma.\n\n* Pale Ale - One of our many pale ale recipes, this iteration contains a mix of piney and spicy hops. While it finishes decidedly crisp and bitter, there is also a persistent maltiness for balance.\n\n* Skajaquada - \"Ska-jack-wa-dah\" is our take on a Cascadian Dark Ale. While dark, almost black in color, it lacks the roasty, acrid character usually associated with black beers and instead features copious amounts of hops giving it a firmly bitter finish.\n\n* Valentine - Demonstrating our seasonal whimsy, this chocolate cherry stout was brewed especially for our February opening. Aged on a combination of all-natural Montmorency cherry puree and cocoa nibs, this is truly a dessert beer. Served on nitrogen for a creamy, luscious finish.  I don't hit reddit often but when someone mentioned this thread in the tasting room last night, I thought I would bite.\n\nI am the head brewer at Triptych, one of the three owners, and I suppose you can ask me anything. Here are some answers to the other questions:\n\n* What is the deal with the low ABV beers?\n\nAs someone else already mentioned, ABV doesn't really correspond to flavor. Our tasting room is meant to be a place you can hang out for a while, play a game of chess/cribbage/cards/whatever, and since it is the middle of winter and a little bit off the beaten path, I thought it might be nice to have some beers that you can enjoy quite a lot of without getting hammered. I did this with mostly British styles, following the tradition of a British \"session\", see http://en.wikipedia.org/wiki/Drinking_culture#Session_drinking Also, I knew a lot of our initial visitors would be our Kickstarter supporters, many of whom were friends and family that while they appreciate our dream, they aren't quite craft beer enthusiasts yet, and so I wanted to have a range that they could enjoy as well.\n\n* Perhaps super high alcohol beers take longer to brew?\n\nThe time difference is pretty negligible, the answer is pretty much the same. I wanted to encourage some social session engagement without making it impossible for people to get back home after an evening at the tasting room. When spring and summer start rolling around and it becomes biking weather, I'll put some more higher abv beers on.\n\n* Growlers\n\nFills are currently between $14-16. And until March 2nd, we're participating in a food drive so if you bring in a non-perishable canned good, we're taking a buck off a growler fill. We sell growlers but we are also happy to fill ANYONE ELSE's 64oz growler too.\n\n* Future beers\n\nI have a significant stable of beer recipes; the idea is that every couple of weeks there is something new on tap at the tasting room. Immediately coming up we have an Imperial IPA and an English Pale ale. Following that will be a number of German lagers. We also have a couple of beers aging in Buffalo Trace Bourbon barrels.\n\nI hope folks will give us a chance. I think our prices are competitive with craft offerings you find elsewhere and as someone else mentioned, we've tried to set up a space/place/brewery that is pretty much all about beer.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  &gt; - 3. Spring in Amarillo\n&gt; \n&gt; Red Ale, 30 IBU, 5.9% ABV\n&gt;\n&gt; - 6. Pale Ale\n&gt;\n&gt; American Pale Ale, 47 IBU, 4.6% ABV\n&gt;\n&gt; - 7. Skajaquada\n&gt;\n&gt; Cascadian Dark Ale, 90 IBU, 6.8% ABV\n&gt;\n&gt; - 8. Valentine\n&gt; Cherry Chocolate Stout, 23 IBU, 6% ABV\n\nThere might be some correlation with just opening and not having super high alcohol beers. Perhaps they take longer to brew? I saw that. Still somewhat low for what they are in my opinion. Your point is definitely valid. For me, drinking a 3% ABV sounds like drinking water, especially at the cost I imagine they are charging for them.  I saw that. Still somewhat low for what they are in my opinion. Your point is definitely valid. For me, drinking a 3% ABV sounds like drinking water, especially at the cost I imagine they are charging for them.  I saw that. Still somewhat low for what they are in my opinion. Your point is definitely valid. For me, drinking a 3% ABV sounds like drinking water, especially at the cost I imagine they are charging for them.  Does Guiness taste like water to you? It's weaker than Bud Lite. There's more to beer than ABV - if you're looking for ABV, go buy some cheap vodka. Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.  Why are all these beers such low ABV? 3%? That's less than bud light. Not too appealing to me.    What are the prices per growler? What are the prices per growler?   That's a terrible location.  Wish you guys the best, but you will have trouble staying in business that far away from campus and the downtowns. Perhaps, but I guess I should also mention that you will find our beer at several downtown locations in the near future. I heard that the order of distribution will be Radio Maria, Blind Pig and Big Grove Tavern (in that order). Can you confirm? That's a terrible location.  Wish you guys the best, but you will have trouble staying in business that far away from campus and the downtowns. That's a terrible location.  Wish you guys the best, but you will have trouble staying in business that far away from campus and the downtowns.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rv6o/triptych_brewing_opening_up_today_in_chambana/"
  }, {
    "id" : 15,
    "title" : "This week at ISS...",
    "snippet" : "This Wednesday (2/20/2013), the ISS will consider (item - summary):\n\nExecutive Orders\n\n1. EXO.2013.28 (ISS) Committee Appointments - Filling vacancies on ISS internal committees.\n\nResolutions for Action\n\n1. IA.2013.34 Reporting for Campus Referendums - The Campus Student Election Commission is urged to track student money spent in support of referenda questions.\n2. IA.2013.35 A Resolution to Support Student Invention &amp; Innovation - A taskforce is created to award small grants to students wishing to file patents.\n3. FA.2013.30 Student Invention Support - The grants for the taskforce are allocated.\n4. *Statement Against a Nuclear Capable Iran** - The ISS stands in solidarity with the letter [\"Prevent Iranian Nuclear Capability\"](http://www.aipac.org/en/resources/aipac-publications/publication?pubpath=PolicyPolitics/Press/AIPAC%20Statements/2012/12/AIPAC%20PRAISES%20STRONG%20BIPARTISAN%20SENATE%20LETTER%20URGING%20FURTHER%20PRESSURE%20ON%20IRAN) (scroll down for full text of the letter).\n\nResolutions for Information\n\n1. Support for Marriage Equality - Supports marriage equality legislation in Illinois.\n2. Carry Free Campus: Statement of Inclusion to the General Assembly - Discussed statements made to the Illinois House Judiciary Committee and their inclusion in law.\n3. Carry Free Campus:Thank You - Thanks people involved in the Carry Free Campus initiative.\n4. Clerks - Adding additional senate clerks to spread the workload.\n5. Increased Autonomy of Committees = Allows ISS committee chairs to add additional committee members.\n\nReports for Information\n\n1. State of the Carry Free Implementation Status\n\n*This resolution has not been approved by the ISS Committee on Community and Governmental Affairs, but it might be soon. Expect it to be added to the Agenda at the meeting.\n\nThe full agenda can be found [here](http://ge.tt/7bZlUqY/v/0?c).   So... can we make this *not* a carry free campus? Is anyone with me in supporting an initiative to the contrary? The campus is already carry free *for students, faculty, and staff*. They're trying to make it totally carry free, so the police can turn away people trying to bring weapons onto an unarmed campus. So, how does this get enforced?  Exactly. How much is enforcing this ridiculous addition to make it totally carry free going to cost us? The campus is already carry free *for students, faculty, and staff*. They're trying to make it totally carry free, so the police can turn away people trying to bring weapons onto an unarmed campus. The campus is already carry free *for students, faculty, and staff*. They're trying to make it totally carry free, so the police can turn away people trying to bring weapons onto an unarmed campus. So... can we make this *not* a carry free campus? Is anyone with me in supporting an initiative to the contrary?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18stwb/this_week_at_iss/"
  }, {
    "id" : 16,
    "title" : "Orange Krush reveal their true colors at Northwestern Sunday night",
    "snippet" : " ",
    "url" : "http://www.youtube.com/watch?v=E_pUy-x3cUo&amp;feature=youtu.be"
  }, {
    "id" : 17,
    "title" : "Tin Roof Tavern Urbana?",
    "snippet" : "I'm wondering if anyone has been to this bar yet?  The interwebs still don't have info about whether it has opened yet, or even a phone number.  I appreciate the neglected small neighborhood bars.  They are super rare down here.  Back home there was a neighborhood bar every few blocks (Irish-German blue collar town).  Drinks are cheap, and there's no pretentiousness in the people or the food.  I went to Mug Shots a few times and thought it was okay, and I really like Boomerangs.  Only (possible) problem with Boomerangs is that most women usually don't want to go, because we normally end up at the Bullet.\n\nIf you've been, reviews?  Haven't been but I'm pretty sure it is the same owner at Mug Shots. If you like those types of bars you should also check out Pias, Tumble Inn, JonEB's, Hubers, The Ice House, and D.R. Diggers. Also, in downtown Urbana Bunny's and Rose Bowl are right up that alley and in downtown Champaign the Brass Rail and the Pheonix are like that too. Haven't been but I'm pretty sure it is the same owner at Mug Shots. If you like those types of bars you should also check out Pias, Tumble Inn, JonEB's, Hubers, The Ice House, and D.R. Diggers. Also, in downtown Urbana Bunny's and Rose Bowl are right up that alley and in downtown Champaign the Brass Rail and the Pheonix are like that too. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18t0ks/tin_roof_tavern_urbana/"
  }, {
    "id" : 18,
    "title" : "Is anyone in CS 418 and interested in meeting up to study for the exam tonight?",
    "snippet" : "I posted in the Piazza to no interest. I think studying with one or two other people could be great considering we have no received no guidance for the exam.   hahahah\nthat was gold when he showed it.\nsorry bro, I would have loved to but was too busy figuring out wtf was gonna be on the exam to check reddit lol\nnext time?  Haha next time for sure. I bombed that exam. \n  no",
    "url" : "http://www.reddit.com/r/UIUC/comments/18sdse/is_anyone_in_cs_418_and_interested_in_meeting_up/"
  }, {
    "id" : 19,
    "title" : "What happened with this Juicy J show? Looking for sources. Whoever has them message me here or send e-mail to music@readbuzz.com",
    "snippet" : "  From what I heard someone who was supposed to back the event withdrew a bunch of money and they didn't have enough money to pay Juicy.  Sucks too, I'm out $60 for 3 tickets and have been shut down in every way regarding refunds. From what I heard someone who was supposed to back the event withdrew a bunch of money and they didn't have enough money to pay Juicy.  Sucks too, I'm out $60 for 3 tickets and have been shut down in every way regarding refunds. From what I heard someone who was supposed to back the event withdrew a bunch of money and they didn't have enough money to pay Juicy.  Sucks too, I'm out $60 for 3 tickets and have been shut down in every way regarding refunds.  The domain was registered through DomainsByProxy. The phone number is a crappy little disposable Cricket phone. The page is so hilariously shitty, it's incredibly unlikely that the person who made it had any intention of coming off as \"professional.\"\n\nIn short, it was a scam. The domain was registered through DomainsByProxy. The phone number is a crappy little disposable Cricket phone. The page is so hilariously shitty, it's incredibly unlikely that the person who made it had any intention of coming off as \"professional.\"\n\nIn short, it was a scam. ",
    "url" : "http://readbuzz.com/music/2013/whos-got-the-juice"
  }, {
    "id" : 20,
    "title" : "Fellow grad students, did you get paid less this month?",
    "snippet" : "People in my department are getting smaller paychecks than we usually do (by $50-100) for February. Word on the street is that we are paying social security now, which was exempt for full time students previously. Can anyone verify this? HR has been unhelpful beyond stating the withheld amount is correct.    I voted for an increase in taxes in November! #Obama2012!! Woohoo!!! Why are my taxes higher now? WTF?  Full-time students are still exempt. Go talk to payroll in Henry Admin Building. The nice young lady (if you needed more incentive than money to go, she's cute, but married) is fully aware that this is a problem and is working to try to fix it... but she needs to know who she needs to fix it for.   It has to do with social security, according to another T.A. complaining about this issue on facebook. http://blogs.wsj.com/economics/2013/01/01/payroll-tax-cut-expires-how-much-more-will-you-pay/\n\nand Obama was the one to push the payroll tax in the first place, YouCanThankObama. Neither party pushed it through this time around, so you can thank both democrats and republicans.  It has to do with social security, according to another T.A. complaining about this issue on facebook. http://blogs.wsj.com/economics/2013/01/01/payroll-tax-cut-expires-how-much-more-will-you-pay/\n\nand Obama was the one to push the payroll tax in the first place, YouCanThankObama. Neither party pushed it through this time around, so you can thank both democrats and republicans.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18s999/fellow_grad_students_did_you_get_paid_less_this/"
  }, {
    "id" : 21,
    "title" : "Are there ever raves at UIUC?",
    "snippet" : "So my friends and I got into going to concerts like Paper Diamond, Emancipator and Baauer, and we wanted to go to an actual rave, are there ever any here?  The closest thing to a rave you'll get in Champaign is a show at the Canopy Club.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rsb0/are_there_ever_raves_at_uiuc/"
  }, {
    "id" : 22,
    "title" : "Humanist Meeting Tuesday at 7",
    "snippet" : "Hey guys, if you identify yourself as a(n) humanist, atheist or agnostic, come out on Tuesday to this discussion group! This week we will be discussing Feminism and Atheism+.\n\nLocation: English Building Room 107b (there will be a sign outside the door)  What about it? Any particular topics?   is this a student group? sounds like my kind of thing. Yes, a student group, you should come try it out! i might. how long do the meetings last? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18s20j/humanist_meeting_tuesday_at_7/"
  }, {
    "id" : 23,
    "title" : "Has anyone lost a cell phone outside of CRCE on February 18th in the morning? I might have it :)",
    "snippet" : "I found it as I was walking to catch the Teal and I assumed it would be easy to find the owner but I didn't realize I can't unlock it or read texts that say who to contact if the phone is found. I figure I'll post here in the mean time.\n\nPM me the details of the cell phone so I can verify that you're the owner and I will try to get it back to you as soon as possible.\n\nEdit: CRCE has the phone now so if you were the one who lost it, you can pick it up over there  Give it to member services at CRCE. I called CRCE and gave them my contact information. When I'm around that area, I'll give it to them.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18r9te/has_anyone_lost_a_cell_phone_outside_of_crce_on/"
  }, {
    "id" : 24,
    "title" : "Would anyone be up for a FIFA 13 tournament on the PS3?",
    "snippet" : "I was thinking maybe a 16-32 player tournament.  I'd be in also. Anyway we could make it for the Xbox 360?      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ry5u/would_anyone_be_up_for_a_fifa_13_tournament_on/"
  }, {
    "id" : 25,
    "title" : "lost an iPad in everitt",
    "snippet" : "I was in the student lounge and left my iPad on the desk. it'd be great if anyone could help. I already checked the lost and found.  do you have find my iPhone activated on it?\n \"everyone who owns an ipad has an iphone, yes that's so very true.\"\n-owner of an ipad and android phone    I accidentally left it behind after I left Everitt. I know for sure someone picked it up and accessed my Facebook through his/her home internet connection. I'm just thinking about how much authorities could do if I reported it along with the IP address. Unfortunately, find my iPhone was not activated.   does anyone know who specifically I should report this to for best results? campus police, champaign police, urbana police? don't really know. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rc98/lost_an_ipad_in_everitt/"
  }, {
    "id" : 26,
    "title" : "Why does it smell like manure near ISR?",
    "snippet" : "There is a pungent smell of farm animals all around the ISR area. It subsides as you walk West but over here by ISR it smells like Wilbur's smelly butthole.  wind coming in off south farms most likely wind coming in off south farms most likely   I'm assuming you're new to the area. The first week of spring, if you live on campus, you will smell like horse shit. There is no way to get around this.  Horse shit? From the South Farms? There are mainly cattle at the South Farms. So basically, you don't know shit.  Wind carrying smell from the farms south of campus. Its just fertilizer     [deleted]  high concentration of foreigners is to blame",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rkpz/why_does_it_smell_like_manure_near_isr/"
  }, {
    "id" : 27,
    "title" : "Free burritos this Wednesday from Cactus Grill",
    "snippet" : "   ",
    "url" : "http://deals.centralillinoissavings.com/deal/cactus-grill"
  }, {
    "id" : 28,
    "title" : "Let's make an \"Easy A\" list! What's the easiest class you've taken at UIUC?",
    "snippet" : "I feel like this would be a really useful list for everyone looking to boost that GPA. Try to give as much info about the class as possible i.e. professors, major assignments, etc.\n\nMy contribution: Sociology 160: Social Change and Global Development.\n\nThe course met twice a week, ended early every day, like 6 lecture got cancelled during the semester, one super easy paper, and two easy tests that were essay style and you got 100% is you had attended the review session the night before. Ended the class with 124% - A+++ lol  It's been a while, so I don't remember the names... but...\n\nbowling, tennis, ice skating, weight lifting, sex ed, and an Asian Studies class taught by a gay Filipino man from Chicago chronicling the life of a gay Filipino man from Chicago. The Prof was very most likely Manalansan.  STAT 100 with Fireman was really easy and fun. STAT 100 with Fireman was really easy and fun.  * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n Is FSHN 304 even still offered anymore? * KIN 102 and 107, bowling and canoeing respectively. \n* FSHN 304 - Wine tasting\n* RLST 104 and 110\n  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  A trained monkey could pass ATMS100. ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.  ATMS120 with Snodgrass, and ATMS100 with Frame. I was an atms major so my opinion may be biased.   I know I'm \"that guy\" but I'd like to implore you all not to take a class for an \"easy A\". \n\nYou will inevitably be too busy the rest of your life to just sit and learn about things that interest you. You'll have a job, a family, and grown up social things to do, so you probably won't have time to learn about american indian history, or how to skate properly. \n\nSo if you really want that A, then yeah, go for it. But if you see a class that's a *little bit* harder but actually interests you, do it instead. You'll still get an A if you actually like learning about it. \n\nYou're supposed to be here to expand your mind and find your interests, not get a GPA. But if all you're here for is to learn about your future employers and make them think you're smart, you can go ahead and do that too. some of the easiest classes unrelated to my major have been some of the most interesting I have taken though. I by no means want a career in horticulture or meteorology, but hort 105 and atms 120 are pretty interesting in addition to being generally easy  For engineers with a tech elective requirement, I'd recommend NPRE 402. HW is due every lecture, but it might take 20 minutes at the most. Basic chemistry and algebra. For engineers with a tech elective requirement, I'd recommend NPRE 402. HW is due every lecture, but it might take 20 minutes at the most. Basic chemistry and algebra. For engineers with a tech elective requirement, I'd recommend NPRE 402. HW is due every lecture, but it might take 20 minutes at the most. Basic chemistry and algebra.    My freshman year Acting professor also taught THEA 101. I never took it, but he himself said it was the easiest class on campus. J.W.? Yip I took the theatre major equivalent. One of my favorite professors I've had at this university. My freshman year Acting professor also taught THEA 101. I never took it, but he himself said it was the easiest class on campus.  ASTR 100 with Bryan Dunne was easy and fun. any 100 level with Dunne! I got an A+ in the class! \n   ANTH 143. It met once a week, had no tests, and there was only a little bit of homework.   I think it should also be listed what gen-ed requirements they fill.       HTLR420 NPRE 481    CLCV 116 and LING 100 were pretty easy and also thoroughly interesting.         Adv 300 - advertising 100\n\nStat 100 and 200  Could you elaborate on Advertising? I am interested in taking a few advert classes and was wondering what they are like in term of the materials, how the classes were run, and workloads.     MCB 432  ITT: CS and ECE kids joke about CS 473, ECE 391 being easy, having hot chicks. Both ECE391 and CS473 are easy for me. For those people who don't think them easy, ask yourself, do you really spend every minute in your life on that class? No pay, no gain.\n Those classes were designed to be difficult, those who are motivated or enjoy the subject do well because they dont mind the work that it requires, those who are not struggle. This goes for many of the other upper level classes people find hard\n      ATMS 120 - awesome class, in it now\nNRES 100 \nANSC 250 -cats and dogs fun class\nACE 161 - alex lo is the man and it is just on microsoft office programs\n     ECON 202, didn't go to lecture so I missed a quiz or two, but got an A in the class.   PHYS 583. Easiest class ever.  Care to elaborate? I'm interested in physics, but I'm ChemE and looking to take some easy, fun physics classes.  IB361 was an easy A for me. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18q3uu/lets_make_an_easy_a_list_whats_the_easiest_class/"
  }, {
    "id" : 29,
    "title" : "Does anyone know of a place on campus where I can get my laptop keyboard repaired? (PC)",
    "snippet" : "Title says it all. One of the keys, along with the rubber cap, fell off of the keyboard. CITES doesn't do hardware repairs, and the Illini Tech Center only services Apple computers, so I'm not sure what to do. Thanks guys.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18rfwh/does_anyone_know_of_a_place_on_campus_where_i_can/"
  }, {
    "id" : 30,
    "title" : "Technical Systems Management with a Business Minor - your thoughts?",
    "snippet" : "I am cosidering majoring in TSM and getting a Business Minor. I am just wondering if anyone here is in TSM, or knows somebody who is in it. How did they like the classes, the department, the job prospects, etc. Just trying to get a general opinion.\n\nhttp://abe.illinois.edu/courses/tsm  Ask Dr. Harper how difficult it is as a TSM major to get into the business minor program.  I plan on applying to the business minor next January (they only accept applications in January now, and I missed it this time around).\n\nLast I heard, it wasn't too difficult as long as you met the GPA/prerequisite class requirements.\nAre you implying it is easy or difficult for TSM majors?\n\nI've been taking BADM and ACCY classes in preparation for this, so it would be a real bummer if I wasn't able to get in.\n\n\n\nedit: I misspoke. The May application period is still active until January 2014 I was in TSM for a semester. I got rejected while I was in it. I switched back to stats/cs and was accepted. My gpa did go up but not by too much. As for the TSM major, it wasn't what I thought it'd be and it sure as hell wasn't for me.   I am good friends with 2 people who are graduating from the program this May, both of which already have solid jobs lined up with energy/ag companies. What companies, and what positions? If you dont mind me asking.  I'm currently in TSM with 2 semesters left after transferring from Ag &amp; Bio Engineering, but am not really familiar with the business minor.\n\nAs far as the major itself I am really enjoying it. You have to take some 100/200 level soils/cropsci/etc but for the most part you are able to choose from a pretty wide selection of TSM, ABE, and ACE classes. \n\nBased on this flexibility, the job prospects are strong in number and diversity. I know of seniors in my classes who have secured jobs with ADM, John Deere, Caterpillar, countless farming input sales, and other commercial construction/farming companies (as well as some random trading and accounting). TSM is already under under ABE I thought?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18qono/technical_systems_management_with_a_business/"
  }, {
    "id" : 31,
    "title" : "Looking for a partner for CS 450 homework!",
    "snippet" : "This class is much more difficult than I thought, and I'm in desperate need for someone to work with. Please PM me if you're interested in getting a group together to finish this work. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18qnso/looking_for_a_partner_for_cs_450_homework/"
  }, {
    "id" : 32,
    "title" : "New UI Dining app for Android and iOS",
    "snippet" : "  This isn't necessarily new. It's just and update. They added a feature to check your balance which is a very nice improvement.  This isn't necessarily new. It's just and update. They added a feature to check your balance which is a very nice improvement.    Do you guys still get nut encrusted pork loin every other day? ",
    "url" : "http://www.housing.illinois.edu/app"
  }, {
    "id" : 33,
    "title" : "Best Caffeine Pills?",
    "snippet" : "Vivarin or generics... need something to get me through MT season... any thoughts?    Ummm... just don't.  Get sleep.  You can do it.  I'm going to be graduating undergrad in 4 years total with a Masters in CS and I sleep 9 hours a day... you will be more productive overall and anything else is just trading your health for grades, a really bad idea in the long run. I can't stand this response. It's possible to get through any program here sleeping 12 hours a day. You just can't do anything else. If you'd actually like to push yourself and take advantage of the ridiculous tuition, *try*. It gets easier in a couple months, and you're actually doing shit. Not sure I agree.  I feel I do more than most of my peers here.  I tend to do 15 hours of all technical classes per semester, plus a 20 hour a week part time job and an EOH exhibit.  Sure I'm not really in RSO's (except a few brief ACM stints), but like I said I have a plenty active social life on top of the resume crap.  I actually get much more done sleeping 7-9 hours than I did sleeping 3.  That's not to say that I never pull the odd all-nighter when deadlines pile up, but I really think that your cognitive skills decrease with lack of sleep and though you can convince yourself you're doing more you're actually limiting academic performance and in my experience mental health (I've had some pretty intense depersonalization periods after a few months of &lt;3hrs/night). Like I said, it gets better after a couple months. And there are plenty of ways to avoid the dead end thinking that happens during severe sleep deprivation, not the least of which is doing work with classmates. I'm extremely active in a number of RSOs, while founding another. It makes it worth it. That being said, I've also been sick relatively often, and the crashes over breaks are hard. So there may be a better middle ground. Ummm... just don't.  Get sleep.  You can do it.  I'm going to be graduating undergrad in 4 years total with a Masters in CS and I sleep 9 hours a day... you will be more productive overall and anything else is just trading your health for grades, a really bad idea in the long run. [deleted] I consider my social life just fine.  Plenty of friends and a relationship that takes up quite a bit of my time. Then you are a more efficient man than I.      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18q837/best_caffeine_pills/"
  }, {
    "id" : 34,
    "title" : "Help the Student Senate create a more efficient/accountable student government (referenda petition)",
    "url" : "https://illinois.edu/fb/sec/632204"
  }, {
    "id" : 35,
    "title" : "NPRE 402 Midterm advice?",
    "snippet" : "So the first midterm for NPRE 402 is tomorrow, and I'm wondering what it'll be like. Obviously this class gets recommended as an easy tech elective for engineers and I've been doing fine on the homework so far. However, I have no clue what the exam will actually be like, because Ragheb doesn't mention anything about the format and the TAs only say that its mostly calculations. \nI've gone over the past homework and made sure I can do them, but still concerned as to what's expected from us. Will studying the homework cut it? I feel like I haven't done enough to prepare but I don't know what else I could do other than go over the homework and the notes again.\n\nAnyone else take this class recently? Any help on what to expect in terms of format? Any help is much appreciated.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18qcs6/npre_402_midterm_advice/"
  }, {
    "id" : 36,
    "title" : "Has anyone taken Math 416 with Dutta?",
    "snippet" : "The first midterm is coming up this week and I was wondering if any of you would be able to comment on his exam difficulty and grading. Thank you!  i took 415 with him. So this isn't exactly the same but I\"ll make some comments anyway. His tests weren't too bad. Since it was 415 there was a lot of computational questions which if you practiced did not take long at all. The proofs were also a breeze having taken 347 I was used to those kinds of things. So all in all I think he was a fair grader. But of course this is a completely different class. So YMMV.\n\nDoes he still do that thing were he says \"isn't it?\" a lot? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18pabr/has_anyone_taken_math_416_with_dutta/"
  }, {
    "id" : 37,
    "title" : "Where can I get late night coffee on campus?",
    "snippet" : "Studying late sometimes, need coffee to function. Anyone know where I can get some late nights?  Merry-Ann's diner is probably your best bet. Or IHOP.  But both will have lots of drunk people. Or IHOP.  But both will have lots of drunk people. Merry-Ann's diner is probably your best bet. I guess they didn't specify that they wanted *good* coffee you aren't going to find that anywhere on campus that isn't paradiso  I wish I knew about this when I was still in school - http://www.amazon.com/Aerobie-AeroPress-Coffee-Espresso-Maker/dp/B0047BIWSK/ref=sr_1_1?ie=UTF8&amp;qid=1361116153&amp;sr=8-1&amp;keywords=aeropress Looks like a glorified syringe. It makes a fantastic cup of coffee and is cheap and portable. Even most of the snobs at r/coffee agree. It makes a fantastic cup of coffee and is cheap and portable. Even most of the snobs at r/coffee agree.     [deleted]  If you've got a meal plan, the Caffeinator is open till 1. Not super conveniently located, but it's an option. cafe credits can be used there?   Define 'late'. Are you talking past midnight, or just at like 11 at night? Im talking 1:30 am   caffeine pills, yo caffeine pills, yo",
    "url" : "http://www.reddit.com/r/UIUC/comments/18oju7/where_can_i_get_late_night_coffee_on_campus/"
  }, {
    "id" : 38,
    "title" : "Does anyone have experience with being readmitted after being dropped?",
    "snippet" : "Basically I was just wondering if anyone had personal experiences with this situation. I myself was dropped from EE after Spring '12 and have found that I really don't have a lot of people to go to to talk about the situation. I'm starting to put together my petition to return now and I just get nervous thinking about whether or not I'll be readmitted to EE. Any stories or experiences welcome!  Returning students definitely happen! Be very forthright about what you changed in the last year that makes it more likely that you will make it this time. Any changes you've made that make you sound more like an \"adult\" are very good. Did you make any changes like this?\n\nGood luck! Yes, I am doing my best to make positive lasting changes. I took up a volunteer opportunity at the Champaign library, found employment, and I am taking relevant classes at Parkland (Calc3,Phys 212,213,214,CS125). Although I am running out of classes to take since I transferred to UIUC as a sophomore having already been an undergraduate engineer at another big University. My biggest worry is that making the required changes in how I approach class, homework, studying has been a bumpy road. Prior to the '11-'12 school year most things had come very easily to me and thus I really didn't see education as a challenge but more of an obstacle to a job. I actively cut corners and rarely did work outside of class. It has been battle but I am making great strides in how I approach work for class and also how to overcome difficult parts in the material. Most importantly for me though was the overall change in how I view education. My time away from the University has been humbling. The only problem has been that initially I thought I would give them a perfect transcript from Parkland (full loads, straight A's- something that couldn't be questioned), and now there is a B or two sitting in there along with an online class I dropped with a W and it worries me. I'm pretty settled in Champaign now and I would not like to move again (having already transferred once). \n\nedit: Thank you for the response by the way. It really is nice to talk to someone about this stuff in a relaxed way. It is kind of a taboo thing to talk about with fellow students and the faculty(folks at Everitt and Engineering Hall) can vary on their degree of helpfulness. Dude, this sounds exactly like my story, except for the transferring part. I'm at community college right now too, and I expected to get straight As but I ended up doing just as bad as I had been doing at U of I, two Ds and a B last semester, not even a full time student. I had such a good work ethic in high school too, mainly because it was just so much easier. I'm getting my associates degree at the end of this semester. Yes, I am doing my best to make positive lasting changes. I took up a volunteer opportunity at the Champaign library, found employment, and I am taking relevant classes at Parkland (Calc3,Phys 212,213,214,CS125). Although I am running out of classes to take since I transferred to UIUC as a sophomore having already been an undergraduate engineer at another big University. My biggest worry is that making the required changes in how I approach class, homework, studying has been a bumpy road. Prior to the '11-'12 school year most things had come very easily to me and thus I really didn't see education as a challenge but more of an obstacle to a job. I actively cut corners and rarely did work outside of class. It has been battle but I am making great strides in how I approach work for class and also how to overcome difficult parts in the material. Most importantly for me though was the overall change in how I view education. My time away from the University has been humbling. The only problem has been that initially I thought I would give them a perfect transcript from Parkland (full loads, straight A's- something that couldn't be questioned), and now there is a B or two sitting in there along with an online class I dropped with a W and it worries me. I'm pretty settled in Champaign now and I would not like to move again (having already transferred once). \n\nedit: Thank you for the response by the way. It really is nice to talk to someone about this stuff in a relaxed way. It is kind of a taboo thing to talk about with fellow students and the faculty(folks at Everitt and Engineering Hall) can vary on their degree of helpfulness. If I was the readmission person in charge of reviewing your application, and you said exactly what you just said, I would have no problem with bringing you back in. Further, you admit that there were some classes you had difficulty with. That's no biggie. I did community college for a few semesters and not everything was As. As long as you're upfront about it, and explain what was difficult, I bet you'll be good (I had problems with discrete math, it just wasn't my forte). I do hope to write something similar in my petition although in the actual directions for the petition it warns against superficial claims. This makes me worry that some of the stuff won't be taken seriously when it's actually huge change/improvement for me. Either way your post made me feel good and a little more optimistic! Thank you!  Yes.  I made an appointment to talk to the department's Dean personally, so I could talk over the circumstances that had led to my awful semester, the game plan for improving my performance and keeping myself on track, and generally just try to make the best impression possible.  It worked.  I was dropped in spring 12 also, and I'm trying to transfer to UIC because I think it might be easier to get into. Am I wrong? Is it still the same process since it is within the University of Illinois system? I never looked into UIC.\n\nedit: By same process I mean; do you fill out a petition or is it like applying to any other University? I think it's like applying to another University. They do ask if you've been in the U of I system to provide your UIN, so it's different in that aspect. Hopefully since I've been in the system they'll accept me.  I was dropped and readmitted in 2004. I had some time to show that I had become more responsible and was ready to make the appropriate commitment. Before reapplying I spoke with a counselor who reminded me that I was let into the university originally because they thought I was capable. Focusing on your growth and changes you've made, as Hippity suggested, is really sound advise. Remember your previous success and don't doubt you can do it. I was nervous reapplying but when I got back in, it was like a new lease on life. Good luck! Numerous counselors have given me the exact same advice. Whenever I get down on myself I think about that and it gives me hope. They let me in this University once, it shouldn't be unreasonable to think that I could make it back. It's nice to hear from someone who made it back! Thanks!  Yep. I did just that and an in my 1st full year back after doin a year at a CC. I spoke to my counselor during the reapplication period to make sure all my T's were crossed and I's dotted, and I heard back within around 2 weeks. If you can give them some solid and legitimate reasoning behind why you were dropped and how you plan to change that I've heard the odds are typically good for readmittance.  Just wondering. What do you mean by crossing T's and dotting I's? I've spoken with the secretary for the deans at engineering hall about getting the actual petition form and then again to clear up some questions I had, but I've never actually sat down and talked my situation through with someone.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18nbvy/does_anyone_have_experience_with_being_readmitted/"
  }, {
    "id" : 39,
    "title" : "Anyone play poker?",
    "snippet" : "I'm looking for a regular (weekly?) NLHE game.  Not super fussy about the stakes, just looking to get out of the house an have some fun with a good group.  I prefer cash games to tourneys, but am open to whatever.  Anyone know of a game that might have a seat available?   you missed a huge boat back in '04-07, our school produced a lot of top cash players and some even joined those \"instructor\" sites.\ni still remember daily cash games in carr hall with the RA. every thursday friday the asians had cash games in both lounges in FAR. there was a game everywhere, all student orgs would host poker tourneys as charity events, there were .50/1 &amp; 1/2 games every 3 blocks. \n\ni don't know what happened by towards the end of my tenure, the school started cracking down everywhere, dorm games were done, all orgs were reprimanded if they hosted and there were obviously fewer cash games.\n\nfor those that are in school now, how is the current popularity?  you missed a huge boat back in '04-07, our school produced a lot of top cash players and some even joined those \"instructor\" sites.\ni still remember daily cash games in carr hall with the RA. every thursday friday the asians had cash games in both lounges in FAR. there was a game everywhere, all student orgs would host poker tourneys as charity events, there were .50/1 &amp; 1/2 games every 3 blocks. \n\ni don't know what happened by towards the end of my tenure, the school started cracking down everywhere, dorm games were done, all orgs were reprimanded if they hosted and there were obviously fewer cash games.\n\nfor those that are in school now, how is the current popularity?    I'm interested, and I have cards and chips. pm if you want to play  I'm interested, and I have cards and chips. pm if you want to play                     Put me on the list too 8472718539. \n\nI think the first thing to do would be to find someone willing to host? Anyone here have an apartment with a decent sized table with chairs?\n\nA couple friends and I play bi weekly but there isn't enough chairs to have more people over.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18m7ti/anyone_play_poker/"
  }, {
    "id" : 40,
    "title" : "Just got admitted, but not into the program I wanted. ",
    "snippet" : "Hello! I applied for the Computer Science program in the college of engineering, and while I did get into the University, I didn't get into the program I wanted so I selected the Undeclared option\n\nHow hard is it to transfer into Computer Science in the College of Engineering?\n\nThanks!  dont assume anything, it is getting harder and harder to get into cs, talk to the department and get a clear list of requirements and cutoffs before making a final decision.  Whom specifically should I contact in the department? the engineering department website isn't really leading me to anywhere useful right now... steve herzog, he is the go to undergraduate advisor for CS. I dont have his email on me right now but Im sure it can be easily found. Thanks! You are fantastic! Just talked to steve today for a class change. Amazing guy Haha, I've heard that you can go in there, have a really friendly chat with him, but not actually get an answer to your question.  This exact story has led to most of the really really sad endings that I have witnessed for UIUC students. If you ever get a C+ or lower in a math, chem, or CS class, the Engineering college will tell you to keep retaking courses until you have a high enough GPA to transfer. This causes a ridiculously high amount of denial and retakes among undeclared students. When you fail Chem 102 and retake it, getting a C, your GPA is terrible. The kicker: if you don't have at least a 2.0 overall GPA after 2 years, *it is impossible to transfer to any major*. \n\n* If you get a C+ or lower in a math or chem or CS class, abandon your plan.\n\nDisclaimer: This is my personal opinion and like I said this is not the official stance of the Engineering college or the Engineering advisers. I'm not even sure it is the official stance of the undeclared advisers. \n\nThe lesson that OP should take from this is that if you got rejected from the major you wanted, you should think seriously about coming here. There is absolutely no guarantee that you will transfer, and you should not come unless there are multiple majors that you would be happy completing. A student without a backup plan is in a very risky situation. A student with a backup plan is totally ok! There's a lot of realistic advice here, but I had a different story. I ended up getting a C- in math 241, with D's and F's in my other classes. I actually got placed on academic probation cause my gpa was so low but I still went to see one of the assistant deans about transferring into MechE. He literally told me that I had no chance of transferring in and even if I got A's for every class from there on out, I still wouldn't get in. It was heart-breaking at the time but I'm pretty stubborn. Long story short, I worked my ass off for a year, and without getting all A's or anywhere close to the \"required\" 3.8, still managed to transfer successfully. My roommate just transferred into CS as well, and while it wasn't pretty, since I don't think he even had a 3.0, he still ended up getting in. So I guess everyone's story is different.  There's a lot of realistic advice here, but I had a different story. I ended up getting a C- in math 241, with D's and F's in my other classes. I actually got placed on academic probation cause my gpa was so low but I still went to see one of the assistant deans about transferring into MechE. He literally told me that I had no chance of transferring in and even if I got A's for every class from there on out, I still wouldn't get in. It was heart-breaking at the time but I'm pretty stubborn. Long story short, I worked my ass off for a year, and without getting all A's or anywhere close to the \"required\" 3.8, still managed to transfer successfully. My roommate just transferred into CS as well, and while it wasn't pretty, since I don't think he even had a 3.0, he still ended up getting in. So I guess everyone's story is different.  This exact story has led to most of the really really sad endings that I have witnessed for UIUC students. If you ever get a C+ or lower in a math, chem, or CS class, the Engineering college will tell you to keep retaking courses until you have a high enough GPA to transfer. This causes a ridiculously high amount of denial and retakes among undeclared students. When you fail Chem 102 and retake it, getting a C, your GPA is terrible. The kicker: if you don't have at least a 2.0 overall GPA after 2 years, *it is impossible to transfer to any major*. \n\n* If you get a C+ or lower in a math or chem or CS class, abandon your plan.\n\nDisclaimer: This is my personal opinion and like I said this is not the official stance of the Engineering college or the Engineering advisers. I'm not even sure it is the official stance of the undeclared advisers. \n\nThe lesson that OP should take from this is that if you got rejected from the major you wanted, you should think seriously about coming here. There is absolutely no guarantee that you will transfer, and you should not come unless there are multiple majors that you would be happy completing. A student without a backup plan is in a very risky situation. A student with a backup plan is totally ok! Mr academic advisor sir, what GPA's do you normally see getting accepted into engineering CS and LAS CS + math? I don't know about engineering CS, because I'm not a CS adviser. Sorry! I do know that they would love to take people and they aren't being jerks, but they refuse to take so many people that CS 225 will overfill. It makes sense, really.\n\nLAS math/cs has a straight-up transfer criterion but it is 3.20 GPA in specific difficult courses, which is really hard. I like guaranteed transfer criteria. But they cause problems for high-demand courses. See http://www.las.illinois.edu/students/programs/declaring/ for LAS's transfer criteria. Just as an advisor, how do you really feel about DGS here? Mr academic advisor sir, what GPA's do you normally see getting accepted into engineering CS and LAS CS + math? This exact story has led to most of the really really sad endings that I have witnessed for UIUC students. If you ever get a C+ or lower in a math, chem, or CS class, the Engineering college will tell you to keep retaking courses until you have a high enough GPA to transfer. This causes a ridiculously high amount of denial and retakes among undeclared students. When you fail Chem 102 and retake it, getting a C, your GPA is terrible. The kicker: if you don't have at least a 2.0 overall GPA after 2 years, *it is impossible to transfer to any major*. \n\n* If you get a C+ or lower in a math or chem or CS class, abandon your plan.\n\nDisclaimer: This is my personal opinion and like I said this is not the official stance of the Engineering college or the Engineering advisers. I'm not even sure it is the official stance of the undeclared advisers. \n\nThe lesson that OP should take from this is that if you got rejected from the major you wanted, you should think seriously about coming here. There is absolutely no guarantee that you will transfer, and you should not come unless there are multiple majors that you would be happy completing. A student without a backup plan is in a very risky situation. A student with a backup plan is totally ok! [deleted]  You might also consider the CS minor. Like others have said, transferring to CS from undeclared will be very, very difficult.\n\nAs someone who hires people for IT positions, I would likely put someone with a CS degree or a CS minor for many positions. If on the other hand, you are really wanting to be a programmer's programmer, CS is almost certainly where you want to end up. In my experience, being a programmer and having a CS degree from UofI are two very separate things.  Almost every class tells you that they are teaching you concepts, not how to program.  If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc. In my experience, being a programmer and having a CS degree from UofI are two very separate things.  Almost every class tells you that they are teaching you concepts, not how to program.  If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc. In my experience, being a programmer and having a CS degree from UofI are two very separate things.  Almost every class tells you that they are teaching you concepts, not how to program.  If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc. &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post?  I transferred into engineering after attending Parkland for 2 years, no one I knew who applied to transfer to an engineering program got denied (granted everyone I knew who was applying at a 3.0 or higher).  From what I have heard, it is actually easier to transfer from another school than to transfer from another college at UIUC.  If I had to do it over again, I would start at Parkland again, the quality of teaching for the basic calculus and physics is worlds better than what I saw at UIUC.   I transferred into Computer Engineering after 3 semesters at a community college. I've been told the same thing, outside transfers are easier (as long as you're an Illinois resident). [deleted] Are you sure you want to transfer that late? Why not apply to transfer for this coming fall? I see no benefit in waiting another 1.5 years. I'm getting a full ride at UIC right now (grants cover everything) and by the time I transfer for Junior year I'll have $15k+ saved from my job, which would put me on track for graduating with zero debt. So there's that.  The CS department has an increasing enrollment, and is trying to prevent hordes of students from transferring in, and in particular, it is going to be harder to do it in the future. This said, if you have high GPA - you are always going to be able to transfer in. After all - why would CS not want to accept *good* students?\n\nThis said, if you got accepted to CE in ECE then it is very similar to CS. It is a good program in a good department, and you should completely go for it.\n  Are you Undeclared as in you are in DGS or in Undeclared as in the new Undeclared option for Engineering?   I am in the same boat. \n\nhttp://provost.illinois.edu/programs/advising/ICT%20Engineering.html\n\n\nThis should help. Notice that there is **no GPA that guarantees transfer** to engineering, please. And a 3.0 is not a trivial task when your schedule is calculus, physics, chemistry, and rhetoric. So what is the relevance of my link? Is it a guideline or...? It's a minimum. If you read it closely, you'll note that it says if you meet those requirements they \"will consider\" you for transfer.  So what are more realistic requirements? If a person can maintain an A/B/B+ average while completing all of the Junior year transfer requirements, and demonstrate that they taught themselves the basics of a programming language in their free time by then - that's a pretty good indication of probable success completing the degree. It is a difficult program, but it's worth it and very doable with dedication.  I know people who have done it, but I'm sure it's hard. Also you contribute to the overscheduling of classes (as in there are too many people who sign up for classes and there aren't enough seats.) But good luck, the CS program is awesome. It's not too bad. Did it fall of last year, and all Herzog wanted was to see if I did well in CS 173, CS 225, and ECE 190.  What was your GPA?    also consider the Math and Computer Science and Statistics and Computer Science programs, as both are LAS. No offense but this does not hold nearly the same value, which is why a lot of people don't see that as a option It doesn't hold the same value, or students don't perceive it to hold the same value. Nobody ever asked me what department I got my degree in. Just what I got.  They don't have to ask if it's on your resume \"BS in Mathematics and Computer Science\" doesn't sound any worse than \"BS in Computer Science.\" No one is going to pay attention to whether your degree comes from LAS/Engineering.  No offense but this does not hold nearly the same value, which is why a lot of people don't see that as a option No offense but this does not hold nearly the same value, which is why a lot of people don't see that as a option  Me too :/ Except civil engineering, is it any different for me than OP?  Undecided student here. CS is hard as hell to transfer into. The GPA requirement doesn't seem like it's that hard, but it is much harder than it looks. A B- is actually weighed as a 2.67, not a 3, so be wary of that as well. Also, the GPA requirement is more like a 3.2 for CS, not 3.0 So I guess getting that 3.2 GPA is pretty difficult? Is that because of the classes needed in order to transfer in? So I guess getting that 3.2 GPA is pretty difficult? Is that because of the classes needed in order to transfer in? So I guess getting that 3.2 GPA is pretty difficult? Is that because of the classes needed in order to transfer in?   Can anyone explain the differences between the Mathematics and Computer Science program in the College of Liberal Arts and Sciences as opposed to the one in the College of Engineering? Applied for EE but didn't get into the program and am considering either majors to submit. As the majors state, the LAS one takes more advanced Math classes as opposed to even more advanced CS classes in Engineering. Engineering's CS program only requires all the Calc courses, Linear Algebra, and I believe a Probability Theory class.\n\nEngineering also requires you to take the Physics track (PHYS 211/212 and your choice of 213 or 214) and CHEM 102/103 for their college requirement. \n\nIn the end, they're about equal. Graduates from both programs should show success and proficiency in their future careers.\n\nI dug up some flowcharts. Here they are:\n\n[Math &amp; CS](https://wiki.engr.illinois.edu/download/attachments/161021976/Math+and+CS+requirements+flowchart+revised.pdf?version=1&amp;modificationDate=1332540462000)\n\n[CS in Engineering](https://wiki.engr.illinois.edu/download/attachments/161021976/CS+requirements+flowchart+CS+track+2012+revised.pdf?version=1&amp;modificationDate=1332542016000)  I don't know how hard it is to switch to CS major, but I do know it is definitely worth to transfer!!!\n\nI was an ECE major, but I switched to CS. Recruiters seeking CS students (Facebook, Twitter, Reddit...) are way much cooler than recruiters seeking ECE students (National Instruments and a bunch of companies you have never heard of...) . \n\nDon't ever consider ECE major, even computer engineering!!! You will be forced to learn a bunch of stuffs you will never used in rest of your life, like Nanotech or Electronic Wave. It is just waste of time.... Knowing these won't really help you to get a job in Facebook....\n\nObviously, there are too many smart chinese or indian kids in ECE department that makes its really competitive...  I would say it is at least two times harder to get an A in ECE classes than in CS classes....\n\nOverall, CS rocks, ECE sucks  (Assume you are not interested in Eletrical of Physic stuffs..). CS is cool. ECE is lame.  Successful CS alumni are usually billionaire or entrepreneurs.  Successful ECE alumni are usually scientists...\n\nI can say this because from my personnel experience and lots of my friends' experiences... I had a bad time in ECE department and almost give up programming after ECE190 but I will say I rebuild the confidence after CS225....Faculties in CS department are nicer!!! They sometimes bring cookies to classes! They are funny and experienced unlike the serious ECE professors who has no verbal skills and always get you bored!\n\nNever ever never switch your major to ECE, if you are already, switch to CS instead!If you can't, at least do a CS minor for getting a job... I don't know how hard it is to switch to CS major, but I do know it is definitely worth to transfer!!!\n\nI was an ECE major, but I switched to CS. Recruiters seeking CS students (Facebook, Twitter, Reddit...) are way much cooler than recruiters seeking ECE students (National Instruments and a bunch of companies you have never heard of...) . \n\nDon't ever consider ECE major, even computer engineering!!! You will be forced to learn a bunch of stuffs you will never used in rest of your life, like Nanotech or Electronic Wave. It is just waste of time.... Knowing these won't really help you to get a job in Facebook....\n\nObviously, there are too many smart chinese or indian kids in ECE department that makes its really competitive...  I would say it is at least two times harder to get an A in ECE classes than in CS classes....\n\nOverall, CS rocks, ECE sucks  (Assume you are not interested in Eletrical of Physic stuffs..). CS is cool. ECE is lame.  Successful CS alumni are usually billionaire or entrepreneurs.  Successful ECE alumni are usually scientists...\n\nI can say this because from my personnel experience and lots of my friends' experiences... I had a bad time in ECE department and almost give up programming after ECE190 but I will say I rebuild the confidence after CS225....Faculties in CS department are nicer!!! They sometimes bring cookies to classes! They are funny and experienced unlike the serious ECE professors who has no verbal skills and always get you bored!\n\nNever ever never switch your major to ECE, if you are already, switch to CS instead!If you can't, at least do a CS minor for getting a job... Cinda heeren is super sweat! She is the best professor I met in UIUC.\nHu Yih-Chun, on the other hand is a smug jerk!!!\n\nI can share my experience, I get a shit in my ECE classes, but after getting an A in CS173 and CS225, I got admitted and became a CS student!\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/18lruw/just_got_admitted_but_not_into_the_program_i/"
  }, {
    "id" : 41,
    "title" : "[IMPORTANT] Girl Scouts selling cookies outside Follett's!",
    "snippet" : "  THANKS FOR THE ALL CAPS TAG I DIDN'T KNOW IF IT WAS IMPORTANT OR NOT THANKS FOR THE ALL CAPS TAG I DIDN'T KNOW IF IT WAS IMPORTANT OR NOT   They're also being sold at a barber shop on Green. Right across the street from Chipotle. Dave is a good guy.  If I had hair, I would be going there.   My spear and magic helmet!\n\nMagic helmet?\n\nMagic helmet!\n\n**MA** **GIC** **HEL** **MET**   My friend's daughter sells 'em to me. I got a source &gt;.&gt; ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18l8f0/important_girl_scouts_selling_cookies_outside/"
  }, {
    "id" : 42,
    "title" : "UIUC Physics?",
    "snippet" : "Hello, \n\nI just got admitted to UIUC! I applied to Engineering, but got offered the alternate program option, and I had physics as my alternate choice. Any physics majors? I'm OOS from Massachusetts, I don't know any UIUC alumni, so I'd love to get an idea of the school, and it's physics program.\n\nThanks!    I am not a physics major, but I am a fellow out of state student (engineering) and I couldn't be happier.  While I won't know much about the physics program, I only took 4 courses in it, I would be happy to answer any questions you have about the University. How's being OOS at UIUC? I take it that most students who do engineering are OOS considering the programs strength. How's the social life, and Urbana Champaign. I live near Boston, so I guess it's a much more different environment. Do you feel that OOS cost is worth it? I really don't think most engineers are OOS. Pretty much regardless of major it seems like 90% of the students here are either from the Chicago Suburbs or Korea.  Not specifically Korea, but let's check your claim.\n\n* http://dmi.illinois.edu/\n\n* Campus Profile\n\n* Department: Physics\n\n* Jump to: Student Data\n\nTells us that the physics department has 177 undergrads.\n\n23% nonresident, which is apparently 13% international and 10% out of state.\n\nSo the \"90% are illinois or [international]\" was actually dead-on for Physics.\n\nAlso notice the %women, which is 21.5% (a HUGE increase over past years)\n\nYou can see more statistics about the 177 physics undergrads [here](http://www.dmi.illinois.edu/cp/listprograms.asp?row=3660&amp;org=1B1-KP-KP0-244&amp;year1=2012&amp;year2=2013). How's being OOS at UIUC? I take it that most students who do engineering are OOS considering the programs strength. How's the social life, and Urbana Champaign. I live near Boston, so I guess it's a much more different environment. Do you feel that OOS cost is worth it? How's being OOS at UIUC? I take it that most students who do engineering are OOS considering the programs strength. How's the social life, and Urbana Champaign. I live near Boston, so I guess it's a much more different environment. Do you feel that OOS cost is worth it?     Don't do engineering-physics Can I ask why? Dealing with different offices in different colleges was a nightmare. They kept claiming it was the other college's responsibility Fair enough. I am looking to major in physics and am not really sure which track to go for. Good information.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18lwh2/uiuc_physics/"
  }, {
    "id" : 43,
    "title" : "School email not working?",
    "snippet" : "It's been \"moved temporarily\" apparently but the redirection link brings me to the same page. Anyone else having this problem?   This seems to be an issue with all of Google Mail and Google Apps. Incognito in Chrome or using Firefox worked for me - Safari didn't.  I was having a similar problem. Try opening up your email in incognito mode that worked for me.  Clear cookies and cache and try again ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18l9vp/school_email_not_working/"
  }, {
    "id" : 44,
    "title" : "Where can local musician's play?",
    "snippet" : "I play guitar and sing, and am looking for somewhere (other than the quad in the spring/potbellies) to perform. Are there any local bars or establishments/talent shows, etc that give local musicians a shot at playing a one or two hour gig?     The Iron Post in downtown Urbana is a pretty good place to start.  I love the Post! But it's sort of a jazz bar   &gt;musicians\n\nFTFY      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18kxs6/where_can_local_musicians_play/"
  }, {
    "id" : 45,
    "title" : "Get it while it's fresh!",
    "snippet" : "    Not to be a dick but isn't this just a typo?",
    "url" : "http://imgur.com/WuKUzRL,E8J4oQF"
  }, {
    "id" : 46,
    "title" : "UIUC's Very Own Chai-Town Does a Beautiful Rendition of an Indian Song for Valentine's Day",
    "snippet" : "     [deleted]  Do the needful. And what is that?",
    "url" : "http://www.youtube.com/watch?v=LG77APl4g3c"
  }, {
    "id" : 47,
    "title" : "Welcoming Penn State with arms wide open...",
    "snippet" : "   &lt;Sarcasm&gt; I don't get it. &lt;/Sarcasm&gt;\n\nA) Valentine's Day is today, fitting for the day the email was sent out\nB) Who cares if his son is shirtless? It's his son. It was a heat of the moment picture after an amazing win over Indiana\nC) ???\nD) People need to stop being little sensitive babies looking for a reason to be offended. I guarantee you I wouldn't have thought of that connection if it weren't for this article.  \n\nI'm more offended by the unappealing color scheme than anything\n\nEdit: I forgot sarcasm doesn't transmit over the Interwebs Trust me, I'm not getting all up in arms over this - its from deadspin, it not to taken seriously anyway. \n\nOffended? No. But can I unsee it? Not really.\n\n**Edit:** Isla_de_tortugas, I indeed understand sarcasm does not transfer over the Interwebs. I thought everyone would find this article funny. According to the sidebar, this is not the case. I'm not berating you by any means. I just have a family that loves doing this sort of thing and it just pisses me off &lt;Sarcasm&gt; I don't get it. &lt;/Sarcasm&gt;\n\nA) Valentine's Day is today, fitting for the day the email was sent out\nB) Who cares if his son is shirtless? It's his son. It was a heat of the moment picture after an amazing win over Indiana\nC) ???\nD) People need to stop being little sensitive babies looking for a reason to be offended. I guarantee you I wouldn't have thought of that connection if it weren't for this article.  \n\nI'm more offended by the unappealing color scheme than anything\n\nEdit: I forgot sarcasm doesn't transmit over the Interwebs ...you don't get it? \n\nPenn State is a school in State College, Pennsylvania. They recently had a scandal where the former Assistant Coach of their football team, Jerry Sandusky, was charged with the systematic rape of dozens of young boys. \n\nThere's a double entendre here, even if it's immature to say so. It's one thing to say, \"That's not really funny,\" or, \"It's offensive that they're saying that about Groce and his son,\" but you *have* to at least *understand* it. \n\nAnd really, getting uptight and saying that the joke is not funny is the \"little sensitive baby thing\" that you're whining about.  Oh right, that whole Sandusky thing. I TOTALLY forgot about that.. &lt;/sarcasm&gt;\n\nEdit: sarcasm Okay, so it wasn't that you didn't get it. It's that you didn't think it was funny. Probably because you were being a little sensitive baby looking for a reason to be offended.",
    "url" : "http://deadspin.com/5984254/the-fighting-illini-ticket-office-chose-an-unfortunate-picture-to-advertise-the-penn-state-game"
  }, {
    "id" : 48,
    "title" : "WET HOT AMERICAN SUMMER this weekend at The Art Co-op!",
    "snippet" : "Another great comedy for the midnight show this weekend! A small budget camp comedy, this movie is truly hysterical. IMDB page here http://www.imdb.com/title/tt0243655/?ref_=sr_1 \nCome on out and participate in some fun, summer camp themed games before the show! Midnight shows Friday and Saturday, 10PM shows next Wednesday and Thursday. Only 7 bucks!! Hope to see you there!   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18j0lf/wet_hot_american_summer_this_weekend_at_the_art/"
  }, {
    "id" : 49,
    "title" : "ESPN's John Brenkus, host of Sport Science, coming to UIUC on Friday at 8PM",
    "snippet" : "John Brenkus, the host of the ESPN show Sports Science, is coming down to Champaign as the E-Week Keynote Speaker this Friday! He will be speaking at the Illini Union Ballroom at 8PM.\n\nIf you have a Facebook, you can check out the event here:\n\nhttps://www.facebook.com/events/274250009368747/\n\nAnyone and everyone is welcome! Space is limited so make sure you get there early. If you are on an E-Week team, you will get points for attending.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ik7t/espns_john_brenkus_host_of_sport_science_coming/"
  } ],
  "processing-time-source" : 602,
  "processing-result.title" : "uiuc1_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc1_reddit.xml"
  }
}