{
  "processing-time-total" : 1372,
  "clusters" : [ {
    "id" : 0,
    "size" : 8,
    "score" : 28.208559471154963,
    "phrases" : [ "New Years" ],
    "documents" : [ 5, 22, 23, 24, 28, 35, 44, 48 ],
    "attributes" : {
      "score" : 28.208559471154963
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 83.05075526523977,
    "phrases" : [ "Credit Hours" ],
    "documents" : [ 8, 19, 22, 33, 41, 49 ],
    "attributes" : {
      "score" : 83.05075526523977
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 45.49734632872637,
    "phrases" : [ "Fun Time" ],
    "documents" : [ 9, 19, 23, 31, 44, 45 ],
    "attributes" : {
      "score" : 45.49734632872637
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 51.20600325197111,
    "phrases" : [ "CS Major" ],
    "documents" : [ 2, 8, 23, 36, 38 ],
    "attributes" : {
      "score" : 51.20600325197111
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 97.50445434523755,
    "phrases" : [ "Check Grades" ],
    "documents" : [ 19, 22, 24, 28, 44 ],
    "attributes" : {
      "score" : 97.50445434523755
    }
  }, {
    "id" : 5,
    "size" : 5,
    "score" : 67.31057977208069,
    "phrases" : [ "Game" ],
    "documents" : [ 4, 24, 31, 35, 42 ],
    "attributes" : {
      "score" : 67.31057977208069
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 22.83184042898628,
    "phrases" : [ "Long Time" ],
    "documents" : [ 24, 28, 36, 44, 46 ],
    "attributes" : {
      "score" : 22.83184042898628
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 108.91141239587778,
    "phrases" : [ "Academic Probation" ],
    "documents" : [ 22, 27, 28, 46 ],
    "attributes" : {
      "score" : 108.91141239587778
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 38.82027918199868,
    "phrases" : [ "Costs" ],
    "documents" : [ 22, 29, 40, 46 ],
    "attributes" : {
      "score" : 38.82027918199868
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 47.52434683142415,
    "phrases" : [ "Level Courses" ],
    "documents" : [ 6, 23, 28, 44 ],
    "attributes" : {
      "score" : 47.52434683142415
    }
  }, {
    "id" : 10,
    "size" : 4,
    "score" : 57.906394965199155,
    "phrases" : [ "Ride" ],
    "documents" : [ 3, 18, 32, 34 ],
    "attributes" : {
      "score" : 57.906394965199155
    }
  }, {
    "id" : 11,
    "size" : 4,
    "score" : 50.79851312688979,
    "phrases" : [ "Watch" ],
    "documents" : [ 17, 22, 28, 42 ],
    "attributes" : {
      "score" : 50.79851312688979
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 52.24333293002219,
    "phrases" : [ "Switched" ],
    "documents" : [ 22, 33, 37 ],
    "attributes" : {
      "score" : 52.24333293002219
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 38.65102437885677,
    "phrases" : [ "Advisor" ],
    "documents" : [ 7, 47 ],
    "attributes" : {
      "score" : 38.65102437885677
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 48.72170902355631,
    "phrases" : [ "Bar" ],
    "documents" : [ 20, 48 ],
    "attributes" : {
      "score" : 48.72170902355631
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 39.988601980484454,
    "phrases" : [ "Courses Earlier" ],
    "documents" : [ 22, 44 ],
    "attributes" : {
      "score" : 39.988601980484454
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 49.22701854471634,
    "phrases" : [ "Dean's List" ],
    "documents" : [ 2, 22 ],
    "attributes" : {
      "score" : 49.22701854471634
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 26.832584118435957,
    "phrases" : [ "Grade Replacement" ],
    "documents" : [ 28, 44 ],
    "attributes" : {
      "score" : 26.832584118435957
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 44.99967121515013,
    "phrases" : [ "Management" ],
    "documents" : [ 15, 44 ],
    "attributes" : {
      "score" : 44.99967121515013
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 36.22976574345216,
    "phrases" : [ "PSA" ],
    "documents" : [ 14, 24 ],
    "attributes" : {
      "score" : 36.22976574345216
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 50.48019574316494,
    "phrases" : [ "Recommend New Life" ],
    "documents" : [ 10, 44 ],
    "attributes" : {
      "score" : 50.48019574316494
    }
  }, {
    "id" : 21,
    "size" : 12,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 1, 11, 12, 13, 16, 21, 25, 26, 30, 39, 43 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1313,
  "documents" : [ {
    "id" : 0,
    "title" : "What to do when a teacher won't change your NR grade after several attempts at contact?",
    "snippet" : "It's for a class that literally stand between me and my degree, and my graduation date was last Saturday so I don't want LAS to take any longer than it already does in processing it. This was probably my best grade for the semester, too.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15n3mf/what_to_do_when_a_teacher_wont_change_your_nr/"
  }, {
    "id" : 1,
    "title" : "Redditors from the Quincy area, I need help!",
    "snippet" : "So I'm not real sure where to ask this so I figured I'd start here and if it's really wrong someone will point me in the right direction. I'll be moving to Quincy, IL after graduation for a job I just accepted. I need some help on places to live. Anyone know of some good companies, some areas to aim for, and anything else I should know?\nThanks.   Might check with /r/illinois ... or ... wait for it ... [/r/quincy](http://www.reddit.com/r/Quincy/)",
    "url" : "http://www.reddit.com/r/UIUC/comments/15nebk/redditors_from_the_quincy_area_i_need_help/"
  }, {
    "id" : 2,
    "title" : "Deans list - CS Engineering?",
    "snippet" : "Just wondering usually whats the GPA requirement for Deans list for Computer science cs majors?  https://wiki.engr.illinois.edu/display/ugadvise/Honors\n\nIt says top 20% - I think in practice that usually works out to roughly &gt;= 3.7. Also, you need to have a minimum of 14 GPA hours. I got it with 3.7 last semester so that sounds accurate **THIS GUY GOT DEAN'S LIST LAST SEMESTER** https://wiki.engr.illinois.edu/display/ugadvise/Honors\n\nIt says top 20% - I think in practice that usually works out to roughly &gt;= 3.7. Also, you need to have a minimum of 14 GPA hours.  I'm also a CS major, I rolled into the Dean's list every time I got &gt;= 3.6.  (with min 14 GPA hours)   CS major here. I got a 4.0 for several semesters and I was on the dean's list all of those semesters. Just a heads up. CS major here. I got a 4.0 for several semesters and I was on the dean's list all of those semesters. Just a heads up.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15n4xt/deans_list_cs_engineering/"
  }, {
    "id" : 3,
    "title" : "Anybody needs a ride back to school from western suburbs on the 31st?",
    "snippet" : "leaving around 4 getting there around 7. Let me know if you need a ride  I'm just wondering why this is such a popular post",
    "url" : "http://www.reddit.com/r/UIUC/comments/15m57g/anybody_needs_a_ride_back_to_school_from_western/"
  }, {
    "id" : 4,
    "title" : "Is there a place in CU that will buy used dvds/games/books?",
    "snippet" : "I'm looking for somewhere kind of like a [Mega Replay](http://megareplay.com/index.html) that will buy old DVDs, books, games, or gaming equipment. I don't think there's anything in town but I'm hoping there's something I just haven't heard of.\n\nThanks in advance.  Live Action Games\n\nExile on Main\n\nRecord Swap warning: the guy who runs record swap is a fucking asshole Please elaborate. accused me of stealing at a point when I was coming in 2-3 times a week.\n\n I guess he was bummed that I bought the dollar ones and not his insanely overpriced other stuff ($80 for a copy of Live-Evil are you fucking kidding me) Live Action Games\n\nExile on Main\n\nRecord Swap Do any of those places do DVDs? I have a few to get rid of and I thought those were all music exchange type places. Exile does DVDs.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15n8hf/is_there_a_place_in_cu_that_will_buy_used/"
  }, {
    "id" : 5,
    "title" : "Krav maga",
    "snippet" : "I heard there was krav maga class offered at Jewish student center, but i can't find any other info on that anymore (latest i found being in 2008) Any of you have any information?  http://www.illinihillel.org/weekly-events.html\n\nTL;DR Every Monday 6:00 P.M. - 7:00 P.M. at the ARC. $10 registration fee for the whole semester THANK YOU I would try and email someone first. The ARC has a god-awful habit of double-booking the combat room, this happened with us in TKD@UIUC this year with them...and looking at our schedule, it may be happening against, since we have it booked 5:30-7 on MW and they're showing it booked 6-7 on Monday...  [I really hate to use a memegenerator image, but I really want to make an archer joke.](http://cdn.memegenerator.net/instances/400x/20961123.jpg) [I really hate to use a memegenerator image, but I really want to make an archer joke.](http://cdn.memegenerator.net/instances/400x/20961123.jpg)       I have a friend who took a few sessions a few years back \n\nI will ask him and see if it was the same people. \n\nIf it's not offered, try the first two weeks of goshin jitsu. The first two weeks are free, and we'll teach you useful self defense, similar to krav (as in none of those stupid pressure point instant death grips, and you're not going to learn to kill someone with one karate chop).  I have a friend who took a few sessions a few years back \n\nI will ask him and see if it was the same people. \n\nIf it's not offered, try the first two weeks of goshin jitsu. The first two weeks are free, and we'll teach you useful self defense, similar to krav (as in none of those stupid pressure point instant death grips, and you're not going to learn to kill someone with one karate chop).  Does Goshin Jitsu accept new/beginning members in the spring semester too?  real_life_corgi, we should be friends. Do you have an actual corgi? Hi ActuallyAnAlpaca, I bet you are delicious. I wish to own one soon [what did you say?](https://www.youtube.com/watch?v=GP5D2apU2SE) ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15lz7b/krav_maga/"
  }, {
    "id" : 6,
    "title" : "ACE 240 and FIN 232",
    "snippet" : "Is there a difference between the two classes other than that FIN 232 is not offered next semester? I'm thinking of taking ACE 240 but I'm just curious.   They are both entry level personal finance courses. They cannot be worlds apart. I have taken ACE 240 and it is a good course that covers a broad range of topics. I'm interested in learning about investing in stocks, and about real estate. Does the class teach you enough to let you actually start doing that? you will go over the basics of investing. Honestly, you can learn more about investing in stocks from places on the internet such as investopedia.com. As for real estate, you will learn about mortgages, renting vs buying, etc. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15mbe1/ace_240_and_fin_232/"
  }, {
    "id" : 7,
    "title" : "is there anyway to speak to an advisor quickly between now and next year?",
    "snippet" : "most university offices are closed right now, but i have a question that is time sensitive regarding my graduation/finances.\n\nanyone know if there is anyway to speak to an advisor today?  Advisor here - no one is really around until January 2nd.  You can PM me and I can see if I can help!",
    "url" : "http://www.reddit.com/r/UIUC/comments/15l3e7/is_there_anyway_to_speak_to_an_advisor_quickly/"
  }, {
    "id" : 8,
    "title" : "Opinions on LER 100?",
    "snippet" : "I was looking for easy courses to fill up free elective hours, and I signed up for LER 100 because it seemed interesting, was online and in the first half of the semester. However, some of the things I've heard about it, including [this comment](http://www.reddit.com/r/UIUC/comments/15kiux/what_is_an_easy_a_2_hour_course/c7ngwqj), are giving me second thoughts, so I'd love some more opinions. How much work do you need to put in to get an A?\n\nComments on LER 110 and 120 would also be appreciated.  Oh I just got done with that course! Let me tell you a little about it:\n\nYou will regret it. Oops.\n\nDo you mind going into more detail? Well let's see... \n\n**-** Absolutely stupidly set-up deadline system for online forum posts.\n\n**-** Tricky exam questions/answers, tough grading and ambiguous guidelines on 4-essay final.\n\n**-** Extraordinary amounts of reading if you have any hope of confidently securing an A.\n\n**-** Tough grading on online forum posts - must cite aforementioned readings. Each post averages out to maybe 1-1.5 pages. 3 posts per segment per forum, that is 9 of these per segment over 4 segments. \n\n**-** Cram all of that into 8 weeks. \n\nFuck you LER100. 100. Not 400, 300, or 200. One fucking hundred. And you know what I got? A B. A few points here, a few there, and then a 70 on the final for not going into enough detail? What the fuck is \"enough\" detail. For Christ's sake. Worst class ever.\n\nOh and most of the same goes for 110 and 120 so don't bother with those either. \n\nAnd definitely **don't** take all three in one semester in the same 8 weeks.\n\nFWIW I learned a lot about unions. Well let's see... \n\n**-** Absolutely stupidly set-up deadline system for online forum posts.\n\n**-** Tricky exam questions/answers, tough grading and ambiguous guidelines on 4-essay final.\n\n**-** Extraordinary amounts of reading if you have any hope of confidently securing an A.\n\n**-** Tough grading on online forum posts - must cite aforementioned readings. Each post averages out to maybe 1-1.5 pages. 3 posts per segment per forum, that is 9 of these per segment over 4 segments. \n\n**-** Cram all of that into 8 weeks. \n\nFuck you LER100. 100. Not 400, 300, or 200. One fucking hundred. And you know what I got? A B. A few points here, a few there, and then a 70 on the final for not going into enough detail? What the fuck is \"enough\" detail. For Christ's sake. Worst class ever.\n\nOh and most of the same goes for 110 and 120 so don't bother with those either. \n\nAnd definitely **don't** take all three in one semester in the same 8 weeks.\n\nFWIW I learned a lot about unions. Say if you're only taking only 2 classes? Is it not bad?  Alternative opinion here:\n\nI see that you are CS, so I will generalize and assume you will not be interested in the content of the course. It is about labor and employer relations. A very good introduction. You will kind of delve into a bunch of different areas of labor history.\n\nMy roommate and I took it our sophomore year (all the way back in 2009-2010). We both got A's with pretty low amount of commitment, especially considering that you never have to meet for class. The forum posts suck, but just cite the same thing other posters cite and reword the information and analysis.\n\nFinal point. If you are interested enough in LER to get a minor in it, I hear it is a very good field to go into. My other roomie worked for UIF and said that LER graduate students had extremely high job placement rates.\n\nMy final opinion: If you put 3 hours of actually productive and efficient work into the class per week, you will get an A. Alternative opinion here:\n\nI see that you are CS, so I will generalize and assume you will not be interested in the content of the course. It is about labor and employer relations. A very good introduction. You will kind of delve into a bunch of different areas of labor history.\n\nMy roommate and I took it our sophomore year (all the way back in 2009-2010). We both got A's with pretty low amount of commitment, especially considering that you never have to meet for class. The forum posts suck, but just cite the same thing other posters cite and reword the information and analysis.\n\nFinal point. If you are interested enough in LER to get a minor in it, I hear it is a very good field to go into. My other roomie worked for UIF and said that LER graduate students had extremely high job placement rates.\n\nMy final opinion: If you put 3 hours of actually productive and efficient work into the class per week, you will get an A.   I signed up for it last semester because I dropped another class and needed more credit hours. I thought it would be easy, but it was way too much work for a class that doesn't count toward anything in my major. I just made it credit/no-credit and didn't do shit in the class. \n\nI tried actually doing the work the first week of class and it was like 2 hours of reading and writing stupid responses online. Probably like 10 hours of work a week for that class. It distracts from real classes too much.\n\nHalf of the syllabus is explaining how it's not an easy A class. \n\nChoose a different class     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15lfrv/opinions_on_ler_100/"
  }, {
    "id" : 9,
    "title" : "Let's grab a beer",
    "snippet" : "Bored on campus   Where and what time? I have people coming over for dinner but maybe after. Woops just got back from down town. It was pretty fun. Hope your dinner was good.  I don't get why people downvote posts like this on this subreddit.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15l53y/lets_grab_a_beer/"
  }, {
    "id" : 10,
    "title" : "Good tattoo shop in the area?",
    "snippet" : "I've been wanting to get a tattoo for quite some time now. What's the best in the Urbana-Champaign area?  No Regets in down town Champagne is very good. My wife and I both just had some work done there.  I've gotten all of my work done at no regrets and I love it. Matt Diana is a god.      If you like traditional work, I can recommend New Life. I have two pieces done by Tilt, and I've been extremely pleased. If you like traditional work, I can recommend New Life. I have two pieces done by Tilt, and I've been extremely pleased.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15l9k6/good_tattoo_shop_in_the_area/"
  }, {
    "id" : 11,
    "title" : "The Beckman Institute's Real Time MRI singing \"Deck the Halls\"",
    "snippet" : "   Pretty cool video but you would think they would have someone that can sing a LITTLE bit better do it. Regardless of that the video is sweet I think that was because the music was added later. I thought that too and realized that is music on post-production. You'd think they could change the key but oh well. The point is, its awesome - in any key. ",
    "url" : "http://www.youtube.com/watch?v=W5Vs137VJm0"
  }, {
    "id" : 12,
    "title" : "What is an easy A 2 hour course?",
    "snippet" : "I need a 2 hour course to pad my gpa this semester any advice   LER 100 is in no way an easy A. Take CHLH 206 or 243. Both online. Both super easy.  what does it mean when it says \"reserve closed\"?  phys 214 ^ Read the username Can someone elaborate what makes phys 214 hard/er? I plan on taking it this upcoming spring semester.  Take Human Sexuality or Drug Use and Abuse (this is online for half a semester). Both are 2 hours and easy and interesting! Take Human Sexuality or Drug Use and Abuse (this is online for half a semester). Both are 2 hours and easy and interesting!   Geog110 is super easy, with flint an it is 2 hours.        CS 473  LER 100, its a half semester online course.   ECE 290",
    "url" : "http://www.reddit.com/r/UIUC/comments/15kiux/what_is_an_easy_a_2_hour_course/"
  }, {
    "id" : 13,
    "title" : "TIL Assembly Hall was the largest dome in NA when it opened in 1963",
    "snippet" : "   IIRC it was the first concrete dome in the world. We need to build a new arena, but I wouldn't mind keeping this one around as a relic why do we need a new arena? To reach back to hallowed antiquity, to bring you a recreation of the second fall of the mighty Carthage!    ",
    "url" : "http://en.wikipedia.org/wiki/World%27s_largest_domes#North_America"
  }, {
    "id" : 14,
    "title" : "PSA - Starting Jan 1, you can skate on the road during the day.",
    "snippet" : "  Cool. Couple of questions to clarify: \n\na) So inline skaters can skate on a road, but only where there is no sidewalk? \n\nb) Also, inline skaters cannot participate in vehicle traffic like a bicycle can, they can only skate on the shoulder of the road? I think 625 ILCS 5/11-1007 E treats skaters as the exception. So they can't skate on certain roads even if there are sidewalks. Everything else in that section refers to people just walking.    what about longboards?",
    "url" : "http://www.ilga.gov/legislation/publicacts/fulltext.asp?Name=097-1023"
  }, {
    "id" : 15,
    "title" : "Any other management companies for on-campus?",
    "snippet" : "Alright r/uiuc, \n\nTL;DR: Am I missing any on-campus management companies from list?\n\nI am returning to school and have been looking for an apparent unicorn, a one bedroom, on-campus, spring lease for less than $600 for everything including utilities. I have been calling the management companies to check availability and wanted to see if I missed any. These are the ones that I have thus far:\n\n* [Advantage](http://www.advproperties.com/)\n\n* [Bailey](http://www.baileyapartments.com/)\n\n* [Bankier](http://www.bankierapts.com/)\n\n* [Burnham 310](http://burnham310.com/)\n\n* [Castle Properties](http://www.castleproperty.us/)\n\n* [CPM](http://cpm-apts.com/)\n\n* [Dermel](http://www.dermelproperties.com/)\n\n* [Electrum Group](http://www.theelectrumgroup.com/)\n\n* [Green Street Realty](http://www.greenstrealty.com/)\n\n* [Hunsinger](http://www.hunsingerapts.com/)\n\n* ~~[Johnson Rentals](http://johnsonrentals.com/)~~ edit: managed by Green Street\n\n* [JSM](http://www.jsmapts.com/champaign/)\n\n* [JTS](http://www.jts-properties.com/)\n\n* [Kellner](http://kellnerrentalproperties.com/)\n\n* [Kennedy Wilson](http://www.cu-living.com/apartments.html)\n\n* [Klatt Properties](http://www.klattproperties.com/cms/)\n\n* [Marshall](http://champaignmarshallapartments.com/)\n\n* [MHM](http://new.mhmproperties.com/)\n\n* [Nogle](http://nogleproperties.com/)\n\n* [PPM](http://ppmrent.com/)\n\n* [Ramshaw](http://www.ramshaw.com/apartments)\n\n* [Roland](http://www.roland-realty.com/)\n\n* [Royse and Brinkmeyer](http://www.roysebrinkmeyer.com/)\n\n* [Shlens Apartments] (http://www.shlensapts.com/admin/)\n\n* [Smith](http://smithapartments-cu.com/)\n\n* [Tower at Third](http://tower3rd.com/)\n\n* [Tri-County Management](http://www.tricountymg.com/champaign.html)\n\n* [UGroup](http://www.ugroupcu.com/)\n\n* [Wampler](http://www.wamplerapartments.com/)\n\n\n\nAny help would be greatly appreciated. For those who ask, yes, I checked there  ----&gt;\n\nEDIT: added Marshall, Shlens, JTS, Royce; edited Johnson\n    Johnson has ceased operations. Their properties are now managed by green street realty  Marshall Apartments also has some one bedrooms!   royse and brinkmeyer  [JTS Properties](http://www.jts-properties.com), though I can't imagine they'll be able to help you much with your 1 room apartment goal. Just one to add to the list.  You forgot [Shlens Apartments](http://www.shlensapts.com/admin/).  A really nice landlord with affordable and well-equipped apartments on the Urbana side of the North Quad. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15jl5q/any_other_management_companies_for_oncampus/"
  }, {
    "id" : 16,
    "title" : "I'm in Arizona for part of break and drove by this Fine Establishment",
    "snippet" : "  Get a sticker or something and bring it in to Zorba's. They'll love it. I have yet to go into a sex shop that sells stickers.. I have yet to go into a sex shop that sells stickers.. Orrrr, have yet to go into a sex shop? There are very few people I know who have not at least gone to the Arcade, that and my friend works at one in the suburbs The Arcade is pricey. And as a woman, my female friend and I were eyeballed very suspiciously by every male client in there. The only person who didn't care we were women was the clerk (rightly so!) but he was a teensy bit pushy and I bought something I could have done without.      [deleted]",
    "url" : "http://imgur.com/A9Rxu"
  }, {
    "id" : 17,
    "title" : "Wristwatch Service/Repair?",
    "snippet" : "Anyone know a good place to have my watches serviced?  The only one I know for sure that does work on all types of watches is Roberts Jewelers downtown, but they are a little expensive.\n\nAnyone have experience with a friendly, reliable and inexpensive watchmaker in the area?  There's a watch repair booth in Marketplace Mall. They don't work on mechanical watches.  That place is just for batteries.  I bought a watch band there once and I had to change it myself using their tools cause the employee was going to scratch the shit out of my casing if I let him do it.   Depends on what you need done --\n\nI needed my watch battery changed and some links removed.  I went to the Macy's counter and asked them to do it..they said sure, but I had to have boughten my watch at a Macy's.  I said yes (even though I didn't, but it's an Armani so it looks nice enough), and they did it for free very well in front of me!\n \"[boughten](http://i.imgur.com/KffH8.jpg)\" sorry i'm on break.  you're obviously a depressed slave for a computer engineering factory with nothing else to do",
    "url" : "http://www.reddit.com/r/UIUC/comments/15ivu4/wristwatch_servicerepair/"
  }, {
    "id" : 18,
    "title" : "Looking or ride to CU from Northern Illinois for NYE",
    "snippet" : "Two people, one dog, will pay our way in gas! PM me if you're leaving Dec 30th or 31st from northern Illinois and are willing to share the ride. Thanks =)",
    "url" : "http://www.reddit.com/r/UIUC/comments/15jis2/looking_or_ride_to_cu_from_northern_illinois_for/"
  }, {
    "id" : 19,
    "title" : "Grades are up! Check your academic history",
    "snippet" : "  That feeling when you get an A in a 5 credit hour class. a 5 credit hour class exists? which one? Intro to psych stats. Psych 301  A in CS 373? praying the TA's didn't make a mistake with the curve A in CS 373? praying the TA's didn't make a mistake with the curve Yeah... 80.66% raw score and I got an A.  this is officially the first time in six years that this news has not applied to me  Not lawschool grades... Not yet... :( Check your last e-mail from Dean V. I'm pretty sure she said to expect grades on January 4. Not lawschool grades... Not yet... :(  What does an \"NR\" mean? I'm assuming it means the grade hasn't been entered by my instructor but does anyone know? What does an \"NR\" mean? I'm assuming it means the grade hasn't been entered by my instructor but does anyone know?  What does BH mean?  [deleted]   3.73 for the semester, 3.50 cumulative.  Law school here I come! Damn. I pulled off a 3.90 this semester but I still only have a 3.36. That's what I get for being lazy my first semester. :P Hey, improvement is improvement.  And I see that you're ECE; one of my roomies is ECE and his life does not look fun. 3.73 for the semester, 3.50 cumulative.  Law school here I come!",
    "url" : "http://registrar.illinois.edu/"
  }, {
    "id" : 20,
    "title" : "Are there any \"grown up\" bars in town?",
    "snippet" : "I don't care at all for the typical college bar scene; in fact I'd rather avoid it alltogether. Are there any bars in the area that are more like bars in non-college towns?\n\nedit: To claify an ambiguity by \"grown up\" I'm mostly talking about discluding underage kids. Bars with mostly grad students count.   Blind pig in downtown Champaign is my go to.  That's still not \"grown-up\", unless you consider grad students grown-ups.\n\nQuality and Boltini seem grown-up to me (I have seen older people there). I do. By grown up I was mostly discluding underage kids.  Then Blind Pig should be fine for you, it is popular with the younger crowd. Going to grad school is simply a means of delaying adulthood and avoiding facing the real world, so grad students are not really grown-up other than being 21+.  Or a means of obtaining the degree that lets you work in your chosen field.  A graduate degree is no guarantee of finding work in your chosen field (or *any* job at all, for that matter), not at least these days in this economy. Often it makes you overqualified and it becomes more difficult to find a job.  A graduate degree is no guarantee of finding work in your chosen field (or *any* job at all, for that matter), not at least these days in this economy. Often it makes you overqualified and it becomes more difficult to find a job. Then Blind Pig should be fine for you, it is popular with the younger crowd. Going to grad school is simply a means of delaying adulthood and avoiding facing the real world, so grad students are not really grown-up other than being 21+.  That's absolutely true, if your destiny is to work at Muffler King. You mean everyone with only an undergraduate degree ends up working at Muffler King? I can confirm this. So Starbucks is asking for master's degrees these days? Then Blind Pig should be fine for you, it is popular with the younger crowd. Going to grad school is simply a means of delaying adulthood and avoiding facing the real world, so grad students are not really grown-up other than being 21+.  Not many grad students freak out at stuff freshmen to juniors do.  Then Blind Pig should be fine for you, it is popular with the younger crowd. Going to grad school is simply a means of delaying adulthood and avoiding facing the real world, so grad students are not really grown-up other than being 21+.  That feel when you defined adulthood wrong You mean when /r/uiuc decided that I defined adulthood wrong? Blind pig in downtown Champaign is my go to.  Blind Pig is usually full of 19-year-old dubstep-loving idiots from Mahomet. Really? Dubstep? Do we go to the same Blind Pig?.. Yeah. I have no idea what he's talking. I've never heard dubstep at the pig and the music is usually at conversation level.  Yeah. I have no idea what he's talking. I've never heard dubstep at the pig and the music is usually at conversation level.  I must have missed where I said dubstep music was actually played at the pig? I just said that there were *fans* of the music hanging out there. I must have missed where I said dubstep music was actually played at the pig? I just said that there were *fans* of the music hanging out there. Blind Pig is usually full of 19-year-old dubstep-loving idiots from Mahomet.  Crane Alley in downtown Urbana hasn't been listed yet.\n\nWhen I first moved here, I went on a hunt for townie bars and tried to go to places that were a decent ways away from the campus. I only visited the first one, but some that spring to mind are The Office II, Tumble Inn Tavern, Pia's Sports Bar, Mike &amp; Molly's. I drive by an icehouse bar occasionally that I keep thinking looks like a cozy little place ... I think it's on Springfield if you go out west far enough from campus.\n\nI've been to the Clark Bar, it's kind of a dive. Not really my go-to place for anything. It's a lot like the Brass Rail, in my experience.\n\nI've been to Emerald City, which is really kind of posh. It's got some cool bartenders, but be warned: it's a gay bar, though quite a few straight ladies go there.\n\nI've been to Jupiter's at the Crossing, which was a pretty nice non-college bar scene. There are a lot of pool tables, and I think even some kid attractions in the basement. It had a decent selection of beer, but the first time I went, there were SO MANY young families in there that it felt a bit like Chuck E. Cheese.\n\nThis might be a good place to start: http://www.yellowpages.com/champaign-il/bars?g=champaign%2C+il Esquire, too. Crane Alley in downtown Urbana hasn't been listed yet.\n\nWhen I first moved here, I went on a hunt for townie bars and tried to go to places that were a decent ways away from the campus. I only visited the first one, but some that spring to mind are The Office II, Tumble Inn Tavern, Pia's Sports Bar, Mike &amp; Molly's. I drive by an icehouse bar occasionally that I keep thinking looks like a cozy little place ... I think it's on Springfield if you go out west far enough from campus.\n\nI've been to the Clark Bar, it's kind of a dive. Not really my go-to place for anything. It's a lot like the Brass Rail, in my experience.\n\nI've been to Emerald City, which is really kind of posh. It's got some cool bartenders, but be warned: it's a gay bar, though quite a few straight ladies go there.\n\nI've been to Jupiter's at the Crossing, which was a pretty nice non-college bar scene. There are a lot of pool tables, and I think even some kid attractions in the basement. It had a decent selection of beer, but the first time I went, there were SO MANY young families in there that it felt a bit like Chuck E. Cheese.\n\nThis might be a good place to start: http://www.yellowpages.com/champaign-il/bars?g=champaign%2C+il  I hear that Kam's in Champaign is going 21+. \n\nYou should check it out!  If you're looking for a place with a good liquor selection try Seven Saints in downtown Champaign. Kind of small, but its got great food and an ok atmosphere. Dublin O'Neil's off of Neil is a pretty cool Irish-style pub, and they have traditional Irish music every Wednesday night.       Like others have said:\n\nCrane Alley (my favorite)\n\nBlind Pig (and Piglet Brewery)\n\nIron Post\n\nMike and Molly's\n\nQuality\n Yeah reaping the Post! \nAlso Black Dog for their beer selection.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15idrp/are_there_any_grown_up_bars_in_town/"
  }, {
    "id" : 21,
    "title" : "Has anyone taken a LINC course?",
    "snippet" : "I'm enrolled in one this Spring. Curious to see if anyone has any experiences.      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15itfe/has_anyone_taken_a_linc_course/"
  }, {
    "id" : 22,
    "title" : "Anyone else on Academic Probation? (By the way, how does one switch from Engineering to Graphic Design as a major?)",
    "snippet" : "Just want to see I'm not the only one.\n\nEDIT: DECIDED TO GIVE ENGINEERING ANOTHER CHANCE.   Well in order to get into graphic design. You must first submit a portfolio to Art and Design. Search their website for details.\n\nShould you get accepted, you will spend a year in the foundations.\n\nNow there is another portfolio review, so you may not even get into GD(though you may change your mind). \n\nRemember that the whole thing is 4 years. You can't take courses earlier. You can't skip foundations. So understand that you would be here a while. \n\nAcademic Probation is excused if you get accepted into foundations.\n\n Well in order to get into graphic design. You must first submit a portfolio to Art and Design. Search their website for details.\n\nShould you get accepted, you will spend a year in the foundations.\n\nNow there is another portfolio review, so you may not even get into GD(though you may change your mind). \n\nRemember that the whole thing is 4 years. You can't take courses earlier. You can't skip foundations. So understand that you would be here a while. \n\nAcademic Probation is excused if you get accepted into foundations.\n\n GD is one of the most competitive majors to get into in FAA (well, I should say A+D, I'm not too sure about FAA in general). I myself didn't make it the first year and was a painting major for a year before applying again. GD also has a two-step system, where they look over your portfolio, and they also call you in for an interview. I think the interview format changes every year. Jennifer Gunji is the head of the department and she can be very intimidating, and she is very no-nonsense. Our program also tends to be more print design heavy, so don't expect too much in the way of UX or web design, thats something the department is still working on. You should also keep in mind you don't make a ton of money by doing design. I just graduated this past spring, so if you want to ask about the program you can pm me. I know theres also GD kids on this subreddit, so if you're really interested maybe you could make another post?  I'm on it now and I'm freaking out. I refuse to tell my parents because they'll kill me. I've been having panic attacks all day now - how are you dealing with it? Dude, just tell them. It's seriously not a big deal. You're in college now, this isn't high school. Shit's hard. Tell them it's hard and you'll do better. Plenty of people are put on probation, it's just a scary sounding word, all it means is they're going to watch you closely and make sure you do better. I was on probation for a semester, and still got into grad school and have quite a nice job now. It's nothing to lose sleep over. I'm on it now and I'm freaking out. I refuse to tell my parents because they'll kill me. I've been having panic attacks all day now - how are you dealing with it? I already told my parents about it because there will be a probation notice coming in the mail. I cried and sobbed last week when I was pretty sure I knew my grades. Just do better next semester. You will be okay. I don't think a letter comes in the mail. Where did you hear this? Another post that I OPed. They are now sent digitally. So, I'm fucked. How is this not illegal under FERPA? Another post that I OPed. They are now sent digitally. So, I'm fucked. I'm on it now and I'm freaking out. I refuse to tell my parents because they'll kill me. I've been having panic attacks all day now - how are you dealing with it? Lie  Hi, I switched from math to GD, so I've got a pretty good idea of how that works. I see your edit, so this is probably not relevant. But if you have any questions about the subject, feel free to reply / PM me, and also here's a mountain of text, that I wrote in another thread.\n\nI did that, exactly.\nThere is a lot more you should be aware of besides GPA. You will need to take an additional 4 years of school. Most, if not all, A+D majors have core classes that cannot be accelerated, as they are offered per semester and sequentially. So, once you are in A+D, you will have 4 more years, and since you couldn't get in until Fall of your Junior year, that would bring you to 6 years total. Make sure that you can afford to stay in school that long, and that mentally you can handle staying here that long without burning out.\nThe only exception to the 4 years is if you have taken proper analogous courses at a good school that can have their credits transferred. It doesn't matter how great you are at any subject, you will need to take those classes.\nBesides the portfolio, you may need to write an essay whose prompt you'll receive. You will very likely not need an interview right away.\nFirst year, you will do \"foundations.\" This is a year of intensive studio work focusing on hand drawing and also design, as well as lectures on art. Overall, this year is to broaden your artistic horizons and prepare you. Then, there is a very stressful process of applying to several majors. Yes, when you get into A+D, you will not have a major. You need to apply to one at the end of the year, using an updated portfolio, followed by an interview if they like it, followed by selection. Know that it is completely possible to not get into the major you want. So, if you only want one, and there aren't several you could be happy with, make sure you are very prepared and have a strong portfolio. I have seen several people get into nothing they want and end up dropping out, or burning a year and re-applying the next year. Graphic Design in particular is the hardest major to get into, and accepts few people. (To give you numbers, out of the 100 or so that get interviewed, 30 or so will get in.)\nAs for the Foundation year studios, you will be drawing. 3 hours straight, 2 days a week. Be sure that you can handle this sort of thing. It's okay if you can't draw well, but you need to be willing to draw that much, and that long. You might have to do things like draw the same chair, in charcoal, for 3 hours.\nBe aware of the financial costs, also. For graphic design, especially, you must have a Mac laptop. It doesn't have to be new, but it must be both a Mac and a laptop. I am not saying it needs to be that because they are better or anything, but you literally will not be allowed into class without a Mac brand laptop. I am 100% serious. If you don't have one, they're pretty expensive, ~1100 new.\nIf you have other questions, feel free to ask me. Think hard before you make that choice, but it can be a good one! Do they really not let you in without a mac? One of my former classmates has a ThinkPad (or had one the whole 4 years in undergrad), and no one ever told her she absolutely had to change. They'll probably push you to get one, but I doubt they wouldn't let you in the program without one. I'm 95% sure Ike is stretching the truth a bit considering that FAA has split labs. There may be pressure from peers, but that's going to be waning now that Macs are no longer \"cutting edge\" Do they really not let you in without a mac? One of my former classmates has a ThinkPad (or had one the whole 4 years in undergrad), and no one ever told her she absolutely had to change. They'll probably push you to get one, but I doubt they wouldn't let you in the program without one. I really didn't want to buy a mac, so I emailed Jennifer Gunji, who runs the GD program, about it. I asked if I could use my home computer, but she insisted I needed a laptop. (Definitely would be a hard major without a laptop.) When I asked if it had to be a mac, and couldn't it be something with equivalent specs, she insisted Mac, and ultimately told me I wouldn't be allowed into the first day of class without a Mac. Like, actually. \n\nThat said, plenty of the teachers are chill... you could probably get away with it, it's sort of up to your own discretion. But, that is Gunji's stance on the matter. However, I thoroughly feel that a PC would have absolutely been fine and I would have run into minimal or no troubles, especially considering the Adobe Suite is multi-platform.  I'm not in graphic design (I'm in ENG), but I can guess a few things you'll have to do:\n\n**Check the requirements to graduate from graphic design** to start taking graphic design classes (and other requirements needed for the degree) this semester (**EDIT: If you're accepted or approved**). Just because you are in a certain college, doesn't mean that you can't register for a course, unless the course is restricted ~~to you~~ (**EDIT: because you're not in FAA**). this means that -\n\n**You have to go to ~~LAS~~ FAA deans** to indicate that you are interested in graphic design so that you can possibly get overrides to register for major specific courses that you can't otherwise get into. Also, there's probably some other stuff that you'll have to do as far as paperwork and ~~whatnot~~ applications.\n\n**Go to ENG deans to tell them that you will be switching to another college.** This is important because if you don't say anything, the ENG deans could kick you out after this semester because you weren't making progress toward an engineering degree, which they will still think you're doing unless yo tell them otherwise.\n\n**Talk to the advisers in graphic design.** ~~LAS~~ FAA is ~~huge~~ (**EDIT: well, maybe not so huge**), ~~so they won't know everything there is that needs to be done~~, but go to the academic advisers in graphic design. (**EDIT: There's a lot of steps to get into that so at least talk to them to see your prospects.**)\n\nOther than that, I'm not sure what else you need to do, but talking to the deans and checking the registration is at least a start.\n\nGood luck on the switch and enjoy the holidays.\n\n**EDIT:** [I don't know what I'm doing.](http://memegenerator.net/instance/32506519) I just know that telling ENG deans that you're switching majors IS EXTREMELY IMPORTANT, because getting thrown out of a university by accident would seem like a very bad experience. Hopefully you will get better advice than from me. You won't be able to transfer directly into Graphic Design.  Thanks for fixing that up. I didn't know that it takes such a long process to got into a major. I just know what it takes to get out of engineering with our too many problems. I think Graphic Design is an exception. When I switched from EE to MatSE it took 6 days after I did the paperwork. The reason that it wasn't that bad is because the majors are in the same college. I started in MechE and went to MatSE and it was no prob - the only thing you have to do is take the classes that the adviser in the major you're going into requires. When you switch colleges, its a lot more headaches because there's more paperwork, and even apps as neoblackdragon has alluded to.\n\n**EDIT:** Restricted classes too - especially in the case of this thread. You probably need someone's approval (dean or prof) for that, and that would be hell to do over winter break when you're not in that college. I think Graphic Design is an exception. When I switched from EE to MatSE it took 6 days after I did the paperwork. I think Graphic Design is an exception. When I switched from EE to MatSE it took 6 days after I did the paperwork. I'm not in graphic design (I'm in ENG), but I can guess a few things you'll have to do:\n\n**Check the requirements to graduate from graphic design** to start taking graphic design classes (and other requirements needed for the degree) this semester (**EDIT: If you're accepted or approved**). Just because you are in a certain college, doesn't mean that you can't register for a course, unless the course is restricted ~~to you~~ (**EDIT: because you're not in FAA**). this means that -\n\n**You have to go to ~~LAS~~ FAA deans** to indicate that you are interested in graphic design so that you can possibly get overrides to register for major specific courses that you can't otherwise get into. Also, there's probably some other stuff that you'll have to do as far as paperwork and ~~whatnot~~ applications.\n\n**Go to ENG deans to tell them that you will be switching to another college.** This is important because if you don't say anything, the ENG deans could kick you out after this semester because you weren't making progress toward an engineering degree, which they will still think you're doing unless yo tell them otherwise.\n\n**Talk to the advisers in graphic design.** ~~LAS~~ FAA is ~~huge~~ (**EDIT: well, maybe not so huge**), ~~so they won't know everything there is that needs to be done~~, but go to the academic advisers in graphic design. (**EDIT: There's a lot of steps to get into that so at least talk to them to see your prospects.**)\n\nOther than that, I'm not sure what else you need to do, but talking to the deans and checking the registration is at least a start.\n\nGood luck on the switch and enjoy the holidays.\n\n**EDIT:** [I don't know what I'm doing.](http://memegenerator.net/instance/32506519) I just know that telling ENG deans that you're switching majors IS EXTREMELY IMPORTANT, because getting thrown out of a university by accident would seem like a very bad experience. Hopefully you will get better advice than from me. This information is largely incomplete. Graphic Design is under FAA. There's a lengthy admissions process for the School of Art + Design. Neoblackdragon listed the correct steps below.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15hsum/anyone_else_on_academic_probation_by_the_way_how/"
  }, {
    "id" : 23,
    "title" : "Recommendation request: Favorite upper-level science/engineering/math classes? ",
    "snippet" : "So, spring semester is my last one as an undergrad at UIUC and I have exactly two classes that I have registered for so far. I am looking for interesting 'STEM classes', for lack of a better descriptor, to fill my schedule with. Were there any classes you've taken in your major that you've found to be really cool or worth taking? An example is something like MATH 347 that a lot of people credit with introducing them to proofs and 'real' math.\n\nAll my gen eds are done, all my major requirements are done and I have taken every obviously interesting undergrad class in my major (physics). If I can't find anything, I will take a grad physics class but I thought I might poke around the rest of the departments before I get stuffed into 'all-physics-all-the-time' for grad school.\n\nDon't worry about pre-reqs or what-have-you and please no 100- or 200- level courses.  ECE470. You learn the math behind robot arms. Prof. Bretl is amazing.  ECE470. You learn the math behind robot arms. Prof. Bretl is amazing.  Will look into it, thank you! Oh and you get to program a robot arm. So awesome. But I see your post about never touching C++, which is the language for the class.  The labs are the best part of the course (unless you love linear algebra *that* much). I even named my robot arm. I miss Fisto. lol...the path planning stuff was pretty cool too. Also the linear is super easy and wtf fisto? lol  Fallout new vegas reference.  If MATH 347 is the Real Analysis class, take it. Learning to write rigorous proofs is a useful skill to have in almost any quantitative discipline. I wish I had taken an analysis class at some point.\n I took MATH 347 (Intro to Proofs or some similar title) and MATH 444 (Real Analysis) and enjoyed both greatly, though the textbook for 444 was frustrating. Thanks for the rec though. You could always teach yourself real analysis if you've taken calc already. My suggestion would be to take some non-physics class that would be useful in grad school but you wouldn't have time to take in grad school / it wouldn't satisfy any course requirements / wouldn't be useful in preparing for quals / you would simply be expected to learn it by yourself. I am not sure what your concentration will be in grad school (experimental, theoretical, or computational), but a couple of general examples would be courses on programming or statistics. You could choose something other than these based on what your specialization will be in the future, so that you get a head start in grad school. Experimental condensed matter. I have taken a programming class in atomic simulation, can program in FORTRAN (and will not touch C++, Java, or Python ever) , and have also taken an excellent statistics class specifically for experimental physics. I took an extra year in undergrad almost specifically to take classes like that so I completely agree with your assessment. Those are usually the most common recs for physics grad students and they were very useful, but I have already done them and am struggling to come up with additional 'good to know's.  Math 412 - Graph Theory. Graph Theory can be used all over the place and almost all problems require a unique approach -- the proofs are never mechanical. It's a very fun course, though brutally fast.\n\nCS 398 (will be 233 in the Fall) - Computer Architecture. You start from the level of a simple logic gate and work your way up to designing a simple processor. I know you said no 200 level courses, but I feel like recommending this anyway. It's really cool to see the machinery behind everything. The ece version of cs 233 (ece 290) is more legit if you're actually interested in that stuff. \n\nOr take ece 411 #yolo ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15iazg/recommendation_request_favorite_upperlevel/"
  }, {
    "id" : 24,
    "title" : "PSA - Final Grades for the Fall 2012 Semester will be out later today!",
    "snippet" : "May the curves be ever in your favor!  :-D  This is where we either get a late Christmas present or an early New Years Resolution.  All these people with there resolutions, clogging up the library. Bro do you guys even read?  Hope I actually graduated lol Hope I actually graduated lol  oh fuck    12/26/12, 5:00 PM\tFinal grade roll - rolls grades to academic history\n\n\n12/26/12\tRun GPA calculation and academic standing\n\n\n12/27/12\tTerm controls are set to display final grades to students via Self-Service\n\n\nhttp://www.registrar.illinois.edu/staff/records/grades_processing.html SO THEY DON'T COME OUT TIL TOMORROW?! From what I can remember they will come out of anytime between now and tomorrow. \n\nAlso I think grades show up under Academic History before Final Grades Oh god. The cable company gives better time windows than that. They are up now in Academic History for me. Yeah, some are, some aren't. That was a LONG hour. From what I can remember they will come out of anytime between now and tomorrow. \n\nAlso I think grades show up under Academic History before Final Grades 12/26/12, 5:00 PM\tFinal grade roll - rolls grades to academic history\n\n\n12/26/12\tRun GPA calculation and academic standing\n\n\n12/27/12\tTerm controls are set to display final grades to students via Self-Service\n\n\nhttp://www.registrar.illinois.edu/staff/records/grades_processing.html  5 Pm I believe to be exact That's when final grades \"roll to academic history\", but then it says that it won't be available for students to view until tomorrow... What do? That's when final grades \"roll to academic history\", but then it says that it won't be available for students to view until tomorrow... What do?  The anticipation is killing me, especially because every time I check grades in compass for my PS 220 some new fucking numbers pop up in the total department, and I have no idea what they mean.  This wouldn't be so bad if I weren't at around 50% for some reason. The anticipation is killing me, especially because every time I check grades in compass for my PS 220 some new fucking numbers pop up in the total department, and I have no idea what they mean.  This wouldn't be so bad if I weren't at around 50% for some reason. PS220...haaaaaahahahaha. I'm so sorry, I just hope I passed that class. B- Good enough, never again.    Record 12 / 38,764 processed ... Please Wait.   How can we check them? DARS as well as \"Check grades\" hasn't updated...\nThe site says that they only roll to academic history at 5:00, but that tomorrow they are made available to self-service. Has anyone been able to check grades already? How can we check them? DARS as well as \"Check grades\" hasn't updated...\nThe site says that they only roll to academic history at 5:00, but that tomorrow they are made available to self-service. Has anyone been able to check grades already? not ready for me yet How can we check them? DARS as well as \"Check grades\" hasn't updated...\nThe site says that they only roll to academic history at 5:00, but that tomorrow they are made available to self-service. Has anyone been able to check grades already?     Does anyone know if there's a deadline for reporting late grades? One of my classes is finalized and reported as NR (I'm assuming its just my professor, I went to every class and did every assignment, and I'm expecting an A). Is there a deadline in which he has to report the grades? Or am I stuck waiting? [From what I understand about the schedule,](http://www.registrar.illinois.edu/staff/records/grades_processing.html) the deadline for submitting grades the easy way was noon today.\n\nYou should probably email the professor. faaaaaack. thanks. Does anyone know if there's a deadline for reporting late grades? One of my classes is finalized and reported as NR (I'm assuming its just my professor, I went to every class and did every assignment, and I'm expecting an A). Is there a deadline in which he has to report the grades? Or am I stuck waiting? I have an NR too. I'm just going to wait a while and see what happens to it. I'm pretty sure it just means the professor hasn't entered the grades.  I have some final grades up on compass. I got a 89.98% in one of my history courses...and my professor won't round it up to an A minus. Merry Christmas to me : [ What professor?  I'd like to know too, tight with many and I'd tell them whats up now that I'm a grad! I have some final grades up on compass. I got a 89.98% in one of my history courses...and my professor won't round it up to an A minus. Merry Christmas to me : [  They start rolling out in your academic history around 5 so get your F5 keys ready    They roll to academic history at five. They'll start showing up shortly on the academic history page as the computer processes them. Keep refreshing.  Yep. So far 2 out of my 6 classes have been updated, and it's in alphabetical order...this is like some sort of sick mind game Yep. So far 2 out of my 6 classes have been updated, and it's in alphabetical order...this is like some sort of sick mind game   I have two grades up... except it says my grades were not reported. o_O    I can't see my grades because of a financial hold. The Reason is \"Contact Accounts Receivable\" and the Originator is \"OBFS Account Receivable Holds\". I have no idea what these mean. Can someone help me out? Check your student account and see if you owe money. If you do, that's why. Just pay it and the hold will be lifted. If you don't, contact the Office of Business and Financial Services (OBFS).    Where are you all seeing this!?!?!?! I can't find it\n Where are you all seeing this!?!?!?! I can't find it\n ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15gw5h/psa_final_grades_for_the_fall_2012_semester_will/"
  }, {
    "id" : 25,
    "title" : "Does anybody know what to do if you have a grade discrepency?",
    "snippet" : "I got a 76.1% in one of my classes, which should be a C.  Instead, I got a D.  I already e-mailed my professor but I got an auto response saying that she won't be answering e-mails until Jan 12.\n\nDoes anybody know who I need to talk to?  This is in a Sociology course.  The same thing happened to me in a soc class as well. I'm planning on emailing the TA and the professor tomorrow morning to see what happens next.   \nFrom what I know, if there is a grade discrepancy, you're supposed to contact the instructor so you may just have to wait until she contacts you back. I hope you get your grade fixed!  Is your professor Dr. Gille by any chance?  I think that the last day to change a grade is sometime in the middle of  next semester.So you should be fine if she doesn't respond until the 12th of January.    &gt; I got a 76.1% in one of my classes, which should be a C.\n\nWhy do you say that? Professors can really give whatever grade they want. Maybe the class did so well a C was 80-85%. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15hxkd/does_anybody_know_what_to_do_if_you_have_a_grade/"
  }, {
    "id" : 26,
    "title" : "Changing majors as a junior",
    "snippet" : "I've stuck with my original major (in engineering) and I hate it.. and as a result my gpa has bombed now to 2.77. Is it too late for me to change to like econ, business or poly sci? Or am I just fucked forever now? (Should I just continue in my major and try and apply myself more so I can graduate with like a 3.05ish gpa?) ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15i6jk/changing_majors_as_a_junior/"
  }, {
    "id" : 27,
    "title" : "Academic Probation Clarification!",
    "snippet" : "I've seen multiple conflicting answers to this - will something come in the mail to my parents stating that I'm on academic probation (engineering)? Can somebody who had recently been on it clarify this for me?   No. \n\nI'M SO EXCITED I'M OFF PROBATION.  No. \n\nI'M SO EXCITED I'M OFF PROBATION.  Were you in eng/was this recent No. \n\nI'M SO EXCITED I'M OFF PROBATION.  So will I just get an email in the next few days about it then to my illinois.edu account?  No. \n\nI'M SO EXCITED I'M OFF PROBATION.  No. \n\nI'M SO EXCITED I'M OFF PROBATION.    Yeah.... That was my conflicting answer. When I was on probation three years ago, I believe they sent a letter, but I guess I was mistaken. Now they use the online system. They send you an email. You respond by clicking confirm. SORRY ABOUT THAT. Don't worry. Just enjoy break and get ready to do better. But tell your parents sometime, because that's a lot of stress to deal with and hide. Good luck next semester. I've seen 2 ppl say this   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15i51y/academic_probation_clarification/"
  }, {
    "id" : 28,
    "title" : "On academic probation now...freshman in engineering. ",
    "snippet" : "Scared/confused about what to do next...help?  [For grade replacement](http://www.reddit.com/r/UIUC/comments/158cb5/grade_replacement/)\n\n[From someone in a similar situation]\n(http://www.reddit.com/r/UIUC/comments/159pkd/academic_probation_question/)\n\n[Other advice](http://www.reddit.com/r/UIUC/comments/159kjj/advice/)\n\nTake this break and try to do as much introspection as possible. Try to identify the WHY and the HOW as to this happening. And remember, **THIS SHIT IS HARD.** This is one of the most difficult colleges in one of the most difficult universities in the country. Its not surprising to have adjustment problems when you start, not because of issue of intelligence, because if that were the case, they wouldn't have let you in to begin with, but the issues of class pace, organization, group studying and work, emotional regulation, and the most important one, lack of self efficacy: the feeling that you don't belong. Just remember, life isn't over at 18 or 19, you got a long time to go. College is a marathon. So, get your support system ready, and your available resources in check - there's a lot of catching up to do. Just put your head down in the books and keep running. &gt; THIS SHIT IS HARD.\n\n[This might help.  Feel better.](http://ex-lax.com/images/productImage.jpg) [For grade replacement](http://www.reddit.com/r/UIUC/comments/158cb5/grade_replacement/)\n\n[From someone in a similar situation]\n(http://www.reddit.com/r/UIUC/comments/159pkd/academic_probation_question/)\n\n[Other advice](http://www.reddit.com/r/UIUC/comments/159kjj/advice/)\n\nTake this break and try to do as much introspection as possible. Try to identify the WHY and the HOW as to this happening. And remember, **THIS SHIT IS HARD.** This is one of the most difficult colleges in one of the most difficult universities in the country. Its not surprising to have adjustment problems when you start, not because of issue of intelligence, because if that were the case, they wouldn't have let you in to begin with, but the issues of class pace, organization, group studying and work, emotional regulation, and the most important one, lack of self efficacy: the feeling that you don't belong. Just remember, life isn't over at 18 or 19, you got a long time to go. College is a marathon. So, get your support system ready, and your available resources in check - there's a lot of catching up to do. Just put your head down in the books and keep running.  Ouch dude. I had a student back in the 80s who was put onto academic probation. He was immediately kicked out of the university and the police were informed.\n\nNext thing you know he's on the run from the police because he can't afford a lawyer that is good enough to convince a judge he is \"Not Guilty\" to Class A felony of \"Not Trying.\"\n\nI saw him on America's most wanted for a few weeks and then he was caught and sentenced to 15 years in prison. \n\nAfter the prison sentence I guess he couldn't find a job because his freshmen year, first semester GPA was too low. :( I saw him begging for money outside of IHOP on green street. Whenever he would beg $5.12 off some students he would buy himself spicy chicken at Cravings to reminisce on his early days as a freshmen in EE. \n\nPoor Guy, his life really fell apart. Ouch dude. I had a student back in the 80s who was put onto academic probation. He was immediately kicked out of the university and the police were informed.\n\nNext thing you know he's on the run from the police because he can't afford a lawyer that is good enough to convince a judge he is \"Not Guilty\" to Class A felony of \"Not Trying.\"\n\nI saw him on America's most wanted for a few weeks and then he was caught and sentenced to 15 years in prison. \n\nAfter the prison sentence I guess he couldn't find a job because his freshmen year, first semester GPA was too low. :( I saw him begging for money outside of IHOP on green street. Whenever he would beg $5.12 off some students he would buy himself spicy chicken at Cravings to reminisce on his early days as a freshmen in EE. \n\nPoor Guy, his life really fell apart. Reading these replies is like watching blind people play teeball.  Ouch dude. I had a student back in the 80s who was put onto academic probation. He was immediately kicked out of the university and the police were informed.\n\nNext thing you know he's on the run from the police because he can't afford a lawyer that is good enough to convince a judge he is \"Not Guilty\" to Class A felony of \"Not Trying.\"\n\nI saw him on America's most wanted for a few weeks and then he was caught and sentenced to 15 years in prison. \n\nAfter the prison sentence I guess he couldn't find a job because his freshmen year, first semester GPA was too low. :( I saw him begging for money outside of IHOP on green street. Whenever he would beg $5.12 off some students he would buy himself spicy chicken at Cravings to reminisce on his early days as a freshmen in EE. \n\nPoor Guy, his life really fell apart. I think there's a joke here but I don't get it. Explain, someone?\n\nOh downvotes? Once again, fuck you UIUC. You continue to prove yourself as the shittiest sub around. Even asking to explain a joke in /jokes will not get you downvotes.  sarcasm Yeah but it's not coherent. And not in the way that sarcasm is supposed to be incoherent, but just incoherent.  Lets give the benefit of the doubt and call it stream of consciousness. I had trouble with it the first few times I read it and then I saw the whoosh comment below. and them I'm like yeah. whoosh. Haha yeah that's more or less what I did too. I started to read and thought \"this makes no sense but isn't sarcasm.\" Then I saw the whoosh and thought I must have missed something, but I definitely didn't. I don't know. I'll just move on.  Ah, please forgive my English. I am from Bulgaria Ouch dude. I had a student back in the 80s who was put onto academic probation. He was immediately kicked out of the university and the police were informed.\n\nNext thing you know he's on the run from the police because he can't afford a lawyer that is good enough to convince a judge he is \"Not Guilty\" to Class A felony of \"Not Trying.\"\n\nI saw him on America's most wanted for a few weeks and then he was caught and sentenced to 15 years in prison. \n\nAfter the prison sentence I guess he couldn't find a job because his freshmen year, first semester GPA was too low. :( I saw him begging for money outside of IHOP on green street. Whenever he would beg $5.12 off some students he would buy himself spicy chicken at Cravings to reminisce on his early days as a freshmen in EE. \n\nPoor Guy, his life really fell apart. haha, sounds like someone's bitter haha, sounds like someone's bitter        I'm a senior in Civil and was also in the same boat as a freshman. This may sound really absurd but, if you decide engineering is \"for you\", now would be the time to beast mode your networking skills. Meet everyone in all of your classes, form solid study groups (This is an important one!), and find solution manuals to all of your classes! I didn't really change my study habits (I studied usually by myself in my room) while trying to boost my GPA to get off probation, instead I just increased the intensity of my studying. This approach did not work so well. It took me a while to realize that college success is pretty dependent on studying efficiently, and that usually entails reaching out to people who are in the same classes as you. Engineering is HARD, and if you are struggling, chances are many others are too. Don't worry too much about being inadequate.There will always be some freak of nature smart people who take 18 hours of all technical courses and get straight A's. Don't feel intimidated by these kids, find them, and study with them. Once you get through the calcs, physics, and Tams (depending on what type of engineering you are), things get easier. \nBest of luck!\n Thanks, it really helps getting advice from someone who's been in a similar positon as me. I think improvement has a lot to do with maturing too, and getting out of that \"high school\" mode. College is a different scene and requires new levels of dedication. I'll definitely look into study groups and more networking. Much appreciated lastsemesterEng.   Such a shame... you land yourself in trouble by not studying, and expect everyone else to sympathize with you? Get off your lazy ass and study. College is difficult. Get over it. Sometimes it isn't lack of studying that lands them in Academic Probation. He/she is probably scared out of their mind and doesn't know where to turn to and is looking for some guidance. Maybe they did \"get off their lazy ass and study\" but it wasn't enough. I can't speak for him/her but please show some empathy. I can understand saying this to a sophomore/junior/senior, but he/she is a freshman! Cut OP some slack. Yeah, OP needs empathy, encouragement, and advice, not sarcasm to drive them away. Coddling him is of no use. My original post may have come across as offensive, but he must realize that he needs to work hard, and that high school and college are totally different. Coddling him is of no use. My original post may have come across as offensive, but he must realize that he needs to work hard, and that high school and college are totally different. I think the probation is enough to make them realize it too. They don't need to you to be a dick to them. \nIt's people like you I hate. When I was in trouble other people helped me feel better and that's just so often what people need. It's a shame you haven't had that experience you sheltered piece of shit. I haven't had that experience because I wasn't lazy enough to land myself in OP's situation. Such a shame... you land yourself in trouble by not studying, and expect everyone else to sympathize with you? Get off your lazy ass and study. College is difficult. Get over it. [Well then...](http://i2.kym-cdn.com/photos/images/original/000/200/420/BRTky.jpg) Such a shame... you land yourself in trouble by not studying, and expect everyone else to sympathize with you? Get off your lazy ass and study. College is difficult. Get over it. Such a shame... you land yourself in trouble by not studying, and expect everyone else to sympathize with you? Get off your lazy ass and study. College is difficult. Get over it.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15i0a1/on_academic_probation_nowfreshman_in_engineering/"
  }, {
    "id" : 29,
    "title" : "Cost of Belly Button Piercing in UC?",
    "snippet" : "Hi there! Has anyone had a navel piercing done near/on campus? How much was it, and where was it? Thanks!   Pain, I would think. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15ia22/cost_of_belly_button_piercing_in_uc/"
  }, {
    "id" : 30,
    "title" : "My dad's Christmas gift 30 years ago. ",
    "snippet" : "    Man, now I'm reminded that Record Service was a thing.      Nice board! There's a couple things that bother me, though...Like how is Kam's not the cheapest property on the board? And how is the cheapest property the Engineering Quad?  What's that racist symbol in the middle of the board for?\n**EDIT**: I was being sarcastic. I think it's pussy that we had to kill the Chief and am now a massive Seminoles fan. Racist symbol? I don't see anything. What's that racist symbol in the middle of the board for?\n**EDIT**: I was being sarcastic. I think it's pussy that we had to kill the Chief and am now a massive Seminoles fan.",
    "url" : "http://i.imgur.com/1RZPo.jpg"
  }, {
    "id" : 31,
    "title" : "Local MTG Players?",
    "snippet" : "I am in no way affiliated with them, but I thought I'd share the fact that one of our two LGS', Armored Gopher is having the Gatecrash Pre-Release at Winter War 2013, here in Champaign, and that you can register [here](http://armored-gopher.com/events/card-games/collectable/magic-gathering/2013-01-26/mtg-gatecrash-pre-release). \n\nAgain, I'm not affiliated at all, I just started playing again last week after a 3 year hiatus :)  I'm a fan of the armored gopher.  I usually go there for FNM.  How friendly are these to newish people? Will I just get rolled and have no fun? Because I've been playing some DotP and just recently started getting my first cards, but I don't really know anyone on campus who plays. I've never played any sealed drafts and not sure how good I will be at deck building... So, 3 years ago, I played super casual with a co-worker. Never owned cards, or had any semblance of \"Standard\" or \"Booster Draft\", etc.\n\nThis past Friday, I decided to go to the Return to Ravnica (The current set) Booster Draft. I got there an hour early. They hooked me up with a deck construction box, which had like 4 boosters and 250 cards. I then got my 3 packs from the BD, and was showered afterwards with like 500 cards. The people there were PHENOMENAL! They let me make mistakes, and untap, etc.\n\nI highly recommend giving Friday Night Magic a go, particularly the [Booster Drafts](http://wiki.mtgsalvation.com/article/Booster_draft). They also have a Standard tourney, but it is quite a bit more $ and time to keep up with.\n\nI'd say give a few BDs a go, and if you like them, go to the Pre-Release event. It is a large sealed event, so, as with booster draft, everyone starts on a level playing field.\n\nIf you decide to go to any events, just PM me and let me know, maybe we can meet up! I don't know if I'll go this week, but time will tell.\n\nTL;DR: Last week at this time I had no clue how to MTG, now I am going to a Pre-Release and have this collection in front of me (total of like $70 investment): [Link](http://imgur.com/fzabF).\n\n**Edit:** I went 2-6-1, and lost all 3 rounds, but it was fun, and most of the games were very close. It's Swiss format, so you play people with like-records. That sounds amazing. I don't come back to campus until the last day of break on the 13th, but I definitely want to check it out that week now (will they have it that week?). I haven't technically bought anything yet so I guess I'll go there early like you said and try to get a setup going.\n\nThanks! I'm 99% sure that every Friday they have FNM which is a draft + standard tourney. I don't imagine that it'll be any different next month :) How friendly are these to newish people? Will I just get rolled and have no fun? Because I've been playing some DotP and just recently started getting my first cards, but I don't really know anyone on campus who plays. I've never played any sealed drafts and not sure how good I will be at deck building...",
    "url" : "http://www.reddit.com/r/UIUC/comments/15hu7w/local_mtg_players/"
  }, {
    "id" : 32,
    "title" : "How dependable is Peoria Charter?",
    "snippet" : "Are they on time? I'm looking at a schedule that says they'll get me to Ohare by 10am, so how much delay can I expect?\nMy other option is illini shuttle, which reaches at 10.40am. My flight is at 12pm (intl. flight)   I've had only good experiences with Peoria Charter, and I've never heard of anyone having a bad one. Every time I've taken them, the bus has picked up on time and dropped off on time or early. They also have the best customer service line I've ever called (because I booked the wrong trip).\n\nIllini Shuttle would probably get you there on time, too, but see... well, the rest of this subreddit for Suburban Express' horrible business practices.\n\n**EDIT:** Also, Suburban Express restricts what kind of luggage you can have, and doesn't allow as much luggage. Those two things alone have been enough for me to eliminate Suburban Express as an option several times, and if you have to catch a flight right after, this is definitely something to consider.  Peoria Charter is great. I took it back to the suburbs and I enjoyed the ride. They came right on time, highly professional, and there were no problems. There is noticeably more leg room than SubEx. \n\nThe only gripe I had was that it took five hours to get to Woodfield Mall because of all the stops. It was in part my fault for booking so late and the heavy traffic near Midway. Otherwise, I would highly recommend taking Peoria on your next trip.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15h97c/how_dependable_is_peoria_charter/"
  }, {
    "id" : 33,
    "title" : "Has anybody switched from Computer Engineering to Electrical Engineering?",
    "snippet" : "I'm a senior in ECE. I came into school as a Computer Engineering major.I decided to switch to Electrical Engineering midway around my junior year.I  never really got to actually switching my major  .I have satisfied all of the requirements for Electrical Engineering( 3 out of 5 courses completed and I need only 2 more ece hours to complete technical credit requirements). Any advice?   My friend switched from CompE to EE after he found out he didn't like 190. It's entirely possible but I think major switching is done at the end of the year...so if you're graduating in May I don't know how that's going to work out.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15hcvn/has_anybody_switched_from_computer_engineering_to/"
  }, {
    "id" : 34,
    "title" : "Riding to Chicago on Thursday?",
    "snippet" : "Anyone? I will chip in for gas, of course",
    "url" : "http://www.reddit.com/r/UIUC/comments/15h7v0/riding_to_chicago_on_thursday/"
  }, {
    "id" : 35,
    "title" : "Look what my sister got me for Christmas, had to share!",
    "snippet" : "  i mean cool, but how is kams that expensive   omg, where can you get this?! omg, where can you get this?! She got it on Amazon used, the box is not in great shape. Friend of mine said his parents got this same game 30 years ago, so not sure if you'll be able to find it new. Since the I is used as the logo, your particular game board was probably made post 2007.  The most recognizable icon of the university was (and probably still is for a lot of people) the chief prior to that year. This game is old and was not made post 2007. Maybe it's a good thing the chief isn't for sale, somehow I get the feeling that would be pretty insulting to Native Americans. Also, the big \"I\" is just how the game was designed, probably cheaper and simpler than printing a chief in the middle of the board. Since the I is used as the logo, your particular game board was probably made post 2007.  The most recognizable icon of the university was (and probably still is for a lot of people) the chief prior to that year. omg, where can you get this?! omg, where can you get this?!       ",
    "url" : "http://i.imgur.com/mQpNr.jpg"
  }, {
    "id" : 36,
    "title" : "Is a 3.15 graduating GPA for an Engineering major enough to get a decent job?",
    "snippet" : "I kind of messed up the last few semesters so a reasonable finishing GPA for me will be around 3.15 and I'm very worried right now.  Can't speak for other majors, but I know in CS (and probably ECE too), that will still get you interviews with most of the companies that recruit at Engineering Career Fairs. After getting the interview, its up to you.  Its not about the GPA its about whats on your resume. GPA does nothing but gets a foot in the door. Your past experiences are what matters.  Does this apply to grad school too? Masters/phd\n\nwhy are all my posts getting downvoted? i am furious Does this apply to grad school too? Masters/phd\n\nwhy are all my posts getting downvoted? i am furious Does this apply to grad school too? Masters/phd\n\nwhy are all my posts getting downvoted? i am furious Does this apply to grad school too? Masters/phd\n\nwhy are all my posts getting downvoted? i am furious Its not about the GPA its about whats on your resume. GPA does nothing but gets a foot in the door. Your past experiences are what matters.     No. Who the hell is going to hire anyone with a B average at one of the top engineering schools in the world? You mad because you have something lower than 3.15? i think he was being facetious. I think he was being fellacious. I think he was being ironic I think you don't know how to use that word. Verbal Irony. Look it up. This was the proper use of the word. Hmm. Have an upvote.  Also, is grad school out of the question now? Also, is grad school out of the question now? Also, is grad school out of the question now?  GPA doesn't matter for all that long.  If you have time try to get an internship, and practice interview / job fair skills.  Those things can go a lot further than a perfect GPA.  \nStill work hard to pull it up, but its not the end of the world.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15ghjs/is_a_315_graduating_gpa_for_an_engineering_major/"
  }, {
    "id" : 37,
    "title" : "Who uses UIECU?",
    "snippet" : "I've found out that university students can use the employee credit union, and considering the bullshit that I've dealt with with TCF in the past (like their bullshit policy of never having more than one teller at a time), I'm looking for a change. Does anyone here use UIECU, and if you do, do you like it?  I use it. Checking, saving, credit card, vehicle loan. What kind of services do you need/use?   I do use UIECU. I like the people, they're pretty nice and can help you out pretty quickly. Also, since its a credit union, its easier to do more intense transactions, like getting a loan or credit card. The only thing that's better at TCF is the free hoody - its a really nice hoody. I never got the free hoodie. Dang that sucks. Hell, its one of my favorites. Anyway, the only other advantage - oops, guess this slipped my mind before - of TCF is ease of access. TCF has more ATM's (although I've noticed UIECU is getting more) and the actual bank is open longer than the Union branch of UIECU. However, if you have a car, you can go to the the other UIECU locations off campus if the union branch is closed. I do use UIECU. I like the people, they're pretty nice and can help you out pretty quickly. Also, since its a credit union, its easier to do more intense transactions, like getting a loan or credit card. The only thing that's better at TCF is the free hoody - its a really nice hoody. signed up for TCF for the free hoodie then switched banks. i didn't choose the thug life I do use UIECU. I like the people, they're pretty nice and can help you out pretty quickly. Also, since its a credit union, its easier to do more intense transactions, like getting a loan or credit card. The only thing that's better at TCF is the free hoody - its a really nice hoody. I've gotten 100 bucks for my first deposit at TCF. And 25 bucks for every referral.\n\nBut I use Chase How is Chase? I've heard about their smartphone apps and stuff, but as someone with a mere average intelligence phone, would it be beneficial to use them for their other benefits? &gt; someone with a mere average intelligence phone\n\nI have a dumbphone, even texting is painful.\n How is Chase? I've heard about their smartphone apps and stuff, but as someone with a mere average intelligence phone, would it be beneficial to use them for their other benefits? I think its great.\nI mean its pretty much free to use as a student. \n\nThey have a few ATMs around campus to use which suffice, I've had some fraudulent charges come up before (the experian thing that I am sure many people on campus have had) and they took care of it, and i direct deposit my paychecks with them and that usually works nicely. \n\nI also pay my credit card bills with them and its always done the same day/the next day. \n\nI don't know if you were implying that you don't have a smart phone, but if you weren't, the mobile app is actually really easy to use. You take the check you want to deposit, go to the deposit screen, take a picture of the front, hit ok, take a picture of the back, hit ok, and send.  I do not have a smartphone - I just wanted to get fancy with the description and it wasn't nearly as funny as I thought. \n\nThanks for the info.\n\nAnyway, what is this Experian thing that you're referring to? Take a look at [this](http://www.reddit.com/r/UIUC/comments/qm2fa/check_your_account_for_charges_to_experian/), [this](http://www.reddit.com/r/UIUC/comments/13d5eg/psa_fraudulent_charge_on_credit_card_experian/), [this](http://www.reddit.com/r/UIUC/comments/y6ab6/another_reminder_to_check_your_bankcard_accounts/)\n\nI had to go to the local branch, but they quickly fixed it.   Don't know much about UIECU, but I too got fed up with TCF and switched over to Chase. The lack of a branch on campus does not bother me in the least. Depositing of checks (the only service I needed to go to physical TCF branch for) can be done by the Chase mobile app.\n\nDepending on what services you need, Chase might also work.  I use UIECU. At the moment just for a credit card.\n\nThe main thing I would say about it is this: Credit unions are almost ALWAYS the better choice: \n\n1. You and your spouse/children are automatically able to be members for life. \n\n2. Rates are usually pretty solid.\n\n3. Fees are usually minimal to non-existent.\n\nThe only drawback is that occasionally they are not FDIC ensured. In this case, I'm not sure as I only use UIECU for a credit line, though I imagine they likely are. \n\ntl;dr Always (almost) go with a credit union when given the opportunity In fact, no credit unions are insured by the FDIC. Most, however, should be insured by the NCUA (National Credit Union Administration), which is simply the credit union equivalent of the FDIC. UIECU is one of those insured by the NCUA. I use UIECU. At the moment just for a credit card.\n\nThe main thing I would say about it is this: Credit unions are almost ALWAYS the better choice: \n\n1. You and your spouse/children are automatically able to be members for life. \n\n2. Rates are usually pretty solid.\n\n3. Fees are usually minimal to non-existent.\n\nThe only drawback is that occasionally they are not FDIC ensured. In this case, I'm not sure as I only use UIECU for a credit line, though I imagine they likely are. \n\ntl;dr Always (almost) go with a credit union when given the opportunity From what I read, the NCUA (http://www.ncua.gov/Pages/default.aspx) is the FDIC equivalent for credit unions, with similar deposit insurance.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15eicn/who_uses_uiecu/"
  }, {
    "id" : 38,
    "title" : "Former Rich South student body president charged with computer fraud at U of I",
    "snippet" : "  Damnit, I thought they caught the ECE hacker. Damnit, I thought they caught the ECE hacker.  Thought they charged an affluent Southerner.  The word \"hacker\" is so overused. When Mr. Brown gets out, I should challenge him to a hack-off.\n\nI'm sure I'd win handily. The main reason I was never apprehended is because I took premeditation and planning to the extreme of obsessiveness (Think Monk meets Kevin Mitnick), and never hacked for personal gain. Mr. Brown clearly did not, and got picked up easily with likely a lot of easy evidence pointing to him. &gt; never hacked for personal gain.\n\nThat is not true, you gained attention (disappointingly for you, only limited to reddit). All personal gain need not be monetary in nature. You gained something you seek and value - attention. That is not bad in itself, everyone needs attention to some degree, but the way you are seeking it is antisocial in nature. You are indeed correct as far as that goes, I did cause a lot of lulz. Although lulz is significantly harder to investigate forensically than bank account records, especially for University of Illinois Special Police's Doughnut Munching Dumbass Division.\n\nAnd my notoriety was not confined to reddit! Dr. Kangaroois, Supreme High Wizard of ECE, was forced to write a rather embarrassing email to the entire department explaining how I can't cancel final exams (although may I add, I did have the power to seriously fuck up finals if I had felt like it)! Perhaps the most hilarious part was where Dr. Kangaroois' personal assistant frantically emailed several sysadmins paranoid that the ECE-HEAD email account had been compromised and was going to send out more PENISmail. UISP and the DI both spent a short while (although not released to the public) trying to figure out who the hell I was, with marginally less success than checking for testicles on Chancellor Wise. I think the most bizarre thing is who you *think* you are. Comparisons to Monk, some amazingly powerful and sleuthful with extreme OCD? No, sorry, he solves crimes. Maybe you think you're some Anon figure, Cosmos the God or whatever UGNazi you're into? That's cute, but they don't need any M.S. in CS or what have you claim to be wasting your time on. \n\nCongrats, you made the department send out an email. They send out one every three days on average I'd guess. Guess who reads all of them? Very, very few people I'd guess. Sorry for your notoriety. And of course, to finish it off, there has to be some hint or rumors of **even more stories.** Because that's just what everyone wants, more info, you just keep us on the edge of our seats.\n\nOh wait, no you don't. You're a pest, a nuisance, a frustration into people's already busy lives. You have the \"power to seriously fuck up finals\" is it? Great, feel proud. I bet you're a real Spider-man right there, all power, no responsibility. Go home kid No need to get your panties in such a bunch over a little lulz! Your argument is invalid, because I sent more classes PENIS than you did.\n\nBut in all seriousness, you are all egging me on to start causing mayhem again on a larger scale, up to and including cancelling many exams. I think I've narrowed down the identity of the \"hacker,\" guys!\n\nJudging from his references to \"lulz\" and his childish demeanor, he most likely goes to Urbana Junior High or one of the Champaign middle schools.  At least, that's the only excuse I can think of for this guy. Hurr... you guys are really asking me to start up PENISmailing every ECE class again, right? Do you think I actually care whether ECE majors receive irrelevant emails from some bored aspie? No need to get your panties in such a bunch over a little lulz! Your argument is invalid, because I sent more classes PENIS than you did.\n\nBut in all seriousness, you are all egging me on to start causing mayhem again on a larger scale, up to and including cancelling many exams. Wow! I wish my e-penis was as big as yours!  Stop feeding the troll, people.  ",
    "url" : "http://news.google.com/news/url?sa=t&amp;ct3=MAA4AEgCUABgAWoCdXPYAQE&amp;usg=AFQjCNFMPvTPhroUUJyq5yACwzmmXzL5zw&amp;rt=IMOBILE_DYNAMIC_LOCAL_SECTION&amp;url=http://www.suntimes.com/news/metro/17001799-418/former-rich-south-student-body-president-charged-with-computer-fraud-at-u-of-i.html&amp;ei=2X3YUJmhHIqntwfQ_wE"
  }, {
    "id" : 39,
    "title" : "CS 498 courses",
    "snippet" : "I been hearing many negative things about these courses, especially that they're not organized. In particular, I'm signed up for the Art &amp; Science of Web Programming, and am a little hesitant to stick with the class.\n\nHonestly would  rather avoid something that is just an unorganized mess. Can anyone speak on their experiences in these \"special topics\" courses?  It depends on the specific class/professor. It would be unfair to generalize over all 498 courses since they're basically just courses with not enough interest (or too much red tape involved) to justify creating a standalone class.\n\nMy experience with CS 498-DH (computational photography) was great. It was probably one of the best courses I've taken here.     I'm in that as well, and I know the TA for that course is in this sub, I hope he can come comment.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15cpb7/cs_498_courses/"
  }, {
    "id" : 40,
    "title" : "Suitmakers around UIUC?",
    "snippet" : "Hi Guys,\n\nI'm wondering if there are suitmakers that charge a fair price in the vicinity of UIUC. Not sure if I should make a set in my home country of Singapore where prices are slightly steep for the quality and then have to lug it over when school starts in my already very full luggage.\n\nLooking at wool suits with a thread count of 150 and above.\n\nAny advice is appreciated, thanks!  A fully hand-canvassed 2pc-suit (blazer and pants) costs around US$1300 here. You can get off-the-rack suits tailored here for much less than that, but I doubt you're going to be able to find a custom made suit for less.  I'm not even sure that there's anyone in central Illinois still making custom suits, though there certainly would be up near Chicago. Keyword: Hand-canvassed. There's a difference between that and Men's Warehouse.  A fully hand-canvassed 2pc-suit (blazer and pants) costs around US$1300 here.        ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15crof/suitmakers_around_uiuc/"
  }, {
    "id" : 41,
    "title" : "How does summer school work?",
    "snippet" : "Retaking chem 102, 103, 104, 105 all at the same time over summer. Bad idea?  I mean, I think what many freshmen don't understand is that summer school is just like normal semester school only it's completed in 8 weeks. \nNo one will stop you from taking these courses, but they will be rigourous. Just because it's a summer term does not make it any easier.  What's a good guide line for the amount of credit hours to take during the summer semester?\n\n12 normal semester hours would be about how many credit hours over the summer? How about 18? There is no minimum for summer school. I am primarily cautioning the mindset that you just \"show up\" to summer school and expect to do really well. \nTo give you an idea, I took 9 hours this past summer (2 300-400 Math courses and ATMS 120), I had homework due 2 times a week in both math courses and ATMS 120 is a joke. The homeworks were just like a normal term and in some cases were exactly the same as the Spring term. A couple of years ago, I took PHYS 212 and MATH 241 over the summer. This was 8 hours if I remember right. I would recommend taking one of the chem packages so 102 and 103 and then some gen ed courses. I personally would recommend not taking all of the chem courses though. That's just me and what I learned from the past 3 years.  Building upon this, OP, if these are retakes, this means that you are having some difficulties with the material. Taking 102 through 105 at once means you wont have enough time to absorb the concepts presented from 102 or 104, especially because it takes time to do two labs at once. I agree with illinidevil, take either 102-3 or 104-5 and a gen ed so you can focus on mastering the chem. What's a good guide line for the amount of credit hours to take during the summer semester?\n\n12 normal semester hours would be about how many credit hours over the summer? How about 18? IIRC, 6 credit hours is considered the equivalent of \"full time\" over the summer semester.  I once took 12 credit hours in a summer semester and it was hardcore even though two of the courses were blow-off classes.  Would not repeat. \n\nI think 4 chem courses during the same summer semester is asking for trouble. Which is more important, getting them out of the way or maintaining your GPA? IIRC, 6 credit hours is considered the equivalent of \"full time\" over the summer semester.  I once took 12 credit hours in a summer semester and it was hardcore even though two of the courses were blow-off classes.  Would not repeat. \n\nI think 4 chem courses during the same summer semester is asking for trouble. Which is more important, getting them out of the way or maintaining your GPA?          ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15bp6t/how_does_summer_school_work/"
  }, {
    "id" : 42,
    "title" : "Finally got a chance to watch a basketball game...",
    "snippet" : "    I'm trying to look at this game positively. Yes, we lost to Missouri. Again. But while we shot horribly and were destroyed on the boards, we still only lost by 9 points (thanks to the last second layup). If a few shots here and there had fallen, we might be talking about the Illini beating a rival and staying undefeated.  A few more shots definitely would have fallen if they didn't take such awful shots. Why on earth were they trying so many threes from the NBA line? They were never going to keep up that 3 point percentage but especially not like that. They were playing the best during the second half when they stopped hitting threes and started driving to the basket    For some reason, I think our game strategy is 3s. They did the same thing with success at another game I saw.   For some reason, I think our game strategy is 3s. They did the same thing with success at another game I saw. A few more shots definitely would have fallen if they didn't take such awful shots.     ",
    "url" : "http://memegenerator.net/instance/32331277"
  }, {
    "id" : 43,
    "title" : "Has anyone taken ANSC 299?",
    "snippet" : "  Have you tried asking in the AnSc Facebook group? https://www.facebook.com/groups/211856678923326/\n\nAlso, for future references for other classes (I don't see 299 listed here) try this google doc: https://docs.google.com/a/illinois.edu/spreadsheet/ccc?key=0AncsRdKNqXABdDhqUkFvUmREQThhVUFMa0thRVV1anc#gid=0\n\n**Edit:** Oops, I just assumed you were an AnSc major...Guess you won't need the google doc after all. Is there a google doc like that for classes overall/gen eds?",
    "url" : "https://my.illinois.edu/uPortal/render.userLayoutRootNode.target.u41998l1n6.uP?pltc_target=210253.u41998l1n6&amp;pltc_type=RENDER&amp;pltp_course=ANSC&amp;pltp_term=spring&amp;pltp_classNumber=299&amp;pltp_action=searchClassDetail&amp;pltp_year=2013#u41998l1n6"
  }, {
    "id" : 44,
    "title" : "Advice..",
    "snippet" : "Hey, I've been lurking this subreddit for awhile now, but I really do need some advice/help.\nI'm a freshman, and I took Physics 211 this semester and really fucked up and got a D. I got an A, B, and B-, but the D, really fucked me, and now my GPA is 2.5.\n\nAdvice, I know there is grade replacement but honestly something motivational or advice on how to study at this place would be welcome? I'm pretty low in the dumps. I don't even want to tell my parents because I was a pretty good student in high school I know I could of done better but I didn't focus on the right things my first semester here. \n\nEDIT: It's worth mentioning I'm premed (Bioengineering) so I know I need a 3.5 at least to be competitive for grad schools. I was hoping to have around a 3.5 my first semester here..Any advice is welcome.   First and foremost - The reason that you had trouble isn't because of your intelligence, if that were the case, you never would have gotten into this school, especially in bioengineering. The reason that you had trouble is because ITS HARD. If people tell you otherwise, either a) they had a great physics teacher in high school which taught them this stuff already, or b) they're saying \nBS to sound smart. Some people get things more quickly than others in classes like these, but it definitely aint a cakewalk. The college of engineering is one of the most difficult colleges in the country, and stuff like this is why. Your class sizes are huge, the material is fast, and in the case of the physics department, there's not much extra course materials to help you out. Its hard. You'll get used to it.\n\nSecond, life doesn't end when you're 19. If you keep making progress, eventually you'll reach your goal. Being a doctor is hard, but the challenges are finite.\n\nThird, I don't know that this applies to you, but I had a lot of difficulty throughout my time in ENG - I felt like everyone was better, more prepared, and could just buckle down when they needed to and finish their work, and I just couldn't. I knew something was wrong, and I went to the counseling center (a couple of separate stints) to try to get help for it. Eventually, I learned last year that I had a mild form of ADHD. I finally understand more about myself and I've been able to work with it and be more patient and forgiving with myself. Im definitely not going to diagnose you, but if you really feel that you're incapable of handing the work for some reason (known or unknown), use the resources in the U of I to help and learn how you work and how you are. Everybody in ENG has the intellect to succeed - the challenge is dealing with the emotional or organizational aspects of school.\n\nLastly, over my time in college, especially in a place like this, I leaned at least one thing - **college is an opportunity, nothing more.** Use every day to further yourself, because its no one else's responsibility anymore to make sure that you do. You're an adult, and you made a big investment in school that you'll have to pay for no matter how well you do. Just remember, you always have an opportunity to help yourself - you just have to be resourceful enough to find what you need to succeed and patient enough to see yourself through the process of improvement.\n\nA bit long winded, I know, but hopefully some of my words helped you out. Now go enjoy the break and come back strong! &gt; I felt like everyone was better, more prepared, and could just buckle down when they needed to and finish their work, and I just couldn't. I knew something was wrong, and I went to the counseling center (a couple of separate stints) to try to get help for it. Eventually, I learned last year that I had a mild form of ADHD. I finally understand more about myself and I've been able to work with it and be more patient and forgiving with myself. \n\nIf you don't mind sharing, can you say how exactly were you diagnosed? I too struggle with and get overwhelmed by simple tasks that other people find easy, like meeting deadlines, being punctual, time management, making plans and sticking to them, focusing on the task at hand and not getting distracted, keeping my place tidy and organized, etc. Most frustratingly, I run to the bus stop every day and still miss my bus. I feel these things are so easy for other people that it is almost second nature for them to be able to be on top of these things. I was diagnosed at the counseling center - I had an interview with one of the ADHD specialists and he realized that I had ADHD-NOS (Not otherwise specified). In my case at least, it means that I have mild severity now (as a child, I was way worse, but ADHD can go into remission as one gets older), but its still interferes with my functioning. Over the past year, I've been going to support groups for ADHD and procrastination at DRES and the counseling center and its helped me out a lot about adjusting my paradigms from \"Why does everyone else not have a problem with this?\" to \"I'm going to have to do this differently if I want to succeed.\" It was really satisfying, because I had a couple of stints at the counseling center previously for just more general counseling (one was more of a coach-type relationship), trying to figure out why I kept bottoming out and running in place. \n\nI'm no doctor, but if you do have concerns, you don't have anything to lose by going - although there is a waitlist for testing. Also, use Reddit as a resource - browse /r/ADHD to get idea of the challenges they face and see if you relate; trust me, its a good place - the mods there are the best - best reddit community I've seen by far. They have FAQ Friday, which is a thread where people ask questions and will get answered, most likely by a mod. You can post general threads on there too though. &gt; I'm no doctor, but if you do have concerns, you don't have anything to lose by going - although there is a waitlist for testing.\n\nIs this at the Counseling Center? Can I just call up and ask to be put on the waitlist, or do I need a referral from someone? Do you remember who you saw?  I've posted this [earlier](http://www.reddit.com/r/UIUC/comments/13uyg8/how_stressful_is_the_cs_program_at_uiuc_sorry_if/c77y7xx), and am re-posting it:\n\n* Form study groups to do homeworks, MPs and to prepare for quizzes and exams. It is a sort of defense against procrastination because someone in your group is likely to be more conscientious and push you to start working on assignments early. It is more fun and less stress to study in a group, and you also get to know people and make friends that way.\n\n* Good grades are not about intelligence (you already have the required level if you get admitted to UIUC). They are about time management, organizational skills, networking (forming study groups, etc.). These soft skills will also be very useful later in life, in fact probably more than technical skills after a point.\n\n* UIUC is a good university with tons of resources to help you. Make use of those! Go to office hours, in fact, if possible, I would say go to office hours even if you were able to do the homework without help. Concepts are often reiterated in office hours and you might learn something new or understand something better just by going to office hours and observing the professor or TA answer someone else's questions. Grainger has study rooms, areas where you are allowed to talk and discuss - utilize those resources. \n\n* Do not take on more courseload than you are able to manage. You don't want to be miserable and stressed out trying to get your courses done sooner and graduating early. Thank you so much. Can't really express how down I am feeling right now. Thank you so much. Can't really express how down I am feeling right now. I've posted this [earlier](http://www.reddit.com/r/UIUC/comments/13uyg8/how_stressful_is_the_cs_program_at_uiuc_sorry_if/c77y7xx), and am re-posting it:\n\n* Form study groups to do homeworks, MPs and to prepare for quizzes and exams. It is a sort of defense against procrastination because someone in your group is likely to be more conscientious and push you to start working on assignments early. It is more fun and less stress to study in a group, and you also get to know people and make friends that way.\n\n* Good grades are not about intelligence (you already have the required level if you get admitted to UIUC). They are about time management, organizational skills, networking (forming study groups, etc.). These soft skills will also be very useful later in life, in fact probably more than technical skills after a point.\n\n* UIUC is a good university with tons of resources to help you. Make use of those! Go to office hours, in fact, if possible, I would say go to office hours even if you were able to do the homework without help. Concepts are often reiterated in office hours and you might learn something new or understand something better just by going to office hours and observing the professor or TA answer someone else's questions. Grainger has study rooms, areas where you are allowed to talk and discuss - utilize those resources. \n\n* Do not take on more courseload than you are able to manage. You don't want to be miserable and stressed out trying to get your courses done sooner and graduating early. As another student who would like to do better, with whom should I set up study groups?  Should it be people from my classes?  Thanks! Sit in the front if you form them with kids you meet in class.\n\nStudy group with kids who sit in the front = good\n\nStudy group with kids who sit in the back = \"Hey man, have you done the HW yet? Can I copy off yours?\" As another student who would like to do better, with whom should I set up study groups?  Should it be people from my classes?  Thanks! Yes, form study groups with people from your classes so that you can discuss the material, do homeworks and MPs, and prepare for quizzes and exams together. Do this especially for the harder courses. Group study makes hard courses less stressful. It helped me stay motivated and interested instead of getting disillusioned by difficult course material. Try to find some smart and serious but nice and friendly study buddies in your early semesters, chances are that they will be taking a lot of the same courses as you during the later semesters too, so you can be study buddies with them for several semesters instead of hunting for new ones for every class. Thanks a ton!  I have a hard time making friends and actually talking to people, but I'll be trying as hard as possible to start getting some study buddies.  It makes sense that it would be far easier and better to have study buddies.  Again, thanks! Forming study groups is actually a good way to make friends, it is easier/less awkward to say \"Hey, did you get started on the homework yet? I am finding it hard, do you want to do it together? I am planning to work on it at 7 tonight at Grainger.\" than say \"Hey, wanna hang out?\"\n\nIf you have a hard time making friends you could make use of university resources to help you - UIUC has a lot of resources, you just have to find them and be willing to take the initiative to use them. For example, the Counseling Center organizes [Tuesday @ 7 Workshops](http://www.counselingcenter.illinois.edu/?page_id=72) to help people with common problems many college students face, and the first workshop of the next semester is on developing social confidence.     I don't know how helpful this will be for you, but there are student support services for people who have nonvisible disabilities. I'm already in graduate school and I have adult onset ADHD, which is technically a learning disability. I've been seeing counselors at McKinley for ADHD and social anxiety this whole semester, and it just got recommended to me to enroll with getting an academic coach and whatever else through this department. \n\nLink here: http://www.disability.illinois.edu/academic-support\n\nI was also a really bright high school student (and did not have ADHD at that time), but as I got older, my sense for motivation went out the window and I know that I suffered from social anxiety *immensely* as an undergrad. I don't know enough about you or your situation, but this might be a start. &gt; I have adult onset ADHD, which is technically a learning disability\n\nHow exactly did that get diagnosed?  I was told by a friend of mine who has bipolar disorder and severe ADHD that some of my everyday problems with doing one task at a time and doing it to completion sounded familiar. I went to a psychiatrist at McKinley and completed a diagnostic survey that confirmed for my doctor suspicions of ADHD. My version is not hyperactivity, but mostly attention deficit.  &gt; I went to a psychiatrist at McKinley and completed a diagnostic survey that confirmed for my doctor suspicions of ADHD.\n\nDo you just call up Dial-A-Nurse at McKinley and ask to be tested? Or do you need a referral from your primary care provider? \n\nIs the diagnostic survey a questionnaire? Is it like the quizzes you can find online? In that case why do you need to see a specialist, can't you diagnose yourself? I was told by a friend of mine who has bipolar disorder and severe ADHD that some of my everyday problems with doing one task at a time and doing it to completion sounded familiar. I went to a psychiatrist at McKinley and completed a diagnostic survey that confirmed for my doctor suspicions of ADHD. My version is not hyperactivity, but mostly attention deficit.  &gt; some of my everyday problems with doing one task at a time and doing it to completion sounded familiar.\n\nI struggle with time management and focus too (I think I struggle more than others, though I am sure everyone struggles to varying degrees and it is a normal distribution), but I sometimes wonder if it is a skill not yet learned/acquired properly or whether it is an intrinsic trait. Considering it an intrinsic trait is probably not helpful. I was a very focused student in high school and then my social anxiety took a huge dive as I got older as an undergraduate student. I was a high performing undergrad who knew how to study, but that has changed as I have gotten older. \n\nDRES will help students pick up the time management skills that are helpful for counteracting learning disabilities like ADHD (from what I understand), but for many people, it isn't helpful to think of learning disabilities as an inherent deficiency. Instead, it is better to think about ways of treating what can be observed as a real challenge to academic success and allowing that person to achieve more.  &gt; some of my everyday problems with doing one task at a time and doing it to completion sounded familiar.\n\nI struggle with time management and focus too (I think I struggle more than others, though I am sure everyone struggles to varying degrees and it is a normal distribution), but I sometimes wonder if it is a skill not yet learned/acquired properly or whether it is an intrinsic trait. In my case of ADHD, the biological traits have faded somewhat with time -but the behavior doesn't necessarily. I got diagnosed when I was 21, so for the first 21 years of my life, I had these traits and assumed they were just an odd part of my behavior an not related to anything - after all, I've only been me, so no one to compare it to. And also, everyone's behavior towards me was that they understood that I was just like that sometimes. So, If I think its just me, and and so does everyone else, the behaviors are conditioned and reinforced. Now Im seeing things in a new way at least and trying to understand my ability compared to everyone else's. &gt; In my case of ADHD, the biological traits have faded somewhat with time\n\nWhat do you mean by biological traits?\n\n&gt; So, If I think its just me, and and so does everyone else, the behaviors are conditioned and reinforced.\n\nYes, it has caused me interpersonal difficulties. I am really embarrassed that I am often late and often people think I don't respect their time, but nothing could be further from the truth. I usually end up apologizing profusely though I am never able to give a satisfactory explanation for consistently being late.            If you're getting a 2.5 GPA you aren't pre-med... Just sayin'\n\nYou can fix that GPA pretty quickly though since you're only a freshmen.\n\nAnyways you didn't really give that much info in the main topic. Why do you think you did poorly? I'm sure you could look back on the semester and figure out your main mistakes. \n\nBesides that I'd say AlmostGrad100's post is pretty awesome and you should check out /r/GetStudying  SDN's finest.... you know it. Got downvoted for being realistic gg Is being realistic a euphemism for douche? Just because you have a low GPA as a first semester freshman doesn't mean you can't be pre-med. Getting mostly A's or A-'s for the rest of his time here could significantly boost his GPA. Having a decent MCAT and around a 3.5 [makes him competitive.](https://www.aamc.org/download/270906/data/table24-mcatgpagridall0911.pdf) And if he's willing to go the DO route they honor grade replacement and the average GPA for applicants for DO schools is 3.41, which he could have by this time next year.\n\nOne bad semester will not ruin someone's goals in life. OP, if you read this, you can do it. It will take hard work but most of the people in this thread have good advice. Just remember your goals and use those as motivation to study hard and be sure to find people who can help you along your path.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/159kjj/advice/"
  }, {
    "id" : 45,
    "title" : "Illinois College of Law Class of 2016?",
    "snippet" : "I just got accepted via early decision and I'll be going here in the fall for law school, exp graduating in 2016. Will any other redditors be joining me? :)\n\n      http://assets.sbnation.com/assets/1851131/airguitarbro.gif i really don't understand all of the hostility on r/uiuc. regardless congratulations on getting in! I don't understand how OPs submission can be construed as hostility toward him/herself, but maybe I'm missing something.\n\nAnyways, I'm class of 2015 with shay626. Congratulations, you're in for a fun time.  It's a great school. I don't understand how OPs submission can be construed as hostility toward him/herself, but maybe I'm missing something.\n\nAnyways, I'm class of 2015 with shay626. Congratulations, you're in for a fun time.  It's a great school.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15a9sg/illinois_college_of_law_class_of_2016/"
  }, {
    "id" : 46,
    "title" : "Academic Probation Question",
    "snippet" : "Hi, I'm a freshman and in the college of Engineering. So far I have a 1.3 GPA (I have bad test anxiety and I had medical issues.) and I'm wondering just how bad academic probation is and what happens while on it. I lost my scholarship, I'm scared, and I don't want to tell my parents. HELP!\n\nEDIT:Clearing up the medical issues thing: I had a sinus infection that was supposedly \"treated\" by McKinley (read: UNTREATED) that turned into strep throat which then turned into Mono (&lt; got treated by my doctor when I visited home). I was pretty sick for about a month.\nAlso was told that these are my precurved final grades, not my legit ones. I haven't even gotten the probation e-mail. Thank you for the help though!  As an eng student who has had his share of problems, I can tell you a few things. \n\nThe probation process works like this: at the beginning of a semester, you will be required to go to a probation meeting that the eng deans talk at. The meeting itself is useless, but what you have to do is talk to your deans often, especially if start out having more trouble next semester. Here's why: at the end of a semester that you're on probation, is that the eng deans will meet in a room and review every single person that was on probation. If you either a) have less than a 2.0 or b) got higher than a 2.0 and took a bunch of classes that don't count towards and requirement to graduate (like bowling), the deans look at what resources did you use to help yourself improve. Did you go to them for advising? Did you go to academic resources such as the counseling center or DRES? Did you get tutoring? Did you go to office hours? If you didn't, they won't have a record of it. And if they don't have any evidence that you tried to get better, the only logical conclusion they can make is that you didn't. And if they make that conclusion, then they remove you from the university. \n\nIf that happens, you must be out of the uni for at least 1 year. You can re-apply after that, as long as you have proof that what ever caused you to have poor performance has improved. This is better than the alternative - never kicking you out and letting your GPA slip into oblivion so that your GPA will never be a 2.0 no matter how hard you work, which is the requirement to get a degree from the U of I. \n\nIf yo are not removed, you're on super-secret probation. But you have another chance to fix things, so take advantage of it. If you get a 2.0 in this, you go back to regular standing.\n\nIf you need to take a semester off, then do so. Leaving voluntarily and coming back later is better than being kicked out. It also costs less.\n\nAnd most importantly, tell your parents. As an adult, you're now fully in charge of taking care of your education, but parents want to help kids with their struggles. Its more about the emotional aspect, because like I said, you're in adult in college - there really isn't much they can do anyway other than provide support for you. But if you don't want to tell your parents - ~~there's a probation letter coming in the mail. Tear it up before they see it.~~ \n\nIts long winded, but I hope this helps. Just take your mind off things and enjoy the holidays. Come back strong!\n\n**EDIT:** I was mistaken about how the probation letter was delivered. In previous years, it was sent by mail, but now it is an electronic letter that is sent by email to you. You must go to the My.ENGR portal and confirm it as it is one of the requirements of your probation I believe. Sorry for the worry and fretting this has caused during your holiday season. Super secret double probation!? As an eng student who has had his share of problems, I can tell you a few things. \n\nThe probation process works like this: at the beginning of a semester, you will be required to go to a probation meeting that the eng deans talk at. The meeting itself is useless, but what you have to do is talk to your deans often, especially if start out having more trouble next semester. Here's why: at the end of a semester that you're on probation, is that the eng deans will meet in a room and review every single person that was on probation. If you either a) have less than a 2.0 or b) got higher than a 2.0 and took a bunch of classes that don't count towards and requirement to graduate (like bowling), the deans look at what resources did you use to help yourself improve. Did you go to them for advising? Did you go to academic resources such as the counseling center or DRES? Did you get tutoring? Did you go to office hours? If you didn't, they won't have a record of it. And if they don't have any evidence that you tried to get better, the only logical conclusion they can make is that you didn't. And if they make that conclusion, then they remove you from the university. \n\nIf that happens, you must be out of the uni for at least 1 year. You can re-apply after that, as long as you have proof that what ever caused you to have poor performance has improved. This is better than the alternative - never kicking you out and letting your GPA slip into oblivion so that your GPA will never be a 2.0 no matter how hard you work, which is the requirement to get a degree from the U of I. \n\nIf yo are not removed, you're on super-secret probation. But you have another chance to fix things, so take advantage of it. If you get a 2.0 in this, you go back to regular standing.\n\nIf you need to take a semester off, then do so. Leaving voluntarily and coming back later is better than being kicked out. It also costs less.\n\nAnd most importantly, tell your parents. As an adult, you're now fully in charge of taking care of your education, but parents want to help kids with their struggles. Its more about the emotional aspect, because like I said, you're in adult in college - there really isn't much they can do anyway other than provide support for you. But if you don't want to tell your parents - ~~there's a probation letter coming in the mail. Tear it up before they see it.~~ \n\nIts long winded, but I hope this helps. Just take your mind off things and enjoy the holidays. Come back strong!\n\n**EDIT:** I was mistaken about how the probation letter was delivered. In previous years, it was sent by mail, but now it is an electronic letter that is sent by email to you. You must go to the My.ENGR portal and confirm it as it is one of the requirements of your probation I believe. Sorry for the worry and fretting this has caused during your holiday season. If my semester GPA is under 2 but my total GPA is higher, am I on probation (as in will my parents get a letter? And when does this letter come? Before I go back?) Your parents will never receive any letters, they'll all come to you (partially due to FERPA, mainly because *you're* the student).  I believe most official communications are now sent electronically, where you have to view them online and then acknowledge their receipt. So nothing will ever come to my parents house? I mean they get stuff from the university addressed to me (like study abroad stuff) but never grades So nothing will ever come to my parents house? I mean they get stuff from the university addressed to me (like study abroad stuff) but never grades I think it depends on which college you're in, but most do it electronically now.  Looks like you'll be subject to [2A](http://www.admin.illinois.edu/policy/code/article3_part1_3-110.html).  No big deal, just get a 2.0 next semester and you'll be fine. I'm in engineering.  I'm not worried about the 2.0, just the letter. The prospective letter will now keep me up at night every night until school starts I'm in engineering.  I'm not worried about the 2.0, just the letter. The prospective letter will now keep me up at night every night until school starts If my semester GPA is under 2 but my total GPA is higher, am I on probation (as in will my parents get a letter? And when does this letter come? Before I go back?)   Have you considered making an appointment to see a counselor at the [Student Counseling Center](http://www.counselingcenter.illinois.edu/)? They have some [self-help brochures](http://www.counselingcenter.illinois.edu/?page_id=7) on [academic difficulties](http://www.counselingcenter.illinois.edu/?page_id=106) on their webpage. They also provide [group therapy for anxiety](http://www.counselingcenter.illinois.edu/?page_id=38). Building upon this: OP, go to Disability Resource Educational Services (DRES). Go immediately when you get back to take care of test anxiety, because that is a hard issue to deal with. I know that they give extra time for exams there and they will work with your professors. I've worked with them, they have really helped me out in a lot of ways.  One thing no one has mentioned is the possibility of a retroactive withdrawal from some (or all of) your courses from this semester. I don't know if this is the best idea for you, but I'm just throwing it out there as another option.\n\nHere's what ODOS has to say about retroactive withdrawal:\n\n&gt;If a student wishes to withdraw from a class or semester after the final examinations and/or grade submission, they must file a petition within their respective college, provide proper documentation, and follow corresponding procedures. Students who drop below full-time (12 hours) need permission from a college dean. For more information, please contact your College.\n\nI don't know how this works for the College of Engineering, but here's what the form looks like for [LAS](http://www.las.illinois.edu/docs/students/forms/retroactive-withdrawal-allpages.pdf).   Clearing up the medical issues thing: I had a sinus infection that was supposedly \"treated\" by McKinley (read: UNTREATED) that turned into strep throat which then turned into Mono (&lt; got treated by my doctor when I visited home). I was pretty sick for about a month. Clearing up the medical issues thing: I had a sinus infection that was supposedly \"treated\" by McKinley (read: UNTREATED) that turned into strep throat which then turned into Mono (&lt; got treated by my doctor when I visited home). I was pretty sick for about a month. I got a sinus infection my freshman year too. I don't remember what McKinley gave but it didn't help me either. It really sucks your problem developed into strep and mono though. Good luck with everything.  Dude. Same fuckin thing happened to me with McKinley. I ended up withdrawing for a semester so as not to be in the situation you are in. FEw things I would say:\n\n1. Tell your parents. Be honest. They will be mad, but they will help.\n\n2. Ever heard of a retro-drop? If you can prove that you were distressed enough, you can retroactively drop a class. This can get rid of an \"f\" or two.\n\n3. Don't be afraid to lose engineering. No shame in it.   [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/159pkd/academic_probation_question/"
  }, {
    "id" : 47,
    "title" : "Congratulations to everyone that is graduating tomorrow!",
    "snippet" : "[I just picked up my cap and gown today](http://i.imgur.com/HgvU9.jpg). \n\nSee you guys tomorrow at the ceremonies!    my email said pick up was at 8pm today? 10am -3pm at krannert studio theater GOGOGO    Anyone know, if I get a D in my LAS capstone course, do I still graduate?\n\n I don't know the answer to that (although my guess would be you do still graduate; a D is technically a passing grade). You should talk to your academic advisor.\n\nWhat I do know though, is that you can walk regardless of whether you actually graduate (assuming you signed up to walk). Sometimes when people graduate in August (finishing their last courses during the summer semester), they still walk in May. So if you have plans to go to the ceremony, you don't need to worry about being prevented from going. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/158nwm/congratulations_to_everyone_that_is_graduating/"
  }, {
    "id" : 48,
    "title" : "New Years at UIUC",
    "snippet" : "Hey guys, I was wondering exactly how New Years works down here. I just heard of having to get ticketd of some sort for the bars? Could someone shed some light on the process? Where do we get the tickets/does everywhere use tickets?\n\nAlso I was wondering if you need a ticket for New Years day too?    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1592k6/new_years_at_uiuc/"
  }, {
    "id" : 49,
    "title" : "What does it mean that I'm able to change a class's credit hours?",
    "snippet" : "For whatever reason, I'm able to click a button in Self-Service (registration and records and all that stuff) to change my TAM 212 discussion from 0 hours to 3 hours. What does that mean? Does that turn TAM in to a 6 hour class? I'm way confused.   That just means that it is either set-up wrong in Banner (the system that feeds Self-Service) or some students take the class for 0-3 credit hours. If you expect the class to be a 3-hr course, just have the credit hours at 3 and it will stay there.  Gotchya. It must be set up wrong in Banner because the lecture is showing as 3 hours. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/159c5i/what_does_it_mean_that_im_able_to_change_a_classs/"
  } ],
  "processing-time-source" : 59,
  "processing-result.title" : "uiuc11_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc11_reddit.xml"
  }
}