{
  "processing-time-total" : 1272,
  "clusters" : [ {
    "id" : 0,
    "size" : 9,
    "score" : 39.53499856652663,
    "phrases" : [ "Comes" ],
    "documents" : [ 3, 8, 10, 17, 24, 25, 37, 44, 48 ],
    "attributes" : {
      "score" : 39.53499856652663
    }
  }, {
    "id" : 1,
    "size" : 5,
    "score" : 54.85787434483401,
    "phrases" : [ "Illinois" ],
    "documents" : [ 12, 18, 44, 47, 49 ],
    "attributes" : {
      "score" : 54.85787434483401
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 53.33279983739948,
    "phrases" : [ "Problem Finding" ],
    "documents" : [ 8, 10, 17, 24, 29 ],
    "attributes" : {
      "score" : 53.33279983739948
    }
  }, {
    "id" : 3,
    "size" : 4,
    "score" : 24.923535435385997,
    "phrases" : [ "Effective" ],
    "documents" : [ 4, 8, 12, 14 ],
    "attributes" : {
      "score" : 24.923535435385997
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 33.57154090542598,
    "phrases" : [ "Mean" ],
    "documents" : [ 7, 10, 14, 17 ],
    "attributes" : {
      "score" : 33.57154090542598
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 49.08445016026752,
    "phrases" : [ "Money to Buy" ],
    "documents" : [ 8, 24, 30, 37 ],
    "attributes" : {
      "score" : 49.08445016026752
    }
  }, {
    "id" : 6,
    "size" : 3,
    "score" : 25.021991223261384,
    "phrases" : [ "Asian" ],
    "documents" : [ 3, 17, 37 ],
    "attributes" : {
      "score" : 25.021991223261384
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 88.31897914922402,
    "phrases" : [ "Just got another Email" ],
    "documents" : [ 12, 17, 35 ],
    "attributes" : {
      "score" : 88.31897914922402
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 39.828676197539565,
    "phrases" : [ "Times if you Just go to Class" ],
    "documents" : [ 17, 32, 38 ],
    "attributes" : {
      "score" : 39.828676197539565
    }
  }, {
    "id" : 9,
    "size" : 2,
    "score" : 40.444019351924545,
    "phrases" : [ "Campus to Study" ],
    "documents" : [ 9, 24 ],
    "attributes" : {
      "score" : 40.444019351924545
    }
  }, {
    "id" : 10,
    "size" : 2,
    "score" : 53.03725247308939,
    "phrases" : [ "Chicago Area" ],
    "documents" : [ 18, 19 ],
    "attributes" : {
      "score" : 53.03725247308939
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 33.06117246895967,
    "phrases" : [ "Couple" ],
    "documents" : [ 30, 31 ],
    "attributes" : {
      "score" : 33.06117246895967
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 83.75436365917135,
    "phrases" : [ "Crane Alley" ],
    "documents" : [ 5, 26 ],
    "attributes" : {
      "score" : 83.75436365917135
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 35.54330381006848,
    "phrases" : [ "Event" ],
    "documents" : [ 25, 28 ],
    "attributes" : {
      "score" : 35.54330381006848
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 22.837735585288538,
    "phrases" : [ "Generation" ],
    "documents" : [ 6, 9 ],
    "attributes" : {
      "score" : 22.837735585288538
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 40.619546966234026,
    "phrases" : [ "Half Price after 3 until they Run" ],
    "documents" : [ 8, 30 ],
    "attributes" : {
      "score" : 40.619546966234026
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 55.81334630887918,
    "phrases" : [ "Parties" ],
    "documents" : [ 23, 49 ],
    "attributes" : {
      "score" : 55.81334630887918
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 42.279428488709584,
    "phrases" : [ "Poster" ],
    "documents" : [ 8, 42 ],
    "attributes" : {
      "score" : 42.279428488709584
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 33.81564914277582,
    "phrases" : [ "Trips" ],
    "documents" : [ 8, 13 ],
    "attributes" : {
      "score" : 33.81564914277582
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 34.6354504789064,
    "phrases" : [ "Victory" ],
    "documents" : [ 1, 47 ],
    "attributes" : {
      "score" : 34.6354504789064
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 47.34766413188859,
    "phrases" : [ "Win" ],
    "documents" : [ 46, 47 ],
    "attributes" : {
      "score" : 47.34766413188859
    }
  }, {
    "id" : 21,
    "size" : 17,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 2, 11, 15, 16, 20, 21, 22, 27, 33, 34, 36, 39, 40, 41, 43, 45 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1184,
  "documents" : [ {
    "id" : 0,
    "title" : "Altera Meat Boy HD--Final Project",
    "snippet" : "  You suck at Meat Boy. Also cool 385 project.   ",
    "url" : "http://www.youtube.com/watch?v=ak7hbttVyVk"
  }, {
    "id" : 1,
    "title" : "My message to ESPN, and the rest of the country, after our victory tonight.",
    "url" : "http://i.imgur.com/0iiR9.jpg"
  }, {
    "id" : 2,
    "title" : "Dallas News reporting 2 former Illini football players, now with Cowboys, involved in an accident, 1 killed and the other arrested. ",
    "snippet" : "  Didn't Brent have some issues while he was here?  I recall he had a few run ins with the law.  DUI, maybe?\n\nSad stuff.\n\nedit: yep, here's the story\n\nhttp://sports.espn.go.com/ncf/news/story?id=4249346 Didn't Brent have some issues while he was here?  I recall he had a few run ins with the law.  DUI, maybe?\n\nSad stuff.\n\nedit: yep, here's the story\n\nhttp://sports.espn.go.com/ncf/news/story?id=4249346      &gt; Goodrich was driving his BMW at a high rate of speed \n\nhigh rate of speed = acceleration?",
    "url" : "http://www.dallasnews.com/sports/dallas-cowboys/headlines/20121208-dallas-cowboy-dies-in-irving-car-crash-teammate-arrested-on-manslaughter-charges.ece"
  }, {
    "id" : 3,
    "title" : "What is the best asian delivery/takeout place on campus?",
    "snippet" : "Feeling like asian food tonight but I know that some places can be kind of nasty. Does anyone know what place(s) are the best?  Cravings on 6th Cravings on 6th Cravings on 6th Cravings on 6th Cravings doesn't have delivery, though. Cravings on 6th Favorites: Hot and Spicy Chicken, Sizzling Chicken Pot, Sweet and Sour Seafood Soup, Fish Masala.\n\nThis is coming from a white guy though, so keep that in mind :p Cravings on 6th Cravings on 6th  It's all about Lai Lai Wok.  They don't deliver but if you are near green and (fourth I think), it is right there on the corner.  Blows Cravings out of the water IMO.   Siam Terrace is solid and delivers to campus. A little pricey, though.  Chopstix. The one, the only.  So average. Chopstix. The one, the only.     No. 1 Wok is pretty decent, it's just off Neil west of the overpass. Not sure on delivery though.     How has no one mentioned Mandarin Wok yet?  Seriously the best Chinese food in all of Chambana.  Their Mapo Tofu is too legit.  I just had Chinese! I ordered from chopstixs... Not the best in the world, but it hit the spot.   Imagine an ant walking on a table. The ant cant lift its head more than 10degress. If you put a sugar cube over the ant in such a way that it cant be seen in its 10 degree angle of view the ant would never learn of its existence and would not exist in the eye of the ant but we all know that the sugar cube is real and exists. Who is to say we are not like the ant  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14iusw/what_is_the_best_asian_deliverytakeout_place_on/"
  }, {
    "id" : 4,
    "title" : "Subleasing for Spring Semester 2013 (effective immediately)",
    "snippet" : "Anyone looking for a place? I'm currently trying to sublease my place until the lease is over (mid-August 2013). \nLocation is near Ikenberry Commons and is really close to campus. Rent is ~400/mo. including sanitation fee. Msg me for more information.\n\n(sorry if this post is misplaced)  You'll have better luck on craigs list. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14jjap/subleasing_for_spring_semester_2013_effective/"
  }, {
    "id" : 5,
    "title" : "Pop-up Ramen at Crane Alley, Monday 12/10, 1-3 PM | Facebook",
    "snippet" : "   ",
    "url" : "https://www.facebook.com/events/138378969646069/"
  }, {
    "id" : 6,
    "title" : "I'm looking for a 4th or 5th generation iPod touch.  Anyone want to sell me one?",
    "snippet" : "The cheapest I could find online was $120.99 refurbished.  My brother who goes here might have one for sale. Let me contact him.\n\nEdit: Ok, he doesn't know what Gen it is but I think it's a 3rd gen. He got is Christmas of 2009. It's probably beat up pretty bad anyway. Sorry, mate. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14iybw/im_looking_for_a_4th_or_5th_generation_ipod_touch/"
  }, {
    "id" : 7,
    "title" : "I will probably end up with a D in one of my classes, and I don't know what that means.",
    "snippet" : "I'm on 2.0 GPA academic probation right now, which means that because my last semester's GPA was under 2.0, if my cumulative GPA drops below 2.0 after this semester I will very likely be dropped. \n\nRight now, I am going to finish one of my classes with a D or D+, C- if I miraculously get a 98 on the final (not very likely). If I were to get a D, my cumulative GPA will still be above 2.0. But does getting a D mean I failed the class? If so, what does that mean for my academic standing?  You still earn credit even with a D. D is the lowest passing grade. You still earn credit even with a D. D is the lowest passing grade. \"D\" stands for \"Done\". \"D\" for \"Degree.\" You still earn credit even with a D. D is the lowest passing grade.  But if the class were required for your major, you'll need to retake it (I think, that's how LAS worked, at least for me). Was there any kind of academic probation related to that grade?    Oliver?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14hv8b/i_will_probably_end_up_with_a_d_in_one_of_my/"
  }, {
    "id" : 8,
    "title" : "LEX shuts down",
    "snippet" : "  \"Do to circumstances beyond our control\"  [Article in the Daily Illini](http://ht.ly/fVe54)\n\n\n&gt;&gt;Champaign-based Lincolnland Express bus company was ordered to shut down its operations Friday in accordance with safety regulations. The Federal Motor Carrier Safety Administration (FMCSA) gave an \"unsatisfactory\" rating to the company’s operation on Oct. 22, stating that the company needed to make corrective actions before Dec. 7.\n\n&gt;&gt;Violations include false reporting of records of duty status, use of commercial motor vehicles that were not periodically inspected and failure to properly maintain vehicle parts and accessories, according to the press release.\n\nBeyond their (LEX's) control my arse.. why did you use a link shortener for that?   Haha. Hopefully it's permanent. They are really scummy. I dont really get why everyone said suburban express and LEX were scummy..can u explain?  I've always thought of Suburban Express as being more \"scummy\" and rather ridiculous.\n\nSee [this](http://www.suburbanexpress.com/dishonoredpmts.html) and [this](http://www.reddit.com/r/UIUC/comments/eo54r/absolutely_ridiculous_bus_ride_home_on_suburban/)\n\nThen again, [LEX is rather scummy too](http://www.reddit.com/r/UIUC/search?q=LEX&amp;restrict_sr=on) That shame page really pisses me off. Is that people who bought a ticket and never actually redeemed them by riding the bus, or people whose payments never went through? People who never paid.  I don't understand how that happens. How could you not have paid for the ticket you bought online? You could go to the store and pay by check, I guess.  I've always thought of Suburban Express as being more \"scummy\" and rather ridiculous.\n\nSee [this](http://www.suburbanexpress.com/dishonoredpmts.html) and [this](http://www.reddit.com/r/UIUC/comments/eo54r/absolutely_ridiculous_bus_ride_home_on_suburban/)\n\nThen again, [LEX is rather scummy too](http://www.reddit.com/r/UIUC/search?q=LEX&amp;restrict_sr=on) Suburban are always on time and always well organized, the drivers are polite and the prices are (were?) decent, so let them do what they want on their website I say. I never had problems with them myself but their methods to reach new businesses such as defaming other services and posting a list of names of people who are \"deadbeats\" *defines* the adjective \"scummy\"\n\nAnd as per their actions given [in this post](http://www.reddit.com/r/UIUC/comments/eo54r/absolutely_ridiculous_bus_ride_home_on_suburban/) (same in my earlier comment), their actions are downright *scummy*. I've read about people being banned when  they complained to Suburban about things such as late busses/ and drivers' attitudes/actions. It's downright unprofessional and *scummy*.\n\n**If a company does well and customers like the business' products/services,, that *isn't* a free pass to let them do and say whatever they want.**\n\nHell it's probably libel and they could (and should) get sued for it Haha. Hopefully it's permanent. They are really scummy.  So now Suburban Express has to rethink it's whole marketing strategy. Yeah, instead of spending all that time and money saying how terrible LEX is, they can spend it on improving service...\n\nHa, who am I kidding; it's just going to go into people's paychecks. So now Suburban Express has to rethink it's whole marketing strategy.   Dear god I hope this is permanent.  LEX once made me miss my flight out of O'Hare because it took six and a half hours to complete a normally two and a half hour drive.  Piddling idiots, the lot of them. Did you check your bus arrival time? I can't image you did if it said that it would get you there in 2.5 hours.  Am I the only person to have used them a dozen times and never had an issue?\nOr were they connected to my credit score being checked twice with recurring fees (which were dropped and refunded)? Yep if there was an experian charge then it was them     This makes me so sad because Suburban Express owner is a FUCKING LUNATIC. See [here](http://www.reddit.com/r/pics/comments/ogdka/the_power_of_subliminal_advertising/c3nrzu8). If you spend some time Googling, you'll also find stories of the owner flipping out on people for no particular reason.   This makes me so sad because Suburban Express owner is a FUCKING LUNATIC. See [here](http://www.reddit.com/r/pics/comments/ogdka/the_power_of_subliminal_advertising/c3nrzu8). If you spend some time Googling, you'll also find stories of the owner flipping out on people for no particular reason.   [deleted] I should be ashamed of myself? LMAO. \n\nNo, I did not work for Kaplan, and yes they did suck when it came to flyering. I would know as they tore down my company's stuff, ALL. THE. TIME. \n\nWhen I was on campus (also note the ALUM part in my flare) I was the only flyer hanger for my company. I only posted one flyer per room, never on top of another flyer (if there was no space, I'd find creative ways to hang it instead--made it stand out more anyway!). \n\nIn my story, yes, I did put up 3 flyers in one room..BECAUSE THEY WERE FOR DIFFERENT TESTS and therefore had different information. \n\nGlass houses, huh? \n\nWell you know what happens when you assume... \n\nEdit: After reading your posts, I realized you're a troll or quite possibly the lunatic Suburban Express owner himself.  So you only put up one poster in each room, except the room where you had your super-frightening encounter with someone who asked why you were putting up multiple posters, and everyone who challenges your is a lunatic or a troll. Ok, that makes sense.  Sigh. If I had more than one type of poster, yes I would put up multiples lol I didn't realize that needed to be spelled out. Why is this even a point of discussion? lol\n\nAnd yes people who register an account to comment on one thread are a bit suspicious don't you think?\n\nALSO, I have a GREAT job now, thanks to my advertising degree, so not sure what there is to mock?  [deleted] [deleted]  Despite all the criticism Lex was subjected to, it provided the only competition to Suburban Express. Now Suburban Express will have complete monopoly and do whatever it likes. Peoria Charter. I don't think they have nearly as frequent service as Lex or Suburban Express, do they? Peoria Charter. Peoria Charter doesnt serve half the locations Suburban does. Ticket prices on Suburban have already rose, there gonna sky rocket now. They were 20$ last year and now the cheapest is 28$ in advance. The peak pricing bullshit is like 35. Its cheaper to drive vs take the bus at 35. i just got 2 amtrak tickets for $28. amtrak + metra will run me no more than $40 for a round trip. switch to amtrak if possible Amtrak is 38$ one way to Union Station... if you wanna buy tickets 3 months in advance then its $20. Plus metra = Over 80$ if its not in advance. Thats a lukewarm deal even at 20$ since Metra is an additional ~$5. Plus afaik amtrak only runs twice a day to chicago. Amtrak is 38$ one way to Union Station... if you wanna buy tickets 3 months in advance then its $20. Plus metra = Over 80$ if its not in advance. Thats a lukewarm deal even at 20$ since Metra is an additional ~$5. they were $14 two weeks in advance for me? maybe I got lucky Peoria Charter doesnt serve half the locations Suburban does. Ticket prices on Suburban have already rose, there gonna sky rocket now. They were 20$ last year and now the cheapest is 28$ in advance. The peak pricing bullshit is like 35. Its cheaper to drive vs take the bus at 35. Despite all the criticism Lex was subjected to, it provided the only competition to Suburban Express. Now Suburban Express will have complete monopoly and do whatever it likes. I agree that a monopoly is bad, but safety is surely more important than competition. It doesn't matter that LEX is providing competition if they're operating on unsafe buses that could potentially kill their riders. Surely another bus company will pop up soon - in fact I saw flyers up for some new company I'd never heard of before. What was it called? South Side Express? That's what it was! Thank you. \nHere's the link to their website, IDK if they're any good. Biggest drawback is that they only go to Union Station and not to the suburbs.\n\nhttp://southsideexpress.net/\n\n What was it called? Despite all the criticism Lex was subjected to, it provided the only competition to Suburban Express. Now Suburban Express will have complete monopoly and do whatever it likes. Greyhound or Amtrak? Despite all the criticism Lex was subjected to, it provided the only competition to Suburban Express. Now Suburban Express will have complete monopoly and do whatever it likes. Despite all the criticism Lex was subjected to, it provided the only competition to Suburban Express. Now Suburban Express will have complete monopoly and do whatever it likes. Despite all the criticism Lex was subjected to, it provided the only competition to Suburban Express. Now Suburban Express will have complete monopoly and do whatever it likes.  I have a bus ticket from LEX to go to O'Hare for break this month! Do you guys think I should get one from another company or that LEX will be back?  As of Friday night, Lex seems to be selling some trips during move-out, and not much else. They must be hiring buses from someone else or something. They must think they've come up with a really f'ing clever solution.\n\nRandom Thoughts:\n\n- It is probably not a good idea for LEX to thumb its nose at DOT. That will not increase LEX's probability of being invited to resume operations, regardless of what the 600 pages, which the LEX dog apparently ate, have to say.\n\n- If you buy a ticket from LEX at this point, you are a fool. They have probably collected $50k-$100k in revenue for trips they have not yet operated. It's unlikely they have liquid assets sufficient to meet final payroll and provide refunds for everyone. So if you bought a ticket before this all went down, you're probably not getting a refund. But there's nothing you can do. Buying a ticket now, however, would be extremely foolish. You're already on notice that LEX cannot operate! If you buy a ticket now, you are just throwing money down a hole.\n\n- The reason LEX is shut down is that they have CHRONIC maintenance and compliance issues. No pile of excuses, not even 600 pages worth, can possibly cancel out LEX's history with DOT. LEX is foolish for holding out hope that DOT will give them a reprieve.\n\n- DOT is engaged in political theatre. Quinn sent LaHood a letter asking that DOT investigate IL bus companies, so that he looks like he cares that Megabus keeps killing IL citizens (3 in the last year or so). LaHood has responded by sending out a posse, with the goal of taking VISIBLE, media-friendly action against some bus companies. According to FOX32, they went after Megabus and LEX. Megabus carries thousands, employs hundreds, has deep pockets and has probably made some nontrivial political contributions. LEX, on the other hand, is a little \"downstate\" cockroach with no connections. So, if you want to make an example of someone, who you gonna go after? LEX, of course. LEX is being sacrificed at the Media Altar to make the public think that DOT is effective and the public is safe. Shutting down LEX is a nice, tidy melodrama for the public, with no potential backlash for DOT.\n\n- As for Suburban, their website has suddenly lost a lot of its personality. The bad check page is gone, avoid-lex.com is now a Viagara advertisement, and I heard the owner was at a spa today. Just kidding about the last part. But maybe they're relieved that they don't have to duke it out with LEX anymore. As for me, I'm going to miss their entertaining posters. I never understood why people pretend to be offended - those posters are very funny, even the nasty ones.\n\n- I also noticed that the IL Shuttle website says something about reduced fares coming. Maybe they're going to crank up their frequency or run buses more frequently (rather than those big blue vans) or something which requires more riders. Think price elasticity...Econ 101.\n\n- Peoria is in trouble. If you google peoria charter winkler and look at articles and letter to the editor in the Peoria Journal Star, you'll find owner Winkler whining about how bad business has been (at least 2 articles) and asking oil companies to do their patriotic duty and reduce fuel prices. He seems like a dolt. His grandpa worked hard to build a business, and now he's doing a great job destroying it. They're circling the drain, IMHO. Everyone at Peoria has been sipping the \"we're great\" kool-aid without realizing that it's poison.\n\n- I imagine the main beneficiaries of the LEX shutdown, other than Suburban, will be Megabus and Slamtrak. Greyhound may get a little bump, but people seem to actively avoid their urine-soaked ghetto buses.\n\nBut what do I know...\n\n What about greyhound? What kind of econ TA misses a major competitor? I'm actually just a homeless person with a smartphone. Give me a break. Are you an Econ TA, or a homeless person with a smartphone? Or a homeless Econ TA with a smartphone? Doesn't the school pay you enough to make rent? Now I know what the GEO bargaining is about ... As of Friday night, Lex seems to be selling some trips during move-out, and not much else. They must be hiring buses from someone else or something. They must think they've come up with a really f'ing clever solution.\n\nRandom Thoughts:\n\n- It is probably not a good idea for LEX to thumb its nose at DOT. That will not increase LEX's probability of being invited to resume operations, regardless of what the 600 pages, which the LEX dog apparently ate, have to say.\n\n- If you buy a ticket from LEX at this point, you are a fool. They have probably collected $50k-$100k in revenue for trips they have not yet operated. It's unlikely they have liquid assets sufficient to meet final payroll and provide refunds for everyone. So if you bought a ticket before this all went down, you're probably not getting a refund. But there's nothing you can do. Buying a ticket now, however, would be extremely foolish. You're already on notice that LEX cannot operate! If you buy a ticket now, you are just throwing money down a hole.\n\n- The reason LEX is shut down is that they have CHRONIC maintenance and compliance issues. No pile of excuses, not even 600 pages worth, can possibly cancel out LEX's history with DOT. LEX is foolish for holding out hope that DOT will give them a reprieve.\n\n- DOT is engaged in political theatre. Quinn sent LaHood a letter asking that DOT investigate IL bus companies, so that he looks like he cares that Megabus keeps killing IL citizens (3 in the last year or so). LaHood has responded by sending out a posse, with the goal of taking VISIBLE, media-friendly action against some bus companies. According to FOX32, they went after Megabus and LEX. Megabus carries thousands, employs hundreds, has deep pockets and has probably made some nontrivial political contributions. LEX, on the other hand, is a little \"downstate\" cockroach with no connections. So, if you want to make an example of someone, who you gonna go after? LEX, of course. LEX is being sacrificed at the Media Altar to make the public think that DOT is effective and the public is safe. Shutting down LEX is a nice, tidy melodrama for the public, with no potential backlash for DOT.\n\n- As for Suburban, their website has suddenly lost a lot of its personality. The bad check page is gone, avoid-lex.com is now a Viagara advertisement, and I heard the owner was at a spa today. Just kidding about the last part. But maybe they're relieved that they don't have to duke it out with LEX anymore. As for me, I'm going to miss their entertaining posters. I never understood why people pretend to be offended - those posters are very funny, even the nasty ones.\n\n- I also noticed that the IL Shuttle website says something about reduced fares coming. Maybe they're going to crank up their frequency or run buses more frequently (rather than those big blue vans) or something which requires more riders. Think price elasticity...Econ 101.\n\n- Peoria is in trouble. If you google peoria charter winkler and look at articles and letter to the editor in the Peoria Journal Star, you'll find owner Winkler whining about how bad business has been (at least 2 articles) and asking oil companies to do their patriotic duty and reduce fuel prices. He seems like a dolt. His grandpa worked hard to build a business, and now he's doing a great job destroying it. They're circling the drain, IMHO. Everyone at Peoria has been sipping the \"we're great\" kool-aid without realizing that it's poison.\n\n- I imagine the main beneficiaries of the LEX shutdown, other than Suburban, will be Megabus and Slamtrak. Greyhound may get a little bump, but people seem to actively avoid their urine-soaked ghetto buses.\n\nBut what do I know...\n\n    ",
    "url" : "http://www.lincolnlandexpress.com/"
  }, {
    "id" : 9,
    "title" : "Good little nooks and crannies around campus to study for finals?",
    "snippet" : "I'm sick of studying in my dorm room and the library. Anyone comfortable with sharing some little-known gems or all-around good areas around campus to study?  steam tunnels  upper floor of county market is open 24 hours and theres food abound   Walk into any campus building and steal a classroom. Hope no one shows up for a class.    Union basement (Food court). Sit along a wall near an outlet Wi-Fi and cell reception are pretty bad down there, though. True. UIUC net works OK down there, my laptop didn't have much of a problem connecting. As for the bad cell reception, that's why its so good for studying! (Reception isn't totally terrible, but # or $ G is nonexistent there.) See, I get no IllinoisNet, UIUCNet, 4G, 3G, G: The Next Generation, or G unless I'm pretty much alone down there.  NCSA first floor lobby. Huge open space, underutilized by even the faculty. Open space, comfortable chairs, lots of outlets.     The vending room in the Union is a pretty good place. There are lots of vending machines, as the name suggests, and pretty much everyone is there to study. Could be pretty quiet, depending on the crowd. I also seem to remember it being open very late, maybe even 24 hours during finals. \n\nThe South Lounge of the Union is always very quiet, but they don't have tables, just couches and chairs.\n\nThe Art &amp; Design building is another good place. I think they're currently open 24 hours. If you go during the day, the Link Gallery is a fairly quiet place. Plus, there's lots of sunlight. There are chairs and some tables, and sometimes an art exhibit. At night, there are several classrooms open.        There usually aren't too many people at Grainger.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14go4x/good_little_nooks_and_crannies_around_campus_to/"
  }, {
    "id" : 10,
    "title" : "Has anyone gotten a haircut from the Champaign Regency Beauty Institute? How did it turn out?",
    "snippet" : "I'm temped by the $9 haircuts, but the thought of students cutting my hair worries me... Anyone been there?  I used to go there regularly when I was a student.  I've always had pretty good luck, because (as mentioned) the instructor will come fix anything the student messes up.  The biggest hassle for me was how long it took (sometimes up to an hour), because the student was being so careful.\n\nI also got manicures and pedicures there - pretty OK service (again, slow), but they give out a free bottle of OPI nail polish with each service, so it ends up being a pretty good deal.  The facial was also very reasonably priced and pretty dang good.\n\nOverall (as with all beauty services), try to find someone you like and specifically request them.  Problem is, they'll probably graduate from the program pretty quick - you might have better luck with consistency if you go later at night, when the part time students are there. woahwoahwoahwoah. \n\nA free bottle of opi with a mani? \nI need details on this.       I go to Great Clips, because I've never spent above $30 on a haircut.  That's silly.  My friends who go to Ippatsu and Lando think I'm nuts for going to such a \"cheap\" place, but my hairdresser tells me that almost all of the workers in every salon in Champaign went to the same school. I've never had any issues with \"cheap\" salons, so I'd assume that the beauty institute would be no different. You just have to be careful. Ive had bad experiences with cheap places as they seem to be all the poor stylists that cant work at nicer salons. Are all this bad? No, not by any means. I'm just too picky myself to try again. I've had bad cuts, bad hair dyes, and even a stylist that had no idea how to.execute the cut I wanted. On the flipside my last hair stylist now owns his own salon. My current stylist I go to her for her knowledge of hair coloring (she works for a salon and also wella). Neither have ever done wrong to my hair. I feel cheap salons are good for simple uncomplicated cuts and styling. Beyond that? Spend the money",
    "url" : "http://www.reddit.com/r/UIUC/comments/14gsrb/has_anyone_gotten_a_haircut_from_the_champaign/"
  }, {
    "id" : 11,
    "title" : "Just a few questions about UIUC, thanks!",
    "snippet" : "I'm a junior in high schoool right now and had a few questions. If someone could answer even one, it would greatly be appreciated!\n\n-How is UIUC's tennis program? I am pretty sure they are D1, but does anyone know if they are on the more competitive D1 schools, or less competitive?\n\n-Can someone give a short synopsis of what I should be expecting over the years if I went for an engineering degree?\n\n-What are some of the minimums for GPA and SAT required to get into the school?\n\nI'll have some more questions later but for know these are the ones I could think of, thanks again!  I would really stress the importance of taking AP tests while you're still in high school. It's possible to pass out of a lot of these first year chem, physics and bio classes ( and possibly even gen-eds!) with AP credit and that allows you to take more interesting classes sooner rather than being bogged down with required classes that aren't as fun. Even if your GPA dips a little bit ( but not a lot!)  because of AP classes, it'll be worth it when you get here.  Exactly. Also, the more AP classes you take, the less classes you have to pay for. And student debt is one of the few debts that lasts until you pay it off, even bankruptcy does not eliminate it.   -Not a clue about tennis. Big 10 quality I guess? no idea\n\n-Your first year as an engineer will be retaking high school courses at a bit harder level. Physics, chem, calc, maybe bio. Your second year you will start taking some actual engineering major courses, and a few straight science. Junior and senior year will  be entirely engineering, more project/hard math focused. The difficulty of each year depends on the department. \n\n-There is no express minimum, your application is viewed holistically. The middle 50% of students usually scored about 1360 - 1480 on the SAT. Couldn't find any GPA stats, usually because most high schools do it differently. A word to the wise though, if you have good, interesting extra curriculars and you pop on paper, they don't care about your grades as much. I know I didn't get close to a 1360, and I got in. Also, apparently everyone writes their essays about legos, or taking apart electronics as a kid, so don't do that.  Haha, my favorite bullshit application essays are always crap from engineers and science majors that begin like \"Ever since I was young, I have always loved looking at the stars\" blah blah blah. I know at least a few of my professors who expressed anguish when they had to read over a hundred of these during the last graduate school application cycle.\n -Not a clue about tennis. Big 10 quality I guess? no idea\n\n-Your first year as an engineer will be retaking high school courses at a bit harder level. Physics, chem, calc, maybe bio. Your second year you will start taking some actual engineering major courses, and a few straight science. Junior and senior year will  be entirely engineering, more project/hard math focused. The difficulty of each year depends on the department. \n\n-There is no express minimum, your application is viewed holistically. The middle 50% of students usually scored about 1360 - 1480 on the SAT. Couldn't find any GPA stats, usually because most high schools do it differently. A word to the wise though, if you have good, interesting extra curriculars and you pop on paper, they don't care about your grades as much. I know I didn't get close to a 1360, and I got in. Also, apparently everyone writes their essays about legos, or taking apart electronics as a kid, so don't do that.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14hi42/just_a_few_questions_about_uiuc_thanks/"
  }, {
    "id" : 12,
    "title" : "Funny that one of the more corrupt universities in the state is closing a program whose main goal is to develop ethical and intelligent leaders.  ",
    "snippet" : "  Shouldn't the title of this post start with \"one of the universities in the most corrupt state\"? Corruption in Illinois isn't limited to this university; two former governors are serving prison sentences. Shouldn't the title of this post start with \"one of the universities in the most corrupt state\"? Corruption in Illinois isn't limited to this university; two former governors are serving prison sentences.   [deleted] They used that excuse to close the school of aviation too even though students there pay extra flight fees and the school had a surplus in the bank. I'm not sure I would believe the \"it's not cost effective\" excuse without seeing some numbers. The University uses that argument a lot. They used that excuse to close the school of aviation too even though students there pay extra flight fees and the school had a surplus in the bank. I'm not sure I would believe the \"it's not cost effective\" excuse without seeing some numbers. The University uses that argument a lot.    Just wondering what corruption? I honestly havent heard of many scandals (besides the admissions list one)  Admissions scandal, the building contract for a relative (recently), the anonymous email scandal\n",
    "url" : "http://www.dailyillini.com/opinion/guest_columns/article_7e5f8f20-4026-11e2-9a90-0019bb30f31a.html"
  }, {
    "id" : 13,
    "title" : "Are there any camping or hiking trips in the area available through the University or just casually through people?",
    "snippet" : "  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14gn8h/are_there_any_camping_or_hiking_trips_in_the_area/"
  }, {
    "id" : 14,
    "title" : "I am writing a report on effectiveness of smoking ban, could you be kind enough to fill this small survey (3 multiple choice questions!)",
    "snippet" : "  I filled it out, but I think 'Is second hand smoking a problem for now?' is poorly worded. Do you mean in general (answer- yes) or specifically on our campus (answer- not really)? I assume the latter, but you should probably make that clear.  This one?\n\n[Urbana's campus to be smoke free by November 2013](http://www.news-gazette.com/news/living/2012-10-17/updated-uis-urbana-campus-be-smoke-free-november-2013.html)? ",
    "url" : "https://docs.google.com/spreadsheet/viewform?formkey=dDhZcXlRSDdqMGQxOW1PbVBOdmNldWc6MA"
  }, {
    "id" : 15,
    "title" : "Does anyone know if non-cs majors can get access to Siebel?",
    "snippet" : "I live close by and don't and it would be convenient to just be able to get in and do homework.  Jason Yoon is the person you would want to talk to - he's in charge of e-lock for Siebel Center.  Just go to the 2302 EngrIT helpdesk and tell them you have a question about e-lock.  They'll send you to him.  You don't need to be CS to get it; just have a good reason for requesting it.  They might not even ask why. Jason Yoon is the person you would want to talk to - he's in charge of e-lock for Siebel Center.  Just go to the 2302 EngrIT helpdesk and tell them you have a question about e-lock.  They'll send you to him.  You don't need to be CS to get it; just have a good reason for requesting it.  They might not even ask why.   Siebel should be open till 5PM during the week but I believe you need to be CS to be able to have your iCard swipe you in. If the after hours/weekends access is anything like it is for Aero in Talbot, then you have to prove to your department (or their Technology Services department I believe) that you deserve after hours access.\n\nThen again, if you just want to go in there, there's nothing stopping you from going in there before they lock up and stay there till whenever you want to leave. Also, going in with someone else or when someone else walks in is all good too. As Vicodeen said, CS-only is not enforced at all. Yeah, I meant after hours access. Thanks for the reply. I was just hoping at least other engineering majors could get in. 4th floor Talbot lab is like heaven to me :D Then again, if you live nearby to Siebel I get that too. Talbot was closest to me when I was on campus and always had at least 1 Aero friend hanging out there to let me in Talbot is the same deal as Siebel just so OP knows. You need to be in NPRE or AE to swipe in after 6 or 7 at night.  OP's flair says she's aerospace, so I assumed she already has access to Talbot :) You are more observant than I. Although I can't imagine anyone in AE not knowing about the aero lab.  OP's flair says she's aerospace, so I assumed she already has access to Talbot :) What makes you think I am a she? ;) I assume he-pirates wouldn't be Perky Pirates now would they? :3 Well, we are all allowed to dream.....  I'm a General Engineer (that really wants to transfer to CS), and I don't know of any way to get i-card access.\n\nIt would be awesome to get access though! It's frustrating not being able to easily get in at odd hours. Are you an ACM member?  ACM can usually get members e-lock access to Siebel and to the office. Really? Are you sure?\n\nDo you know who I could contact to get this? I am part of ACM.   I'm a compE, and when I asked (repeatedly) a few years ago - I was consitently told no for two reasons \n1) Security risks (apparently CompE's are security risks)\n2) It was \"too much effort\" The thing is, card access is managed through the building automation system (which for Siebel is an Andover Continuum).  The reason for both of these was because the building automation system doesn't have a way to expire access automatically - for every person that was given access, it would have to be manually revoked.  It's partially bad design, partially because it just wasn't designed around the specific requirements of the department.  They didn't give access to CS undergrads for this reason, either.\n\nIn the somewhat recent past, a group of students developed a piece of software called STELA (System for Time-based E-lock Automation).  This is basically a piece of software that interfaces with the building automation system, and adds features to e-lock access (like LDAP sync, expiration, access groups, access requests, etc.).  Since they can easily give specific permissions to users and automatically expire them, they're able to be less restrictive about granting access.\n\ntl;dr new software mitigates the issues you listed it is really frustrating when some sort of software is used for school (and the school pays $$ for it), when CS students could easily do a much better job, for a fraction of the fraction of the price\n\nfor example: compass, moodle, or piazza. many CS students could make **significantly** better systems\n\nanyways, thanks for sharing, it's real cool those students did that Well, the thing is, the building automation system isn't just some arbitrary piece of software, it's literally what keeps the building running.  It controls HVAC, lighting, access control, occupancy, energy utilization, etc.  Access control is only a small fraction of what that system controls, and is one of the only parts the CS dep't actually controls (most is Facilities and Services).  Also, Andover Continuum is a campus standard (so A. Siebel isn't the only building that uses it and B. CS staff don't actually have any say in what gets used).  Changing this system would be a very lengthy endeavor since it involves so many different departments - and might not even be possible since some buildings that use it are LEED certified.  It'd be super costly and time consuming and just not worth it, even if there were a better alternative (there might be, I'm not familiar with very many BAS vendors).\n\nI agree with you to an extent, but I don't believe that the BAS could actually be replaced/written better in a practical sense.  Yeah, the front end could really be improved, but it's in an entirely different category than the softwares you listed.\n\nTo be clear, I'm not saying you're wrong or that I disagree with you - I just wanted to clear up why the system sucks so much (and yeah, it kind of does). ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14gtmq/does_anyone_know_if_noncs_majors_can_get_access/"
  }, {
    "id" : 16,
    "title" : "People really don't know how to use bike racks.",
    "snippet" : "  More like, people lock their bikes up and then never use them or move them so there are no spots to lock up a bike!!!!!!!!!!   I wish these places would use the proper racks. These racks are so you can put the wheel over the other side and lock the frame to the rack. The way these are positioned, you can only do the wheel or frame and one wheel with a chain. \n\nAlso I have enhanced the picture and we know who you are! You may know my face, but do you know *who* I am!? yup Well of course *you* do... Well.  EXCUUUUUUUSE MEEEEEE  This is at the Illini Tower bike rack. I saw the picture and I was like, \"Huh... that looks familiar.  Oh, that's IT!\"  I hope you're the same guy who kept getting pictures of asses under his door. This is at the Illini Tower bike rack.",
    "url" : "http://i.imgur.com/agta2.jpg"
  }, {
    "id" : 17,
    "title" : "New Hack from the ECE hacker",
    "snippet" : "   TBH it sounds like he just found a silly exploit in the My.ECE portal that let him send e-mails (like ..XSS or bad checking of url parameters). And now that he can't do it anonymously via TOR, he's backing off.\n\nOf course, he reads reddit. Feel free to tell me otherwise. Murph@murph.cc ;) Yeah, he does **read reddit**. [I just got another email](http://imgur.com/LBeZI). This one is sent from me to me.\n\nEDIT: clarified my intended message *shrugs* I have no idea who you are. Perhaps you're him? Breaking into a gmail usually justs means he got your password from somewhere else or a keylogger.\n\nYou should use two factor authentication, btw.\n\nI'm just saying, he hasn't demonstrated any particularly 'awesome' skills as far as I can see. Lol. Nah, I'm not him, you can trust me as an anonymous person on the internet. I assume he just hacked into my illinois.edu and since it forwards to my Gmail he could access it too? \n\nThanks for the two factor authentication suggestion, I'll rechange it. Yeah, he does **read reddit**. [I just got another email](http://imgur.com/LBeZI). This one is sent from me to me.\n\nEDIT: clarified my intended message The only thing that tells you who an email came from is a field sent along with the message. Anyone can send an email and make it look like it came from someone else (part of the reason for cryptographically signing emails).\n\nWhat would show an intrusion would be him showing you a confidential email you received from someone else. So he could've sent the email from myself without actually intruding? Correct. When an email is received by a mail server it has a bunch of [headers](http://en.wikipedia.org/wiki/Email#Header_fields) attached to it, one of them is the from address.\n\nAnyone could connect to the mail server and send an email with whatever from address they want, you could send an email from barack@whitehouse.gov or this@doesnt.exist without actually having access to that email account or the account even existing.\n\nThe catch is that, while you can send a message like this, you won't get any of the replies to it (because you don't actually have access to the account). But if he manually changed the header files why is this still accessible to me through my own deleted messages folder. Wouldn't it be only visible to the recipient? Thanks for answering btw, I'm just curious about how unsafe might my email have been. Were you not the recipient? I thought you said the email was from and to you, in which case when the mail server received it, it would place it in your inbox/spam/whatever, and would remain in your account, moved to whatever folder you put it in.\n\nIt would also be possible for him to set the from and to fields to another person's, but include you in the BCC list. Again, that would not mean he has access to the account, and wouldn't be able to access your previous or future emails, and would not see any replies to that email. So he could've sent the email from myself without actually intruding? The only thing that tells you who an email came from is a field sent along with the message. Anyone can send an email and make it look like it came from someone else (part of the reason for cryptographically signing emails).\n\nWhat would show an intrusion would be him showing you a confidential email you received from someone else. TBH it sounds like he just found a silly exploit in the My.ECE portal that let him send e-mails (like ..XSS or bad checking of url parameters). And now that he can't do it anonymously via TOR, he's backing off.\n\nOf course, he reads reddit. Feel free to tell me otherwise. Murph@murph.cc ;)  I didn't even know there was an infamous 'ECE Hacker' out there...\n\nwhat's he been up to? anyone wana fill me in? If you want to find out the hacker's identity, you must first follow the fedora... I didn't even know there was an infamous 'ECE Hacker' out there...\n\nwhat's he been up to? anyone wana fill me in?  Seems like the type of guy that would claim he could \"hack\" the pentagon with photoshop or something.  This is the most conceited, condescending nonsense I've ever read. Seriously, this guy must really seek attention; he should find friends or a hobby or something. Honestly, I think he purposely wrote the email to come across as everything you mentioned. Not that it doesn't make him any of the things you listed, but every comment in this thread is probably feeding his ego. He was seeking attention and now he has it. This is the most conceited, condescending nonsense I've ever read. Seriously, this guy must really seek attention; he should find friends or a hobby or something. It would appear he *does* have a hobby... ha... ha... ha. [deleted] This can be very productive TBH.\n\nThere are thousands of huge corporations that pay people to exploit their software and infrastructure in order to protect against valid threats. A lot of blackhat hackers end up taking that route and being very successful. [deleted] This is the most conceited, condescending nonsense I've ever read. Seriously, this guy must really seek attention; he should find friends or a hobby or something. And yet, he hacked our network. Not only that, he is telling then that they need to fix what they are doing. I say bravo, and genius definitely going to get a decent job after college. Are you being sarcastic? How is this going to help him get a job? He can't write \"Created mayhem by hacking ECE department's emails\" on his resume. Not this exactly, but the ability to hack and find vulnerabilities in general. Sure what he did was immature, but it drew attention to a legitamate problem with uiuc's servers And yet, he hacked our network. Not only that, he is telling then that they need to fix what they are doing. I say bravo, and genius definitely going to get a decent job after college. Pretty much anyone with an engineering degree and decent GPA from UIUC is going to get a decent job after college. \n(Not saying other colleges won't, I've just never looked into the employment rates for the others). You are over-optimistic. I gather you are a freshman? Many graduates hold jobs where they are underemployed and overqualified. You are over-optimistic. I gather you are a freshman? Many graduates hold jobs where they are underemployed and overqualified. Pretty much anyone with an engineering degree and decent GPA from UIUC is going to get a decent job after college. \n(Not saying other colleges won't, I've just never looked into the employment rates for the others). I'm not sure you understand how the job market works... I guess we probably have very different views of a decent GPA  I am guessing that this guy hasn't taken ECE 316 or CS 210. Loui will have a good time with this example for his class. Oh god if I watch \"The incident at Morales\" ONE MORE GOD DAMN TIME Oh god if I watch \"The incident at Morales\" ONE MORE GOD DAMN TIME  Wow... His only redeeming trait is that he left on his own. Yeah he is **good**, but he is also a selfish bastard who fucked a shit-ton of students over for the lulz.\n\nedit: I accidentally some grammar.    &gt;I'm one of those \"hackers\" just out for a good time and to prove how smart I am, not to cause actual ruin.\n\nReally? Yet you mistake \"warn\" for \"worn\"?  What a fucking prick. I don't think theres anything at ALL admirable about what he did.  TBH I do wonder if the OP might be \"ECE hacker\" tooting his own horn TBH I do wonder if the OP might be \"ECE hacker\" tooting his own horn I wish I was a psychologist so I could say yes for sure, but I would be surprised if it wasn't.  I doubt it's him. OP seems to be from South America and doesn't use the oxford comma (a number of instances in his posting history), where-as the oxford comma is used by the \"hacker\" in paragraph 4. I doubt it's him. OP seems to be from South America and doesn't use the oxford comma (a number of instances in his posting history), where-as the oxford comma is used by the \"hacker\" in paragraph 4. I doubt it's him. OP seems to be from South America and doesn't use the oxford comma (a number of instances in his posting history), where-as the oxford comma is used by the \"hacker\" in paragraph 4.  This guy's obviously ESL. Not that that narrows it down, but... The offender is described as an ESL male student, probably Asian.\n\nInformation about the race or ethnicity of alleged offenders is provided only to aid detailed descriptions that include physical stature, clothing or unusual characteristics.  Racial descriptions do not, by themselves, offer a meaningful picture of an individual's appearance.  This is racist! How can you judge the race just based on an email?!\n싸발! This is racist! How can you judge the race just based on an email?!\n싸발! Shut up, zipperhead! The offender is described as an ESL male student, probably Asian.\n\nInformation about the race or ethnicity of alleged offenders is provided only to aid detailed descriptions that include physical stature, clothing or unusual characteristics.  Racial descriptions do not, by themselves, offer a meaningful picture of an individual's appearance.  I see what you did there. Also, he's probably Korean. He used a double-negative, which is grammatical in Korean, ungrammatical in English, and very rarely grammatical in Chinese. I see what you did there. Also, he's probably Korean. He used a double-negative, which is grammatical in Korean, ungrammatical in English, and very rarely grammatical in Chinese. I have observed mainly grad students, but his English (at least in the email listed in this post) seems too good for him to be Korean. Maybe undergrad Koreans have better English because they live in dorms, are younger, etc. \n\nCan someone post all the emails from the hacker in one place so that we can all do some investigative work? Though I fear this attention is precisely what the hacker wants.\n\nObviously ESL, but unlikely Asian. ...His English abilities are probably independent of his first language... second language acquisition is highly variable. It's probably due more to length of instruction/immersion than his first language. It's possible, though, to glean information about a speaker's (or writer's) first language from the errors they make in their second language.  OP's English is near-perfect, but he is from South America and is an undergrad. I had a South American officemate who started grad school in his late 20s and his (written) English was always a problem. So it seems like undergrads learn/assimilate ESL much better than grads, so you might be right that the hacker is Korean. That narrows our search from 40,000 students to 3,000. I feel flattered that my English is near-perfect. Also, where was your office mate from? Dialects in Spanish tend to affect the fluency of English. I see what you did there. Also, he's probably Korean. He used a double-negative, which is grammatical in Korean, ungrammatical in English, and very rarely grammatical in Chinese. This guy's obviously ESL. Not that that narrows it down, but... What makes you think so? The casual use of idioms suggests someone who is either a native speaker or has resided in an English-speaking country for a number of years. There is a misspelling and it's hardly Shakespeare, but that's easily explained away by the fact that this is a logic-oriented person and wouldn't have extensive practice in composition. What makes you think so? The casual use of idioms suggests someone who is either a native speaker or has resided in an English-speaking country for a number of years. There is a misspelling and it's hardly Shakespeare, but that's easily explained away by the fact that this is a logic-oriented person and wouldn't have extensive practice in composition. ESL and/or lack of fluency is obvious. The errors native speakers make are of the your/you're and there/their kind. They don't use double negatives incorrectly and convey the opposite meaning of what was intended.   Shutting down TOR stopped him?  Sounds to me like he's not nearly as good as he thinks he is. Shutting down TOR prevented him from doing it anonymously.  How did he find your email from your Reddit account? It's not hard, you'd be surprised how easy it is when you use the same username everywhere. Just google around that name with tags like \"steam\" and see what pops up. Hell I found my roommate by doing facebook.com/&lt;username&gt; How did he find your email from your Reddit account?  http://www.youtube.com/watch?v=IwMqSjGyOuQ&amp;sns=em\n http://www.youtube.com/watch?v=SXmv8quf_xM\nhttp://i0.kym-cdn.com/photos/images/newsfeed/000/200/420/BRTky.jpg?1321408042 http://www.youtube.com/watch?v=SXmv8quf_xM\nhttp://i0.kym-cdn.com/photos/images/newsfeed/000/200/420/BRTky.jpg?1321408042 I just booted him out of my gmail account and changed my password. He has a bunch of IPs linked to NY, Ohio and Germany.   Why is the ECE department or the university unable to catch the hacker? Is it very hard to do that? They could catch the director of the CIA (whose hacking prowess is admittedly questionable, he was a military general), why can't they catch this hacker? It does look bad that a university with one of the top CS and ECE programs (I am assuming they are good at security research too?) is getting attacked by hackers. Why is the ECE department or the university unable to catch the hacker? Is it very hard to do that? They could catch the director of the CIA (whose hacking prowess is admittedly questionable, he was a military general), why can't they catch this hacker? It does look bad that a university with one of the top CS and ECE programs (I am assuming they are good at security research too?) is getting attacked by hackers. The way TOR works makes it extremely difficult (but not completely impossible under special circumstances) to trace connections and find the attacker. \n\nAlso, in terms of computer security, attacking is almost always easier than defending. The defender needs to account for all possible security holes, but an attacker only needs to find one. Why is the ECE department or the university unable to catch the hacker? Is it very hard to do that? They could catch the director of the CIA (whose hacking prowess is admittedly questionable, he was a military general), why can't they catch this hacker? It does look bad that a university with one of the top CS and ECE programs (I am assuming they are good at security research too?) is getting attacked by hackers. Petraus was not trying very hard.  He had a shared gmail account with his mistress, and they just wrote notes and saved them as drafts.  I assume they thought that was safer or something (it isn't, Gmail is a cloud service and all data is still online).  The FBI, who were most likely already monitoring him, just had to access his Gmail account.  They can do that fairly easily, as the Justice Department doesn't claim to need a warrant to read emails.\n\nThis \"ECE hacker\", on the other hand, is using a service called TOR (The Onion Router).  TOR was a government project that was developed to help people hide their actual location and identity by routing all internet traffic through a bunch of proxy servers around the world. while it can still be traced given enough time and resources, there is no way UIUC has that kind of power without LEO intervention.\n\nTL;DR Bigger fish, more technically challenging. Why is the ECE department or the university unable to catch the hacker? Is it very hard to do that? They could catch the director of the CIA (whose hacking prowess is admittedly questionable, he was a military general), why can't they catch this hacker? It does look bad that a university with one of the top CS and ECE programs (I am assuming they are good at security research too?) is getting attacked by hackers. Catch the director of the CIA? What do you mean? [The FBI found that the director of the CIA was having an affair from email evidence](http://en.wikipedia.org/wiki/Petraeus_scandal). That wasn't exactly like catching the ECE hacker, but I believe the expertise and skills required will be similar? This was front-page news for several days last month. Yeah, I heard about the scandal. I did not know the ECE dept was involved in it, though. ECE dept. wasn't involved of course. But I thought it was easy to catch hackers since others have done it, so why isn't ECE being able to do it? Is it very hard? There must be an FBI branch in Champaign too?\n\nEdit: I don't know a whole lot about these things, but is it so hard to find out who is doing this that someone would be brave enought to do this? They would surely be expelled if caught. here is a quick anecdote\n\ni heard about this guy working for cites or some computer branch on campus that eventually led to him altering gradebooks for his own personal gain.\n\nthe fbi, and kudeki got involved (i would me more afraid of kudeki) and the dude got expelled for 15 yrs. he ended up going to utoronto. The Sean Liao case? http://news.google.com/newspapers?id=LXpjAAAAIBAJ&amp;sjid=hnkNAAAAIBAJ&amp;pg=2886,1910944\n\nWonder what ever happened to the guy... ECE dept. wasn't involved of course. But I thought it was easy to catch hackers since others have done it, so why isn't ECE being able to do it? Is it very hard? There must be an FBI branch in Champaign too?\n\nEdit: I don't know a whole lot about these things, but is it so hard to find out who is doing this that someone would be brave enought to do this? They would surely be expelled if caught. ECE dept. wasn't involved of course. But I thought it was easy to catch hackers since others have done it, so why isn't ECE being able to do it? Is it very hard? There must be an FBI branch in Champaign too?\n\nEdit: I don't know a whole lot about these things, but is it so hard to find out who is doing this that someone would be brave enought to do this? They would surely be expelled if caught. Oh, I see what you mean now. I guess your usage of \"they\" in the OC confused me.\n\nI'm not sure, I guess it depends on how much care this kid takes on covering his tracks. He hasn't done anything TERRIBLY bad, aside from the 329 thing, so I don't think the FBI would get involved in something like this. I think getting access to exams is pretty serious and is probably a crime, but probably not FBI-worthy.  If this email is real, this is the sort of thing that gives us engineering/science majors a bad rep. \n\nAnd is anyone even worried about this? I'm not a CS person, but I assume we don't have our top computer security experts working on \"defending the network\", meaning the \"worthy opponents\" he's battling against are just some tech guys who made the system a few years back The top CS security people don't look at the same stuff nor do the same stuff the top Network Admin security people do. They are not interchangeable. Much like a good Doctor is not really the same person as a good disease or drug researcher. Sure there will be overlap, but, there are differences. \n\nThe cites people are pretty good, but the thing in computer security is: there are always new/more bugs that are exploitable.  The top defenses are still not all that good at blocking *new* attacks. Further, the defenses themselves are just computer programs, and as such may be exploitable, and definitely have flaws. Out of curiosity, could you give me a brief explanation of the difference between CS security and Network Admin security? Out of curiosity, could you give me a brief explanation of the difference between CS security and Network Admin security? If this email is real, this is the sort of thing that gives us engineering/science majors a bad rep. \n\nAnd is anyone even worried about this? I'm not a CS person, but I assume we don't have our top computer security experts working on \"defending the network\", meaning the \"worthy opponents\" he's battling against are just some tech guys who made the system a few years back  the OP said that they changed their password and kicked out the perpetrator... How then did the ECE Hacker send another e-mail from your account to your account, if they didn't have access (so you say)?  I found this in my deleted messages folder after I luckily saw it on my cellphone. DAE have this? This guy's ~~admirable~~ impressive, seriously.\n\nAlso it says **I** sent it to security@illinois.edu\n\nEDIT: I just want to clarify, I don't *admire* him, I'm just impressed by what he did, seeing as how I do not know how to do this. Also, I'm **not the hacker**.  I'm torn between respect for his skills in finding the exploits and disappointment that he went as far as ruining the academic experience of some students who received his e-mails. Leaning towards the latter.\n\nI'm sure that whoever he is, he could have had a good time and proven how smart he is without sending out e-mails causing confusion among the students. ",
    "url" : "http://imgur.com/39jdm"
  }, {
    "id" : 18,
    "title" : "How many of you are in-state but not from Chicago or the outlying suburbs?",
    "snippet" : "I was just curious. I'm from around the Cairo area and I was wondering if there were any rural students here who don't consider Champaign as \"Southern Illinois.\"  Speaking as someone who has lived his entire life in Central Illinois, this is one of those things that irritates me about Chicagoans. Champaign is not in Southern Illinois. Carbondale is in Southern Illinois. Drive down there and you'll see the difference.     Champaign is definitely in central Illinois.\n\nOh! look! [Northern](http://www.illinoischannel.org/Illinois%20Counties%20-%20About%20Illinois%20North.JPG), [Central](http://www.illinoischannel.org/Illinois%20Counties%20-%20About%20Illinois%20Central.JPG), [Southern](http://www.illinoischannel.org/Illinois%20Counties%20-%20About%20Illinois%20South.JPG)\n\nedit: Forgot to saw I'm from Northwest Illinois Champaign is definitely in central Illinois.\n\nOh! look! [Northern](http://www.illinoischannel.org/Illinois%20Counties%20-%20About%20Illinois%20North.JPG), [Central](http://www.illinoischannel.org/Illinois%20Counties%20-%20About%20Illinois%20Central.JPG), [Southern](http://www.illinoischannel.org/Illinois%20Counties%20-%20About%20Illinois%20South.JPG)\n\nedit: Forgot to saw I'm from Northwest Illinois    don't call us southern          I'm from a rural area an hour south of Champaign and I've never heard anyone consider it \"Southern Illinois\" until I moved here. We considered it Central, for obvious geographic and social reasons. I've lived in and travel led throughout Southern Illinois and it's completely different economically and socially than the rest of the state, including Central Illinois.  Can you say what town you are from? I'm thinking Mattoon-Charleston area.    I'm from the Peoria area. I had a friend from the suburbs tell me once that anything south of 90 is Southern Illinois...   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14fm2f/how_many_of_you_are_instate_but_not_from_chicago/"
  }, {
    "id" : 19,
    "title" : "How to find music shows in the Chicago area?",
    "snippet" : "HI UIUC,\n\nI just moved out here from the west coast. Very much enjoying the local music scene in the area. Smilepolitely and a few other resources work well to find out what's going on locally. But what about the Chicago area? \n\nIt's not that difficult to get up there and back. Therefore would like to hit more shows there, but I'm finding it difficult to find the good stuff. The local papers aren't impressing me, tribune / sun-times and fuck ticketmaster ect... For all the transplants from the burbs and city, how do you stay informed as to where/when good shows are hitting the chicago area?      What kind of music are you interested in? I usually check out do312.com      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14fxku/how_to_find_music_shows_in_the_chicago_area/"
  }, {
    "id" : 20,
    "title" : "Guitar Class???",
    "snippet" : "Hey guys, im a senior and ive always wanted to learn how to play guitar. Im just wondering if anyone here knows if uiuc offers a class that teaches you or some bs like that ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14fq96/guitar_class/"
  }, {
    "id" : 21,
    "title" : "Transferring from DGS to ECE ",
    "snippet" : "I'm a freshmen in DGS and was wondering if anyone wants to share about their experience of transferring from DGS to ECE. like gpa requirements, any advice in general, anything would help!    Hi! A close friend did this. Do well in your classes overall (esp your science and calc classes). Advisors told him to do really well in ECE 110. You should be taking it next spring. Remember to sign up for the waitlist!\n\nThis should also be helpful:\nhttp://www.ece.illinois.edu/students/transfer/guidelines.html Hi! A close friend did this. Do well in your classes overall (esp your science and calc classes). Advisors told him to do really well in ECE 110. You should be taking it next spring. Remember to sign up for the waitlist!\n\nThis should also be helpful:\nhttp://www.ece.illinois.edu/students/transfer/guidelines.html  be willing to give up your soul when you get around to ECE 391 if you decide to become a Computer Engineer. do electrical engineers have to go through that course too?   [deleted] I went to go see a advisor to see if they could take the hold off for ECE 110, but they said to just wait until Jan 7th until its open to all students. So does your total GPA even matter? Like I heard you need a 3.00 or higher to get in. Is that true? And I have been hearing that ECE 110 is really hard, do you have any advice on how to do well in that class? Oh also do classes like electives and gen-eds like Chemistry 102 matter, because Chem 102 is fucking my GPA up. Thanks for the advice btw!  [deleted] [deleted] Oh btw I don't think Professor Brunet is teaching next semester, but I know that Professor Haken is for sure. Oh btw I don't think Professor Brunet is teaching next semester, but I know that Professor Haken is for sure.   [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/14fhfg/transferring_from_dgs_to_ece/"
  }, {
    "id" : 22,
    "title" : "The Noyes renovation claims a victim, Rest in Peace Chemistryan",
    "snippet" : "  I don't get it. I don't get it.  Yeah you may need to explain this or present a before picture.  For the longest time (As in since before I was a freshman, currently a senior) there was a small piece of graffiti there, where someone took the end of Chemistry and added \"an\" plus some underlining to make \"chemistRYAN\". Since the construction work it appears to have been erased.\n\nI'll admit it's never been a focal point of UIUC culture, but it was one of the first of the little quirks of this university's lifestyle that stood out me. It's part of my memories of this place, and I'm kinda sad to see it gone.\n\nBased on the subreddit's reaction,  I guess y'all can get off my lawn now. I got your joke and enjoyed it.  For the longest time (As in since before I was a freshman, currently a senior) there was a small piece of graffiti there, where someone took the end of Chemistry and added \"an\" plus some underlining to make \"chemistRYAN\". Since the construction work it appears to have been erased.\n\nI'll admit it's never been a focal point of UIUC culture, but it was one of the first of the little quirks of this university's lifestyle that stood out me. It's part of my memories of this place, and I'm kinda sad to see it gone.\n\nBased on the subreddit's reaction,  I guess y'all can get off my lawn now.  [deleted] I think you're in the wrong thread my friend. Also what is an \"AlBN\"? ",
    "url" : "http://imgur.com/5IPgr"
  }, {
    "id" : 23,
    "title" : "Christmas parties?",
    "snippet" : "Just a curious freshman here, I was wondering if there were going to be any big christmas-themed parties like there were for halloween. It seems like something that would happen.      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14fo0i/christmas_parties/"
  }, {
    "id" : 24,
    "title" : "Why is public parking on Campus so horrendous?",
    "snippet" : "I know we have a parking thread, but that's essentially inactive and doesn't address what I'd like to discuss.\n\nSome friends of mine came in to visit on Monday for the night. When they got here, we had to find parking. I'm in the dorms so I don't have a spot. We drove around for about an hour looking for a place that wasn't a no-parking 2-6am. There are literally no spots like that anywhere on campus. Even in Greek-zone, up north, or out in Urbana, everything is no parking without permit or no 2-6am. And, they're all meters, which in itself is annoying if you want to spend the night and need to continually refill it.\n\nWe ended up having to park at a friends house off campus. I know they have temporary permits for sale but there are so many issues with that. First off, they only sell the permits from 8:30am-5pm, so if you show up after that you're shit out of luck. Also, even with these temporary permits, you can only park in E14 and F23. Fuck. That. \n\nThe worst part is that there are so many spots available but none of them can be used by the public. Why is there not a public lot anywhere? What are people supposed to do if they're just coming in for the night and don't happen to make it to the permit office or want to park in the shitty lots?\n\nAlso, is there anyway to complain to the school or county about this? We just had a new election. The school senate banned smoking. IMO, the parking situation is infinitely more important than outdoor smokers.\n\nSorry, end /rant. But seriously. Fuck you, U of I, and your shitty parking.\n\n\nEDIT: This thread has made me lose a lot of faith in you, r/UIUC. I understand I rambled in the OP, but I was nothing but respectful in the posts (originally) and yet I was getting downvoted and insulted. The tone of the majority of your posts is patronizing more than informative. I then lost it and just let all insults fly. I've noticed a lot that this community is very pretentiously based on elitism and very discouraging to text posts. I've seen many people been ridiculed for asking a question that has been brought up before. This is a small sub, but it's the biggest school one there is. That's why I'm surprised at how childish everyone around here acts. Have some maturity and act like decent Redditors, please.    The idea is to try and prevent all the students from bringing cars down and parking them all over the place. It's not going to change, so you've pretty much just got to get over it. Buy a temporary parking pass (if your friend isn't going to be there in time, go there yourself and have them pay you back), find some of the parking off campus, or just park on the street and pay the ticket if you get it (it'll be around $20-25 I believe). Also, check those meters. Most of them shouldn't be enforced all night long. \n\nBut in the end, this is a big campus with a lot of people and a lot of the employees will need to park somewhere. When you've got parking in high demand, this is what happens.  I understand that, but the fact that it is so large would make me think they should be able to open a public visators garage. Register and monitor the vehicles that park there to prevent students from parking there regularly and profit. \n\nTo be honest, taking the ticket is likely the best option. Is it really only $25? Is there any situation in which you would get towed or booted?\n\nAnd you're right, I think the meters stop charging after a certain time. But they still all say (or at least the many I checked), no parking 2-6am.  I've only been ticketed for overnight parking in Urbana, and that was $25 I believe. For a one time offense, you shouldn't get towed or booted. If you leave your car there for 3 days, then yeah you probably will.\n\nAnd they do have a place for visitors, it's E-14. It's not extremely close but it's the best option you'll get. You can't expect them to make it free, there is too high a demand for parking and it's a great source of money for the university.  I don't expect free. I would pay up to $20 if I could. That's my point, there's literally nothing you can do if you show up at 7pm on a Monday. I would totally pay however much to park on the streets or in a lot but you can't!  \n\nGod damn I really get more and more pissed about this the more I think about it.  This is only because you don't know what you're doing.\n\nhttp://ci.champaign.il.us/departments/public-works/parking-programs/visitor-parking/university-district-visitor-parking/\n\nThere's plenty of options. Lot J is probably your best bet, or you can stop being scared of leaving campus. Lots of busses will get you from downtown Champaign back to campus. Additionally you can just do street parking in Urbana and take the Green back to campus town. It's a completely straight shot and it's 72 hours of free parking. [deleted] You're bitching about needing to make it a block further than Hendrick House. That's about half a mile from the Union. You can't find decent parking near campus? Well, join the club. As an employee I'm expected to pay 8% of my salary for a parking spot, and getting anywhere near the campus core will require a multi-year wait list. If the university were to expand parking, the new spots would probably go to employees so that your janitor that has to spend all night cleaning puke wouldn't have to take a 20 minute bus-ride out to E-14. [deleted]  I didn't have a problem finding a spot when I brought my car here before thxgiving break. Just drive around a bit north of green and east of lincoln and you'll find a spot that you can park for 72 hours. That is so incredibly far though it's not even funny.  yeah it is, the only other reasonable alternative is buying a temp pass but that sucks. So yeah, I'd agree overall on campus parking isn't too great. That is so incredibly far though it's not even funny.   You can park free overnight and all day on weekends at the two parking garages by fat sandwich at like 5th and john  HEY I WANT FREE PARKING BUT AM NOT WILLING TO WALK MORE THAN 10 FEET TO GET IT. \n\nis all this post is saying to me Fuck all of you. I have said numerous times I would be more than willing to pay for it, and at absurd rates too. The university just doesn't offer viable options.  http://i2.kym-cdn.com/photos/images/newsfeed/000/030/403/YouMad.jpg   &gt;We drove around for about an hour looking for a place that wasn't a no-parking 2-6am.\n\nContrary to what the parking website and the parking thread say, lot B1 across Matthews from Grainger does not start ticketing until 6 am. As long as you don't oversleep, it's perfectly safe on weeknights. I park there all the time when studying late at grainger, and you can verify this by the enforcement hours on the lot's parking sign.\n\nI'd be willing to bet that the other weekend parking lots have the same enforcement hours during the weekday.\n\nB-1 Springfield Avenue between Mathews &amp; Goodwin\n\nB-17 Harvey Street between Clark and Main\n\nC-09 Chalmers and Sixth\n\nE-14 First Street and Kirby\n\nF-23 Lincoln Avenue and Florida\n\nF-28 Peabody and Dorner Drive\n  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14flji/why_is_public_parking_on_campus_so_horrendous/"
  }, {
    "id" : 25,
    "title" : "Come see Wavves playing with The Dirty Feathers and Easter at Foellinger this Saturday!",
    "snippet" : "Show begins at 8.  Tickets are $15 for students.  If I recall correctly, you can buy them at the door.  The event is hosted through [Star Course](http://www.star-course.com) (a UIUC club).\n\nWavves is an indie rock band with punk/surf rock influences.  [Here's my favorite song by them](http://www.youtube.com/watch?v=uDKh61eMMuE).\n\n[Here's the official Facebook event.](https://www.facebook.com/events/172746586199807)   Foellinger is the worst place to see a live show.    Typical favorite song... Typical favorite song... ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14eio9/come_see_wavves_playing_with_the_dirty_feathers/"
  }, {
    "id" : 26,
    "title" : "Whose leg do you have to hump for a crawfish dinner around CU?",
    "snippet" : "Cravings; I've got one.   Crane Alley does one near the start of Mardi Gras. Other than that I think you're out of luck. Chinatown Buffet serves (terrible) crawdads if you just have to get a fix.  There's a Cajun place over on Gregory street that probably might have some crawfish on their menu.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14dvia/whose_leg_do_you_have_to_hump_for_a_crawfish/"
  }, {
    "id" : 27,
    "title" : "Best bar on Wednesday night?",
    "snippet" : "What is the bar to be at tonight?  I go to Seven Saint's, mostly for Whiskey Wednesday. 1/2 price whiskey would probably get me to go anywhere though.. I go to Seven Saint's, mostly for Whiskey Wednesday. 1/2 price whiskey would probably get me to go anywhere though..  Blind Pig, because mug night. Blind Pig, because mug night.  White Ho.   Murphy's, because all the cool kids hang out there on Wednesday night. Otherwise, Mike n' Molly's has Beats by Otter, which is a really super awesome chill laidback DJ night. Also Bacon Mega Cheeseburgers are cheaper on wednesday. Murphy's, because all the cool kids hang out there on Wednesday night. Otherwise, Mike n' Molly's has Beats by Otter, which is a really super awesome chill laidback DJ night. All the cool kids go to Thursday night murphy's  KAM'S!!! WOO! Bro.        As a guy who just went on a barcrawl, Firehaus was by far the busiest. Brothers, Legends, and Joes where all quite empty.  Act Sci Club Bar crawl!! (I still haven't figured out who you are...) I definitely enjoyed Firehaus the most. They were bustling, had dollar shots, and a lively group of people.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14d31i/best_bar_on_wednesday_night/"
  }, {
    "id" : 28,
    "title" : "By request, the Social Gaming Club is hosting a Smash 64 tournament on Saturday at 4PM in DKH314! One last event before finals :P",
    "snippet" : "  how do  you register for this? the register link is leading me to register for a wordpress account?? Just show up with $5. Ignore the link  SHIT! Really want to go to this but I think I'm going to see Twenty One Pilots this night.  This blows, you guys better have another one in the future. We have a great lineup of events for next semester, but none of the dates are final so I can't reveal them. I wish I could though ;)   I looked through the site and I was surprised you guys don't play BF3 at all. I am disappoint. I looked through the site and I was surprised you guys don't play BF3 at all. I am disappoint. My data shows that BF3 is in the same category of games as TF2, Halo, and Fifa- there are enough competitive players at this school to field a team or two, but not enough for an intracollegiate tournament. A BF3 tournament becomes pretty hard to justify if I can only expect 10-15 serious players.",
    "url" : "http://uiucsocialgamers.wordpress.com/events/super-smash-bros/smash64-fa12/"
  }, {
    "id" : 29,
    "title" : "How often do non-music majors get to play in the bands/orchestras?",
    "snippet" : "Is it common for people not majoring in music to play in the ensembles at UI? Or what about music minors? I am looking to go to UIUC to major in physics and possibly minor in music, but my decision is mainly resting on this. My main instruments are bassoon, tenor saxophone, guitar and drum set. I am in the all-state orchestra on bassoon as a junior, to get an idea of my talent. So, what do you all think? Would it be plausible for me to play in a concert band, an orchestra, and the volleyball band?   Info on band auditions for non-majors [here](http://bands.illinois.edu/content/concert-bands-audition-information). The orchestras are more competitive, so the band program is your best bet. I don't know anything about the volleyball band.  If you just really want to play in a concert band, you shouldn't have much of a problem finding a band to play in. There are six different concert bands divided into I think four tiers of skill, based on audition- the lowest tier is more or less specifically tailored to non-majors and majors on secondary instruments, so given your skill level I don't think you should have much difficulty getting into at least one of the bands. It might be somewhat of a time commitment though, and you will also need to either buy a tuxedo or rent one for each of the concerts. If you're in the dorms it might also be a little tough to find a good place to practice where you won't disturb anyone, and I don't think non-majors have access to practice rooms in the music building, but you can probably work something out.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14cyuy/how_often_do_nonmusic_majors_get_to_play_in_the/"
  }, {
    "id" : 30,
    "title" : "did Jimmy John's raise their prices?",
    "snippet" : "I went in there today and it was $4.64-- used to be $4.25.  What is this about?!    I ran into this today too. My normal sandwich costs $4 and change, and I usually pay with a five. Today it cost $5.01. I did not have the $0.01. I asked the cashier if it was a big deal and he said yes. Checked my pockets again and walked away with my sandwich half made on the assembly line. I felt like a jerk, but I literally didn't have the money.\n\nLong-winded way of saying that yes, they definitely did raise their prices some time between today and a couple weeks ago. They wouldn't give you your food for being a cent short?  I remember when jimmy johns was actually a good deal. Now the only thing worth buying is the day old bread. I love that day old bread, break off the ends and that shit is some of the most delicious 25 cents you can get I love that day old bread, break off the ends and that shit is some of the most delicious 25 cents you can get how does one acquire this day old bread?\n I love that day old bread, break off the ends and that shit is some of the most delicious 25 cents you can get  I don't like Jimmy John's anymore after they stopped putting sprouts on their sandwiches. The sweet pea shoots they put instead were worse, and now they have stopped that. I don't like Jimmy John's anymore after they stopped putting sprouts on their sandwiches. The sweet pea shoots they put instead were worse, and now they have stopped that. Didn't they stop putting sprouts because of that salmonella outbreak that was linked to them? Didn't they stop putting sprouts because of that salmonella outbreak that was linked to them?  it could also be a tax increase. places on campus will often raise their prices during breaks/summer so people don't notice. chic fil a is especially guilty of that Papa dels had slices for like near a dollar during the summer and now they are 3 bucks. I am so bummed.  Prices are the same.  \n\nWere you buying them in the late afternoon?  Slices are half price after 3 until they run out. [deleted] [deleted] Prices are the same.  \n\nWere you buying them in the late afternoon?  Slices are half price after 3 until they run out.   It's probably a reaction to Obamacare IMHO. Obamacare was responsible for all those hostages taken in Iran. Obamacare killed my dog.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14cv9f/did_jimmy_johns_raise_their_prices/"
  }, {
    "id" : 31,
    "title" : "A couple of my friends thought some of the hydrants on campus looked a little chilly.",
    "snippet" : "      ",
    "url" : "http://imgur.com/a/Dai9s"
  }, {
    "id" : 32,
    "title" : "How many people will actually donate back to the University when they become Alumni?",
    "snippet" : "As the title says, how many of you would consider donating money back to the University? Since I'll be graduating next year, I can't imagine giving back to this University though. I thoroughly enjoyed all my classes and students I have met here except... \n\nI really dislike my school's career services and department advisers. They are all near useless and gave me tons of bad advice throughout my time here. I could've probably graduated another semester earlier if I was knowledgeable about scheduling back in the day. My career services was pretty unhelpful also (pretty much found a job on my own). I would rather donate money to a charity honestly.\n\nEDIT: Thanks for your responses! It was interesting to read some of the insight by other members on this subreddit.   I will only donate money, assuming I am rich enough, on the condition that it only goes to improve the lives of students, and not just get caught up in the bureaucracy of a College's administration. So for example, no way in hell would I give money that might go to things like the faculty, advisors or career services like you said, but I would donate money to improve dorms, improve food, renovate buildings to include better workspaces for students, etc.  I agree with this wholeheartedly. How do I tell where my money is going though? I will only donate money, assuming I am rich enough, on the condition that it only goes to improve the lives of students, and not just get caught up in the bureaucracy of a College's administration. So for example, no way in hell would I give money that might go to things like the faculty, advisors or career services like you said, but I would donate money to improve dorms, improve food, renovate buildings to include better workspaces for students, etc.  &gt; no way in hell would I give money that might go to things like the faculty, advisors or career services\n\nDoesn't that seem a little counter intuitive? Perhaps their services would be better if there were more funds going into them. You think the reason some professors/staff are so shitty at U of I is because of lack of funding? The college of engineering is doing this I-STEM program where they are paying a bunch of people to improve freshman and sophomore level classes. Of the two courses I'm in that are participating I think they have actually made the class more aggravating compared to semesters past. Plus a bad professor that's been here for 45 years is getting paid buckets of money already, nothing will change his ways, including stupid ICES forms (off topic but as long as I'm ranting)\nMy point was money doesn't solve the problem of bad faculty or courses, but it can solve other problems that students will actually see benefits in day to day life   Already an alum of both the engineering and business schools. And no, so far I have no plans to donate. I'd give to the business school before the college of engineering. I always felt like unless you were incredibly gifted, the engineering school didn't give a shit about you. Business, on the other hand, seemed actively involved and interested in my future.\n\nI also don't like the idea of donating to a clearly (at this point) broken system. Out of control tuition, grade inflation, expanding bureaucracy, and diminishing worth of a degree. Once those things get under control maybe i'd think about it.  &gt; I really dislike my school's career services and department advisers.\n\nWhich school? :D Probably not in your department. My advisers would never use smileys :)     Nope. The University doesn't care about LAS. All the money goes to Engineering. I feel like a second-class student. Even in my own small department, it's extremely difficult to reach people. I get no feeling that they care about my future. Needless to say, it's left a bad taste in my mouth =/ Nope. The University doesn't care about LAS. All the money goes to Engineering. I feel like a second-class student. Even in my own small department, it's extremely difficult to reach people. I get no feeling that they care about my future. Needless to say, it's left a bad taste in my mouth =/    They only donation I am giving is to my club. Why you may ask? The reason is because the University has so many RSO's that it does not give a shit about. The university has enough to survive on its own i just want to make sure future students in my club can keep doing what we already do which is a major stress relief and honestly fun.  You're already donating to the school if you're paying taxes in this state      Actually, the school has a small team of employees whose jobs are to call Alumni and politely ask for donations. Someone I know has this job- it's amazing how many thousands she pulls in from calling these people. It's a weird set up, because the work she directly does brings in thousands, but she  herself is paid about minimum wage. I believe all colleges have something similar. I recall my brother receiving a call from the Alumni Association a few weeks after he had graduated asking for donations. He didn't even start work yet.     If I become filthy rich, I will donate enough so that the buildings where I got raped in my engineering classes would be named after me.  Then I would have a nice laugh.     The only way this school is getting another cent out of me is if I go to a football game in the future.   I could see myself donating towards specific research projects or scholarships but that's only if I make it big.  Can you make it big as a C programmer?",
    "url" : "http://www.reddit.com/r/UIUC/comments/14boas/how_many_people_will_actually_donate_back_to_the/"
  }, {
    "id" : 33,
    "title" : "Anyone know a good place to get \"Chief\" stuff like shirts or stickers?",
    "snippet" : "Looking for Xmas fodder for a pro-chief buddy.  Any suggestions?  Gameday still has some Chief merchandise online.\nhttp://store.cstv.com/store.cfm?dept_id=9609&amp;store_id=378  Lots of the online stores will have stuff even if they aren't in stores. I have talked with one of the employees at Follets and they said that to please the university (which has tried to stay neutral on the issue) they don't display Chief merchandise but they still have it in stock in the back room and online because some people still want it. that's funny, because they have the chief prominantly dispalyed in their window. Are you sure it's not a different store?  so on the topic of the chief, i was watching the redskins game the other day, and they're freaking name is THE REDSKINS and this is their logo http://upload.wikimedia.org/wikipedia/en/thumb/6/63/Washington_Redskins_logo.svg/220px-Washington_Redskins_logo.svg.png\n\nif we cant have our chief, they should have to be the washington W'S! They're in the NFL, and privately owned.  Different rules apply to them...  It sucks, but true. I would've said money was the deciding factor.... They're in the NFL, and privately owned.  Different rules apply to them...  It sucks, but true.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14cnoo/anyone_know_a_good_place_to_get_chief_stuff_like/"
  }, {
    "id" : 34,
    "title" : "Arts&amp;Crafts Store On or Near Campus",
    "snippet" : "I signed up to give a present to a less fortunate child this Christmas, and she (10 year old female) said she would like arts/crafts/coloring supplies. I went to Walgreens, and the selection was disappointing.\n\n\nI want suggestions of a place either on campus, or accessible by bus (I do not own a car). Any help is appreciated, thanks!  There's Art Coop in Lincoln Square Mall. I've only been there once to get 'chenille stems', but it looked like they had a good selection of art stuff.  If you have a particular project in mind, definitely check out [the IDEA store](http://the-idea-store.org/). It has tons of supplies and random odds/ends for almost any art project.    If you want to get her into Knitting there is a local yarn store. Here is their site: http://www.cu-needleworks.com/   Art Coop might be overkill for a 10 year old. There's a Hobby Lobby on Neil, north of I-74. Art Coop might be overkill for a 10 year old. There's a Hobby Lobby on Neil, north of I-74. They have a lot of kid's stuff from what I can remember. Art Coop might be overkill for a 10 year old. There's a Hobby Lobby on Neil, north of I-74. I went there today, they have art supplies for various age and skill levels. You may just have not noticed the kids' section, but I was satisfied.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14cmw7/artscrafts_store_on_or_near_campus/"
  }, {
    "id" : 35,
    "title" : "Goddamnit I can no longer trust emails sent from the ECE department",
    "snippet" : "   Also, it appears the ECE department is teaching you how to get any girl with one easy trick.     seems legit It's not. Someone has been hacking email in the department and causing all kinds of confusion. Cancelled an exam last Thursday. Are you sure someone hacked the emails and isn't just spoofing the email adress? Are you sure someone hacked the emails and isn't just spoofing the email adress? This is what kindratenko said was happening.   Is there any way to speed up catching this a-hole?\n\nI assume there is some cyber security firm or government agency they can employ for help... permanent solution: shut down the internet permanent solution: shut down the internet permanent solution: shut down the internet Shutting down the Internet is no laughing matter. Think of the repercussions. No reddit. No cats.....THE HORROR!!!!",
    "url" : "http://postimage.org/image/pqtjbjfbl/"
  }, {
    "id" : 36,
    "title" : "LEX Owner Defends Carrier’s Actions",
    "snippet" : "  While I do think that LEX service is shitty I dont want to see them shut down. Suburban Express will then have a monopoly on buses to/from Champaign and their owner is an asshole. I know Peoria Charter and Greyhound have buses too, but they don't have nearly as many times as LEX or SE.    Excuses are like assholes.  Everybody's got one, but don't nobody want to admit it. Excuses are like assholes.  Everybody's got one, but don't nobody want to admit it. Excuses are like assholes.  Everybody's got one, but don't nobody want to ~~admit it~~ hear yours.",
    "url" : "http://will.illinois.edu/news/spotstory/lex-bus-company-defends-agencys-accusations/"
  }, {
    "id" : 37,
    "title" : "Where do all the Asian kids get the money to buy all those nice cars?",
    "snippet" : "I am not trying to be racist but I have noticed that for the most part only the Asian students on campus are the ones who seem to have the really nice cars.  Today I saw someone driving a brand new Maserati down Green street.  They all seem to have Mercedes, BMW, Audi, etc.  So where do they get the money to buy the cars?  As it is they already pay out of state tuition?  And why do they feel the need to buy such nice cars? I am sure their are students here whose parents are just as successful but they don't feel the need to buy such cars.\n   Their parents have jobs. At these jobs, their parents exchange goods &amp; services for money. They use that money to buy cars for their kids. Most parents have jobs.  At these jobs, most parents exchange goods &amp; services for money.  However, very few use that money to buy [$120,000 cars](http://www.motortrend.com/new_cars/01/maserati/) for their kids.\n\nPerhaps I'm alone on this, but I don't believe condescending sarcasm is warranted when a legitimate question is asked. It's their money and they choose to spend it this way.   In China, even after adjusting for currency, the prices on those same cars are astronomically higher.  My Chinese roommate told me something like cars that might cost $30,000 here could cost around $100,000 in China.  So perhaps if the student comes from a wealthy family (which many internationals do) their parents are giving them a chance to drive a car like that before coming home.\n\nShowing off wealth also seems to be a major part of Chinese upper-class culture, so that could play a role in it too. In China, even after adjusting for currency, the prices on those same cars are astronomically higher.  My Chinese roommate told me something like cars that might cost $30,000 here could cost around $100,000 in China.  So perhaps if the student comes from a wealthy family (which many internationals do) their parents are giving them a chance to drive a car like that before coming home.\n\nShowing off wealth also seems to be a major part of Chinese upper-class culture, so that could play a role in it too. Not just Asia, I have heard that a Volkswagen or BMW costs 1.5 to 2 times more in Germany where it is manufactured than it does here. Also, the cost of gas is much higher in the rest of the world compared to the US. Back home, I could fill the tank of a Trail Blazer with less than half of what I pay for a gallon here.    I saw a GTR35 on campus today O.O    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14abxt/where_do_all_the_asian_kids_get_the_money_to_buy/"
  }, {
    "id" : 38,
    "title" : "Trade RLST 110 discussion sections?",
    "snippet" : "I'm currently in RLST 110 World religions with a discussion section on Thursday from 11-11:50. One of my other classes finally listed it's time for the lab associated with it and of course it's during this time. I can't move that lab since it's my capstone design class. All the discussion sessions for 110 are closed now. So if anyone would like to trade me times that'd be awesome. Or if someone can suggest a new class to take that would be easier or interesting. I just have to have two hours of liberal education hours so it could basically be anything. Thanks.   Talk to the professor, and tell him you need to take a different discussion but they're all full.  Seating capacities are set by the professor, not by the University, so it's possible for him (to have a secretary) increase it by one to get you in it. Talk to the professor, and tell him you need to take a different discussion but they're all full.  Seating capacities are set by the professor, not by the University, so it's possible for him (to have a secretary) increase it by one to get you in it.  If I were you I would just keep an eye on it, someone in a discussion section that works for you will drop eventually. What if no one does before the semester starts? Am I suppose to just go to a random discussion that week and then wait for ppl to drop the class and jump in one officially? Talk to course staff.  That's a pretty competitive course to get into (since it fulfills one of two requirements), but they'll work with you to get you into a section.\n\nAccording to current course policy, you can attend any section led by your assigned section leader; I imagine the policy will be similar next semester.  Taking RLST110 now. Basically as long as you don't have a schedule conflict so it won't let you register, you'll be fine. The prof and TA's are really flexible, and you can pretty much go to any discussion time of the same TA, and if that doesn't work they're pretty active in trying to help. Be careful of switching classes because some students tried that at the beginning of the semester but got locked out of the class, and the prof pretty much said there was nothing he could do to get their spots back.  Ok i'll keep that in mind. How do you like the class? Is it easy? I took it because it seems really interesting so I don't really mind if it is some work but I'd prefer less.. How many exams are there?  It's pretty straightforward. Even my TA has said multiple times \"if you just go to class and pay attention you will get an easy B\" which very true. I go to class and barely pay attention, and I got a solid B on the first exam with little studying. The thing that puts you into the A range is proper studying and also doing well on the term paper. One exam, one final, one term paper are your grade. I clicker points are a little bit too.\n\nOn a side note, I don't know if you can tell who your TA is or if you will be able to switch, but if you can, try to get Nathan Raybeck. He takes a huge part in writing the exams and gives awesome study guides/help. Alright. Thanks for all the tips!! It's pretty straightforward. Even my TA has said multiple times \"if you just go to class and pay attention you will get an easy B\" which very true. I go to class and barely pay attention, and I got a solid B on the first exam with little studying. The thing that puts you into the A range is proper studying and also doing well on the term paper. One exam, one final, one term paper are your grade. I clicker points are a little bit too.\n\nOn a side note, I don't know if you can tell who your TA is or if you will be able to switch, but if you can, try to get Nathan Raybeck. He takes a huge part in writing the exams and gives awesome study guides/help.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14a7c2/trade_rlst_110_discussion_sections/"
  }, {
    "id" : 39,
    "title" : "CS 498-Cloud Computing Any thoughts?",
    "snippet" : "Taking it next semester because I couldn't get into the web development course... is this the first time it's been offered? Any impressions?  I'm looking forward to that Web course.\n\n(Oh yeah, I'm TA'ing it). God I'm jealous... Professor wouldn't open more spots. Any thoughts on getting in? God I'm jealous... Professor wouldn't open more spots. Any thoughts on getting in? Edit: It's way too late. You were talking about the web programming course and not the cloud computing course. :D    \n~~I'm probably looking at the wrong thing, but this is what I see in the registration system.~~\n\n&gt; ~~Cloud Computing - 31601 - CS 498 - CC3 = ~40 open spots~~  \n&gt; ~~Cloud Computing - 59276 - CS 498 - CC4 = ~80 open spots~~\n\n~~Good luck.~~ I'm looking forward to that Web course.\n\n(Oh yeah, I'm TA'ing it). I signed up, and just out of curiosity, what exactly should I expect? I'm a cs junior but haven't done web development before, not sure if I'll be in over my head.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/149h47/cs_498cloud_computing_any_thoughts/"
  }, {
    "id" : 40,
    "title" : "Steam on UIUCnet?",
    "snippet" : "Edit: Used IllinoisNet and it worked.\n\nI was in lecture and saw someone downloading their steam games through WiFi.\n\nI installed Steam on my laptop and Steam is telling me \"Steam.exe (main exception): To run steam, you must first connect to the internet.\" I obviously have internet because I'm posting this right now and I've turned my Firewall off to see if that would work.\n\nHave you guys gotten Steam to work on UIUCnet?\nIf so, how?  Can you use IllinoisNet? That might work better. That worked! I never use IllinoisNet because my laptop is crappy and can never connect to it.\n\nGuess I got lucky this time. Thanks!  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/149w4o/steam_on_uiucnet/"
  }, {
    "id" : 41,
    "title" : "Where to find a sombrero in uiuc area?",
    "snippet" : " I can't think of a place to find one. Any of you see one lying around in a store? Preferably a very large one ^^  Try Dallas &amp; Company on University and First.  Even if you don't find it, it's a pretty cool store to check out.   amazon     Go to a Mexican restaurant and claim it is your birthday. In addition to a sombrero, you will also get a free desert.  Lies. I went to Chipotle and told them it was my birthday and the cashier just looked at me weird. You should have tried Taco Bell.  Dallas &amp; Company defiantly has them\n They were told not to sell them... But none can tell D&amp;C what to sell!  Why not? ~~defiantly~~ definitely\n\nJust seemed humorous in my mind.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/149ijr/where_to_find_a_sombrero_in_uiuc_area/"
  }, {
    "id" : 42,
    "title" : "Printing a poster on campus?",
    "snippet" : "I have a presentation on Thursday and need to get a poster off for it. Is there anywhere on campus that does decent poster printing? I know of the FedEx location down on Wright Street, but I've heard some of the GE students have a printer they can use. Does anyone know about this?  [Beckman ITS](http://its.beckman.illinois.edu/PrintingCopying.aspx). They usually get it done in under an hour, and you just walk in and pick it up.   You may (MAY) be able to do it for free if you go to the Siebel Help Desk.\n\nSource: I work there. Already taken care of, but thanks. Already taken care of, but thanks. Where did you get it done?",
    "url" : "http://www.reddit.com/r/UIUC/comments/149lnf/printing_a_poster_on_campus/"
  }, {
    "id" : 43,
    "title" : "If only...",
    "snippet" : "  ",
    "url" : "https://mail.google.com/mail/help/customtime/index.html"
  }, {
    "id" : 44,
    "title" : "What is the most interesting/unique building on campus in your opinion? ",
    "snippet" : "For Rhetoric I have to write an analytic paper describing one of the buildings on campus(ex. lincoln hall, noyes, granger) along with its culture, demographic, and impact on campus. I plan on checking out some locations tomorrow, but I'm curious if you guys have any suggestions. Thanks everyone  Altgeld wouldn't be a bad choice. It most definitely is interesting. Its a piece of a replica of a german castle right? [Altgeld's castles](http://en.wikipedia.org/wiki/John_Peter_Altgeld%27s_architectural_legacy) Altgeld wouldn't be a bad choice. Supposedly it's one corner of a castle, with the others being on other Illinois public university campuses (NIU comes to mind, but I can't remember the other universities). Also, Altgeld used to be the law building. The stonework over the north entrance says \"Law.\"\n\nI learned this information from a former law professor.   Noyes, because of the \"grave\". Also you can get to around five different buildings from noyes without ever walking outside (via tunnels and bridges). grave?  Krannert would be a great building to write about. Im not sure who designed the building, but you could say a lot about its overall design. There are a lot of features in it that are unique, such as the performance halls that is acoustically perfect - i.e. the hall was designed such that sound from the stage would travel evenly to every spot in the theater without the aid of sound enhancing equipment.  A lot of theatre majors (myself included) know all the trivia about Krannert that the tour guides tell visitors. Take these with a grain of salt because I heard these factoids second hand.\n\nFoellinger Great Hall is completely Symmetrical. The siding is taken from tree cores that are split down the middle and were put on opposite ends. There are fake doors that are there purely for symmetry. When the Fire Marshall saw them, he said something along the lines of, \"That's cute, are you going to take off the handles?\".\n\nThe ceiling in the lobby has a corrugated pattern because Mr. Krannert (UIUC alum) invented the process by which they make corrugated cardboard. \n\nThe floor has a wooden tile pattern that is based of the corn fields that Mrs. Krannert liked so much when they flew over them. The tiles are also made of a special kind of wood, and the whole year's supply was used in the Krannert Center the year it was built.\n\nThere are five venues: Studio Theatre, Foellinger Great Hall, Tryon Festival Theatre, Colwell Playhouse and an outdoors ampitheatre. \n\nAlso, it's very confusing trying to get to where you want on the lower levels. It's a bit of a maze if you are not familiar with it. I believe the wood floor is Teak... Krannert would be a great building to write about. Im not sure who designed the building, but you could say a lot about its overall design. There are a lot of features in it that are unique, such as the performance halls that is acoustically perfect - i.e. the hall was designed such that sound from the stage would travel evenly to every spot in the theater without the aid of sound enhancing equipment.     siebel  There's one building near PAR/FAR that had door on the second floor, just hanging outside. I heard the story was that it was for the props - that building used to house a theater - but that part of the building was demolished but the door stayed. It's just really interesting to look at. outside of it, its just plain old building though  Beckman What is Beckman? I never hear of anyone actually using that building yet it is huge. What goes on in there? What is Beckman? I never hear of anyone actually using that building yet it is huge. What goes on in there?   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/148xz2/what_is_the_most_interestingunique_building_on/"
  }, {
    "id" : 45,
    "title" : "Need extra time for Finals?",
    "snippet" : "  Finals cannot be canceled. http://i.imgur.com/9qkzQ.jpg http://i.imgur.com/9qkzQ.jpg Not fucking worth it. I would do it.  \nI do have 3 finals in 24 hours though. You can request a conflict for that. now it's 3 consecutive exams. They're not all consecutive though. Oh that's rough 8 and 11 am Friday and 8 am Saturday.\nI will kill whoever scheduled these engineering class finals. Finals cannot be canceled. From the email today:\n\n\"Finally, as we approach the end of the semester, please keep in mind that scheduled final exams cannot be **cancelled**. Changes to the time and venue for an exam, if any, will be made only by the course instructors. The only legitimate announcements about exam schedule changes will be made in class by your instructors and through a special posting on My.ECE.\" Yeah? Finals cannot be canceled.  I'm sorry, what exactly happened? I never saw any of the \"malicious\" emails, can someone fill me in? A Fake Massmail was sent to all students of ECE (woops Edit) 329 roughly an hour before their most recent exam. Attached was an encrypted zip which the message claimed were the answers to the exam, and in exchange for X amount of bitcoins (a form of tough to trace online currency), he would send the key so you could see the answers. \n\nThen presumably the same person sent an email 15 or so minutes later from what appeared to be the professor's email, claiming that the exam was cancelled.  A Fake Massmail was sent to all students of ECE (woops Edit) 329 roughly an hour before their most recent exam. Attached was an encrypted zip which the message claimed were the answers to the exam, and in exchange for X amount of bitcoins (a form of tough to trace online currency), he would send the key so you could see the answers. \n\nThen presumably the same person sent an email 15 or so minutes later from what appeared to be the professor's email, claiming that the exam was cancelled.  I'm sorry, what exactly happened? I never saw any of the \"malicious\" emails, can someone fill me in? ",
    "url" : "http://www.quickmeme.com/meme/3s12sf/"
  }, {
    "id" : 46,
    "title" : "Get UIUC on the #1 spot! We can't let UC Davis win this! Signup ASAP!",
    "snippet" : "   I signed up after a quick glance at the company, but what does it offer besides just specialized searching for FB contacts?\n\nIt's a cool idea and maybe I'm missing some major functionality, but it doesn't seem like it does a whole lot you can't already do through FB's search functions.  As a U of I alum who is currently at UC Davis, I'm staying out of this.  ",
    "url" : "http://ark.com/edu/"
  }, {
    "id" : 47,
    "title" : "Illinois ranked 13th in AP poll!",
    "snippet" : "  The higher we go, the more nervous I get.  Agreed, especially since we haven't had a really strong statement win yet.  I hope we're as good as the polls think we are, but I don't get how we jumped so high after the Georgia Tech game.\n\nEdit: I accidentally a word Agreed, especially since we haven't had a really strong statement win yet.  I hope we're as good as the polls think we are, but I don't get how we jumped so high after the Georgia Tech game.\n\nEdit: I accidentally a word Agreed, especially since we haven't had a really strong statement win yet.  I hope we're as good as the polls think we are, but I don't get how we jumped so high after the Georgia Tech game.\n\nEdit: I accidentally a word &gt; I hope we're as good as the polls think we are\n\nWe aren't.  We never are. :( One of the legions of fans ruined by Bruce Weber.  Anyone else love the fact that Kentucky isnt ranked?  Can't wait for the #13 Illinois vs #10 Gonzaga game on Saturday. Gonzaga currently has the #1 fieldgoal % in the nation (.533%) and is at #5 for points per game (85.3). It's a scary match-up but it would be a huge statement if we could win that one.  Let's look to some of Groce's high-intensity D to bring the Zags offensive numbers back down to earth.  It's definitely a going to be a tough game, but I like the matchup for us...if only the game was at the UC again instead of out in Washington.... No way we should be favored, Gonzaga has only lost 7 games in that arena the 8 years it has been open, I'm hoping for an illini victory but a close loss wouldn't be terrible. Who said anything about being favored?  They are at home and better ranked.  Of course they are going to be favored. &gt; but I like the matchup for us...\n\nTo me that sounds like you think we will be favored to win, and definately some people on loyalty are saying that we should win. I think that this will be a tough matchup for us and hard to win.     Be sure if you want to see the Western Carolina game tomorrow, you have to go; it won't be on TV.  ",
    "url" : "http://espn.go.com/mens-college-basketball/rankings"
  }, {
    "id" : 48,
    "title" : "What is the crazy loud noise that periodically comes from the Northeast of campustown?",
    "snippet" : "So right now there is an insanely loud vacuum-cleaner like sound reverberating through my apartment near 1st and John that seems to come on once a week or so. I've talked to others as far as 6th and Springfield who hear it also, so does anyone know what the reason is for it?  1st and john is northwest part of campus.... I live at 2nd and daniel and hear the powerplant noise at a fair intensity when its going off.\n  It comes from the power plant with the two smokestacks. I dont know what it is. It comes from the power plant with the two smokestacks. I dont know what it is. There was a post on this subreddit about noise from the powerplant a few days ago. OP should search for it. That was a sound from the southwest part of campus though. It comes from the power plant with the two smokestacks. I dont know what it is.       FORBES HERE. I CANT SLEEP ",
    "url" : "http://www.reddit.com/r/UIUC/comments/148rxy/what_is_the_crazy_loud_noise_that_periodically/"
  }, {
    "id" : 49,
    "title" : "The Socialist Equality Party urges University of Illinois graduate assistants to reject the sellout agreement the Graduate Employees Organization has reached with UIUC administrators.",
    "url" : "https://www1.wsws.org/articles/2012/dec2012/uiuc-d04.shtml"
  } ],
  "processing-time-source" : 88,
  "processing-result.title" : "uiuc15_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc15_reddit.xml"
  }
}