{
  "processing-time-total" : 1278,
  "clusters" : [ {
    "id" : 0,
    "size" : 10,
    "score" : 26.928643876846845,
    "phrases" : [ "Interested" ],
    "documents" : [ 2, 5, 7, 13, 15, 22, 31, 36, 38, 47 ],
    "attributes" : {
      "score" : 26.928643876846845
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 60.3217078058252,
    "phrases" : [ "Play" ],
    "documents" : [ 0, 5, 8, 26, 45, 47, 48 ],
    "attributes" : {
      "score" : 60.3217078058252
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 55.04439570475231,
    "phrases" : [ "Email" ],
    "documents" : [ 7, 11, 15, 24, 33, 44 ],
    "attributes" : {
      "score" : 55.04439570475231
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 37.892948644301185,
    "phrases" : [ "Like New People" ],
    "documents" : [ 6, 25, 31, 47, 48 ],
    "attributes" : {
      "score" : 37.892948644301185
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 37.35373275207819,
    "phrases" : [ "Lot of Programming" ],
    "documents" : [ 15, 36, 38, 47, 48 ],
    "attributes" : {
      "score" : 37.35373275207819
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 52.291097291864695,
    "phrases" : [ "According" ],
    "documents" : [ 4, 14, 31, 48 ],
    "attributes" : {
      "score" : 52.291097291864695
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 50.9552986803027,
    "phrases" : [ "Drop the Class" ],
    "documents" : [ 32, 38, 47, 49 ],
    "attributes" : {
      "score" : 50.9552986803027
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 47.23374212333711,
    "phrases" : [ "Quickly" ],
    "documents" : [ 19, 23, 28, 31 ],
    "attributes" : {
      "score" : 47.23374212333711
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 32.1931650905919,
    "phrases" : [ "Company" ],
    "documents" : [ 28, 33, 43 ],
    "attributes" : {
      "score" : 32.1931650905919
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 41.61384654490205,
    "phrases" : [ "Lab" ],
    "documents" : [ 15, 16, 31 ],
    "attributes" : {
      "score" : 41.61384654490205
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 58.9638584429061,
    "phrases" : [ "Local" ],
    "documents" : [ 3, 17, 31 ],
    "attributes" : {
      "score" : 58.9638584429061
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 56.72745318180951,
    "phrases" : [ "Spring 2013" ],
    "documents" : [ 5, 10, 38 ],
    "attributes" : {
      "score" : 56.72745318180951
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 54.405214374036206,
    "phrases" : [ "Trees" ],
    "documents" : [ 25, 36, 37 ],
    "attributes" : {
      "score" : 54.405214374036206
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 38.105444690240745,
    "phrases" : [ "Black Dog Black Dog that's my List" ],
    "documents" : [ 21, 25 ],
    "attributes" : {
      "score" : 38.105444690240745
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 29.939690687211417,
    "phrases" : [ "Business Days" ],
    "documents" : [ 42, 47 ],
    "attributes" : {
      "score" : 29.939690687211417
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 100.29736800863952,
    "phrases" : [ "CS Program" ],
    "documents" : [ 36, 47 ],
    "attributes" : {
      "score" : 100.29736800863952
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 64.11760872902587,
    "phrases" : [ "Change your Math" ],
    "documents" : [ 32, 46 ],
    "attributes" : {
      "score" : 64.11760872902587
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 71.71677146100679,
    "phrases" : [ "Georgia Tech" ],
    "documents" : [ 29, 47 ],
    "attributes" : {
      "score" : 71.71677146100679
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 69.21206959360134,
    "phrases" : [ "Looking into Transferring" ],
    "documents" : [ 38, 47 ],
    "attributes" : {
      "score" : 69.21206959360134
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 54.93535487300809,
    "phrases" : [ "Strike" ],
    "documents" : [ 35, 46 ],
    "attributes" : {
      "score" : 54.93535487300809
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 44.8942327079183,
    "phrases" : [ "Tickets" ],
    "documents" : [ 9, 26 ],
    "attributes" : {
      "score" : 44.8942327079183
    }
  }, {
    "id" : 21,
    "size" : 10,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 1, 12, 18, 20, 27, 30, 34, 39, 40, 41 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1191,
  "documents" : [ {
    "id" : 0,
    "title" : "I need to play pool. Competitively, and soon.",
    "snippet" : "Hey, where can I get a decent game around here? Anything goes, just no shitty tables and no french pool.  [Jupiter's Pizza in downtown has leagues.](http://www.jupiterspizza.com) Sorry, I'm not looking for that sort of league. I don't want to beat people, I want to beat the best people around- the idea of a reward is less appealing to me than the idea that I beat the best around...BUT, you get an upvote anyway, because I could totally get down on this league on a drinking night. Thank you.  Well I mean that depends on your skill level. Everyone thinks they're good at pool. You could always come play with the Illinois team and me sometime and see.  Clarification by OP; I am over 21 and looking for a legit league that could improve not only my ability to apply 'english' on heavy/cross table shots, but also improve my ability to pull off double shots (aka french-style pool), and sharp rebound shots within my game. You sound like the man that could help me. Include details or a link for a tryout if you have it. Thank you. You won't necessarily get better with league play. You'll just pay lots of money to play short little races. I mean, again, that depends on your skill level. Next semester lots of things will be coming up, like Regionals (here at UIUC) and Illinois state tournament.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/148x8w/i_need_to_play_pool_competitively_and_soon/"
  }, {
    "id" : 1,
    "title" : "Advice on choosing a minor",
    "snippet" : "ABE student here, focusing on Biological engineering. I'm trying to decide between a minor in bioengineering, biomolecular engineering, and chemistry. I'm leaning toward the first two. I'd like to hear some people's advice ( pros and cons ) towards any or all of the above minors. I'm hoping to go to grad school after undergrad. Goals: High income, flexible career opportunities, job security, flexible working hours, ability to obtain superior knowledge, ability to greatly benefit society.  Consider not doing a minor, and instead doing something that someone would want to talk to you about in an interview.\n\nIf the classes in the minor are something you are taking anyway, or if they will be cool / relevant enough that your ideal employer might care about what you did there, then it's a good idea. Otherwise, it's a line on your resume that will probably be skipped over since it sounds so similar to your major anyway.\n\nI'm not a biological engineer, but this is a perspective to weigh against the alternatives. Good luck! I'm already planning on doing some research or an internship.. or possibly both. Out of those two options what do you recommend? also where do recommend I start to look for these opportunities? I'm already planning on doing some research or an internship.. or possibly both. Out of those two options what do you recommend? also where do recommend I start to look for these opportunities?  none\n\nsmoke weed instead. its so good none\n\nsmoke weed instead. its so good ",
    "url" : "http://www.reddit.com/r/UIUC/comments/147w26/advice_on_choosing_a_minor/"
  }, {
    "id" : 2,
    "title" : "Anyone in the MS in the Teaching of Mathematics?",
    "snippet" : "I just finished my application. Thoughts? TA / RA availability?  From the public data at [this page](http://www.dmi.illinois.edu/stuenr/class/enrfa12.htm), you can see that there are currently **3 students** in the MS in the Teaching of Mathematics program. So.... it would be pretty crazy for you to find one here.\n\nOn the other hand, googling MS Teaching of Mathematics UIUC gave me [this page](http://www.math.illinois.edu/GraduateProgram/financial-support-ms.html) as the fourth result, which says\n\n&gt; **Teaching assistantships**\n\n&gt; There is generally no financial aid available.\n\nGood luck to you. interesting link... any idea why are there multiple codes for the same program/concentration (bs in marketing, for example)? From the public data at [this page](http://www.dmi.illinois.edu/stuenr/class/enrfa12.htm), you can see that there are currently **3 students** in the MS in the Teaching of Mathematics program. So.... it would be pretty crazy for you to find one here.\n\nOn the other hand, googling MS Teaching of Mathematics UIUC gave me [this page](http://www.math.illinois.edu/GraduateProgram/financial-support-ms.html) as the fourth result, which says\n\n&gt; **Teaching assistantships**\n\n&gt; There is generally no financial aid available.\n\nGood luck to you. Thanks for the student enrollment data. For the financial aid, I was interested in [this page](http://www.math.illinois.edu/GraduateProgram/prospective-students.html) where, at the bottom, it mentions that funding is available for 2 out of 3 semesters. So... that dreaded 3rd semester...?",
    "url" : "http://www.reddit.com/r/UIUC/comments/148ii8/anyone_in_the_ms_in_the_teaching_of_mathematics/"
  }, {
    "id" : 3,
    "title" : "Anyone know of a place that I can donate toys for local kids for Christmas?",
    "snippet" : "Every year my fiance and I buy toys for underprivileged kids and we are hoping to find a local group!    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/147lz3/anyone_know_of_a_place_that_i_can_donate_toys_for/"
  }, {
    "id" : 4,
    "title" : "The unfortunate restructuring of the Civic Leadership Program",
    "snippet" : "  If anybody is in the political science realm and had planned to join the Civic Leadership Program to get your master's degree, I have bad news for you.  The Political Science Department has decided to gut the program. According to that article, only 10 students a year were selected. I'm guessing that's competitive. And it doesn't sound like this should be a surprise, is it?  It's things like this that make me think this university has just lost its way. I agree...I mean, why should the university be providing ways for its students to have a leg up on competition during the job search?   Umm... are you taking a swipe at me for agreeing with you that this is unfortunate? Nope, sorry.  I'm taking a swipe at the PoliSci department for discounting the value of more \"applied\" education Ha!  I couldn't tell if you were being sarcastic or not.  Oh well.",
    "url" : "http://www.dailyillini.com/news/campus/article_96c2b976-3d0a-11e2-9209-0019bb30f31a.html"
  }, {
    "id" : 5,
    "title" : "[Subleasing] I would enjoy a subleaser for Spring 2013.",
    "snippet" : "Hey Guys and Gals,\n\nI am looking for a lucky guy or lady to hopefully sublease from me for the Spring 2013.  There are three great things about this apartment, first being the location.  The apartment itself is located in a great spot, 2nd and green right above chopstix, also known as park place http://www.bankierapts.com/index.php?81,202-e.-green-champaign.  The second great thing is this apartment is probably one of the nicest for the price, come over and you can check it out.  Huge living-room, nice carpets, two and a half baths, and a great view. Finally you will have the chance to spend it with three other great guys!  They are all down to play video-games, board-games, studying, partying, and are extremely respectful.  The best part is you get all of this for the low price of $585 per month.  Please pm me if you are interested, want a tour, or want to interview us.\nThanks!",
    "url" : "http://www.reddit.com/r/UIUC/comments/147ml4/subleasing_i_would_enjoy_a_subleaser_for_spring/"
  }, {
    "id" : 6,
    "title" : "Lets procrastinate!",
    "snippet" : "  you ruined our irc channel I was confused at why there were so many new people, and then I saw this!\n\nEDIT: Ignore umenthum, we like new people &lt;3 I don't mind new people, the channel would suck if we never got new people, as long as they stick around long enough for you to get to know them. But the channel is being flooded and the quality of the conversation is much lower than usual. There's so many people, its worthless to try and get to know people, I doubt they'll even come back after tonight... I might. I didn't know uiuc had an irc. But people who never use irc won't come back, of course. To be fair the topic when I was on was about pizza guys and drugs, not something terribly exciting. I even saw the \"nice try campus police\"...the most original thought ever It's a chat room. It goes from nerdy to dumb to geeking out about food to whatever constantly. Don't judge. I might. I didn't know uiuc had an irc. But people who never use irc won't come back, of course. I don't mind new people, the channel would suck if we never got new people, as long as they stick around long enough for you to get to know them. But the channel is being flooded and the quality of the conversation is much lower than usual. There's so many people, its worthless to try and get to know people, I doubt they'll even come back after tonight... I was confused at why there were so many new people, and then I saw this!\n\nEDIT: Ignore umenthum, we like new people &lt;3",
    "url" : "http://webchat.freenode.net/?channels=%23%23uiuc&amp;uio=d4"
  }, {
    "id" : 7,
    "title" : "Non-faith based ways to volunteer around the community?",
    "snippet" : "I'm a veteran going to college on my GI Bill.  I don't have any friends or family in the area (originally from Louisiana) and have no real need for a job thanks to the GI Bill paying my rent and such, so I'd like to volunteer somewhere two nights a week to help out, give back, and give me something to do.\n\nand just to head off the inevitable reddit comments, I'd just prefer to volunteer for things not based in a church, but if I can't find anything I'll volunteer at a church before I don't volunteer at all.  Check out [http://www.cuvolunteer.org/](http://www.cuvolunteer.org/)       If you're interested, the Illini Secular Student Alliance is a community for non-religious students on campus. While we do a lot more than volunteer work, we do make an effort to do several volunteer events each semester. We have a blood drive coming up on Friday, helped clean up the Children's Science Museum in town, and raised over $2000 for cancer research this semester. Here's our page: http://www.facebook.com/IlliniSSA?bookmark_t=page\n\nIf that's not for you, I believe the Orpheum Children's Science Museum in downtown Champaign is always looking for volunteers! And on that note I'd like to shamelessly plug the blood drive ISSA is hosting in cooperation with the American Red Cross Club. [This Friday, 10-3.](http://www.facebook.com/events/299558663486021/) Because of Hurricane Sandy, the Red Cross is in dire need of donations, especially around the holiday season. How long does it take to recover from giving blood? If it's more than 24 hours seems ISSA is also bad at party planning...  Try out the Habitat for Humanity ReStore! H4H is a Christian organization. Has a large enough mix of religious and non-religious members that it may or may not be a problem for the OP.          CUCPJ - Champaign-Urbana Citizens for Peace and Justice\n\nJwJ - Jobs with Justice\n\nIMC - Independent Media Center\n\nI can't remember the name of it, but I know of a war protest group that welcomes all sorts of people. It might be ironic given your veteran status but many veterans have come back after deployment and joined anti-war groups. Send me a PM and I can get you a contact email for it. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/145s7z/nonfaith_based_ways_to_volunteer_around_the/"
  }, {
    "id" : 8,
    "title" : "Anyone play Ingress on campus?",
    "snippet" : "I did the tutorial on my phone, but I'm not sure which side to join. Which side is outnumbered?\n\nBesides that, how does everyone like the game? :D   I've been playing since it came out.\n\nGenerally, the enlightened have taken over downtown champaign and urbana, and the resistance have been stronger in campus.\n\nHowever, since break got out, campus itself has been a bit disputed.\n\nAs much as it pains me to say, I'd suggest staying Resistance. But either side would be fine. If you have friends playing or an ideological choice, go with that. Negated, I'm starting to wonder if I have run into you while playing now.  I take it you're resistance?\n\nYes I did just resurrect an old comment. I'm enlightened.\n\nI play under NegatedVoid. I haven't really gotten to it since the end of last semester.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/146pu9/anyone_play_ingress_on_campus/"
  }, {
    "id" : 9,
    "title" : "Anyone going to #savechampaign this Thursday at Canopy? I'm giving away 2 free tickets",
    "url" : "http://acityinthemidwest.com/2012/12/02/the-kid-daytona-mickey-factz-save-money-the-boy-illinois-frank-leone-canopy-club-126-savechampaign/"
  }, {
    "id" : 10,
    "title" : "Anyone need a place for Spring 2013? 362/month and close to campus!",
    "snippet" : "I'm looking for a new roommate as a Spring 2013 sublease! The apartment is on the corner of Busey and Green, right where the Green bus stops! (PM me for exact address, if you want it.) The apartment is 4 bedroom 2 bathroom, has an attic, huge storage room, parking space, and laundry in the building. Rent is $362 / month, and utilities usually run about $60 (elec, gas, water, internet.) \n\nThe current tenants are 4 men, 1 single and 3 in relationships, all about 22 years old. We are all very social and accepting of others, big video game fans, and generally pretty nerdy. Drink on occasion, not really anything else but you are welcome to whatever makes you happy.\n\nIf you are looking for a place, please feel free to either comment or PM me. If you'd like to come see the place, PM me for my number and we can set up a meeting for whenever works for you. If you'd like to move in, you could  move in as soon as December 18th.",
    "url" : "http://www.reddit.com/r/UIUC/comments/1467oy/anyone_need_a_place_for_spring_2013_362month_and/"
  }, {
    "id" : 11,
    "title" : "Illini Floor Hockey, tonite (12/2) at 9pm, CRCE. (extra sticks provided).",
    "snippet" : "We hope to see you this Sunday! If you cannot make it out, feel free to email Michael and he'll add you to the email list! illinifloorhockey@gmail.com Go Hawks!",
    "url" : "http://www.reddit.com/r/UIUC/comments/145iqw/illini_floor_hockey_tonite_122_at_9pm_crce_extra/"
  }, {
    "id" : 12,
    "title" : "UIUC to work with Department of Energy to develop 5X battery power boost in 5 years (as seen on front page)",
    "snippet" : "   Anytime you hear a scientist say to a journalist that their project is going to have an impact on the market in \"five years\", then you can basically discount it.  Especially stories about battery life.  Don't believe me?  Go back five years in a science news archive and look at all their five year predictions. I know it's popular on reddit to be totally cynical about any scientific findings, but the whole point of the article is to explain that they're putting a lot of funding towards a lofty goal.  Whether or not that specific number is achieved in 5 years isn't as important as the level of funding they're giving to the problem.  You put a lot of great scientists and engineers on a problem and they make progress on it. Nobody is going to put hundreds of millions of dollars down on a timid goal.\n\nI could agree with your statement if you said it was about fusion research or something else similar that's far off, but battery research has been making steady progress for years now.  It's so important because renewable energy sources such as wind and solar need grid-level storage in order to be useful on a large scale. I know it's popular on reddit to be totally cynical about any scientific findings, but the whole point of the article is to explain that they're putting a lot of funding towards a lofty goal.  Whether or not that specific number is achieved in 5 years isn't as important as the level of funding they're giving to the problem.  You put a lot of great scientists and engineers on a problem and they make progress on it. Nobody is going to put hundreds of millions of dollars down on a timid goal.\n\nI could agree with your statement if you said it was about fusion research or something else similar that's far off, but battery research has been making steady progress for years now.  It's so important because renewable energy sources such as wind and solar need grid-level storage in order to be useful on a large scale. Yes, we've made a lot of progress in battery research.  But 5x is a tremendous leap forward.  Promising such a specific positive outcome for a large collaborative research beyond a five year horizon is unrealistic.  This is PR hype to justify funding.  This happens all the time.  Look at the human genome project.  We were promised the cure for cancer and all kinds of revolutionary outcomes from the consortium.  The basic science has been a tremendous boon, but the specific outcomes were't what the hype machine promised.",
    "url" : "http://www.computerworld.com/s/article/9234200/DOE_wants_5X_battery_power_boost_in_5_years"
  }, {
    "id" : 13,
    "title" : "Does anyone know what causes the power plant to generate such noise every now and then?",
    "snippet" : "It's a sound that reverberates across the entire southwest side of campus, it seems. It's not that it bothers me, I'm just being curious because it was doing it now/earlier today and because I've heard it before.  It's usually the turbo encabulator. Here is some more info, if you're interested: https://www.youtube.com/watch?v=MXW0bx_Ooq4 It's usually the turbo encabulator. Here is some more info, if you're interested: https://www.youtube.com/watch?v=MXW0bx_Ooq4       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/144bv2/does_anyone_know_what_causes_the_power_plant_to/"
  }, {
    "id" : 14,
    "title" : "According to ABC...",
    "snippet" : "                Meow Mix!  ",
    "url" : "http://imgur.com/ZKVDO"
  }, {
    "id" : 15,
    "title" : "Pre-med Resources",
    "snippet" : "How good of a school is UIUC for pre-med? Are there many research opportunities? I know there's a hospital near campus, so doing volunteer work there during the semester shouldn't be a problem. Is there a pre-med advising program? On college confidential, I saw a statistic that said approx. 45% of pre-meds who apply get accepted into med school. I couldn't find a source for that stat, and I honestly thought it was a bit higher, so can someone verify the accuracy of that stat? Thanks.  I found [this](http://blog.admissions.illinois.edu/?p=776).\n\nI don't know where you saw the 45% since UIUC does not even have a pre-med major.. and I am not sure how they would get statistics on it. A LOT of students in MCB/bio/chem all claim they are pre-med their freshmen year.. I highly doubt half of them end up going to med school.  I'm materials science pre-med. I'm interested in the academia side of medicine. I've been to the pre-med advising once and it's pretty good. They will tell you what you need to know. I don't know about that statistic or even if the university has a statistic on the fact. \n\nPM me if you have any specific questions, I've done a lot of research on this stuff. Thanks. I guess I'm just worried about not having enough research opportunities to research what I'm interested in. Since you're interested in the academic side of medicine, I don't know what year you are, but you've probably done some summer research or something of that sort at least. If there are enough research opportunities, which they're probably are at a school like UIUC, how would I go about getting them? Finding research is really the least your your worries. For me, it was as simple as emailing a few and providing them with my CV that included my grades and resume (I did this directly after freshmen year). From there, three or four professors emailed me back and asked if I could meet them in their lab and discuss my research goals and if I would be a good fit.\n\nAfter that I chose a lab and have been working in this lab since the end of summer and plan to continuing doing research in it throughout the rest of my undergrad so I can do a senior thesis. I'm materials science pre-med. I'm interested in the academia side of medicine. I've been to the pre-med advising once and it's pretty good. They will tell you what you need to know. I don't know about that statistic or even if the university has a statistic on the fact. \n\nPM me if you have any specific questions, I've done a lot of research on this stuff. are you russell crowe on sdn? are you russell crowe on sdn? I was wondering the same thing lol",
    "url" : "http://www.reddit.com/r/UIUC/comments/144rxm/premed_resources/"
  }, {
    "id" : 16,
    "title" : "234 Everitt Closed?",
    "snippet" : "I noticed 234 Everitt lab was closed the last couple days, and they moved ECE385 office hours. Anyone know why?\n\nAnd looking through the window from the south side of Talbott, it looks like the big file cabinet on the north side of the lab is missing.   [deleted] seriously? The ECE department has been having A LOT of trouble recently  I know the lab was open as of this past Monday, as I had a 210 lab there. WRT the file cabinet, it had been replaced by a couple extra lab benches. Cool! Because I am going to take 385 next semester! \nHas anyone noticed the disgusting gums under lab benches?\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/143zjf/234_everitt_closed/"
  }, {
    "id" : 17,
    "title" : "Local Rappers?",
    "snippet" : "Hey, I'm wondering if you guys know of any good local rappers in the UIUC area. I'm looking to produce, and I'm going to try to get involved with Hip-Hop congress through school, but I was wondering if you guys have any links to some stuff by local rappers, just so I can here what's out there around here.  http://en.wikipedia.org/wiki/Ludacris TIL.   Talk to the UC Hip Hop group: http://www.facebook.com/groups/283807611728232/   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/144cfy/local_rappers/"
  }, {
    "id" : 18,
    "title" : "Where can I score some mistletoe?",
    "snippet" : "**PRIZE:** Kisses, duh.  [deleted] The dollar store probably has fake ones too. It would last longer.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/142qih/where_can_i_score_some_mistletoe/"
  }, {
    "id" : 19,
    "title" : "Garage for quick check of used car? Advice?",
    "snippet" : "So, I'll be checking out a used car from its owner. Is there a garage nearby that would do a 20 pt. inspection? I just want to check whether everything is ok before I go ahead with it....  I usually go to Myler Automotive. They're good people. I've had some bad experience with Myler.  They let fairly generous timelines slip without saying a word to me and kept promising to finish the job \"tomorrow\" whenever I called.  They said the job would take a few days.  It ended up taking just over a week.\n\nAnd... I hate to say this, but they're not exactly cheap, either.  I wanted to give them a second chance after the above experience, because they seem like nice people.  But their quote was more expensive than the dealership charged me.  The dealership had the job done the next day.  Myler said they couldn't even start working on my car for a week.\n\nThey're extremely friendly, but I think they've just got more work than they can handle.  Rather than turning people away, they're not being honest with themselves or their customers.    You could do a 20-pt inspection yourself.  If you're going to pay a mechanic to do it, have them do an exhaustively thorough inspection. Well, I don't really know much about cars, how could I do that? There are websites that will give you a checklist to go through - make sure that this component doesn't move when you try to wiggle it, etc.  But for a really thorough inspection you have to disassemble certain parts and for that you need a mechanic.  So if you're going to have a mechanic look at a used car anyway, pay a little extra and have him do a thorough inspection rather than just a basic one.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1433uh/garage_for_quick_check_of_used_car_advice/"
  }, {
    "id" : 20,
    "title" : "Where can I get free or very cheap food on campus during the month of December.",
    "snippet" : "Here's the deal:\n\nThe IRS started garnishing my wages this month without giving me prior notification. Looking into the matter further, I'm pretty sure I don't even owe the money that they're pulling from my paychecks. Regardless, I'm now broke. Not just student-broke. I'm $1.24-in-my-account-broke. And it looks like I'm going to be barely skating by for the entire month of December. If anyone knows where or how to get free, or very cheap food on campus or in the CU area, please speak up!  Up until the end of the semester, you can get free lunches at the cultural houses on Nevada. Not too much but at least its one meal.\n\nAlso, I don't know if there is one in Champaign (you'd have to look a little) but most Sikh Gurudwaras will serve you a free meal (and when I say free meal, I mean a free, real meal). &gt;  you can get free lunches at the cultural houses on Nevada.\n\nhttp://studentaffairs.illinois.edu/diversity/lunch.html Do you think it'd be an imposition to show up to those meals? I know beggars can't be choosers, but I'm wondering whether I might be overstepping my bounds by eating the meals, but having no involvement within the community.  ~~What do you do for ISR? And~~ tell me more about the garnishing.\n\nThere should be [clear limits](http://www.dol.gov/compliance/guide/garnish.htm#BasicPro) to the amount that your wages can be garnished.\n\nAlso, [/r/RandomActsOfPizza](http://randomactsofpizza.com/).\n\n &gt; What do you do for ISR? \n\nHe said IRS. Though my impression was that courts garnish wages, not IRS. Woops, I misread that.\n\nIs is a Tax Levy or actual Wage Garnishment? :/\n\nIn Illinois, the IRS can only request a Levy of up to 15% of your gross income for back taxes due... and you should have 10 days notice. [see here](http://tax.illinois.gov/Individuals/collection.htm)\n\nAre you a student? You should be visiting student legal services.  [Here](http://eifoodbank.org/find-help/where-to-find-food/) is a list of places. Thanks! This is awesome. Thanks! This is awesome.  While they're still open for the semester, you can volunteer at the Red Herring for an hour for a free meal.  While school is still in session, look up meetings of campus RSOs. They will often have pizza, and there's a million of them. Good call, thanks.  You may want to look into different soup kitchens and food pantries around Champaign. For example, [the Wesley Food Pantry at Green and Goodwin](http://wesleypantry.org/getting-help/) has a distribution date on December 20th. There's also [Salt and Light](http://www.saltandlightministry.org/) across town on Anthony Drive. [Here's a list](http://www.stock2forflu.com/faith-food-pantries.php) of others in Champaign County provided by the CU Health District.\n\nEdit: Oops, if I'd read closer I would've seen AlmostGrad provided a much more comprehensive list. Either way, good luck with everything.    [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/142bbp/where_can_i_get_free_or_very_cheap_food_on_campus/"
  }, {
    "id" : 21,
    "title" : "Tired of deciding where to eat? Check this out.",
    "snippet" : "  Nice little site. It'd be handy to have a link to Yelp too!  I find the juxtaposition of your polite responses to suggestions and the sweary belligerence of the site to be hilarious.  I get culver's even after unchecking the 'I CAN DRIVE' box. I don't think you guys put in the filter again after unchecking.   Fuck that list. \n\nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \n\nThat's my list. As soon as I clicked the Fuck No button a bunch of times and never got Black Dog, I knew the site was *wrong*. Fuck that list. \n\nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \n\nThat's my list. I just pushed an update to the website that adds Black Dog to the driving locations. Thanks for the suggestion!  Did it remove all other locations? \n\nIf so, then bravo. Unfortunately, I did not. Though I did make a \"Black Dog\" edition of the website: http://likeabus.com/blackdog/ Fuck that list. \n\nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \nBlack Dog   \n\nThat's my list. [deleted]  Is there a reason you are ripping off http://wherethefuckshouldigotoeat.com/ and slapping ads all over the page? Is there a reason you are ripping off http://wherethefuckshouldigotoeat.com/ and slapping ads all over the page? I developed the website. I actually started it as something for just a few of my friends, as we had a bunch of places we loved going, but never could decide which one to go to. We then decided to expand the list and give it a broad release. I had no idea that wherethefuckshouldigotoeat.com even existed until I read this comment.\n\nAs for why there are ads, it simply helps cover the costs for the website itself. very cool site! does it take into account the hours of all the restaurants? like, if i go on at 2 am will it only list things that are open?   You guys should add some more restaurants on Green Street (like Qdoba).  ",
    "url" : "http://likeabus.com/eat/index.html"
  }, {
    "id" : 22,
    "title" : "Some guy turned my wallet in and left an interesting note in it...",
    "snippet" : "   Hey Dan how about you pat yourself on the back a little more, it must be hard being the last hope for humanity Hey Dan how about you pat yourself on the back a little more, it must be hard being the last hope for humanity Hey Dan how about you pat yourself on the back a little more, it must be hard being the last hope for humanity   I recently returned a wallet (I'm not Dan) and now I'm kicking myself for not leaving a note.    I think I might know who that is. It's totally something he would do. It also sort of looks like his handwriting. I think I might know who that is. It's totally something he would do. It also sort of looks like his handwriting.  was it stolen? ",
    "url" : "http://www.flickr.com/photos/90622434@N02/8230506341/in/photostream"
  }, {
    "id" : 23,
    "title" : "Fire! Fire! In the garbage can! ",
    "snippet" : "  Quick, someone grab a couch! Dammit!!! I wanted that say that comment. Kudos.    [deleted]  ",
    "url" : "http://imgur.com/cdEr9"
  }, {
    "id" : 24,
    "title" : "ECE329 Exam... not cancelled? (fake email?)",
    "snippet" : "http://img694.imageshack.us/img694/5363/329examcancellation.png\n\nSo I got that email, and several before it about the solution set for the exam being for sale.\n\nBut apparently the exam did happen!?  Ah... so... are there any ECE classes that have *not* been hacked as of late? Another \"Ass Mail\" was sent out this Tuesday for ece 190. pics plz Ah... so... are there any ECE classes that have *not* been hacked as of late?    My boyfriend is in that class. Here's what he said:\n\n-gets email about answers for sale. He forwards it to the professor. \n\n\n-gets another email about the exam being cancelled. Hooray! At this point our Internet goes down in the dorm I'm at. \n\n\n-a mutual friend who lives in the dorm and is in the same class didn't get the cancelation email. As he also doesn't have a smart phone, he goes to the test. \n\n\n-so little people went, that the teachers cancel the test, saying that they will make some sort of other assignment to do.\n\n\n-friend comes back 15 min after test is supposed to start,  boyfriend has a minor heart attack. Newman?     I'm in the class and went to the exam, you're fine. It was not meant to be cancelled, the Professor's email was hacked, but because of the confusion and since people didn't show up, they actually cancelled the exam.\n\nThey will send in email soon about what they will do to make up for the exam. I find it hilarious that, of all people, an ECE professor's email was hacked. I find it hilarious that, of all people, an ECE professor's email was hacked. Being in ECE doesn't  mean you know anything about networking, security, mitm attacks, phishing, etc. I'd wager that I know more about security than a lot of ECE people. \n\nAnd shit, for all we know, the professor could have made the dumb physical mistake of leaving a computer logged in unattended and someone decided to trollol the class, which isn't hacking, just being a dick.  Dude, you should do CS460/461/463 as an elective! Dude, you should do CS460/461/463 as an elective! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14163k/ece329_exam_not_cancelled_fake_email/"
  }, {
    "id" : 25,
    "title" : "The Perfect Week in Champaign-Urbana",
    "snippet" : "My buddy and I need your help.\n\nWe are both done with finals on the 17th, but we're thinking of staying until the 22nd and really enjoy all that Champaign-Urbana has to offer without the stress of classes. \n\nRedditors, what would you do or recommend we do before we head back home? Any ideas appreciated; I'm sure there will be other people with nothing to do that wouldn't mind a few suggestions.\n\nSuggestions can include anything; restaurants, activities, or places to see. \n\nHere is the current list:\n-Allerton (Provided there is snow)\n-Flat Top brunch\n-Japan House\n-Altgeld Bell Tower\n-Ice Skating\n-Racquetball at the ARC\n-Swimming/Hot Tub at CRCE\n-Piano Man\n-Black Dog\n-Farren's  Are you familiar with downtown Champaign? Such a townie thing to say Such a student thing to say Such a townie thing to say Such a townie thing to say   Drive to Danville. Spend an hour. Go back to C-U. It'll seem WAY more exciting and awesome. Or Decatur. Or Rantoul. People who work at these places prefer to live in Champaign and commute to work. Or Decatur. Or Rantoul. People who work at these places prefer to live in Champaign and commute to work. As one who works in Decatur I can confirm, living in Champaign is worth the commute. Or Decatur. Or Rantoul. People who work at these places prefer to live in Champaign and commute to work. Drive to Danville. Spend an hour. Go back to C-U. It'll seem WAY more exciting and awesome. Danville High School has some cool old pictures of Dick Van Dyke hanging up in their halls from when he went there.  Papa Del's pizza; High Dive for dancing; Canopy Club for bands; The Ribeye for steaks; Bacca for cigars;  UofI sports game; there's always the Silver Bullet;  drive to bloomington (I have many more ideas for over here);\n\nIf you can give us an idea of stuff you like, we'll be able to give you better idea.   Can you elaborate on what going to the High Dive is like? I've never been there. Can you elaborate on what going to the High Dive is like? I've never been there. Papa Del's pizza; High Dive for dancing; Canopy Club for bands; The Ribeye for steaks; Bacca for cigars;  UofI sports game; there's always the Silver Bullet;  drive to bloomington (I have many more ideas for over here);\n\nIf you can give us an idea of stuff you like, we'll be able to give you better idea.   Mike n Molly's beats out Canopy for bands most days of the week. Papa Del's pizza; High Dive for dancing; Canopy Club for bands; The Ribeye for steaks; Bacca for cigars;  UofI sports game; there's always the Silver Bullet;  drive to bloomington (I have many more ideas for over here);\n\nIf you can give us an idea of stuff you like, we'll be able to give you better idea.   Papa Del's is...terrible. Just terrible. Unpopular opinion, I know. Go back to New Jersey Papa Del's is...terrible. Just terrible. Unpopular opinion, I know. Papa Del's is...terrible. Just terrible. Unpopular opinion, I know. Papa Del's is...terrible. Just terrible. Unpopular opinion, I know.   Go to Destihl and try out their home brewed beers if you're 21. The beers are supposed to be brewed on the premises, but they really aren't home brewed.     Fan of the list so far.\n\n-Blind Pig (always a good idea, you can go on mug night and get a mug plus cheap beer whenever you go back on a tuesday or thursday).\n-Arboretum trail  (if you're going to Japan house you will pass it, so you could just stop by).\n-Hockey game (if they're still going on)\n  Get info from the UIAS on how to get to the off-campus dark site (15 minutes away), and spend a couple hours under the stars :D I checked the website http://uias.astro.illinois.edu/ and couldn't find anything about it. Any suggestions?           Try Emerald City for brunch instead of Flat Top.  Monday: Joes\nTuesday: Joes\nWednesday: White Ho for some karaoke \nThursday: Brothers for $1 drinks\nFriday: anywhere but lion\nSaturday: Anywhere but lion\nSunday: Firehause  Or if you're not in a Greek organization. \n\nDowntown champaign:\nBlind pig brewery\nMemphis on main- leaky tap runs every night which is a mason jar of beer for three dollars. Different random beer every night. One time it was honey brown, one time shock top, another Ham's. just depends on what they have extra of. \n\nWhite horse's kareokee night is pretty solid. \nTry Murphy's for logo or international night. \nObligatory apple pie shot at Illi inn\n\nAlso hooligans used to do a pretty decent app and martini special on Thursdays. \n\nAs childish as it may seem check out the savoy rollar rink and laser tag. Cheap and simple.   get a bunch of trees and liquor and lock yourself in from the cold...fuck it see if you can get on the morrow plot? Its easy to get on the plot, just walk in. Nothing happens.  possible expulsion, though I hear that's a hoax. I walked through the plot once and nothing happened. Although, not being a student here, there's really not much they can do, amirite? AMA request: Someone who walked through morrow plots possible expulsion, though Not true. I used to be in the college of ACES and they dont care. If you fuck with something, then you might be charged with destruction of property. Just going in doesn't matter.  get a bunch of trees and liquor and lock yourself in from the cold...fuck it see if you can get on the morrow plot? get a bunch of trees and liquor and lock yourself in from the cold...fuck it see if you can get on the morrow plot?",
    "url" : "http://www.reddit.com/r/UIUC/comments/1400ad/the_perfect_week_in_champaignurbana/"
  }, {
    "id" : 26,
    "title" : "Questions about the Krannert Center",
    "snippet" : "I ordered tickets online for The Nutcracker on December 8th, and I have a few questions. First, I chose to have them mailed to me, so do they send the tickets out whenever you buy them or a certain time before the selected performance? And second, is there a minimum dress code, or will I be able to wear khakis and a sweater?\n\nThank you for your time  there is no dress code but you will look like a wang if you show up in ripped jeans and a ride the lightning tshirt. Khakis and a sweater will make you fit right in there is no dress code but you will look like a wang if you show up in ripped jeans and a ride the lightning tshirt. Khakis and a sweater will make you fit right in   No no no. Come as you are. I mean you ARE attending The Nutcracker. Absolutely no one cares. Just don't show up stinking of booze, you might not know it, but the person next to you can smell it and it's not that pleasant (even though those blue hairs are pulling down serious amounts of wine before the show). Cheers!\n  Khakis and a sweater should be okay I think; the average person dresses at least business casual (or is it called \"evening casual\" in this situation?). Just no jeans/shorts (at least not to operas/ballets/concerts - these might be okay for plays in the Studio Theatre). Women usually wear dresses. Okay, thank you! This will be my first ballet, so I was a little confused.",
    "url" : "http://www.reddit.com/r/UIUC/comments/140j5n/questions_about_the_krannert_center/"
  }, {
    "id" : 27,
    "title" : "Saw a familiar store while watching That 70's Show the other day",
    "snippet" : "  I'm pretty sure there is a Red's Muffler Shop in Urbana  What is that supposed to say? [Slot and Wing Hobbies](http://www.slotandwing.net/)   Oh man I haven't been to Slot and Wing in years.  Love that place. Fun to look around there, I also found their prices too high though.  I've only been there once since it moved, I liked the old place better.  Used to love the slot car tracks they had laid out.  ",
    "url" : "http://i.imgur.com/x73ae.jpg"
  }, {
    "id" : 28,
    "title" : "Does anyone have experience with Direct Energy LLC?",
    "snippet" : "This evening a woman from Direct Energy LLC came to my door and told me that I could receive a discount on my power bill. Sounds too good to be true so I was worried it was a scam. A quick Google search showed that other people shared my concerns but no one seemed to have concrete proof either way. Does anyone have experience with this company or know someone who has?    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/141ax1/does_anyone_have_experience_with_direct_energy_llc/"
  }, {
    "id" : 29,
    "title" : "Illini Top Georgia Tech in B1G-ACC Challenge",
    "snippet" : "  Shaky start but great run to take command of the game. Joe Bertrand is a beast. [Here](http://www.chicagotribune.com/sports/college/ct-spt-1129-illinois-georgia-tech-basketball--20121129,0,4801014.story) is a great photo from the Tribune of Bertrand basically knocking that guy over with his balls. Also I dig his haircut ",
    "url" : "http://scores.espn.go.com/ncb/recap?gameId=323330356"
  }, {
    "id" : 30,
    "title" : "Anyone know where I can get Win 7 on the cheap?",
    "snippet" : "It is unavailable from the UofI Webstore and it is somewhat time sensitive. Trying to find Win 7 Pro if possible. Any recommendations?\n\nEDIT: Worked something out. Thanks for the suggestions.   Pirate the retail Win7 Pro disc and install it without activating? And then wait for it to come back to the web store so you can enter a key. \n\nUnless it takes more than a month for it to be back on the web store or something. That is what I did, but about 25 days ago. That is why it is time sensitive. Shouldn't have been lazy and just bought it before.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13zwdl/anyone_know_where_i_can_get_win_7_on_the_cheap/"
  }, {
    "id" : 31,
    "title" : "Article relating to the Illini Alert this morning.  \"Campus area apartment fire under investigation by police and fire officials\"",
    "snippet" : "  This is *so* shady...\n\n&gt; sparked by chemicals cooking on the stove\n\nand\n\n&gt; fire investigator John Koller reported that the men put a couch on the stove in an attempt to put out the fire.  This is *so* shady...\n\n&gt; sparked by chemicals cooking on the stove\n\nand\n\n&gt; fire investigator John Koller reported that the men put a couch on the stove in an attempt to put out the fire.  This is *so* shady...\n\n&gt; sparked by chemicals cooking on the stove\n\nand\n\n&gt; fire investigator John Koller reported that the men put a couch on the stove in an attempt to put out the fire.  This is *so* shady...\n\n&gt; sparked by chemicals cooking on the stove\n\nand\n\n&gt; fire investigator John Koller reported that the men put a couch on the stove in an attempt to put out the fire.  Chemicals = drugs? I am assuming \"cooking meth\" involves actual cooking on a stove? If it wasn't something illegal I would think they would call 911 before trying to use a couch to put out the fire. And if they had nothing to hide, they would probably also let the police search their apatment without a warrant, especially as it meant all the residents of the building were being inconvenienced and not allowed to return to their apartments. And why has the FBI been notified if it were a mere fire? What's even more interesting for me is that when I got out of the apartment and heard the kid screaming bloody murder for help inside the smoking apartment, the tenant of that apartment was outside freaking out. He left his *visiting* friend in the potentially unfamiliar apartment, and left him trapped to a point where he had to jump out a window... Da fuck man.  I was sitting next to his friend who jumped out the window on the bus for some time, and throughout the conversations he was mumbling \"fucking piece of shit, fucking asshole, etc.\" repeatedly.... Chemicals = drugs? I am assuming \"cooking meth\" involves actual cooking on a stove? If it wasn't something illegal I would think they would call 911 before trying to use a couch to put out the fire. And if they had nothing to hide, they would probably also let the police search their apatment without a warrant, especially as it meant all the residents of the building were being inconvenienced and not allowed to return to their apartments. And why has the FBI been notified if it were a mere fire? To be fair, not letting police search could be just having weed/paraphernalia in the apartment.  I'm one of the currently displaced people who live in this building. The apartment itself is not too badly destroyed, as the fire was contained to one single apartment on the 2nd floor of a 3 story building. There will undoubtedly be some smoke damage to other units, but it was contained fairly quickly.\n\nIn regards to why there is a huge investigation, we were told this morning that the tenant admitted to making a \"smoke bomb\" on the stove but then refused to give consent to enter the apartment to the police. Based on this information the police took him into custody, taped the building off, and told us we wouldn't be getting in until some time early this afternoon (at the earliest). \n\nEvan, the man who jumped down to us, was on the bus with us for most of the wait and appeared to be fully cooperating with police. That is to say, he wasn't taken into custody. He is also honestly lucky to be alive as he (according to his story) struggled to find the apartments window and inhaled a ton of smoke. When I emerged from the building he was straddling the window's ledge and trying to hold his head away from the smoke pouring out. I'm one of the currently displaced people who live in this building. The apartment itself is not too badly destroyed, as the fire was contained to one single apartment on the 2nd floor of a 3 story building. There will undoubtedly be some smoke damage to other units, but it was contained fairly quickly.\n\nIn regards to why there is a huge investigation, we were told this morning that the tenant admitted to making a \"smoke bomb\" on the stove but then refused to give consent to enter the apartment to the police. Based on this information the police took him into custody, taped the building off, and told us we wouldn't be getting in until some time early this afternoon (at the earliest). \n\nEvan, the man who jumped down to us, was on the bus with us for most of the wait and appeared to be fully cooperating with police. That is to say, he wasn't taken into custody. He is also honestly lucky to be alive as he (according to his story) struggled to find the apartments window and inhaled a ton of smoke. When I emerged from the building he was straddling the window's ledge and trying to hold his head away from the smoke pouring out. That's inconvenient. You are going to stay on the bus till then, and not be able to go to class? The bus is gone now. The emergency Dean was on it with us making sure everyone had somewhere to go even if it was a hotel that she sounded like the university would pay for. Most people seemed to have some place to go to. She also had absences in the work for everyone regardless of what they had going on today. She said we could use them or not. Up to us. I'm one of the currently displaced people who live in this building. The apartment itself is not too badly destroyed, as the fire was contained to one single apartment on the 2nd floor of a 3 story building. There will undoubtedly be some smoke damage to other units, but it was contained fairly quickly.\n\nIn regards to why there is a huge investigation, we were told this morning that the tenant admitted to making a \"smoke bomb\" on the stove but then refused to give consent to enter the apartment to the police. Based on this information the police took him into custody, taped the building off, and told us we wouldn't be getting in until some time early this afternoon (at the earliest). \n\nEvan, the man who jumped down to us, was on the bus with us for most of the wait and appeared to be fully cooperating with police. That is to say, he wasn't taken into custody. He is also honestly lucky to be alive as he (according to his story) struggled to find the apartments window and inhaled a ton of smoke. When I emerged from the building he was straddling the window's ledge and trying to hold his head away from the smoke pouring out. I lived in that apartment up until 4 months ago. Do you guys know if it had been fixed up at all before now? It had been scheduled for new carpets/paint when I had signed with the University Group, but Mr. Marshall bought the place like a month before I moved in and never got around to it while I lived there.\n\nIf it was in the same condition it was in when I left, one of the stove burners was faulty (the knob was loose and so the display had little bearing on what temp it was set to - I never used it). The utilities are all old, but more \"mild inconvenience\" than \"explode randomly\" old. I'm one of the currently displaced people who live in this building. The apartment itself is not too badly destroyed, as the fire was contained to one single apartment on the 2nd floor of a 3 story building. There will undoubtedly be some smoke damage to other units, but it was contained fairly quickly.\n\nIn regards to why there is a huge investigation, we were told this morning that the tenant admitted to making a \"smoke bomb\" on the stove but then refused to give consent to enter the apartment to the police. Based on this information the police took him into custody, taped the building off, and told us we wouldn't be getting in until some time early this afternoon (at the earliest). \n\nEvan, the man who jumped down to us, was on the bus with us for most of the wait and appeared to be fully cooperating with police. That is to say, he wasn't taken into custody. He is also honestly lucky to be alive as he (according to his story) struggled to find the apartments window and inhaled a ton of smoke. When I emerged from the building he was straddling the window's ledge and trying to hold his head away from the smoke pouring out.   Who cooks at 3 AM? Who cooks at 3 AM?    These Illini Alerts are seriously unnecessary. 99% of people who get these alerts are sleeping at that time. People who are near the area will see the fire/smoke and stay away, and the police can cordon off the area and keep people away. There is no need to wake so many people up in the middle of the night. Then don't sign up for the text alerts? It's optional, so why are you complaining? On the one hand I agree, but on the other hand it would be nice to subscribe to \"only alerts that I could possibly care about / react to.\" A reasonable argument to make is that Illini-Alert should only contain such alerts anyway! On the one hand I agree, but on the other hand it would be nice to subscribe to \"only alerts that I could possibly care about / react to.\" A reasonable argument to make is that Illini-Alert should only contain such alerts anyway! I think time of the day, whether the danger is localized, etc. should be taken into account. If there is an active shooter at large or hazardous chemicals have been released from a chemistry lab, it makes sense to inform everyone because the danger isn't contained in a limited area. If it is a fire that isn't spreading, only the building's residents and possibly the ones nearby need to know, especially at that time of the night, and the sirens from fire engines and police cars will wake them up. There was a fire at Za's in the morning last year and it made sense to send out that Illini Alert, since it saved people the inconvenience of going to Green Street and having to come back because it was closed - again, it was not dangerous (to people away from the area who received the alerts), but saved them some inconvenience.\n\nThat said, what is going on at First and John? Half the Illini Alerts are about incidents in that area - this one, and [this](http://www.news-gazette.com/news/courts-police-and-fire/2012-11-04/roommates-arrested-fight-brings-building-evacuation.html) and [this](http://www.news-gazette.com/news/courts-police-and-fire/2012-05-28/all-clear-given-campustown.html). These Illini Alerts are seriously unnecessary. 99% of people who get these alerts are sleeping at that time. People who are near the area will see the fire/smoke and stay away, and the police can cordon off the area and keep people away. There is no need to wake so many people up in the middle of the night. Really getting a text message work you up and ruined a good nights sleep? Also they can't tell who lives where/walking around/visiting. What if I got my headphones on and not near a window?\n It is hardly likely that the building residents evacuated the building due to an Illini Alert. The police would have woken them up and evacuated them. If you had headphones on you wouldn't be able to hear the incoming text message either. It's not so much about ruining a good night's sleep but the fact that I get scared when I get a text message at such an unusual time, and panic wondering who is texting me, what happened, etc. Take the 10 seconds to read the text and you will know who is texting you AND what the text message says. Then you don't need to get scared and panic. It is hardly likely that the building residents evacuated the building due to an Illini Alert. The police would have woken them up and evacuated them. If you had headphones on you wouldn't be able to hear the incoming text message either. It's not so much about ruining a good night's sleep but the fact that I get scared when I get a text message at such an unusual time, and panic wondering who is texting me, what happened, etc.",
    "url" : "http://www.news-gazette.com/news/courts-police-and-fire/2012-11-28/campus-area-apartment-fire-under-investigation-police-and-fir"
  }, {
    "id" : 32,
    "title" : "Changing Math sections",
    "snippet" : "I'm looking to change sections for Math415 next semester except all the sections are full. If I drop the class, can the math department help me make the switch so I can take another class at that time slot?\n\nEdit: I'm asking here to see if anyone has experiences with this cause I hear the math department can be anal about Such matters.     Ok, on a side note, does anyone know what the Cross Listing means when registering for courses? Is XL Rem different from Rem?",
    "url" : "http://www.reddit.com/r/UIUC/comments/13yu5l/changing_math_sections/"
  }, {
    "id" : 33,
    "title" : "I just got an email from DormBooks about a job offer...does anyone have any experience working for, or using this company?",
    "snippet" : "It seems like a pretty fair system, but I wouldn't really be surprised to find out that it's a scam...does anyone have any stories or experiences from working with the company at all?   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13yvkw/i_just_got_an_email_from_dormbooks_about_a_job/"
  }, {
    "id" : 34,
    "title" : "Odd Question: Does anyone have yesterday's USA Today?",
    "snippet" : "Yesterday being Tuesday, of course. I've been unable to find a copy, acc I want to save it. Does anyone have one?   we need to go Back to the Future   No, but I have a copy of tomorrow's Chicago Sun-Times.  \"She got a big booty, so I call her Big Booty\"\n\nlol",
    "url" : "http://www.reddit.com/r/UIUC/comments/13xv8i/odd_question_does_anyone_have_yesterdays_usa_today/"
  }, {
    "id" : 35,
    "title" : "GEO: Tentative Agreement Reached ",
    "snippet" : "  I'm assuming this means that a strike will most likely not happen? From what I understand, there will not be a strike unless something apocalyptic happens between now and the ratification vote.\n From what I understand, there will not be a strike unless something apocalyptic happens between now and the ratification vote.\n   Daaaarn it. I was kind of hoping for a strike.   ",
    "url" : "http://www.uigeo.org/2012/11/27/tentative-agreement-reached/"
  }, {
    "id" : 36,
    "title" : "anyone take cs 466 - bioinformatics?",
    "snippet" : "how difficult is it? Is there more bio or more programming (presumably programming because its cs, but you never know)?\nI'm not a cs student but I do work in bioinformatics independently and am very interested in taking this course  I assume Dr. Sinha is teaching it again (a good thing)...\n\nIt's actually not all that difficult, but gives an introduction to many of the common algorithms of bioinformatics. This will be lots of general topics often encountered elsewhere in CS, just applied specifically to bioinformatics. Things like pattern matching (via trees, hashing, ...), HMMs, string alignment (basic dynamic programming concepts, Smith-Waterman algorithm, ...), clustering and classification, ...you get the idea. It's definitely a breadth rather than depth sort of course, so if you're already familiar with such topics, the course may be of limited use; but if not, the course is a fair introduction.\n\nHowever, realize it's purely a CS course. You may see one lecture that runs through the absolute basics of molecular biology, that's it. But don't think it's just for CS people, a few people from outside of CS were in the course when I took it.\n\nAs for structure, it's a few on-paper assignments, one programming assignment, and a midterm and final exam.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13xqo2/anyone_take_cs_466_bioinformatics/"
  }, {
    "id" : 37,
    "title" : "Looking for a Christmas tree?!? Come check out the Illiniforester annual Christmas tree sale. Trees are super cheap: *$30 for 5ft scotch pine and $35 for Balsam fir.* ($5 additional dollars for each foot). Anyone with an apartment, frat-house, house etc, come by and check it out this weekend.",
    "snippet" : "  what is the illini foresters? if this is some sort of lumberjacking club i would like to join  i'm coming at 4 am to see if you're actually there.  Hey, any way anyone could get notice further in advance? I'm always wondering when this happens... (I'll be by to strap a tree to the top of my cavalier anyways).   Do you guys have anything shorter than 5ft?   My family have been getting trees from them for 20 years or so.  Always the best in town !!!  Awesome! See you and your family this weekend!  Do you have that thing with the nets that makes your tree look like this | instead of like this /\\ for the drive home?\n\nIf you give me a good explanation of the differences between the trees, I'll come buy one.  Will you have rope and whatnot to tie trees to cars? And does anyone know of a cheap place to find tree holders? Thanks! ",
    "url" : "http://i.imgur.com/deOXW.png?1"
  }, {
    "id" : 38,
    "title" : "Looking into transferring next year, would like some insight on your transfer experience! (or share your general UIUC experience)",
    "snippet" : "I'm a freshman at a private liberal arts university and I am looking into transferring in the Fall 2013. I applied last year as a senior and got wait-listed, and was wondering if that has any effect on my transfer decision?\n\n I am currently undecided but will complete 34-36 credits by Fall 2013 and possibly looking into the biology program. How hard is it to get in the biology or chemistry program there?\n\nAlso wondering about housing and scholarships. I might consider joining a sorority, so what is the process like for sophomores? And what about the housing situation? \n\nAlso, I know the transfer application deadline is pretty late in the year, and I am worried I will not get be able to apply/receive scholarships or receive sufficient financial aid, so does anyone have experience with this?\n\nI know I am asking for a lot, but I appreciate any input on your experience at UIUC so far!    I was accepted as a freshman transfer last Spring. Here's my experience: \n\nThat fact that you were wait-listed before will have no bearing on your decision this time around. However, as szaero pointed out, if you have less than 30 completed credits on your transcript when you apply, they will look at your high school transcript and ACT/SAT scores. \n\nI had a lot of health problems in high school, so I eventually dropped out. Then I got my GED and began taking classes online through Arizona State. After taking 12 credit hours (with 6 still in progress), I applied to UIUC in the Division of General Studies. Instead of directly applying to a program that interests you, I would highly recommend applying to DGS, as it is less selective and has very minimal requirements for transfers. Edit: It is very easy to transfer into the major of your choice after a semester or two at UIUC, so long as you meet the program's requirements and have decent grades.\n\nI know nothing about Sororities, so I can't help you there. However, with housing, I would not recommend the dorms. Renting an apartment (even a really nice apartment, close to campus) is almost always cheaper than the dorms. I have heard going this route makes it harder to make friends, but if you're considering going Greek and/or have a decent personality, you should be fine. Yup, I agree with this -- try for DGS.  I transferred into sociology before psych.  My GPA and everything was fine, but I had to take my alternative major choice at first because I was lacking one required class (I transferred in as a JR) that my CC didn't offer.  So I might have not been accepted into the program if it weren't for that. (Switching majors within LAS once you're in is incredibly easy-- take the req's you need, do well, and switch.  Easy as that.  Getting in is the hard part.)\n\n This is true except in the case of technical majors, which have entry requirements even once you are inside LAS. I'm glad it worked out for you!! I worry a lot about transfer students. Yup, I agree with this -- try for DGS.  I transferred into sociology before psych.  My GPA and everything was fine, but I had to take my alternative major choice at first because I was lacking one required class (I transferred in as a JR) that my CC didn't offer.  So I might have not been accepted into the program if it weren't for that. (Switching majors within LAS once you're in is incredibly easy-- take the req's you need, do well, and switch.  Easy as that.  Getting in is the hard part.)\n\n So is the DGS for undecided majors (and also easier to get in than picking a major)? and how do I know what required classes I need to take before transferring?  http://admissions.illinois.edu/apply/requirements_transfer_handbook.html\n\nRequirements are in the transfer handbook, it varies by college and major. If you're at a college in Illinois right now you can use transfer.org to correlate all of your college's course numbers to UIUC course numbers.\n\nI followed the transfer handbook and transfer.org. All of my course credits were accepted. So is the DGS for undecided majors (and also easier to get in than picking a major)? and how do I know what required classes I need to take before transferring?  So is the DGS for undecided majors (and also easier to get in than picking a major)? and how do I know what required classes I need to take before transferring?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13xalw/looking_into_transferring_next_year_would_like/"
  }, {
    "id" : 39,
    "title" : "Sesame Street's Big Bird (Caroll Spinney) coming to campus tomorrow to give a guest lecture!",
    "snippet" : "Mr. Spinney will be speaking in the I rooms in the Illini Union tomorrow night. Doors open at 6:30!  Do you know what will be the topic of discussion? I would like to attend but due to time constraint it would be nice to know more about the lecture so I can make a more informed decision Do you know what will be the topic of discussion? I would like to attend but due to time constraint it would be nice to know more about the lecture so I can make a more informed decision",
    "url" : "http://www.reddit.com/r/UIUC/comments/13x6pf/sesame_streets_big_bird_caroll_spinney_coming_to/"
  }, {
    "id" : 40,
    "title" : "It's that time of year again, apparently",
    "snippet" : "  [Basically how it's going to happen](http://i.imgur.com/PZtQb.gif) [Basically how it's going to happen](http://i.imgur.com/PZtQb.gif)  Wait... I took rhet 105 and have no clue what this means. Most Rhet 105 sections require a survey to be completed and the data used for your final project. I lucked out and ACT'd out of it, so I never had to go through the pain, but this time of the semester you always get asked to take a billion &lt;/exaggeration&gt; surveys for people's projects. Ok thanks. I took this back in 2006 (ugh... and I'm still in school) and this didn't exist yet.  If it makes you feel better my dog is a big fan of the Riemann Zeta function Your dog? You should get one of those bumper stickers that says your dog is smarter than your honors student. ",
    "url" : "http://www.quickmeme.com/meme/3rxurk/"
  }, {
    "id" : 41,
    "title" : "What do you guys think of the TechnoGraph? Does anybody read it? ",
    "snippet" : "Link here: http://www.readtechnograph.com/\n\nI'm an engineering student here and reading about happenings in the engineering departments at UIUC is exciting to me, but I haven't heard much about the Technograph. What do you guys think? What's the culture surrounding it like? Are people too busy to read it?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13wquv/what_do_you_guys_think_of_the_technograph_does/"
  }, {
    "id" : 42,
    "title" : "Good auto shops?",
    "snippet" : "Victim in a fender bender, and I need some honest, reliable auto shops to get me some estimates and check for frame damage. Anyone have experiences with any?   I just had $10k+ worth of insurance repairs done by Collision Revision, and they do really horrible work. Avoid at all costs! They did great work for me. But they're big box. They're not the most skilled people in town, but they're fast and predictable, at least. Yeah, for me they definitely weren't fast or predictable.  They quoted me 15 business days, then took 20 business days, and returned to me a very poorly done repair job (paint peeling, lots of imperfections, broken trim pieces, loose bolts, etc).  I'm still fighting with them to get everything right.  Gallo-Miller is great. They're honest guys and have been around for a long time. They do great body work. www.gallomiller.com ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13xa8z/good_auto_shops/"
  }, {
    "id" : 43,
    "title" : "Apt Deposits and Subleases",
    "snippet" : "Hey guys,\n\nSo I'm going to be subleasing an apt for next semester and have been working out the agreement with my subleasee for the place. My subleasee just asked me to pay him a deposit on the place which he says I'll get back at the end. Is this reasonable and a regular thing for subleasees to ask?\n\nI know when you sign a contract for an apartment you need to pay a deposit, but is there any way for me as a subleaser to just have the deposit switched, instead of me having to pay the sublessee independently and just trusting that he will return the deposit once the term has ended??\n\nWhat is the general procedure for this??\n\nThanks for your help!\n\nEDIT: I should add that throughout this entire process, the sublesee has been very helpful and I trust him, but I just in case I don't want to lose a full months rent... I heard some housing companies are just dicks and won't return the deposit anyways, so I don't want to have to pay for the entire years worth of deposit if he wasn't going to be receiving it back anyways...   I agree that it's a good question to ask the Tenant's Union.  A deposit isn't totally out of the ordinary for a sublease, but make sure than the terms of the deposit are described in whatever contract or paperwork you plan to sign.  If I remember correctly, if you give anyone any sum of money, they are not bound to return it if they are not on contract.  I doubt your sublessor has ill intentions, but it's always better to be sure. Ahh I actualy just reread the sublease agreement that we signed and it actually is down on paper. I didn't know about how much the deposit would be, but on my agreement, its for the full deposit. I guess it's probably too late to ask that it only be for part of the deposit huh? :/   With JSM, part of the sublease agreement includes that the subleaser pay the the subleasee some percentage of the original deposit, to be returned upon end of agreement less any damages.\n\nGet your agreement in ink, preferably in the contract, and have it witnessed, signed, and/or maintained by the landlord. Ahh yea, I realized that it actually is on the sublease agreement that I signed, though its for the full deposit and not a percent of the original (though that number had been agreed upon already... now I realize I probably shouldve asked to pay just a percent of the original deposit shouldnt I?)\n\nI trust my subleaser, but I'm just worried since i've heard some companies never return the deposit anyways just because theyre dicks... did you ever have problems with JSM about that? (this lease is with Roland though)  If the apartment owner is CPM and [you getting your deposit back] is contingent upon [him getting his deposit back], then you might want to think about negotiating down to a half month's security deposit, unless the apartment is absolutely pristine. CPM is fairly reluctant to return security deposits at all, and often require badgering. Which is probably sensible for a company with so many tenants who are chicagoland students using their parents' money, eager to leave town as soon as possible. \n\nCPM kept my security deposit, but my roommate that year was unimaginably gross, so I'm not going to call that one dishonesty. I'm more basing this off friends' experiences, so treat this as a secondhand recommendation.  Is your agreement contingent on him getting his deposit back or contingent on you causing damage?\n\nYou should document well the state of the apartment when you move in, to show that any damages are not your fault.",
    "url" : "http://www.reddit.com/r/UIUC/comments/13wxr7/apt_deposits_and_subleases/"
  }, {
    "id" : 44,
    "title" : "How do I get an absence excused by the emergency dean?",
    "snippet" : "I missed my classes today and I haven't had to excuse my classes before, so I have no clue what I'm doing.  tell them you were in the apartment complex with the meth explosion Is that what the Illini Alert last night was aboot?   http://www.odos.uiuc.edu/deanonduty/#absences\n\nSend HELPdean@illinois.edu an email explaining the situation and they'll get you sorted out. Thanks! I sent them an email. Do you know how long it takes for them to get back to me? Thanks! I sent them an email. Do you know how long it takes for them to get back to me?  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13vuis/how_do_i_get_an_absence_excused_by_the_emergency/"
  }, {
    "id" : 45,
    "title" : "Illinois Bball ranked #22 in AP and Coaches poll",
    "snippet" : "  Lunardi insider RPI #7 Lunardi insider RPI #7 Link? Lunardi insider RPI #7   Look at all the other big ten teams there. We won't be there for long once conference play starts. Your name should be Not_a_optimist! he's right though -- the regular season is going to be brutal, especially if Michigan continues to be good We are already in the regular season, and it hasn't been brutal yet! Do you mean conference play? And even if we go 11-7 or 10-8 in the conference we will still get into the tourney. Let's see how we play against Gonzaga and Mizzou in the next few weeks. Those will be 2 good tests to see where this team is really at. Look at all the other big ten teams there. We won't be there for long once conference play starts. Just shows the B1G is a strong conference which will help us in March.  Look at all the other big ten teams there. We won't be there for long once conference play starts. Look at all the other big ten teams there. We won't be there for long once conference play starts.       After barely sneaking a win from Gardner-Webb?  Utter bull shit. ehhh, I see what you mean, but with the show they put on in Maui in addition to a 7-0 record, I think it is deserved. \n\nAlso, most of the other ranked teams are not quite perfect either...for example\n\n#13 Michigan St. won by only 3 against Louisiana Laffeyete yesterday and also have a loss.\n\nLook at North Carolina who lost badly to Butler in Maui, and have arguably 0 strong wins...they are still ranked #14.\n\nMoral of the story, rankings this early do not mean much, but it sure is awesome to see the Illini get some recognition for their successful trip to Hawaii and climb into the rankings after not recieving any votes in weeks prior. The performance in Maui was good.  I will lend you that, but I think the team is sporadic, at best.\n\nThis is yet another Weber-esque team, and with yet another mediocre coach from the mid-majors, we have nothing but failure in our future.  If we manage to eke out a tournament appearance it will end in tears. I guess we're coming from a different angle here, but given the terrible end to last season, and the team remaining largely the same minus a draft pick, I would consider a tourney appearance a mild success for a coach's first year.  Maybe that's just my rose colored glasses trying to find anything positive though. My issue is Groce's mediocre (at best) record in the mid-majors.  If he couldn't hack it there, he won't hack it here. What exactly about John Groce's work at Ohio suggests that he couldn't \"hack it\" there? He not only made the tourney 2 of the 4 years he coached there  (an impressive enough feat considering they only made the tourney 1 time between 1994 and Groce's start in 2008), but each time, beat a team that was seeded 4 or better. Not to mention he took the #1 seeded team to overtime in the Sweet Sixteen game this year. He also brought in the talent that has propelled Ohio to their 5-0 start. Similarly, he just signed an impressive recruiting class for us in a short 7 months since taking the job. I'd say he'll hack it here just fine. After barely sneaking a win from Gardner-Webb?  Utter bull shit. After barely sneaking a win from Gardner-Webb?  Utter bull shit.",
    "url" : "http://espn.go.com/mens-college-basketball/rankings/_/year/2013/poll/1/week/4"
  }, {
    "id" : 46,
    "title" : "A TA just told a friend of mine that the University might end the semester this week in the case of a strike... sounds like BS, right?",
    "snippet" : "I've tried reading up on all of this stuff, but it just seems too wordy. I get what the issue is; now I want to know what happens if TA's stop working. What classes/departments are going to be hit hardest? What happens in undergrad classes that rely on TAs for grades? What happens to those grades? What happens to the rest of the semester? Help!\n\n  I highly doubt it; it's probably just the rumor mill working overtime in response to the controversy.  I was here for the last strike; it's a ginormous inconvenience (doubly so, given our proximity to finals week) but the university doesn't grind to a halt and foam at the mouth.  Most professors still hold classes, and exams can always have undergrad proctors instead of TAs.\n\nSTEM majors are the least affected, because those TAs don't join the GEO as much as liberal arts and social science majors do.  As engineers, I don't think we have much to worry about. I think they have to join the GEO.  I remember a TA from my research group complaining about having 2% of his pay go to the GEO, especially since he didn't like how they politicize things. 2% up to $45, not 2% straight. 2% up to $45, not 2% straight. I think they have to join the GEO.  I remember a TA from my research group complaining about having 2% of his pay go to the GEO, especially since he didn't like how they politicize things. I think they have to join the GEO.  I remember a TA from my research group complaining about having 2% of his pay go to the GEO, especially since he didn't like how they politicize things. 2%? Wtf are they doing with that money? I probably should've asked that in the AMAA, although it wasn't completely relevant to the strike at hand. Assuming every grad is making $10000, thats $2.13 million. 2% up to $45, should change your math. 2% up to $45, should change your math. 2%? Wtf are they doing with that money? 2%? Wtf are they doing with that money? 2%? Wtf are they doing with that money? http://www.uigeo.org/geo-budget/ So the money from this union mostly goes to three other unions? \n\n~~That sounds a bit sketchy...~~\n\nTL;DR\n\nI still think its pretty funny. Did you read the line immediately below the graph that begins the explanation of where that money goes?\n\nIt seems that we actually get a lot of benefit from those other unions. I think they have to join the GEO.  I remember a TA from my research group complaining about having 2% of his pay go to the GEO, especially since he didn't like how they politicize things. I highly doubt it; it's probably just the rumor mill working overtime in response to the controversy.  I was here for the last strike; it's a ginormous inconvenience (doubly so, given our proximity to finals week) but the university doesn't grind to a halt and foam at the mouth.  Most professors still hold classes, and exams can always have undergrad proctors instead of TAs.\n\nSTEM majors are the least affected, because those TAs don't join the GEO as much as liberal arts and social science majors do.  As engineers, I don't think we have much to worry about.   Relax, take a chill pill.\n\nThe semester won't be ended early, that'd be insane. The University can't just do that.\n\nI think last time there was a strike it was like two days long. Really, striking won't affect you as much as you might think. Relax, take a chill pill.\n\nThe semester won't be ended early, that'd be insane. The University can't just do that.\n\nI think last time there was a strike it was like two days long. Really, striking won't affect you as much as you might think. I wasn't too worried about it. I know how irrational that is. I was just wondering why a TA would go around saying something like that.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13uabi/a_ta_just_told_a_friend_of_mine_that_the/"
  }, {
    "id" : 47,
    "title" : "How stressful is the CS program at UIUC? (Sorry if this has been asked before)",
    "snippet" : "UIUC is a really strong candidate in my list of schools. I'm an out of state student living in New Jersey and I'm really attracted by the top CS rank and reasonable price that Illinois has to offer. \n\nHowever, the only thing that I'm worried of is the difficulty and workload of the program. Don't get me wrong, I'm more than willing to work hard and apply myself. I'm just wondering if I'm gonna be clawing for extra hours of sleep and spending days without seeing sunlight (My friend is doing Chemical Engineering @ UMich and that's what he described his life as, haha). I don't mind doing that a couple times, but if this occurs 9/10 days then I might have a problem since I'm still unsure how I'd handle in that type of situation.\n\nAs for my skill in CS, I've had a long term interest in computers in general and have very, VERY limited coding experience. Still, coding generally makes sense to me and I am really interested to learn more. \n\nDoes anybody have any insightful comments to make on the rigor of the CS  at UIUC? It could help me a lot in settling myself, although to be honest I'd probably go even if you described it as hell on earth.  You might get very lonely.\n\nI haven't talked to any girls in the past year and a half. That's only a mild exaggeration. And that is no one's fault but your own. Preach. This is a campus of 30,000 undergrads, 15,000 approximately female. You see literally hundreds of girls you have not yet ever talked to every day in the 10 minutes between every single class. So you can not say that you don't talk to girls because you can't find any.\n\nThe next thing you might argue is that there are no 'socially acceptable' ways to talk to girls. I call bullshit, and I will name three:\n\n1) Almost every lecture hall class has group projects, or at least projects where you can work with at least one partner. You could ask almost any girl in the class if she would like to work with you on something. Granted, there may be a smaller percentage of females in a CS class, but I have yet to find a CS class with over 100 students that has 0 girls. Also, she might say \"no, I'm working with someone else,\" but that's fairly unlikely and there are other options and other girls in the class.\n\n2) You can join student groups. Sure, CS groups generally also have a smaller female percentage, but most groups of decent size have at least some girls. Then, there are non-CS student groups which you could join, and women in almost all of them. Hell, if you really care about talking to women, go to Women in CS open office hours. You don't even have to leave Siebel! That group has a majority of female members! They've even got an Xbox with kinect so you can play dancing games with the girls there! \n\n3) You can go to public areas and meet women. If you live in a dorm, you can go to the lobby. If you don't live in a dorm, you can go to a dorm, wait for someone to swipe their iCard, then follow them into the lobby. There are lounges in the union, there are rest places in Siebel, and countless other public hang-out places I don't even know about. All of these places you know about, or could've easily found out about. Once you are in a public place, you can talk to anyone you please, and unless they ask you to leave them alone (as long as you're moderately pleasant, they most likely won't), you can keep talking to them until they have to leave.\n\nYou also might argue that you're too busy to talk to girls. Yeah right. Unless you have two jobs, are taking 18 credit hours, and won't be happy with anything less than a 4.0, you will have free time. You might choose to spend this free time, say, on reddit instead of talking to girls, but you will have at least some time. But even if you choose to spend your free time not talking to girls, you still have option 1 up above.\n\nSo I have preached, I have defended my case. If you never talk to girls, it is no one's fault but your own.\n\nAnd on one's going to read this because it's in a two day old thread, practically dead. Damn. I said preach and you preached. Good stuff man. Too bad nobody is going to read it haha. You might get very lonely.\n\nI haven't talked to any girls in the past year and a half. That's only a mild exaggeration. You might get very lonely.\n\nI haven't talked to any girls in the past year and a half. That's only a mild exaggeration. This. I find it so awkward so talk to girls now because I haven't spoken to them regularly for so long. Talk to them like people? This. I find it so awkward so talk to girls now because I haven't spoken to them regularly for so long. You might get very lonely.\n\nI haven't talked to any girls in the past year and a half. That's only a mild exaggeration. You might get very lonely.\n\nI haven't talked to any girls in the past year and a half. That's only a mild exaggeration. Can anybody else vouch for this? This actually is sort of a turn off, haha. If you rely exclusively on classes to meet people, you're not gonna meet many girls in most engineering majors. Doesn't matter what school, CS does not attract women in general.\n\nBasically, if you are naturally outgoing and have good time management, you're set for any/all majors.\n\nTime management is literally the most important thing in college. Most people who are overworked in college either procrastinate or take on way too many extracurricular responsibilities. \n\nGo to class, take notes, do homework/study early, and you should be fine. A guy told me he thought I was smarter than him; well, he came into college with insane time management and I just rode my \"intelligence\" through high school. I went from incoming James Scholar to academic probation in 2 years, only just now climbing out of the hole I dug. He destroyed all of his classes and still finds time to do everything he wants to. Pretty sure he's the smart one, not me.\n\nFuck it, I already typed too much:\n\nrawnoodles10 guide to college based on his mistakes and others' success:\n\n* Go to class, take notes (even mindless copying counts), do your hw/projects early. Starting early means you can go to office hours and ask the professor questions, I know a CS major that finished her huge project the first week it was assigned because she just kept asking the prof when she got stuck. You cannot do this 3 hours before the thing is due.\n\n* Rely on extracurriculars/dorm/friend's friends to meet people. You aren't going to see the same people in class till junior level classes, inverse is true for female/male ratio in engineering. You will probably know much fewer people overall than you did in high school.\n\n* Just get the default meal plan, I never saw anyone actually able to avoid wasting credits on the bigger ones. You're going to hate dorm food 1-2 months in. Same crap over and over. Rent yourself housing and learn to cook. Don't rent at CPM.\n\n* At UIUC, you don't need a car. Bus (pass included in tuition) can take you a block from anywhere, or bike. \n\n* Don't be afraid to talk to professors. They're generally pretty laidback and friendly. You can easily get research by looking up a profesor doing something interesting and knocking on their office door.\n\n* It's ok to fuck up. Grade replacement/dropping classes can let you catch up.\n\n* Doesn't hurt to ask, you can get a lot of stuff by just asking for it. Just don't bullshit. If you rely exclusively on classes to meet people, you're not gonna meet many girls in most engineering majors. Doesn't matter what school, CS does not attract women in general.\n\nBasically, if you are naturally outgoing and have good time management, you're set for any/all majors.\n\nTime management is literally the most important thing in college. Most people who are overworked in college either procrastinate or take on way too many extracurricular responsibilities. \n\nGo to class, take notes, do homework/study early, and you should be fine. A guy told me he thought I was smarter than him; well, he came into college with insane time management and I just rode my \"intelligence\" through high school. I went from incoming James Scholar to academic probation in 2 years, only just now climbing out of the hole I dug. He destroyed all of his classes and still finds time to do everything he wants to. Pretty sure he's the smart one, not me.\n\nFuck it, I already typed too much:\n\nrawnoodles10 guide to college based on his mistakes and others' success:\n\n* Go to class, take notes (even mindless copying counts), do your hw/projects early. Starting early means you can go to office hours and ask the professor questions, I know a CS major that finished her huge project the first week it was assigned because she just kept asking the prof when she got stuck. You cannot do this 3 hours before the thing is due.\n\n* Rely on extracurriculars/dorm/friend's friends to meet people. You aren't going to see the same people in class till junior level classes, inverse is true for female/male ratio in engineering. You will probably know much fewer people overall than you did in high school.\n\n* Just get the default meal plan, I never saw anyone actually able to avoid wasting credits on the bigger ones. You're going to hate dorm food 1-2 months in. Same crap over and over. Rent yourself housing and learn to cook. Don't rent at CPM.\n\n* At UIUC, you don't need a car. Bus (pass included in tuition) can take you a block from anywhere, or bike. \n\n* Don't be afraid to talk to professors. They're generally pretty laidback and friendly. You can easily get research by looking up a profesor doing something interesting and knocking on their office door.\n\n* It's ok to fuck up. Grade replacement/dropping classes can let you catch up.\n\n* Doesn't hurt to ask, you can get a lot of stuff by just asking for it. Just don't bullshit. I would add to this list:\n\n* Form study groups to do homeworks, MPs and to prepare for quizzes and exams. It is a sort of defense against procrastination because someone in your group is likely to be more conscientious and push you to start working on assignments early. It is more fun and less stress to study in a group, and you also get to know people and make friends that way.\n\n* Good grades are not about intelligence (you already have the required level if you get admitted to UIUC). They are about time management, organizational skills, networking (forming study groups, etc.). These soft skills will also be very useful later in life, in fact probably more than technical skills after a point.\n\n* UIUC is a good university with tons of resources to help you. Make use of those! Go to office hours, in fact, if possible, I would say go to office hours even if you were able to do the homework without help. Concepts are often reiterated in office hours and you might learn something new or understand something better just by going to office hours and observing the professor or TA answering someone else's questions. Grainger has study rooms, areas where you are allowed to talk and discuss - utilize those resources. \n\n* Do not take on more courseload than you are able to manage. You don't want to be miserable and stressed out trying to get your courses done sooner.\n\n* Have a life and interests outside your major. Join an RSO or some other club/activity/sports, but don't take on too many extracurricular activities.  I thought I covered all those.\n\n'Cept study groups, those are good too. If you rely exclusively on classes to meet people, you're not gonna meet many girls in most engineering majors. Doesn't matter what school, CS does not attract women in general.\n\nBasically, if you are naturally outgoing and have good time management, you're set for any/all majors.\n\nTime management is literally the most important thing in college. Most people who are overworked in college either procrastinate or take on way too many extracurricular responsibilities. \n\nGo to class, take notes, do homework/study early, and you should be fine. A guy told me he thought I was smarter than him; well, he came into college with insane time management and I just rode my \"intelligence\" through high school. I went from incoming James Scholar to academic probation in 2 years, only just now climbing out of the hole I dug. He destroyed all of his classes and still finds time to do everything he wants to. Pretty sure he's the smart one, not me.\n\nFuck it, I already typed too much:\n\nrawnoodles10 guide to college based on his mistakes and others' success:\n\n* Go to class, take notes (even mindless copying counts), do your hw/projects early. Starting early means you can go to office hours and ask the professor questions, I know a CS major that finished her huge project the first week it was assigned because she just kept asking the prof when she got stuck. You cannot do this 3 hours before the thing is due.\n\n* Rely on extracurriculars/dorm/friend's friends to meet people. You aren't going to see the same people in class till junior level classes, inverse is true for female/male ratio in engineering. You will probably know much fewer people overall than you did in high school.\n\n* Just get the default meal plan, I never saw anyone actually able to avoid wasting credits on the bigger ones. You're going to hate dorm food 1-2 months in. Same crap over and over. Rent yourself housing and learn to cook. Don't rent at CPM.\n\n* At UIUC, you don't need a car. Bus (pass included in tuition) can take you a block from anywhere, or bike. \n\n* Don't be afraid to talk to professors. They're generally pretty laidback and friendly. You can easily get research by looking up a profesor doing something interesting and knocking on their office door.\n\n* It's ok to fuck up. Grade replacement/dropping classes can let you catch up.\n\n* Doesn't hurt to ask, you can get a lot of stuff by just asking for it. Just don't bullshit. Can anybody else vouch for this? This actually is sort of a turn off, haha. Can anybody else vouch for this? This actually is sort of a turn off, haha. Can anybody else vouch for this? This actually is sort of a turn off, haha. Can anybody else vouch for this? This actually is sort of a turn off, haha. Can anybody else vouch for this? This actually is sort of a turn off, haha. Can anybody else vouch for this? This actually is sort of a turn off, haha. You might get very lonely.\n\nI haven't talked to any girls in the past year and a half. That's only a mild exaggeration.    [deleted] Yeah, I'm interested in the logic and the theory behind it more than just being a code monkey. Is that a good thing? You'll love CS 173-273-373-473 Yeah, I'm interested in the logic and the theory behind it more than just being a code monkey. Is that a good thing?  &gt;if I'm gonna be clawing for extra hours of sleep and spending days without seeing sunlight\n\nIf you manage your time well this won't happen as often. But the thing is people who actually enjoy those hours struggling trying to finish an mp (machine problems, just a fancy word for CS hw) will do well in this field. You should come give it a shot and see how you do. If you don't like it we have other solid programs as well.\n\nAlso I didn't do much coding before I attended UIUC. It shouldn't be a problem.  If you manage your time, you'll be fine.\n\nI started in Aviation, transferred to Engineering for CS after two years while finishing up the Aviation program and did the Marching Illini and Basketball and Volleyball bands on top of that.  Spent an extra year to finish up, but I wouldn't trade it for anything.\n\nDo keep in mind that it is many ways a very theoretical program.  The focus is not on coding.. it's on the principles behind the coding.  Algorithms, Data Structures, and Hardware are all areas of emphasis.  I've heard it said that the Bachelor's program covers material that many other colleges cover in their Master's CS program.\n\nThis is both a good thing and a bad thing.  You'll be expected to pick up the languages that a given course is taught in as you go -- the focus isn't the language, the language is the tool to cover the material at hand.  Some people do well with that approach (I did).  Others do not.  It's an amazing program. If you manage your time properly and start assignments early, you never have to stay up late. However, once you reach sophomore year, second semester, it pretty much evolves from being a major into being a lifestyle. If you're okay, with CS related stuff dominating a majority of your time and your life then go for it. Also, people within CS are not exactly the most social. But I'm an international student so my experiences might be a little different. That's actually pretty worrying... I'm by no means a party animal but I am looking for some type of social college experience  That's actually pretty worrying... I'm by no means a party animal but I am looking for some type of social college experience  [deleted] It's an amazing program. If you manage your time properly and start assignments early, you never have to stay up late. However, once you reach sophomore year, second semester, it pretty much evolves from being a major into being a lifestyle. If you're okay, with CS related stuff dominating a majority of your time and your life then go for it. Also, people within CS are not exactly the most social. But I'm an international student so my experiences might be a little different.  If you are a social kid then you will hate it. 90% of CS kids here are assholes. It always seems to me like CS people aren't necessarily the worst people as a whole, but the worst people do seem to be CS people.  I concur. Obviously I can't generalize and make a statement for the population as a whole. I only have anecdotal evidence, but some of the ones I know have poor social skills and somewhat of an attitude problem (God's gift to mankind kind of attitude). It doesn't get better after they have finished undergrad, either, they stay the same later on, too. Watch \"The Social Network\" for an in-depth understanding; I don't know if it is representative of CS majors but it matches my experience and observations.\n\nTL; DR: CS major good for employability, bad for social, interpersonal and life skills. You would probably have to put in conscious, extra effort into socialization to make sure your social skills progress beyond the high school-level skills that you came in with. Good for employability, bad for life skills, which include knowing how to get a job.  I never did really learn that one.. and so, I'm in graduate school, where I can still survive without knowing how to do that.  I think I'm kind of odd in that respect though.. most people got quite a few offers all the time it seemed. That's unusual - I thought getting into UIUC CS grad school was harder than getting a job. I'm not in UIUC graduate school, I'm somewhere else.  But I think it was a number of things--I'd rather go to graduate school than be a software engineer because of the things I want to do, so I had more drive to push myself toward that; also, it's a different style of applying--no talking to recruiters and handing out resumes, which I found kind of difficult and which made me nervous all the time.\n\nI always wonder if I should just become a software engineer though... I'm sure I could get a job easily if I applied to a bunch of places and they do make more money, but I'd feel like I'd be stuck doing that forever and I never really wanted to in the first place. If you are a social kid then you will hate it. 90% of CS kids here are assholes. Eh, I don't think that's completely true.  There are definitely some alpha nerds who think they're ~~God's~~ Stallman's gift to the world, but they're typically holed up in the ACM office.  For the most part, I found that people were friendly and helpful.  Finding the right group of people to work with is key. &gt; There are definitely some alpha nerds who think they're ~~God's~~ Stallman's gift to the world, but they're typically holed up in the ACM office.\n\n...right along with a good number of decent people.  Some of the same people, in fact, that you're claiming are friendly and helpful. Ah, sorry, I didn't mean to imply that everyone in ACM is a douche. The few people I ever got any sort of hostility from seemed to always be in ACM, **but**, as you say, most are very friendly and helpful; I should have made that clear. \n\nThe point is, FightingDucks was pretty liberal - or, rather, *wrong* - with his numbers by saying 90% of the people in CS are assholes.  It's much, much smaller than that. Ah, sorry, I didn't mean to imply that everyone in ACM is a douche. The few people I ever got any sort of hostility from seemed to always be in ACM, **but**, as you say, most are very friendly and helpful; I should have made that clear. \n\nThe point is, FightingDucks was pretty liberal - or, rather, *wrong* - with his numbers by saying 90% of the people in CS are assholes.  It's much, much smaller than that. If you are a social kid then you will hate it. 90% of CS kids here are assholes. You publicly state that you're better than 90% of your classmates... and yet you think they're the stuck up assholes. no not better by any means at CS, hell i struggle to get by in it.  More social than 90% and have better personal skills, yes.  [deleted] Personal skills usually involve communication in person and not over an anonymous forum so this is not any indication. The whole concept of anonymous online forums is to be able to say whatever you want without worrying about the people around you taking offense and knowing who you are.  [deleted] Caring about something has nothing to do with personal skills, that just has to do with being a caring person who can show signs of empathy or sympathy.  And insult or not, it is true and OP asked about the program.  Im going to be honest and give my opinion which I stand by.  And as for the insulting people in a forum many of them read, I still think it was a good idea.  As you pointed out that many CS people read this, OP's chance of getting any honest responses that aren't just building up this program greatly decrease.  Are you that butthurt that about me saying that you are probably in this group who lacks interpersonal and social skills in real human interaction as opposed to communication behind the safety of your computer screen? [deleted] As stated before, I do not consider myself to be better than everyone else is.  I also doubt that we know each other, however that would be interesting wouldn't it. I am just saying that from my own personal interactions with CS undergrads, about 90% were very anti-social and came off as that god's gift to earth type.  That isnt to say that all CS people are like that, it is very possible that I have just had poor luck and that these are the ones I have interacted with. If you are a social kid then you will hate it. 90% of CS kids here are assholes. Is this your opinion or just the common mindset shared by most of the student body? I just posted this above but here is my opinion/ personal experiences...\n\nI stand by statement. I'm in CS so I have had plenty of interactions with other CS students. Perhaps 90% overall was a bit too high of a number but from my own personal experiences, I have met 1 or maybe 2 people in CS that weren't \"Gods gift to earth, I'm better than you, assholes.\" \n\nAlso I guess there are some experiences that sum it up better than others. For example just  a few weeks ago in lecture I tried to start a conversation with the guy next to me before the class started, all he responded with was \"what the fuck do you want go bother someone else.\"  Also last year in a discussion section some kid asked a question (maybe not the best question but that is what discussion sections are for) and one kid stood up and cussed the kid out calling him a dipshit who was making \"all of us smart kids in CS look bad.\"  If you are a social kid then you will hate it. 90% of CS kids here are assholes.   If you want a fantastic social life (ie. go out 3 nights a week), a CS major is the farthest thing from it, \n\nConsider studying Information Systems in the College of Business if you want a great social life and are interested in computers (especially in more general terms).    I don't think there is anything \"reasonable\" about UIUC's out of state tuition... \n\n I'm an out of state student. U of I's rate for us is much lower than public schools in other schools for students that wish to study out of state. When I was considering different schools, I do believe that Georgia Tech was about $4k/yr less than U of I though.  Its great. The classes are extremely easy and there are a ton of girls everywhere.\n\nEdit: Ok, on a serious note. There are plenty of assholes in CS of course, and you have to find the people that aren't assholes- but that's not hard. And don't take the gender ratio jokes seriously- the majority of my CS friends are girls (I'm a guy) and this is purely by accident, not because I only try to make friends with girls. Of course there gender ratio is pretty skewed, but its not impossible to work around. (Basically, if you're going into CS for girls you're doing it very wrong, but as long as you have some sort of social presence, you shouldn't have to worry about it.)\n\nThere's a good mix of everything from the \"hardware\" side to the \"theory\" side of the spectrum, and a lot of programming in between. As for having prior experience, I came in with very little and I'm doing pretty fine. There's plenty of work, of course, but that's to be expected. You will learn a lot; its not like professors give you busy work, or strange problems where you have no idea why you're supposed to be doing this. &gt; the majority of my CS friends are girls (I'm a guy) and this is purely by accident, not because I only try to make friends with girls\n\nWhat a thinly veiled attempt at calling yourself a baller. Thanks for last night, I really enjoyed it ;) I particularly enjoyed the part where you put your male connector in my female port. You must love soaking up karma by riding all my comments -_- No, I just like seeing you get downvoted. Its great. The classes are extremely easy and there are a ton of girls everywhere.\n\nEdit: Ok, on a serious note. There are plenty of assholes in CS of course, and you have to find the people that aren't assholes- but that's not hard. And don't take the gender ratio jokes seriously- the majority of my CS friends are girls (I'm a guy) and this is purely by accident, not because I only try to make friends with girls. Of course there gender ratio is pretty skewed, but its not impossible to work around. (Basically, if you're going into CS for girls you're doing it very wrong, but as long as you have some sort of social presence, you shouldn't have to worry about it.)\n\nThere's a good mix of everything from the \"hardware\" side to the \"theory\" side of the spectrum, and a lot of programming in between. As for having prior experience, I came in with very little and I'm doing pretty fine. There's plenty of work, of course, but that's to be expected. You will learn a lot; its not like professors give you busy work, or strange problems where you have no idea why you're supposed to be doing this.",
    "url" : "http://www.reddit.com/r/UIUC/comments/13uyg8/how_stressful_is_the_cs_program_at_uiuc_sorry_if/"
  }, {
    "id" : 48,
    "title" : "Can someone plain and simply give me the numbers(hours and salary) behind the whole GEO issue. ",
    "snippet" : "It seems to me if you divide out the per-hour ratio, TA's are making $20+ an hour, which is a lot more than recent graduates. \n\nI just want the numbers!\n\nEDIT: thanks for the answers guys  I don't think you understand how being a TA works in grad school. You are paid (let's say in a STEM field something around $2k/month) to be a TA with a \"50% appointment\", meaning you are supposed to spend 50% of your time TAing. The other 50% of your time (in reality, this takes up a lot more than 20 additional hours per week) is research, but you don't get paid for that time....  If you assume a TA works a combined 40hrs/wk, which is a gross underestimate for anyone I've met, that's something like $13/hour. In the sciences you are usually prohibited from having another job because you're expected to spend all your time on research. The wage you earn from TAing is your only income.\n\nFor those asking why a tuition waiver guarantee is necessary... it is laughable to consider what would happen if the university took waivers away. Any student who had any other options for grad school would not be paying to come here when other schools will pay to have you. This means no students to do research, no one to produce work for PIs who need work done to win more grants... in the long term, no warm bodies to do teaching and no more grant money coming in. You may question why some grad students get paid, while professional students have to pay... it doesn't even really matter. It is the way it is, and if UIUC doesn't comply, it will lose students to the vast majority of schools that still do. I don't think you understand how being a TA works in grad school. You are paid (let's say in a STEM field something around $2k/month) to be a TA with a \"50% appointment\", meaning you are supposed to spend 50% of your time TAing. The other 50% of your time (in reality, this takes up a lot more than 20 additional hours per week) is research, but you don't get paid for that time....  If you assume a TA works a combined 40hrs/wk, which is a gross underestimate for anyone I've met, that's something like $13/hour. In the sciences you are usually prohibited from having another job because you're expected to spend all your time on research. The wage you earn from TAing is your only income.\n\nFor those asking why a tuition waiver guarantee is necessary... it is laughable to consider what would happen if the university took waivers away. Any student who had any other options for grad school would not be paying to come here when other schools will pay to have you. This means no students to do research, no one to produce work for PIs who need work done to win more grants... in the long term, no warm bodies to do teaching and no more grant money coming in. You may question why some grad students get paid, while professional students have to pay... it doesn't even really matter. It is the way it is, and if UIUC doesn't comply, it will lose students to the vast majority of schools that still do. I'm pretty sure these tuition waivers don't necessarily apply to STEM graduate students. I talked to a few, they said they get paid through their PI's grants and TAing is usually an extra source of income. I don't think tuition is ever a problem for STEM field graduate students. As a STEM graduate student, I didn't always get paid through my PI's grants and TAing was not an extra source of income. \n\nUsually, you TA the first few semesters for your salary, then you are put on as a research assistant and the salary comes from your PI somewhere. But there's no additional money if you TA. It just changes where your salary comes from. That could change from dept to dept.\n\nAgreed that tuition is (usually) not a problem in my field... but then if this issue is not about grad students keeping their existing tuition waivers, what is it about? I'm pretty sure these tuition waivers don't necessarily apply to STEM graduate students. I talked to a few, they said they get paid through their PI's grants and TAing is usually an extra source of income. I don't think tuition is ever a problem for STEM field graduate students. I don't think you understand how being a TA works in grad school. You are paid (let's say in a STEM field something around $2k/month) to be a TA with a \"50% appointment\", meaning you are supposed to spend 50% of your time TAing. The other 50% of your time (in reality, this takes up a lot more than 20 additional hours per week) is research, but you don't get paid for that time....  If you assume a TA works a combined 40hrs/wk, which is a gross underestimate for anyone I've met, that's something like $13/hour. In the sciences you are usually prohibited from having another job because you're expected to spend all your time on research. The wage you earn from TAing is your only income.\n\nFor those asking why a tuition waiver guarantee is necessary... it is laughable to consider what would happen if the university took waivers away. Any student who had any other options for grad school would not be paying to come here when other schools will pay to have you. This means no students to do research, no one to produce work for PIs who need work done to win more grants... in the long term, no warm bodies to do teaching and no more grant money coming in. You may question why some grad students get paid, while professional students have to pay... it doesn't even really matter. It is the way it is, and if UIUC doesn't comply, it will lose students to the vast majority of schools that still do. My friend who TAs ECE190 makes ~700/month, and I'm pretty sure ECE is a STEM field that should be making ~2k/month. -_- Is your friend a grad student? Is your friend getting paid for a research position at the same time? yes and yes  you can't buy food/pay rent  with a tuition waiver. you can't buy food/pay rent  with a tuition waiver. Just playing devil's advocate here: Law/Med students take out loans to pay tuition. Why should it be different for graduate students? A full-time TA gets paid 29K according to the link posted below, this is a very liveable wage for central Illinois. \n\nObviously tuition is absurd and a modest TA salary is not a reasonable way to pay for tuition and live. But shouldn't they be separate? Why shouldn't the situation be viewed the same as an undergrad delivering Sandwiches: Take out loans for tuition that you'll pay back later, and get a part-time job to pay for living expenses in the meantime. \n\nAgain, I don't feel this way - but this logic makes sense to me. Just playing devil's advocate here: Law/Med students take out loans to pay tuition. Why should it be different for graduate students? A full-time TA gets paid 29K according to the link posted below, this is a very liveable wage for central Illinois. \n\nObviously tuition is absurd and a modest TA salary is not a reasonable way to pay for tuition and live. But shouldn't they be separate? Why shouldn't the situation be viewed the same as an undergrad delivering Sandwiches: Take out loans for tuition that you'll pay back later, and get a part-time job to pay for living expenses in the meantime. \n\nAgain, I don't feel this way - but this logic makes sense to me. Read the AMA from the GEO co-president, she addressed a lot of your points much better than I can.\n\nLaw/med students don't teach, thus don't get waivers. Graduate students don't automatically get waivers, only if they are employed as a TA/RA/GA. \n\nNot all TA's are full time. I believe that the GEO wants part time GAs to have a liveable wage (since not all GAs get full time appointments). [deleted] [deleted] Do you think prospective undergrads will want to attend a school where their courses are taught by other undergraduates? Just playing devil's advocate here: Law/Med students take out loans to pay tuition. Why should it be different for graduate students? A full-time TA gets paid 29K according to the link posted below, this is a very liveable wage for central Illinois. \n\nObviously tuition is absurd and a modest TA salary is not a reasonable way to pay for tuition and live. But shouldn't they be separate? Why shouldn't the situation be viewed the same as an undergrad delivering Sandwiches: Take out loans for tuition that you'll pay back later, and get a part-time job to pay for living expenses in the meantime. \n\nAgain, I don't feel this way - but this logic makes sense to me. Just playing devil's advocate here: Law/Med students take out loans to pay tuition. Why should it be different for graduate students? A full-time TA gets paid 29K according to the link posted below, this is a very liveable wage for central Illinois. \n\nObviously tuition is absurd and a modest TA salary is not a reasonable way to pay for tuition and live. But shouldn't they be separate? Why shouldn't the situation be viewed the same as an undergrad delivering Sandwiches: Take out loans for tuition that you'll pay back later, and get a part-time job to pay for living expenses in the meantime. \n\nAgain, I don't feel this way - but this logic makes sense to me.  The issue is about protecting tuition waivers, but here are the [numbers](http://www.ahr.illinois.edu/grads/GEO1213rates.pdf).\n\nIf you want to actually understand the GEO's position, you can read [this](http://www.uigeo.org/wp-content/uploads/2012/09/TuitionWaiverFAQfront.jpg). From that link - it seems like taking away the tuition waivers is breaking the contract they signed. Isn't that illegal? If this is the case, wouldn't court be the best option as opposed to trying to reason with the school?\n\nAlso, does this only affect grad students in Fine and Applied Arts? Someone could correct me here, but I think the issues is not the current contract, because the current contract provides for the tuition waivers.\n\nThe issue now is that the school and the GEO is working on a new contract, but the school administration does not want to include tuition waivers for all TA's/RA's/GA's whatever.\n\nEdit: Mixed up GEO and admin. &gt; but the GEO does not want to include tuition waivers\n\nThe GEO wants tuition waivers for all TA's/GA's holding 25-67% appointments.\n From that link - it seems like taking away the tuition waivers is breaking the contract they signed. Isn't that illegal? If this is the case, wouldn't court be the best option as opposed to trying to reason with the school?\n\nAlso, does this only affect grad students in Fine and Applied Arts? And thanks for the links by the way  I would like to address a little bit about your question of the necessity of a tuition waiver. The base stipend in my department is 20k pretax, and unless you get additional fellowship, this is all you get. We get minimally taxed on that, but heavily taxed on *any additional scholarship we get over the base stipend**. We also pay all the student fees that for the most part, we don't really benefit from anyway.\n\nSo we are now at about 17k a year. For a 25 year old with a modest student loan, I can live on it well enough to afford to share an apartment and a car with my boyfriend and an annual trip home to see my aging parents. \n\nIf the tuition waiver was taken away, I would not be afford to live. Not without a loan anyway. This is not the deal I signed on to give up other opportunities. Sure, 20k for a 50% appointment sounds like a lot, but nobody I know--at illinois or anywhere else, actually work 20h and not expected to be kicked out of grad school (I know people who had been asked to leave for this reason). I would say between the engineering and science grads I know, we work between 40-80 hours a week because that's what academia demands of us.\n\nI went to a well ranked undergrad program and I have an impressive enough cv to get into this school. I can confidently say that if I wasn't offered financial support here, I would have ditched this for a fully funded program 5 ranks lower. Or not go to grad school at all. And this is representative of the sentiment among my social circles. If this school wants to flush its academic reputation down the toilet, this would be a good way to go. \n\nEdit because my memory failed me. TAs and RAs don't pay taxes on the waiver.  [deleted] Have you read past the first line?\n\n&gt; This taxation does not apply to qualified Teaching Assistants or Research Assistants.   If I remember correctly, they make just under $17,000 a year, which is the poverty line. (A TA of mine had a long talk about this.) As an LAS TA, I make just under $12,000 a year.  Not all of us are in STEM.",
    "url" : "http://www.reddit.com/r/UIUC/comments/13uej6/can_someone_plain_and_simply_give_me_the/"
  }, {
    "id" : 49,
    "title" : "What's the likelihood that my late drop/class withdrawal will be accepted?",
    "snippet" : "Anybody done this before? I'm doing awful in a class after the most stressful semester I've ever had, and I'd really like to be able to drop the class so that I have a \"W\" in my transcript instead of the current inevitable \"F.\" Anybody have experiences/suggestions?\n\nEdit: grammar     well shit. I'm gonna try anyway but I'm not gonna get my hopes up. Thanks for the input.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/13ubyb/whats_the_likelihood_that_my_late_dropclass/"
  } ],
  "processing-time-source" : 87,
  "processing-result.title" : "uiuc16_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc16_reddit.xml"
  }
}