{
  "processing-time-total" : 1322,
  "clusters" : [ {
    "id" : 0,
    "size" : 10,
    "score" : 66.11580166517888,
    "phrases" : [ "UIUC" ],
    "documents" : [ 3, 4, 19, 26, 34, 38, 40, 43, 47, 49 ],
    "attributes" : {
      "score" : 66.11580166517888
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 42.9739969614936,
    "phrases" : [ "Walk" ],
    "documents" : [ 1, 16, 19, 38, 40, 43, 44 ],
    "attributes" : {
      "score" : 42.9739969614936
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 50.528387938803625,
    "phrases" : [ "Planning" ],
    "documents" : [ 9, 10, 11, 19, 20, 36 ],
    "attributes" : {
      "score" : 50.528387938803625
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 51.91740817615019,
    "phrases" : [ "Check" ],
    "documents" : [ 0, 9, 23, 38, 40 ],
    "attributes" : {
      "score" : 51.91740817615019
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 64.11577513343765,
    "phrases" : [ "Hey" ],
    "documents" : [ 3, 5, 37, 40, 46 ],
    "attributes" : {
      "score" : 64.11577513343765
    }
  }, {
    "id" : 5,
    "size" : 5,
    "score" : 52.61277005700253,
    "phrases" : [ "Night" ],
    "documents" : [ 12, 15, 16, 25, 40 ],
    "attributes" : {
      "score" : 52.61277005700253
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 94.45693868488907,
    "phrases" : [ "Year you are in the House" ],
    "documents" : [ 1, 3, 38, 42, 43 ],
    "attributes" : {
      "score" : 94.45693868488907
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 44.43659304631265,
    "phrases" : [ "Website" ],
    "documents" : [ 0, 27, 43, 47 ],
    "attributes" : {
      "score" : 44.43659304631265
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 51.19267789940142,
    "phrases" : [ "Art" ],
    "documents" : [ 13, 31, 33 ],
    "attributes" : {
      "score" : 51.19267789940142
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 18.718425453297588,
    "phrases" : [ "Eat" ],
    "documents" : [ 1, 12, 19 ],
    "attributes" : {
      "score" : 18.718425453297588
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 31.129900706404282,
    "phrases" : [ "Final" ],
    "documents" : [ 0, 7, 49 ],
    "attributes" : {
      "score" : 31.129900706404282
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 35.49452922568783,
    "phrases" : [ "Gave" ],
    "documents" : [ 6, 7, 43 ],
    "attributes" : {
      "score" : 35.49452922568783
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 58.58987165360293,
    "phrases" : [ "Movies" ],
    "documents" : [ 10, 31, 43 ],
    "attributes" : {
      "score" : 58.58987165360293
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 38.66576316589294,
    "phrases" : [ "Volunteering" ],
    "documents" : [ 2, 9, 43 ],
    "attributes" : {
      "score" : 38.66576316589294
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 67.14398271973538,
    "phrases" : [ "Basketball Game" ],
    "documents" : [ 28, 35 ],
    "attributes" : {
      "score" : 67.14398271973538
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 27.236124635618726,
    "phrases" : [ "Film" ],
    "documents" : [ 10, 36 ],
    "attributes" : {
      "score" : 27.236124635618726
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 70.49461776498876,
    "phrases" : [ "Harlem Shake Videos are such a Stupid" ],
    "documents" : [ 34, 39 ],
    "attributes" : {
      "score" : 70.49461776498876
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 47.97990759197906,
    "phrases" : [ "Messages" ],
    "documents" : [ 4, 22 ],
    "attributes" : {
      "score" : 47.97990759197906
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 33.87986342016448,
    "phrases" : [ "Picture of the dog on my Facebook" ],
    "documents" : [ 19, 45 ],
    "attributes" : {
      "score" : 33.87986342016448
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 43.002686287153836,
    "phrases" : [ "Representative" ],
    "documents" : [ 0, 43 ],
    "attributes" : {
      "score" : 43.002686287153836
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 50.242022025176496,
    "phrases" : [ "Thursday" ],
    "documents" : [ 24, 30 ],
    "attributes" : {
      "score" : 50.242022025176496
    }
  }, {
    "id" : 21,
    "size" : 9,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 8, 14, 17, 18, 21, 29, 32, 41, 48 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1260,
  "documents" : [ {
    "id" : 0,
    "title" : "Champaign IL State Rep. Adam Brown says, \"99% of my constituency, those who have contacted me, is against gay marriage\". Maybe he needs to hear from a more representative sample of his constituents: staterepbrown@gmail.com",
    "snippet" : "  Most people living in Champaign and Urbana are represented by Naomi Jakobsson, not Adam Brown. Jakobsson is a co-sponsor of the marriage equality bill: http://www.ilga.gov/legislation/BillStatus.asp?DocNum=5170&amp;GAID=11&amp;DocTypeID=HB&amp;LegId=65291&amp;SessionID=84\n\nPlease check which district you are in before writing to ensure that you are writing to your representative. This map shows districts: http://gis.elections.il.gov/map_viewer_update/default.aspx\n\nBrown represents the 102nd district. Jakobsson represents the 103rd. \"To view this content, please install Silverlight\" :(\n\nIs it possible to give a high level summary? i.e. East/West or North/South? This website has the redistricting. You have to scroll down pretty far to see it, but almost all of Chambana is 103rd district. Far east Urbana is 104th, far south and west Champaign are 102nd.\n\nhttp://willcountynewspolitics.blogspot.com/2011/12/realigned-illinois-state-legislative.html?m=1 Thanks for the summary. When accessed from Android the page is nothing but a Silverlight screen.  Sent this:\n\nRepresentative Brown-\nI'm not going to try to change your mind on gay marriage; rather, I have several issues with how you recently defended your position in the press and how you perceive the issue in general. You are quoted as saying: \"“I would say 99 percent of my constituency, those who have contacted me, is against gay marriage...My job is to represent my constituents and uphold what they believe.”\n\nFirst, exaggeration fools nobody. It is statistically impossible that so many of your constituents agree with you, especially in county that voted heavily Democrat in the previous Presidential election. You know this. I realize you qualified the statement with \"those who have contacted me\"--you should expect a lot of dissenting contacts in the near future. \n\nSecond, you shouldn't be allowed to hide behind you constituency's imagined wished in this instance because people's rights should never be put to a vote in the first place. Morality, misguided or otherwise, has no place as the basis for deciding a person's worth as a citizen and a human being; otherwise, what are we left with besides tyranny of the (incredibly slim yet vocal) majority? When gay marriage is legalized it will not be because it is a right grudgingly given, but rather a long-standing oppression finally removed. There is a difference.\n\nWhat consoles me and, I suspect, gay people across the state and around the country, is that despite your obstruction, it simply doesn't matter very much in the long run. Gay marriage will be legal nationwide, and soon. Those who oppose it are simply on the wrong side of history, and every day of delay may be disappointing, insulting, painful...but nothing more than that: a delay. Human dignity and love will win out, and you'll be left to explain your support of intolerance to your grandchildren.\n\nAs I said before, expect many more emails along these lines. If you're an honest man, and I have no reason to believe otherwise, I'd expect you to stand up and defend your position without hiding behind what you've chosen to pretend that your constituents believe.  Sent this:\n\nRepresentative Brown-\nI'm not going to try to change your mind on gay marriage; rather, I have several issues with how you recently defended your position in the press and how you perceive the issue in general. You are quoted as saying: \"“I would say 99 percent of my constituency, those who have contacted me, is against gay marriage...My job is to represent my constituents and uphold what they believe.”\n\nFirst, exaggeration fools nobody. It is statistically impossible that so many of your constituents agree with you, especially in county that voted heavily Democrat in the previous Presidential election. You know this. I realize you qualified the statement with \"those who have contacted me\"--you should expect a lot of dissenting contacts in the near future. \n\nSecond, you shouldn't be allowed to hide behind you constituency's imagined wished in this instance because people's rights should never be put to a vote in the first place. Morality, misguided or otherwise, has no place as the basis for deciding a person's worth as a citizen and a human being; otherwise, what are we left with besides tyranny of the (incredibly slim yet vocal) majority? When gay marriage is legalized it will not be because it is a right grudgingly given, but rather a long-standing oppression finally removed. There is a difference.\n\nWhat consoles me and, I suspect, gay people across the state and around the country, is that despite your obstruction, it simply doesn't matter very much in the long run. Gay marriage will be legal nationwide, and soon. Those who oppose it are simply on the wrong side of history, and every day of delay may be disappointing, insulting, painful...but nothing more than that: a delay. Human dignity and love will win out, and you'll be left to explain your support of intolerance to your grandchildren.\n\nAs I said before, expect many more emails along these lines. If you're an honest man, and I have no reason to believe otherwise, I'd expect you to stand up and defend your position without hiding behind what you've chosen to pretend that your constituents believe.  This is a great letter but have you checked that he is actually your representative? If he isn't, even the best letters will make no real difference.\n\nAdam Brown represents the 102nd district which is far west Champaign (west of Duncan). Most of Champaign-Urbana is the 103rd district and our representative is Naomi Jakobsson, who is a democrat and in my opinion a pretty neat lady overall.  This is a noble effort, but misguided. His statement could be accurate, as he may represent more rural members of the community. Odds are, you aren't his constituents because \n\na: most of you are only temporary residents of Champaign-Urbana for school.\n\nb: if you want to make the argument that state representatives should represent even temporary residents, most of you are probably covered by Naomi Jakobsson - who has already agreed to sign it. \n\nHer page is here, if you'd like to show your support - http://www.facebook.com/pages/Representative-Naomi-Jakobsson/109442605763187?ref=ts&amp;fref=ts        Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt. Based on the map scientific_derp posted the 103rd district starts west of Duncan, which happens to be where I'm from. A significant population lives in that part of town right outside of the city limits.  I think you mean 102nd. Brown represents the 102nd district which is the area west of Duncan and very southern Champaign (possibly Savoy). Almost all of Chambana is within the 103rd district which is represented by Naomi Jakobsson. Very east sections of Urbana are 104th but I'm not positive who their rep is. Based on the map scientific_derp posted the 103rd district starts west of Duncan, which happens to be where I'm from. A significant population lives in that part of town right outside of the city limits.  Based on the map scientific_derp posted the 103rd district starts west of Duncan, which happens to be where I'm from. A significant population lives in that part of town right outside of the city limits.  Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt. Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt. Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt.   ",
    "url" : "http://www.pantagraph.com/news/state-and-regional/illinois/government-and-politics/same-sex-marriage-might-be-harder-to-clear-in-house/article_9bcc9092-7e1c-11e2-8075-0019bb2963f4.html"
  }, {
    "id" : 1,
    "title" : "Unofficial 2013 is this week. Stay safe and know your rights. (re-posting tips from last year's post)",
    "snippet" : "From [last year's post](http://www.reddit.com/r/UIUC/comments/qbya6/lets_get_everyones_unofficial_tips_and_tricks_in/) (by /u/Dalimey100):\n\n1. Safety first and don't be a dumbass, I don't want to see any of you awesome dudes in hospital or handcuffs.\n\n2. If you are under 21, stay away from Green street, its crawling with cops and you can't get into bars now.\n\n3. If you can, buy alcohol off campus. Its significantly cheaper. If you're &lt; 21 and looking for someone to buy for you, ask someone to buy today or early tomorrow, nobody is going to want to buy stuff for other people on Friday.\n\n4. Walk in groups. Crime happens, and there's no easier target than a lone drunkard. Know the numbers of the campus PD and saferides/walks \n\n5. [this](http://i.imgur.com/rdIBH.jpg) gives some great help for dealing with cops and general safety (thanks /u/Helpful_guy).\n\n***\n\n&gt; Being drunk doesn't mean your behavior gets excused by everyone.\n\n\n&gt; Pace yourself. Eat lots. Don't forget about drinking water every once in a while to stay hydrated.\n\n\n&gt; Dont do simple dumb things, remember the age old rule \"Do one illegal thing at a time\" aka dont j-walk, climb shit, litter, etc.\n\n\n&gt; Another big thing is if you have a party to make sure no randoms are coming in. I was at a house party that was busted at Polar Bear (SIUC) this winter and the undercover cop was a woman posing as a sorostitute (minding she was a solid 8.5) so don't assume that kind of trickery does not happen here.\n\n\n&gt; I don't have any tips but the people who really lick their chops over unofficial are the tow truck drivers. If a sign says that you have to meet a certain criteria to be able to park (eg resident) don't risk it. You'll get towed.\n\n***\n\n[Laws to be aware of on Unofficial](http://www.reddit.com/r/UIUC/comments/185pax/any_laws_we_should_be_aware_of_on_unofficial/)   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1953kg/unofficial_2013_is_this_week_stay_safe_and_know/"
  }, {
    "id" : 2,
    "title" : "Volunteer at Read Across America this Saturday",
    "snippet" : "If you aren't too hungover from Unofficial, volunteers are needed at Read Across America this Saturday. It's a great, fun event aimed at young kids (pre-school through elementary, mostly) to encourage an early love of reading. Please consider helping out. If you're a member of a campus group that needs service hours, you can get verification for your time. I've helped with the event probably 5 out of the last 6 years, and it's great.\n\nAs shown in the facebook event page, please contact the volunteer coordinator, Carolee DeArmon (not me, I'm just trying to get the info out there) if you're interested. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/195m74/volunteer_at_read_across_america_this_saturday/"
  }, {
    "id" : 3,
    "title" : "Any redditors looking for roommate/s '13-'14?",
    "snippet" : "Hey r/uiuc! I'm a female going into senior year and I still haven't signed a lease yet for next school year. I'm looking for roommate/s for a house or apartment on/near campus for &lt;$400 rent. Pretty clean and quiet. Non-smoker. Figured redditors would make interesting roommates. So if you're looking, have a room to fill, or know of anyone, please let me know! :)",
    "url" : "http://www.reddit.com/r/UIUC/comments/1959ep/any_redditors_looking_for_roommates_1314/"
  }, {
    "id" : 4,
    "title" : "Found Wallet Sunday West of Bookstore",
    "snippet" : "Hello uiuc reddit, I have found a wallet on campus that belongs to a girl named, Shannon Parish. I tried Facebook to find her with no luck, the internet also turns up no results except for Deans List of some kind of academic excellence. I would love to return this to the owner as soon as possible because I'm sure she is looking for it. If you can give me any information please message me.\n\nTL;DR : Found and want to return a wallet belonging to a, Shannon Parish.  If you search on illinois directory on illinois.edu, it shows up an email address for that user. I don't know if personal information can be listed here so I'll pm you the address as well.",
    "url" : "http://www.reddit.com/r/UIUC/comments/195le5/found_wallet_sunday_west_of_bookstore/"
  }, {
    "id" : 5,
    "title" : "Hey! That's mine....Suspicious Squirrel ",
    "url" : "http://gickr.com/results4/anim_67ba9011-e9d4-de44-6d14-2560e0d231e6.gif"
  }, {
    "id" : 6,
    "title" : "Gave him a popchip outside the Union, and well, once he popped, he couldn't stop",
    "snippet" : "  Don't feed the god damn squirrels...\n\nNext time pop him a molly This is why they attack people... Don't feed the god damn squirrels...\n\nNext time pop him a molly Once I gave one a fruit from my fruitbowl, next thing I had been attacked and the fruit bowl was on the ground being devoured by the devil.   ",
    "url" : "http://i.imgur.com/XWtzFoV.jpg"
  }, {
    "id" : 7,
    "title" : "How is Pearlstein a professor?",
    "snippet" : "I'm using a throwaway because his ability to do calculations to 4 decimal places in his head downright scares me.\n\nBut seriously, this dude is batshit insane, his office looks like a tornado has gone through it (daily, for the past 10 years), and his lectures consist of incoherent rambling and him yelling at people. \n\nAm I getting my first taste of a terrible tenured professor?   What room and time is this class? I'm tempted to sit in just for the experience. MWF, 11 am, MSEB 100. Try not to look him in the eye.  I had him for fluids and he once went off on a kid for asking a question while chewing gum. The man is a genius, and batshit insane is a great way to put it.   Pearlstein is an interesting character.\n\nHad him for ME 300. He changed the problems in the book so that we would have to interpolate every value we got out of the charts for homework. He knew every ones name, and will hand your exam packets to you individually. For exams he will leave the room at the end of class and not accept any more tests after he has left (so get done early, it becomes the hunger games of people trying to put exams in his hands). I would feel like I learned something from each final (that I wished I had known when I was taking it). \n\nBut I did shit on the first exams(thinking back i guess it was average just the grades as a whole were low), managed aced the final and he gave me a good grade in the class so it appears that if he sees you improve/try he can be lenient. I am fairly sure he sets the average to a C- or a C so have fun with that.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/194duh/how_is_pearlstein_a_professor/"
  }, {
    "id" : 8,
    "title" : "FIN 221??",
    "snippet" : "How does everybody like the Fin 221:Corporate finance class. \nI took it, but I didn't like the format of the whole video lectures with discussion. \n\nI felt watching videos didn't make me grasp the class as well, though I did end up doing well.    Could you elaborate a little bit? I was recently admitted to the business minor, so I'll be taking FIN 221 down the road, and would be interested to know how the class is organized.",
    "url" : "http://www.reddit.com/r/UIUC/comments/194ocl/fin_221/"
  }, {
    "id" : 9,
    "title" : "For those who studied abroad, how did you fund it?",
    "snippet" : "I'm wanting to go abroad over winter break, but am trying to figure out how to get the money for it. I was planning on doing the whole 'backpacking through Europe after graduation' deal but don't have the money for that, and this looks like a cheaper option. I currently don't have any loans/financial aid and don't want to jump on that boat first off. Any suggestions or tips?   potatoes   I did a 6-week summer program in Hiroshima, Japan, back in 2010. Apart from my own money and some help from my parents, I was actually able to snag a few scholarships. \n\n* The honors program awarded me $1,000 for the trip. Thanks, CHP.\n* I don't know which office you'll go through, but I studied through IPENG and thus was able to do a fellowship. I got half my airfare covered in exchange for a few volunteer hours and making a tri-fold poster for them to use at study abroad fairs. Things like that may not be available for short programs like what you want to do, but check with whichever office you use to see if they have anything like that.\n* The I4I scholarships are great. I got one for $500 for having a \"unique destination,\" but there are a whole bunch others. Check those out! Apply for them all!\n\nGood luck! kinda a tangent, but how did you like the program? That's actually one of the programs I'm looking at, but I'm trying to gauge if it's worth a couple thousand in addition to a normal tuition year. i'm pretty apathetic about credits, i'm just looking to have a good experience over a summer (or semester) because I've never left the US. It was absolutely fantastic! None of us really knew any Japanese before we went there except a few phrases we'd picked up from anime, but we had a phenomenal Japanese teacher at HIT (the Japanese university), and immersion did wonders for us. (I came back knowing more than enough to test out of JAPN 201 here.) We also took a culture class and a few small engineering seminars that would meet anywhere from once the whole trip or twice a week. We were also able to shadow some of HIT's clubs -- we got to try out kendo, tea ceremony, taiko, and tons more.\n\nThey also took us on weekend outings . We took a day trip to Miyajima where we saw SO MANY DEER and got to climb (for many of us) our first mountain. Another weekend, we went to the city and saw the atomic bomb memorial and museum at the Peace Park. And yet another time we got to visit an okonomiyaki sauce factory and try our hand at making our own okonomiyaki. \n\n[Here's a photo of me climbing that mountain.](http://sphotos-b.xx.fbcdn.net/hphotos-prn1/29322_401086946285_931246_n.jpg)\n\nWe also spent a ton of time shopping, going to karaoke, taking over arcades (seriously, 10 floors of games -- it was heaven), and drinking. We're still close with lots of the kids we met over there, and some of the Japanese kids have studied abroad here to get their own experience. \n\n**tl;dr** Program was AMAZING and I wish I had time and money to go back. Any more questions, ask away. :)   My sister is in Europe now. She worked. She also got scholarships but for the most part she used several years of her savings because it's a once in a lifetime thing. Pretty sure she's been to near twenty countries in her time there. How much money did she save up for it?  Gilman Scholarship. It's a 1 in 3 shot at up to 5,000 if you qualify.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/194cj4/for_those_who_studied_abroad_how_did_you_fund_it/"
  }, {
    "id" : 10,
    "title" : "Carmike Movie Theater?",
    "snippet" : "When did Carmike close? Does anyone know what happened? I bought a 2013 popcorn bucket!!!!!!  It shut down last week. I went and saw a movie there the week before so I know it was open then. I have an annual bucket too and was disappointed when i went to go try and catch a movie. What piqued my interest was how the theater was removed from everywhere online: Imdb, fandango, even carmike's own site don't list the theater as even existing :(\n \nMaybe there will be some opening specials to make up for our lost \"popcorn time\"   May have to do with the construction of the IMAX(I guess BIGD) portion of the theater. Maybe the phase they are in is not suitable to do business. It's supposed to be a major rebuild.  May have to do with the construction of the IMAX(I guess BIGD) portion of the theater. Maybe the phase they are in is not suitable to do business. It's supposed to be a major rebuild.  Isn't the theater in Savoy the one building IMAX? Or are they both? I can't believe we'd get two IMAX theaters in this area... Savoy is getting an IMAX, but they're still open. The one on north prospect is doing a total reconstruction, the whole thing will probably be torn down in a couple of weeks. Also, they're not getting an IMAX, they're getting whatever is one size smaller than an IMAX. I heard the whole thing wont be done until early-mid summer.\n\nI got some buddies that work(ed) at the beverley theater that told me about this stuff. &gt; they're not getting an IMAX, they're getting whatever is one size smaller than an IMAX. \n\nIMAX is about size? I always thought it had something to do with 3D, but now that I think of it, all IMAX theaters I have been to are huge. It's not really about \"size\", especially screen size. Yes, IMAX screens are larger, but can vary from theater to theater. What makes IMAX different is that they use larger film, with different cameras and projectors that lead to larger screen images and higher resolutions. So, the Beverly isn't getting a \"smaller IMAX\", but going with a different film format for their HD movies. &gt; they're not getting an IMAX, they're getting whatever is one size smaller than an IMAX. \n\nIMAX is about size? I always thought it had something to do with 3D, but now that I think of it, all IMAX theaters I have been to are huge. Isn't the theater in Savoy the one building IMAX? Or are they both? I can't believe we'd get two IMAX theaters in this area... Both are. The Savoy theater was open while they were doing the construction, but Beverly will be closed till summer. Open but limited screens. The whole left side is closed. So with no Carmike and limited play times if anyone is planning on seeing a movie they may want to get tickets in advance or show up early. May have to do with the construction of the IMAX(I guess BIGD) portion of the theater. Maybe the phase they are in is not suitable to do business. It's supposed to be a major rebuild.    On the bright side, now that it's closed, no one will get shot there! Beverly is notoriously shady. \nSource: I'm a townie On the bright side, now that it's closed, no one will get shot there! Beverly is notoriously shady. \nSource: I'm a townie ",
    "url" : "http://www.reddit.com/r/UIUC/comments/193458/carmike_movie_theater/"
  }, {
    "id" : 11,
    "title" : "housing and furniture",
    "snippet" : "Is anyone graduating this semester and planning on selling their furniture?\nAlso. is anyone planning on moving out of a furnished studio/one bedroom and can you tell me what the average rent is per month including all utilities?\nThanks!!!\n   [deleted] ",
    "url" : "http://www.reddit.com/r/UIUC/comments/193oe4/housing_and_furniture/"
  }, {
    "id" : 12,
    "title" : "Good Place to eat tonight?",
    "snippet" : "What's a good/interesting place to eat near campus?   If you like barbecue, Black Dog in Urbana is really good. They also have a nice late night menu on the weekends from 10:30pm-2am. What this guy said. The Black Dog is my favorite restaurant. It is seriously good (real) barbecue. The only drawback is it is frequently packed.  If you like barbecue, Black Dog in Urbana is really good. They also have a nice late night menu on the weekends from 10:30pm-2am.   Farren's in downtown Champaign. It's easy to take the bus there. Seaboat on Kirby. Crane Alley in Urbana. Also easy to take the bus there.     You can never go wrong with Dos Reales.     Chopstix for Chinese. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/193tuv/good_place_to_eat_tonight/"
  }, {
    "id" : 13,
    "title" : "My friends made a snow Pikachu!",
    "snippet" : "  I'm so glad it wasn't yellow.  Nice! Now where is this work of art On the quad, by Davenport     ",
    "url" : "http://i.imgur.com/P6jIBNq.jpg"
  }, {
    "id" : 14,
    "title" : "I am an employee of the U of I. Can I score a free (or cheap) copy of office 2013 anywhere?",
    "snippet" : "   Did you log in to the Webstore? Not sure if staff get any discounts.    Here's the webstore link others have mentioned: https://webstore.illinois.edu/Shop/product.aspx?zpid=752  in case you haven't considered, open office is a good alternative. (recently renamed to LibreOffice) Apache OpenOffice is still there. but I use LibreOffice. either is a good free alternative. (recently renamed to LibreOffice)    you should be able to get it for $10 using your illinois.edu email here: http://www.microsofthup.com/hupus/home.aspx?dialect_id=en-US&amp;country_id=US\n\nThis goes for anyone with an illinois.edu email.  Even if you no longer go to the school but have a permanent email that ends in illinois.edu like law.illinois.edu you should be able to get it for $10 using your illinois.edu email here: http://www.microsofthup.com/hupus/home.aspx?dialect_id=en-US&amp;country_id=US\n\nThis goes for anyone with an illinois.edu email.  Even if you no longer go to the school but have a permanent email that ends in illinois.edu like law.illinois.edu  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/19362y/i_am_an_employee_of_the_u_of_i_can_i_score_a_free/"
  }, {
    "id" : 15,
    "title" : "Free Trap and Bass Show Tonight at Cowboy Monkey",
    "snippet" : "Noticed a bunch of people getting in to trap music lately with the explosion of the harlem shake videos. If you like that sound or just want to throw some trap bows it should be a good night of music. \n\nDoors open at 9\nFree before 11pm and $3 After. \n\nMusic from: \n\n* [###](https://www.facebook.com/poundpoundpound/app_108468622525037)\n* [Footwork](https://soundcloud.com/FOOTWORKMUSIK)\n* [Dj Belly](http://djbelly.com/feature/2010/12/07/promo_ep)\n* [The Interns](https://soundcloud.com/the-interns-music)\n* [epilep[c] ](https://soundcloud.com/epilepc)\n\n[Facebook Event](https://www.facebook.com/events/343737649074903/)",
    "url" : "http://www.reddit.com/r/UIUC/comments/1937sp/free_trap_and_bass_show_tonight_at_cowboy_monkey/"
  }, {
    "id" : 16,
    "title" : "The Quad last night.",
    "snippet" : "  FUCK. Did anyone notice that huge, black rocket launching to the west of the Union? How about the UFO if you look straight up?  I found a rip in the space time continuum  - http://imgur.com/Z2AhiRt   Approximately what time did you take this?  I was walking through this area at about 7:30 and it seemed way worse than this.  I was walking from the Psychology Building to ISR and it was so windy that I had to either attempt to run or simply not move.  Was definitely an experience trying to get back to ISR with all of that wind walking through the snow.       ",
    "url" : "http://360.io/BbFfB7"
  }, {
    "id" : 17,
    "title" : "Why doesn't this guy wear shoes in winter?",
    "snippet" : "  Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Doesn't he worry about broken glass along busier streets? Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. &gt;super cool, very chill Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I.  Why don't you ask him? But...it's easier to take a photo from far away and make fun of him online so that I can hide my social awkwardness!  More and more evidence has found that the shape of our bare feet, molded by centuries of evolution, have whittled it down to near perfection. Meaning we don't really need shoes.   probly because he's a smelly hipster from urbana probly because he's a smelly hipster from urbana",
    "url" : "http://imgur.com/ISb5pSz"
  }, {
    "id" : 18,
    "title" : "Holy shit the Illinois Student Senate spent $8000 to provide .7% of undergrads with I-Clickers",
    "snippet" : "   It says they used $8000 to buy 200 iClickers that are about $20 each... what the fuck happened to the other $4000? The ISS bought iClicker 2's, because some classes require the newer version. They cost $40 a piece.\n\nKeep in mind that it's a loaner program, so the iClickers get returned in May and will be reused. Yeah I call bs on the required part. I still use an iclicker 1 for every single one of my classes.  Yeah I call bs on the required part. I still use an iclicker 1 for every single one of my classes.  Yeah I call bs on the required part. I still use an iclicker 1 for every single one of my classes.     If you rent something for free, it's not really \"rent\" anymore, is it?\n\nI also don't know much about these stupid devices, but if every student is required to have one, wouldn't it be simpler for university to give it to students in a centralized way? You want to give a 40 (for new versions) and 20 (for old versions) to EVERY undergrad? That's far more than the money spent here. They could just rent them out for each class that requires them and make buying one optional. Put down a $20 deposit, return it at the end of the semester. You want to give a 40 (for new versions) and 20 (for old versions) to EVERY undergrad? That's far more than the money spent here. Maybe if the university has to pay for them instead of students, they will think twice about whether the clickers are actually useful? Why would the University agree to ever do that?  If you rent something for free, it's not really \"rent\" anymore, is it?\n\nI also don't know much about these stupid devices, but if every student is required to have one, wouldn't it be simpler for university to give it to students in a centralized way?  Of course maybe the school shouldn't allow courses to use a glorified paperweight. iClickers are a good idea... if they're used properly.\n\nUsing them just to take attendance isn't that great of an idea (instead of forcing students to come to class, just ensure that lecture is a good use of their time), but using them to quickly assess if the class is understanding certain material is really nice. \n\nBut this is a bit off the point of what the article is about anyway. Of course maybe the school shouldn't allow courses to use a glorified paperweight. Of course maybe the school shouldn't allow courses to use a glorified paperweight. And mandatory software packs, don't forget that wonderful innovation. Yeah... I bought the required courseware for a Mathematica class I'm in this semester. Haven't used it once. $25 wasted. You know you can use Mathematica for free via EWS computers, right? Yeah, this isn't the Mathematica program. It's just a bunch of lousy Mathematica files that are supposed to teach you how to use Mathematica.",
    "url" : "http://www.dailyillini.com/news/campus/article_7be6f3ac-7cb0-11e2-b09d-0019bb30f31a.html"
  }, {
    "id" : 19,
    "title" : "Racial Intolerance on Campus",
    "snippet" : "I was walking on green and fourth and a couple of guys in a minivan started to yell out their window and say things like \"Nice ass slumdog\" or \"Go back to your shitty country\" etc. This didn't happen just once - they drove back and yelled more racially charged stuff. At this point, It seemed like it was way more than just a \"joke\" or a harmless prank because they actually turned around to come back and say more stuff.\n\nHow many of you guys have been subject to people talking to you like this? This isn't the first time this has happened to me so I'm curious about you others on here.  I'm asian and it's happened to me several times before. Sometimes they yell out of windows of cars or out of balconies. Idk why some idiots do this.   If you remember any identifying information, you might want to consider reporting it. Policies and procedures are listed in the [Campus Administrative Manual](http://cam.illinois.edu/ix/ix-b/ix-b-3.htm), with these excerpts about reporting procedures being relevant:\n\n1. \"Individuals alleging violation of the policies herein are encouraged to report the alleged violation immediately upon experiencing the alleged misconduct or learning of the alleged misconduct. Individuals reporting alleged or suspected violations of this policy during non-business hours or University designated holidays should contact the Office of Diversity, Equity, and Access at (217) 333-0085 or diversity@illinois.edu, or the Emergency Dean at (217) 333-0050 for student-related matters.\" \n\n1. \"Students alleging discrimination or harassment allegedly committed by a student in their capacity as a student may submit a report as specified in this policy or by contacting the Office for Student Conflict Resolution. Such complaints should be referred to the Office for Student Conflict Resolution at (217) 333-3680 or conflictresolution@illinois.edu for investigation and resolution under the student disciplinary system procedures.\"\n\nNot sure what will be the procedure if the offender is not a UIUC student/employee or if you don't know the person and can't identify them.   I'm asian, and I've never been treated like this. Next time this happens, I guess you can call the cops. But if you call the cops, how would it work? You call them and say some people shouted racial slurs from a moving vehicle? Are the cops going to try to find them and chase them in a police car? If they catch them, what will they do? Give them a warning or a ticket? Will they be charged with a crime? What crime? Will it be a misdemeanor? It's probably not worth your time to deal with people like that. But if you really wanted, calling the cops is one thing you can do. If victims started doing that, at least people would be more careful before they bully someone in public.\n\nI'm not sure what the legal consequences would be if they get caught. But I'm guessing it will at least be treated like a verbal abuse or harassment. But if you call the cops, how would it work? You call them and say some people shouted racial slurs from a moving vehicle? Are the cops going to try to find them and chase them in a police car? If they catch them, what will they do? Give them a warning or a ticket? Will they be charged with a crime? What crime? Will it be a misdemeanor?  are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? Don't understand why you're being down voted. Perfect response. For me it's that it sounds just as racially intolerant as the Op is talking about if not even more immature. are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit?  Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. As generalizing as this comment is; there is some truth to it.  I went to high school with a ton of people in a small town near here who would just consider it entertainment to drive down Green Street and yell at people who weren't white.  I would always hear about it in school on Monday.  It was disgusting. Nearly all the people I know who grew up in small rural towns have confirmed this whenever asked about it. Nearly all the people I know who grew up in small rural towns have confirmed this whenever asked about it. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. The farm boy from Fithian, IL who [attacked a Sri Lankan professor at Illinois Terminal](http://www.news-gazette.com/news/courts-police-and-fire/2011-12-08/bond-500000-attack-ui-professor.html) a year back was not all that harmless. You never know what they will do when they are [on meth](http://commercial-news.com/local/x1940557927/County-man-arrested-in-Champaign). Anyone on meth can be dangerous.  Now you're just being racially intolerant of farm boys. It's not the same thing. Yes, anyone on meth is dangerous. However, when that person attacks you because of your race it means you are exposed to danger for your appearance not because you are anybody. What does any of this have to do with farms? There's a stereotype that people from rural areas are racially intolerant. I.e, farm boys will shout racial slurs at you from truck windows.  That's my point, lets stop racial intolerance by perpetuating other racial stereotypes, great plan! 'farm boys' is not a 'racial' stereotype\n If we're getting that specific,  \"Go back to your shitty country\" isn't racist either. 'farm boys' is not a 'racial' stereotype\n Anyone on meth can be dangerous.  Now you're just being racially intolerant of farm boys. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless.  this one time in bandcamp, i had my feelings hurt",
    "url" : "http://www.reddit.com/r/UIUC/comments/191hv7/racial_intolerance_on_campus/"
  }, {
    "id" : 20,
    "title" : "Official Plans for Unofficial",
    "snippet" : "  ",
    "url" : "http://imgur.com/EWw08Tw"
  }, {
    "id" : 21,
    "title" : "Overheard some girl say this on the bus today...",
    "snippet" : "  I'm from the Bay Area, CA so I kind of feel that way actually.. I kind of feel that way too. I'm from southern california, and it will be a normal February day there tomorrow - 76 degrees and partly cloudy. &gt;a normal February day there tomorrow - 76 degrees and partly cloudy.\n\nWeather. I'm from the Bay Area, CA so I kind of feel that way actually.. I'm from the Bay Area, CA so I kind of feel that way actually..  she also said she was from Chicago, so literally no defense. Yeah she wins the dumb ass of the week awkward.  This is probably the most snow I have seen, I am from California though      Sounds like something Perry would say.",
    "url" : "http://imgur.com/ECuAHlC"
  }, {
    "id" : 22,
    "title" : "Scumbag CUMTD",
    "snippet" : "     I swear, in the three years I've been here, not **once** have I ever seen CUMTD display that message when the weather was actually nice (or even sunny, for that matter). I swear, in the three years I've been here, not **once** have I ever seen CUMTD display that message when the weather was actually nice (or even sunny, for that matter).  Haha, I just saw this on the way home. Smartass. It did actually get me to smile, but then I just got mad.   Who controls these messages? I hope the CUMTD employee who posts here sometimes comes to tell us!  CJS7070 is on the right track. All buses are loaded with every possible route destination sign. This includes all of our fixed-routes as well as messages like \"Not In Service,\" \"Training Bus / Do Not Board,\" and the public relations messages you all are referring to. MTD Staff usually review the messages once a year and make edits as needed for a full fleet reload.\n\nOperators punch in the code for the corresponding route they are driving. Dispatchers will alert the fleet if a \"PR\" message is to be added that day. An example is during home games, as darklinggg alluded to, MTD may decide to run the message \"Beat Purdont\" for the next day's football game against Purdue.\n\nDrivers can act on their own will, and sense of humor, and in this case one chose to punch in \"Smile It's Sunny\" during yesterday's winter weather storm. Thanks for the interest and for riding MTD!  Who controls these messages? Who controls these messages? The driver. The mtd has a bunch of pre-loaded messages that the drivers can choose from using the console above their seat.        gr8 job",
    "url" : "http://imgur.com/JeaJ3iN"
  }, {
    "id" : 23,
    "title" : "There is a tiny snowball man congregation on the quad worshipping their larger god.",
    "snippet" : "I figured at least some of you guys would help add to it.\n\nThere's not much snow left to make the snowball men, but go check it out! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/191heo/there_is_a_tiny_snowball_man_congregation_on_the/"
  }, {
    "id" : 24,
    "title" : "Anyone from Bromley have an extra ticket to the Hawks in St Louis next Thursday?",
    "snippet" : "I'm desperately trying to find one. My friend dropped the ball on letting me know when they went on sale to the general student population. If anyone knows anyone who needs to get rid of a ticket, please pm me!  they're not sold out... I called just an hour ago, they said they were. Where do you see they're not?",
    "url" : "http://www.reddit.com/r/UIUC/comments/191syc/anyone_from_bromley_have_an_extra_ticket_to_the/"
  }, {
    "id" : 25,
    "title" : "What my buddy and I did last night.",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/cO5VP7b.jpg"
  }, {
    "id" : 26,
    "title" : "UIUC WinterWonderland ",
    "snippet" : "   ",
    "url" : "http://www.youtube.com/watch?feature=player_embedded&amp;v=B9VVEBMgzSI"
  }, {
    "id" : 27,
    "title" : "Anyone having troubles with the Suburban Express website?",
    "snippet" : "I'm looking to buy tickets for Spring Break, but it always says that there are no trips available. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/191wrk/anyone_having_troubles_with_the_suburban_express/"
  }, {
    "id" : 28,
    "title" : "This greeted me on sixth street when I got off work",
    "snippet" : "  NSFW? Really? Yeah I was at least expecting to see some tits, total letdown.    Did you try and take her home? She was totally askin for it ;)  Then some drunk guy came along and screamed \"Fuck you snowman!\" and pushed it over while his friend screamed \"NOOOOOOOOOO!!!!\"\"\"\n\nThe aftermath: http://i.imgur.com/wnUwZRs.jpg technically it's a snow woman   My roommates+neighbors did that =]\n\nUnfortunately I missed out due to work at a horrible men's basketball game I'm sorry their work was destroyed :/",
    "url" : "http://imgur.com/EtXxVSo"
  }, {
    "id" : 29,
    "title" : "Can anyone recommend a good physical trainer in the area?",
    "snippet" : "Particularly for running injuries.  I've tried the Sportwell Center in the past, but it ended up setting me backwards instead of forwards in terms of injuries.  Carle has a sports medicine department if you were interested in going that route.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/191856/can_anyone_recommend_a_good_physical_trainer_in/"
  }, {
    "id" : 30,
    "title" : "Saw this 6' Snowman celebrating Thirsty Thursday.",
    "url" : "http://imgur.com/zcuCxsA"
  }, {
    "id" : 31,
    "title" : "JOHN DIES AT THE END starts at The Art Co-op tonight at midnight!",
    "snippet" : "For those of you who like Cabin in The Woods and Fear and Loathing in Las Vegas, this movie will be right up your alley. Based on the cult book by John Wong, this movie is absolutely one of the weirdest horror/sci-fi movies to come out in a while. Grab a Soy Sauce from the concession stand, and join in the festivities. A live mentalist will be at Friday and Saturday's midnight shows demonstrating his craft! The Onion calls this movie \"A PUNK ROCK GHOSTBUSTERS BY WAY OF H.P. LOVECRAFT\" Hope to see you there! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/190n0t/john_dies_at_the_end_starts_at_the_art_coop/"
  }, {
    "id" : 32,
    "title" : "View outside 309 E Green Champaign (Snow)",
    "snippet" : "      I would mock your panorama skills, except mine at even worse  This is where I have confirmation that even you Yankees take pictures of snow. Judging by his post history, he's indian",
    "url" : "http://i.imgur.com/uEqvJ2O.png"
  }, {
    "id" : 33,
    "title" : "6 foot snowman by the Krannert Art Museum",
    "snippet" : " ",
    "url" : "http://imgur.com/a/1Fdbz"
  }, {
    "id" : 34,
    "title" : "Dear God that UIUC Harlem Shake video...",
    "snippet" : "Terribly done, poorly edited, and just obnoxious. Makes me embarrassed to say I'm from U of I :/   [This is the video from yesterday on the quad](http://www.youtube.com/watch?v=O6sh487fBPE) They made the video private now. How strange... To hide their shame. [This is the video from yesterday on the quad](http://www.youtube.com/watch?v=O6sh487fBPE) Oh wow, that is pretty terrible.\n\nI did enjoy Bane with the shake weight though.\n\nThat had potential to be pretty awesome, I feel like someone needs to get the raw footage and make one that's a little more.... smooth. Oh wow, that is pretty terrible.\n\nI did enjoy Bane with the shake weight though.\n\nThat had potential to be pretty awesome, I feel like someone needs to get the raw footage and make one that's a little more.... smooth. I thought Bane ruined it for me. \n\nAssuming that's the same Bane as \"Chicago\" Bane, or the guy who does all of the tired and barely relevant Dark Knight parodies, I felt like Bane was a pretty shameless plug for himself. It's also just not funny anymore.   jesus fucking christ is the format really that difficult to follow?   Started from the bottom now we here The worst song possibly in human history.\n That shit is catchy.  Well, that's fitting, because our TV commercials and most everything else are also terribly done, poorly edited, and just obnoxious.     Harlem Shake videos are such a stupid, annoying trend. They all look the same, what's the fucking point? That moment when you realize that you've become your parents.  Harlem Shake videos are such a stupid, annoying trend. They all look the same, what's the fucking point?   This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol You seem pretty upset. This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. You seem pretty upset. This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol Agreed. I guarantee the people that did this video had a blast doing it and do not have any remorse. People need to cool it worrying about a video that will be phased out in a couple weeks. If you are going to be embarrassed by a video that 500 people did in a school that has 10's of thousands of students then you are doing it all wrong.  This is Life, man. Fuckin have fun with it. If this shit is really stressing you out please take a couple deep breaths, close your eyes, and remember what true value you've found along your path. \n\nedit: Lol  At least Orange Krush did a [good version](http://www.youtube.com/watch?v=DQ8QKngspSA).  At least Orange Krush did a [good version](http://www.youtube.com/watch?v=DQ8QKngspSA). ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ycxj/dear_god_that_uiuc_harlem_shake_video/"
  }, {
    "id" : 35,
    "title" : "stream for the basketball game?",
    "snippet" : "anybody have a working online stream for the penn st game?\n  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18zwk8/stream_for_the_basketball_game/"
  }, {
    "id" : 36,
    "title" : "What RSO's are you surprised do not exist here?",
    "snippet" : "Doctor Who or generally any science fiction based club\n\nAnimation - Either for viewing or making\n\nComic Book - reading/collecting/discussing\n\nComputer Support- There are groups on campus that are CS related or employed groups. But not one devoted to \nfixing and maintaining computers pro bono.  &gt; not one devoted to fixing and maintaining computers **pro bono**\n\nBecause CS majors get enough of that from friends and family. &gt; not one devoted to fixing and maintaining computers **pro bono**\n\nBecause CS majors get enough of that from friends and family. also you can't put that on your resume (unless you are applying for a computer fixing job), so no one's interested.  I'm surprised that there is not a Film Society. An older alum (graduated in the 70s) told me that there used to be an extremely active film society on campus. At some point a couple decades later, the film society ceased to exist. I am quite disappointed by this fact, as I love getting together with others to screen films and talk about them afterward. If I were better versed in how one starts an RSO, I would definitely try to get a Film Society going on our campus again. I can't be the only person on this campus who adores all kinds of cinema form classics to Japanese to Eastern European to Experimental film.\n\nWe do have IFV (Illini Film and Video), but they are geared toward making films and videos - not film study and appreciation.\n\nEdit: According to [University Archives](http://archives.library.illinois.edu/archon/?p=collections/controlcard&amp;id=2157), the former Film Society existed form 1955 to 1996, with involvement from Professor Steven P. Hill who passed away in 2010.\n\nAlso, there is the [Chinese Independent Film Society](https://www.facebook.com/UIUCCIFS?ref=stream), but that's a little more specific than what I am seeking. I'm surprised that there is not a Film Society. An older alum (graduated in the 70s) told me that there used to be an extremely active film society on campus. At some point a couple decades later, the film society ceased to exist. I am quite disappointed by this fact, as I love getting together with others to screen films and talk about them afterward. If I were better versed in how one starts an RSO, I would definitely try to get a Film Society going on our campus again. I can't be the only person on this campus who adores all kinds of cinema form classics to Japanese to Eastern European to Experimental film.\n\nWe do have IFV (Illini Film and Video), but they are geared toward making films and videos - not film study and appreciation.\n\nEdit: According to [University Archives](http://archives.library.illinois.edu/archon/?p=collections/controlcard&amp;id=2157), the former Film Society existed form 1955 to 1996, with involvement from Professor Steven P. Hill who passed away in 2010.\n\nAlso, there is the [Chinese Independent Film Society](https://www.facebook.com/UIUCCIFS?ref=stream), but that's a little more specific than what I am seeking. First off, I love you for linking to University Archives. Secondly, I work there, and the date range at the top does not mean that's when the club was active, it just means that's the dates that the material is from. FYI...    Boxing. I know a few people that were on my high school team that want to start one. Tough to get started because you need a gym to train but it is a great sport.  I remember hearing people talking about wanting to start one up, but they were getting some flak from the university for it. We can have a group for every political belief on the planet, every stance on religion, every viewpoint ever. But we cannot have a club that promotes exercising and physical health. The logic is very flawed (unless you consider the constitution but still) . Sure there is a lot of head trauma in boxing but that is in actual fights. You rarely ever get put on your ass training. I see more injuries in football than I do in boxing. Yeah, go figure.  I think the rationale was that it wasn't \"cultured\" enough or some bs like that. We can have a group for every political belief on the planet, every stance on religion, every viewpoint ever. But we cannot have a club that promotes exercising and physical health. The logic is very flawed (unless you consider the constitution but still) . Sure there is a lot of head trauma in boxing but that is in actual fights. You rarely ever get put on your ass training. I see more injuries in football than I do in boxing. In football you have people paid to professionally monitor it all. With Boxing it may be that the school feels that if someone sustains(just one person) a serious injury......the school would be blamed.  The University is not affiliated with any RSO's on campus. If someone were to get injured during boxing the head of the RSO and its board members would be held accountable. All you have to do is make the members sign a contract saying that the RSO will not be held accountable and the the participants accepts all risks. Same thing I had to do in high school for boxing. Though while they have legal distance, anything done by their students on school property still comes back to them. Though there probably still is more to it though.  Though while they have legal distance, anything done by their students on school property still comes back to them. Though there probably still is more to it though.  Who says that a boxing club has to be on school property? Most of my clubs RSO events happen off campus. Boxing. I know a few people that were on my high school team that want to start one. Tough to get started because you need a gym to train but it is a great sport.   Papercraft/origami. More just disappointed than surprised though.\n\nEdit: Would anyone be seriously interested in starting this? We would need 5 officers total, and the President and Treasurer would both have to pass quizzes. I guess the additional 3 unlabeled officers are optional, but would still be good to have. If anyone is interested enough to do it, PM me, and we might be able to get a new RSO going.  Papercraft/origami. More just disappointed than surprised though.\n\nEdit: Would anyone be seriously interested in starting this? We would need 5 officers total, and the President and Treasurer would both have to pass quizzes. I guess the additional 3 unlabeled officers are optional, but would still be good to have. If anyone is interested enough to do it, PM me, and we might be able to get a new RSO going.  Papercraft/origami. More just disappointed than surprised though.\n\nEdit: Would anyone be seriously interested in starting this? We would need 5 officers total, and the President and Treasurer would both have to pass quizzes. I guess the additional 3 unlabeled officers are optional, but would still be good to have. If anyone is interested enough to do it, PM me, and we might be able to get a new RSO going.  I do a ton of papercrafting, if anyone makes this, I'd probably come.\n\nActually, last time I posted an album of one of my models, someone recognized my hall from the background...  I was very surprised there isn't a chess club. There is a chess club on campus:\n\nhttps://www.facebook.com/IlliniChessClub I was very surprised there isn't a chess club.   Animation? Come to acm siggraph! We do 3D animation... or we have in the past and really plan to but those of us with enough experience are way too busy.  Overall probably one of the issues is the amount of people required. You need 5 people with two being treasurer and President.  You actually just need 2, the treasurer and the president. The other 3 authorized agents are optional. \"Step 3- Add your organization roster by providing the names of the president, treasurer, and three Authorized Agents.  You must have 5 members that fulfill those positions\"\n\nBut I have found there wording confusing here and there.  I'm an officer in a RSO and last year we only had the 2 positions officially filled. We had other officers but they weren't registered with the university.\n\nJust because it says you need 5 doesn't mean you actually need 5 :P   Science Fiction based? Isn't that what TechFront is? It meets in the DCL room 1320 on Saturdays. Times I'm not sure of but probably around 5 would be a good time to stroll in and see if people are there.\n\nAnimation well theres Japanese Animation Club (JAC) but thats more of viewing than making. they meet Saturdays in Siebel 1404 from 2-8pm\n\nThose are the ones I know of that seem relevant. Not too sure if those are what you were looking for but I'm sure you might find some kindred spirits there especially whovians. Give 'em a try if you haven't heard of them already :) Sci Fi- Looking at the entry, it's not about Sci Fi. Not all sci fi is about discussing tech. \n\nAnimation- Yeah Japanese animation but nothing western and I feel your basically getting a Japanese club with a hook. So I this case I would say more diversity here.\n\nAnd the last thing, well again there is no official group. Of course these people exist but no RSO does for it. Sci Fi- Looking at the entry, it's not about Sci Fi. Not all sci fi is about discussing tech. \n\nAnimation- Yeah Japanese animation but nothing western and I feel your basically getting a Japanese club with a hook. So I this case I would say more diversity here.\n\nAnd the last thing, well again there is no official group. Of course these people exist but no RSO does for it. Sci Fi- Looking at the entry, it's not about Sci Fi. Not all sci fi is about discussing tech. \n\nAnimation- Yeah Japanese animation but nothing western and I feel your basically getting a Japanese club with a hook. So I this case I would say more diversity here.\n\nAnd the last thing, well again there is no official group. Of course these people exist but no RSO does for it. Science Fiction based? Isn't that what TechFront is? It meets in the DCL room 1320 on Saturdays. Times I'm not sure of but probably around 5 would be a good time to stroll in and see if people are there.\n\nAnimation well theres Japanese Animation Club (JAC) but thats more of viewing than making. they meet Saturdays in Siebel 1404 from 2-8pm\n\nThose are the ones I know of that seem relevant. Not too sure if those are what you were looking for but I'm sure you might find some kindred spirits there especially whovians. Give 'em a try if you haven't heard of them already :) [deleted] ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18zyrm/what_rsos_are_you_surprised_do_not_exist_here/"
  }, {
    "id" : 37,
    "title" : "So how about that crime alert?",
    "snippet" : "A dumpster fire that happened two weeks ago?  I think the Division of Public Safety were thinking, \"Hey, we haven't put out a crime alert in a while.  What can we go with?\"   I thought the same thing too, until I realized that the purpose of the e-mail was to see if anyone recognizes the person in the video.  Think back to the iPad robbery last year - they sent that video out for the same reason.  Besides, arson can be pretty serious (it might have just been a dumpster but fire spreads).\n\nLaugh about it all you want, but ANY police department (including UIPD) relies on the community around them.  While it would be wonderful if UIPD/CPD/UPD/etc. could stop and solve every crime, that's just not practical.  I realize this thread is going to be full of \"UIPD is useless hahaha what a joke\" comments, but this is a pretty good way of handling this situation - which means they're actually addressing the situation.\n\nJust my thoughts on this. But why did they wait two weeks before turning to the community for help identifying this guy?  He has probably already hit the road, especially if he knows cops are looking for him.   Yeah and if this was the summer and that dumpster was near say dried out grass and a tree........\n\n But it isn't...",
    "url" : "http://www.reddit.com/r/UIUC/comments/18zj3y/so_how_about_that_crime_alert/"
  }, {
    "id" : 38,
    "title" : "Graduate housing at UIUC",
    "snippet" : "I'll be joining the MBA program as an international student in the fall, and I'm looking at the different options for housing at UIUC. What would you guys recommend? I'm looking for a cheap, secure place with laundry facilities nearby.  I'm in Daniels Hall, and lived in Sherman Hall as well.  I really like Daniels, it's a pretty big room with your own bathroom. Feel free to PM me with any questions. $752 per month, yikes! That's a lot more than Goodwin-green, is the difference in cost really worth it?  I lived in Goodwin Green apartments my first year of graduate school.  They're not exactly cheap or luxurious, but very secure with good laundry facilities.  They're located right on campus, and I liked that since they are University housing, if I ever had a problem either maintenance or the graduate housing office was on top of it.   I lived in Goodwin Green apartments my first year of graduate school.  They're not exactly cheap or luxurious, but very secure with good laundry facilities.  They're located right on campus, and I liked that since they are University housing, if I ever had a problem either maintenance or the graduate housing office was on top of it.   Thanks! How is Orchard South? I would not recommend Orchard South. Depending on where you live in OS, the laundry building could be 4 blocks away. If you want to live in OD, choose an apartment close to one of the two laundry buildings. If you are going to be here for a couple of years, something on-campus like Goodwin-Green, or something with one of the better landlords (Advantage, Bailey) might be a better idea with regard to ease of getting to classes, being on several bus routes, etc.\n\nHowever, if you are an international student, depending on the country you are from, Orchard Downs might be a better place to stay if you don't know anyone here or there aren't many people from your country. Orchard Downs organizes many [community events](http://www.housing.illinois.edu/~/media/Files/Publications/ApartmentNewsletters/Neighbor-February2013.ashx), so you get to know other people who live there, and you wouldn't feel too isolated or lonely.  Jesus, what a bunch of unsubstantiated crap. Do you have any relevant PERSNONAL EXPERIENCE with any of this? Or are you just flapping your jaw because you like attention from some freshman to be who can't distingush between crap and actual information. Just wondering what your problem is. Jesus, what a bunch of unsubstantiated crap. Do you have any relevant PERSNONAL EXPERIENCE with any of this? Or are you just flapping your jaw because you like attention from some freshman to be who can't distingush between crap and actual information. Just wondering what your problem is.  I live at Indigo Place/The Place at 117. I've lived here for a year and a half, and will be living here for another year and a half. I have not had any issues with management, they have remodeled all of the common areas in the past year (New workout room/equipment, new clubhouse, revamped pool area, repaired hottub, repaved and resurfaced the parking, and got a pimpin new shuttle, which will be running extended hours starting in the fall).\n\nMany of my friends from law school moved to The Village at Colbert Park, but that property is literally adjacent to the train tracks. It may or may not be nicer in terms of the rental units, but it is also more expensive and gets a nasty rumble every few minutes from passing freight. How much is it for a room at Indigo Place? Looks highend.... I think its between 300-500 ish per room, depending on the number of rooms. I have a 3 bedroom to myself (with my wife) for about 1100 a month. This works out to less than 400/room. Oh, ok. Not as expensive as I thought it would be. The reviews I've seen online are a mixed bag, some people are really pleased with the place, others loathe it. I guess the bad reviews are from before the renovations....  Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix If you mean Advantage Properties, I agree. I had zero issues in the two years I lived in one of their buildings. Their apartments have their own washer/dryer, which was really nice. Having covered parking for my car was also a bonus. Internet was included as well. How fast is the internet? I'm living at one of their places next year and I thought they said it's a local company, not like Comcast or AT&amp;T. How fast is the internet? I'm living at one of their places next year and I thought they said it's a local company, not like Comcast or AT&amp;T. How fast is the internet? I'm living at one of their places next year and I thought they said it's a local company, not like Comcast or AT&amp;T. Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix Anything from Advantage Properties is good, if you want to check out the local landlords. They are fair, have decent prices, their units are in good shape, but they are in the quiet (boring) part of town.\n\nIf you are considering UIUC graduate housing...then you should reconsider. Ashton Woods has nice apartments, but they are so far off campus that you need to have transportation figured out way ahead of time. A bike will be fine, if you don't mind biking through freezing wind in the winter. The rest of them are equally far, but decidedly shittier.\n\nI know this isn't much help but I know that a little bit west First Street there are a few buildings that are known to be inexpensive, but I don't know the landlords.\n\nEdit: Yeah, I meant Advantage. Thanks for the fix  Some fraternities allow people to move into the house for a pretty cheap rate. Let me know if you're interested  Look in Champaign - housing is generally cheaper and you'll deal with fewer undergraduate shenanigans. Faron Properties, Wampler, Royce &amp; Brinkmeyer - google them, look at places online, give them a call. As a student, the bus is free, but you can easily walk too - you can be less than a mile from campus, in places and closer to other grad students. It's a whole different world from Campustown or Urbana.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18y84q/graduate_housing_at_uiuc/"
  }, {
    "id" : 39,
    "title" : "Enough with the fucking Harlem Shakes videos",
    "snippet" : "They're seriously annoying.  The only funny one is the one with the black dude pouring milk on his head.  Nobody wants to see you dance around for 15 seconds unless you're pouring milk on your head.  Oh no - this one is funny: http://www.youtube.com/watch?v=Ugl_eAm2OGY Fine.  Milk and bricks in dryers.  You do know you can just not watch them right?  I'd rather have 25 worthwhile links/text posts on the front page than 21 with a few videos of people flailing around like morons, especially on a sub as small as this one.    How do you really feel? I feel like these videos are fucking stupid. I feel like these videos are fucking stupid. But how do you **really** feel?  What about mine, Richie? Fine, you can pretend to be dead too.  That was actually really funny.  I should post it.   English and Poli Sci huh? I'm gunna need you to express your feelings a little bit better than this.  You want me to write you a fucking essay or something?  Unless you're pouring milk on your head I don't want to hear your shitty deadmau5 song.  Not that hard, buddy. If you're going to insult a form of music, at least get the genre right. At what point did I talk about genre in my comment? Deadmau5 and Baauer are different genres... I know it was an insult, but it would be like saying Elton John instead of Metallica.   It's not your fault I feel like it is though because I watched a few of them and that just makes people want to make them more.  but y u mad, tho? le reddit troll strieks agin lelelelel\n\nGo home.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18xzwl/enough_with_the_fucking_harlem_shakes_videos/"
  }, {
    "id" : 40,
    "title" : "EWS checking all lab computers for Keyloggers",
    "snippet" : "So I was working on the 4th floor ews lab of grainger, and two lab guys came around and used a thermal imaging gun to check all the keyboards for key-loggers. They said it was in response to the \"ECE Hacker\". Just thought it was interesting and nice that they're preemptively trying to prevent such things.    Hey, I was one of those guys! \n\nYes, we're checking all the keyboards (and I mean fucking all of them) just to double triple check that there are no more keyloggers in any of our keyboards. We're then putting sweet tamper proof stickers on all of them so we know in the future if they've been opened up. \n\nSomeone said it below, but I'll just confirm what he said so you all know. The thermal gun is used because we're checking for imbedded keyloggers. When you look at a keyboard, you'll see a hotspot at the keyboard controller (as /u/NegatedVoid said, all electronics produce heat when operating). We're looking for another obvious hotspot which would be a keylogger.  How did you get that job?\n He works engineering IT. I do too.\n\nYou can find the application online if you want. haha Yup, and then being promoted to Special Operations!  I got this promotion, but I can't fit a spec-ops shift into my schedule.\n\nI guess I'll never be as cool as cooluke.... Hey, I was one of those guys! \n\nYes, we're checking all the keyboards (and I mean fucking all of them) just to double triple check that there are no more keyloggers in any of our keyboards. We're then putting sweet tamper proof stickers on all of them so we know in the future if they've been opened up. \n\nSomeone said it below, but I'll just confirm what he said so you all know. The thermal gun is used because we're checking for imbedded keyloggers. When you look at a keyboard, you'll see a hotspot at the keyboard controller (as /u/NegatedVoid said, all electronics produce heat when operating). We're looking for another obvious hotspot which would be a keylogger.  Were cu police or police of any sort involved? I was in dcl last night and saw two cops walking about.  Hey, I was one of those guys! \n\nYes, we're checking all the keyboards (and I mean fucking all of them) just to double triple check that there are no more keyloggers in any of our keyboards. We're then putting sweet tamper proof stickers on all of them so we know in the future if they've been opened up. \n\nSomeone said it below, but I'll just confirm what he said so you all know. The thermal gun is used because we're checking for imbedded keyloggers. When you look at a keyboard, you'll see a hotspot at the keyboard controller (as /u/NegatedVoid said, all electronics produce heat when operating). We're looking for another obvious hotspot which would be a keylogger.  How much is the gun?  It'd be cool for Internet cafes. I think about $5K. Kinda of cool but hella expensive, haha. \n\nEdit: \n\nWe borrowed it from one of the engineering departments. No way does Engineering IT have that much expendable cash xD Sure you do. Just don't upgrade your servers for 3 years. Bam! $15k to blow on hookers and a infrared gun. :-P\n\nNo, but really: I bet the F&amp;S guys have them really nice ones too so they can find leaks in the steam lines.\n\nAdditionally, couldn't you find likely targets via the additional current required? If it's putting off detectable amounts of heat, it's gotta bump the power consumption out of spec. mA required is passed over the USB bus IIRC.  What? How do they use thermal imaging to check for keyloggers? We're talking about hardware keyloggers.\n\nI'm assuming they're checking for keyboards that have had one embedded in them. All electronics produce some heat when operating. I have a hard time imagining someone opening up all those keyboards and splicing in keyloggers, but I suppose someone has to check. I'd be more concerned with someone planting a device on the ethernet cable, between the computers and the outlet.\n\nAlso surprised that the keyloggers would generate enough heat, relative to room temperature, to be seen through the keyboard. That's exactly how his keyloggers worked. He opened up a keyboard and then soldered in the keylogger to the controller. It generates heat because its an electronic device, hooked up to power. Oh, and the thermal gun we're using is extremely sensitive. \n\nThe other device you speak of I think is a lot more obvious to find and know about (from the server side). I think from our end we would know if a device like that was hooked up to a computer's ethernet jack.   How you found any more of this dudes key loggers? Also I was at one of the computers while you took a pic of the keyboard. That gun was pretty cool That's exactly how his keyloggers worked. He opened up a keyboard and then soldered in the keylogger to the controller. It generates heat because its an electronic device, hooked up to power. Oh, and the thermal gun we're using is extremely sensitive. \n\nThe other device you speak of I think is a lot more obvious to find and know about (from the server side). I think from our end we would know if a device like that was hooked up to a computer's ethernet jack.   &gt; He opened up a keyboard and then soldered in the keylogger to the controller.\n\nThat seems like a ridiculous amount of risk. How many of these things did he manage to plant? I have a hard time imagining someone opening up all those keyboards and splicing in keyloggers, but I suppose someone has to check. I'd be more concerned with someone planting a device on the ethernet cable, between the computers and the outlet.\n\nAlso surprised that the keyloggers would generate enough heat, relative to room temperature, to be seen through the keyboard. We're talking about hardware keyloggers.\n\nI'm assuming they're checking for keyboards that have had one embedded in them. All electronics produce some heat when operating. This seems like such inefficient and probably ineffective way to check for hardware keyloggers. All electronics give off a little heat. They'd be able to see an unusual heat source inside the keyboard (remember, they probably own a buhzillion of the same keyboards).\n\nI think it'd be much less efficient to actually go around opening them all up. As another poster said, now they're putting tamper-proof stickers on them so they won't have to image again. Huh. I didn't know there was such a thing as a keylogger inside of a keyboard. That wouldn't help against something [like this one](http://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Keylogger-hardware-PS2-example-connected.jpg/175px-Keylogger-hardware-PS2-example-connected.jpg) though. Right, but they can simply order EWS staff to check for them on a regular basis. Perhaps they already do.\n\nThe tamper proof stickers would have to be checked, too. This seems like such inefficient and probably ineffective way to check for hardware keyloggers. We're talking about hardware keyloggers.\n\nI'm assuming they're checking for keyboards that have had one embedded in them. All electronics produce some heat when operating.  ATTENTION. Please Upvote this so people can SEE.\n\nI know these guys probably checked this as well, but whenever you use the computers PLEASE make sure to check the back of the computers to where the keyboard connects to see if there is an attached keylogger. There are many hardware keyloggers that people plug into the USB port and then plug the keyboard into that.\n\nSO if you think anything is weird with how the keyboard is connected....DON'T USE IT  So who is this ECE hacker? Sorry I guess I haven't been keeping up with uiuc news. I know there was some ece hacker like 2 months ago. Is it the same guy? Yep, same guy. Same guy who cancelled that ECE class last semester, glued a professor's/administrator's door shut, and put keyloggers in a bunch of computers in Everitt. \n\nDo some searching on this sub for \"ECE Hacker\" and you'll find the threads. \n\nThe TL;DR is: Guy did stupid shit. Guy thought he was smart shit. Guy got shit on by campus security and FBI. Guy got arrested. Guy posted bail. Guy awaiting trial.  So how did he get the professor's password(s) with keyloggers in the EWS keyboards? So how did he get the professor's password(s) with keyloggers in the EWS keyboards?  So what about software sided keyloggers. It's not that hard to add yourself to the sudoers file and be able to install a daemon keylogger.  Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. Actually on EWS, at least its my understanding that its a pain in the ass to edit the sudoers file.\n\nBesides, you would be crazy to try it. Our linux admin is like a hawk with X-ray vision. And lazors. So what about software sided keyloggers. It's not that hard to add yourself to the sudoers file and be able to install a daemon keylogger. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18wluz/ews_checking_all_lab_computers_for_keyloggers/"
  }, {
    "id" : 41,
    "title" : "Cycling at the ARC when this guy runs by me...triple take that shit.",
    "snippet" : "  High-Altitude training mask..  Yep. Apparently they are gaining popularity. I've seen multiple people using these in the past few weeks.  Are you my mummy? Bravo\n      I always wonder about people who do this: Are they really in good enough shape to benefit from this form of training? ",
    "url" : "http://imgur.com/iGKgusp"
  }, {
    "id" : 42,
    "title" : "For those wondering: Champaign's Unofficial liquor restrictions",
    "snippet" : "  Ohohoh, I'll be having my party in Urbana! what are the restrictions in urbana?   They're not going to allow pitchers for the weekend? I've never been around for this madness in the past. Is that typical?  Not sure that these restrictions will have much impact. It hasn't in the past. I was at U of I the first year they put these extra restrictions in place.  Just pushed partying from the bars to apartment and house parties.   Not sure that these restrictions will have much impact.",
    "url" : "http://www.dailyillini.com/news/campus/article_2369fa70-7b76-11e2-b264-0019bb30f31a.html"
  }, {
    "id" : 43,
    "title" : "Greek Life at UIUC ",
    "snippet" : "Hello redditors of UIUC! \n\nI was accepted into UIUC recently and was wondering about sororities on campus. Is it beneficial to be a part of a sorority or a waste of time? From what I know about the university, it's pretty big into Greek life. Are most people on campus involved in it? Any thoughts? \n   I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  ^^ This is why I wanna be friends with more Pi Phis (assumed from the Ice Cream, am I right?). You seem completely normal and unlike girls from what people consider to be \"top houses\". Shame my house never does anything with anyone but houses I don't like.\n\nWhen it comes to rushing both fraternities and sororities, a lot of people get turned off from it because they see how the people in the \"top houses\" act, and figure that if that's the top, then the ones beneath can't be good. But they're all wrong, because first of all, there are still plenty of great people in top houses, they just aren't seen as much. Secondly the other houses are usually more grounded and aren't all assholes which is the stereotype for guys, and fake for girls. I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  This needs a counter point pretty badly because it's rather skewed.\n\nFirst of all, don't glorify the fact that greek systems are essentially access to a cheating pyramid. The fact that the university doesn't crack down on what is obviously cheating is beyond me. Frats/sororities do not hold to any standard of academic integrity at all. And the minimum GPA is not something all that hard to keep.It's not like you feel pressured to keep that GPA. What's your house's minimum GPA, out of curiosity? \n\nThe job network is rather convenient and does have obvious benefits. However, if you are smart with your connections (which I am not, sadly), you can network in a similar way you could with a fraternity or sorority. Talk to professors, take advantage of research opportunities, get involved in your department. This is a great college and the staff here are well connected in their fields.\n\nDon't start the whole philanthropic causes thing. First of all, a good portion of that money comes from alumn or people outside of the house. It is nice that greek life contributes to \"supplemental things\", but if those \"things\" are really important to you then you shouldn't need to join greek life to participate. Anyone can work in a soup kitchen or run a clothing drives. (Plus, I still firmly believe that habitat for humanity is just a way for a bunch of spoiled kids to have a morally fulfilling vacation in a town. There is nothing unemployed people in New Orleans can't to do build a house that your sorority can, sorry. If anything you're just stealing the jobs and local resources they have.)\n\nThe whole fun paragraph is nothing unique to greek life at all. I guess that was the point of typing it out, but chilling, pranking, buying shit, and pregaming are normal parts of college lifestyle for everyone. However, something not everyone has is the vindictive jealousy that goes with sorority sisters within their own house and at girls in other houses. So be wary of that.\n\nI'm not anti-greek. I have a lot of friends in top houses and I know it's a big part of life here. But I *hate* how the information they give out to draw in new members is skewed. The best piece of advice heander gave you, OP, was give it a try. See if you like it, but be aware that very few girls ever drop out of a pledge class and I don't really want to imagine how their ex-pledge sisters are to them. \n\nBest of luck, OP. Congrats on your acceptance.  I don't disagree with you iam0594. You made a lot of good points! But at the same time any time a person gives their opinion on a subject it will be skewed. I have a bias to being in a sorority because I love being in a house. \n\nI agree that the university is not on top of their game when it comes to \"cheating\" but I know of people who have access to old tests and quizzes just like I do, but instead of getting it from sisters or brothers they get information from friends. I have several GDI friends who pass around all of their information from previous semesters to their friends. How is that any different? I'm just explaining that being in a house has helped me with my school work. My house has a min. GPA of 2.6 (I think?) but some houses have a 3.0 requirement. \n\nWhen it comes to philanthropy when we raised money last semester it was from dinners, ice cream bar and a football tournament. All the money raised was from other students on campus. We weren't asking for donations from our alumni. And I never said that you had to join a house to volunteer and raise money, its just one of that added perks of being in a house. \n\nThe fun paragraph isn't unique to greek life. I completely agree with you on that one, but it is something that I love about being in my house. Any time someone wants you to join a club they're going to list out the benefits of being in a club. This is no different with me and my house. I love the volunteering aspect, I love hanging out, I love being able to go ask older girls in the house for help with school. While you may call it skewed, I'm just explaining why I love being greek. \n\nYou are also correct, very few girls drop out once they're actually in the house. Where most girls drop out is during the actual rush experience.  &gt; While you may call it skewed, I'm just explaining why I love being greek.\n\nRight, and I totally get and appreciate that. I'm not trying to bash you or sorority lifestyles at all. \n\nI'm pretty sure that you'd agree with me that in order for someone in a house to get access to previous tests and homeworks is much easier than it is for someone not in a house. So I guess in a way the main reason they are different is because of how readily available you have access to material you shouldn't. I know lots of people end up with stuff like that anyways and that professors usually change their material to prevent that from being an issue, but I feel like it's more implicit within a house. And not like that's necessarily a bad thing, I could use some answers for my engineering classes myself. But it is present and that's that.\n\nI'm very critical of philanthropy anyways so sorry to sound like I was attacking you on that. \n\nAnd yeah absolutely on you just listing the good sides of joining a sorority. If my sister were to come here and want to join a sorority I would likely tell her she absolutely should. I don't have broad, generalized notions anything against the people in them at all. Sorry if I came of as harsh! I was just defending why I love being in my house, but I can come off too strong to often!  Nope, you were one of the most respectable posters I've seen on here. I refuse to accept your apology.  Can I ask why we're banning Moruitelda? They had an [internet fight](http://www.reddit.com/r/UIUC/comments/18sncm/ruiuc_where_do_you_feel_unsafe_around_campus/c8hu294). Juicy. They should fight irl. I'd watch. Can I ask why we're banning Moruitelda? This needs a counter point pretty badly because it's rather skewed.\n\nFirst of all, don't glorify the fact that greek systems are essentially access to a cheating pyramid. The fact that the university doesn't crack down on what is obviously cheating is beyond me. Frats/sororities do not hold to any standard of academic integrity at all. And the minimum GPA is not something all that hard to keep.It's not like you feel pressured to keep that GPA. What's your house's minimum GPA, out of curiosity? \n\nThe job network is rather convenient and does have obvious benefits. However, if you are smart with your connections (which I am not, sadly), you can network in a similar way you could with a fraternity or sorority. Talk to professors, take advantage of research opportunities, get involved in your department. This is a great college and the staff here are well connected in their fields.\n\nDon't start the whole philanthropic causes thing. First of all, a good portion of that money comes from alumn or people outside of the house. It is nice that greek life contributes to \"supplemental things\", but if those \"things\" are really important to you then you shouldn't need to join greek life to participate. Anyone can work in a soup kitchen or run a clothing drives. (Plus, I still firmly believe that habitat for humanity is just a way for a bunch of spoiled kids to have a morally fulfilling vacation in a town. There is nothing unemployed people in New Orleans can't to do build a house that your sorority can, sorry. If anything you're just stealing the jobs and local resources they have.)\n\nThe whole fun paragraph is nothing unique to greek life at all. I guess that was the point of typing it out, but chilling, pranking, buying shit, and pregaming are normal parts of college lifestyle for everyone. However, something not everyone has is the vindictive jealousy that goes with sorority sisters within their own house and at girls in other houses. So be wary of that.\n\nI'm not anti-greek. I have a lot of friends in top houses and I know it's a big part of life here. But I *hate* how the information they give out to draw in new members is skewed. The best piece of advice heander gave you, OP, was give it a try. See if you like it, but be aware that very few girls ever drop out of a pledge class and I don't really want to imagine how their ex-pledge sisters are to them. \n\nBest of luck, OP. Congrats on your acceptance.  This needs a counter point pretty badly because it's rather skewed.\n\nFirst of all, don't glorify the fact that greek systems are essentially access to a cheating pyramid. The fact that the university doesn't crack down on what is obviously cheating is beyond me. Frats/sororities do not hold to any standard of academic integrity at all. And the minimum GPA is not something all that hard to keep.It's not like you feel pressured to keep that GPA. What's your house's minimum GPA, out of curiosity? \n\nThe job network is rather convenient and does have obvious benefits. However, if you are smart with your connections (which I am not, sadly), you can network in a similar way you could with a fraternity or sorority. Talk to professors, take advantage of research opportunities, get involved in your department. This is a great college and the staff here are well connected in their fields.\n\nDon't start the whole philanthropic causes thing. First of all, a good portion of that money comes from alumn or people outside of the house. It is nice that greek life contributes to \"supplemental things\", but if those \"things\" are really important to you then you shouldn't need to join greek life to participate. Anyone can work in a soup kitchen or run a clothing drives. (Plus, I still firmly believe that habitat for humanity is just a way for a bunch of spoiled kids to have a morally fulfilling vacation in a town. There is nothing unemployed people in New Orleans can't to do build a house that your sorority can, sorry. If anything you're just stealing the jobs and local resources they have.)\n\nThe whole fun paragraph is nothing unique to greek life at all. I guess that was the point of typing it out, but chilling, pranking, buying shit, and pregaming are normal parts of college lifestyle for everyone. However, something not everyone has is the vindictive jealousy that goes with sorority sisters within their own house and at girls in other houses. So be wary of that.\n\nI'm not anti-greek. I have a lot of friends in top houses and I know it's a big part of life here. But I *hate* how the information they give out to draw in new members is skewed. The best piece of advice heander gave you, OP, was give it a try. See if you like it, but be aware that very few girls ever drop out of a pledge class and I don't really want to imagine how their ex-pledge sisters are to them. \n\nBest of luck, OP. Congrats on your acceptance.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.  Your sorority has test files from past upper level physics classes?  Your sorority has test files from past upper level physics classes?  I feel like I can help out a lot here. I'm a physics major and in a house. Seeing as my classes are mainly guys I wanted a way that I could make friends with a lot of girls. I know a lot of people will talk about how being in a house is a \"waste of time\" but its not. Most sororities will have test files where you can look at notes, quizzes, labs, exams and all sorts of helpful information from semesters before. This has helped me out a great deal with homework for whenever I seem to get stuck. The other thing that most people don't understand is that you have to hit a minimum gpa to be in a house. The girls all want you to succeed and so homework and exams will always come before sorority life. \n\nNot even just the school life, but being in a sorority is a great place for networking. I have been offered jobs and promotions from other sisters who are no longer in college. The opportunities gained from being in a house alone makes it worth it. \n\nThis university is really big on greek life, and on a campus a large as our school, being in a house will honestly make the campus feel smaller. I have made so many friends in other houses (both sorority and frat) and its nice being able to walk around campus and run into people you know. \n\nFrats and sororities are super involved in volunteering and raising money for various causes. Most people know little about this. We raised over $10,000 in a semester for our philanthropy. Not to mention we go and read to children every week as well as other supplemental things like working in soup kitchens, clothing drives, and habitat for humanity trips.\n\nNot to mention but being in a house is just fun. We do a lot of activities together like sit down hang out and watch movies, pull pranks on each other, going out, random walmart runs, getting ready for events together and so much more. We're all normal human beings, we just happen to live in a house together. \n\nThere are so many different houses on campus, 18 now and a possibility of 19 next year. There is a unique personality to each house and if its something you're interested in you're bound to fit into one of them! Worst case scenario you can always go through rush, discover that you don't like it and drop. You can even join a house and if its not what you were hoping for (don't get along with the girls, not enough time, decide its not for you, whatever) you can drop. That's the thing, as much as it is a \"commitment\" no one is forcing you do to anything you don't like. \n\nWith that being said, it is a time commitment, at first. The first year you are in the house you will be the most involved. You will have new member meetings, initiation and a lot of other things. As time goes on the house takes up less of your time. Also it is expensive to be in a house. Living in is not cheap (about the same price as the dorms) and there are also dues. But there are dues for any club you join. \n\nI love being in my house, and while I know that most redditors are anti-greek I think you need to just experience it for yourself and then decide.   I'm not in a sorority (dropped after the first day of recruitment, too much \"ra ra sisterhood\" for me), but one of my best friends is. Her biggest complaint to me is that her sisters get kinda catty and jealous if she hangs out with non-house members too often. I personally need lots of time alone. I don't know your personality, but it seems like theres always something you have to participate in in a sorority, which sounds like hell to me. I think that all depends on the house! My house encourages hanging out with non house members. We like being individuals, and by joining other clubs and hanging out with other friends you do just that. Just because you join a house doesn't mean that those girls have to be you're only friends.          It depends on what type of person you are. There are alpha-girl (ultra bitchy, extremely attractive) sororities and there are more average-joe girl sororities. If you can get along with these girls and want to spend a lot of your time with them, +12,000$$, go for it.\n I only know of one sorority that's that expensive. For the most part, they run from $3000-$6000/yr Just a guess but I assume he meant in aggregate.\n ($3k-$6k/year) * 4 years = $12k+\n\n Just a guess but I assume he meant in aggregate.\n ($3k-$6k/year) * 4 years = $12k+\n\n It depends on what type of person you are. There are alpha-girl (ultra bitchy, extremely attractive) sororities and there are more average-joe girl sororities. If you can get along with these girls and want to spend a lot of your time with them, +12,000$$, go for it.\n Not sure why all the downvotes, probably just butthurt alpha-girls. Your implication is absolutely right though: more unique, interesting women that can carry stimulating conversation are probably best not conforming to Greek Life, while averagely interesting or egotistical girls will probably benefit greatly from it. The same can be said for men. It is a masturbational system at its core.   If you've read past posts on this subject, you'll probably find that there is a bias in this subreddit against the Greek life.  \n\nLikely stemming from a systemic and deep seeded jealousy of the popular by the self-depreciative masses that occupy this forum.   If you've read past posts on this subject, you'll probably find that there is a bias in this subreddit against the Greek life.  \n\nLikely stemming from a systemic and deep seeded jealousy of the popular by the self-depreciative masses that occupy this forum.   Downvoted because the truth hurts. No, downvoted because the idea of being \"popular\" because you are in a frat / sorority at a university of &gt;40k students is a relatively bizarre one.  Also, the idea that non-greek people are inherently jealous of you because know other greek people is false. \n ...and you think people actually have these ideas? No, downvoted because the idea of being \"popular\" because you are in a frat / sorority at a university of &gt;40k students is a relatively bizarre one.  Also, the idea that non-greek people are inherently jealous of you because know other greek people is false. \n I agree. Personally, I think it's a lot cooler to make your friends based on interest/personality rather than buy them. But I'm an unpopular god damn independent person so what do I know.  You don't buy your friends when you join greek life. The money goes towards benefiting both the individual and the community. But you wouldn't know that because you probably just judge it based on the actions of a few stupid frat boys and a few catty sorority girls who don't accurately represent greek life as a whole. Well, I chose not to pursue that lifestyle. You don't think kids join that bologna to make new friends when they come to school? It's the same reason people join clubs is to meet new people but they usually don't have to shove out a couple grand for it every so often. However, yeah, I don't know what I'm talking about after being here around these people for six years, having dated someone in a frat, and being friends with people from frats and sororities. God, I'm an idiot! Get a life, me.  I didn't say its for everyone or blame you for not joining it. I didnt tell you to get a life. I was simply pointing out that you are make a rude false assumption about something you aren't apart of.  No, downvoted because the idea of being \"popular\" because you are in a frat / sorority at a university of &gt;40k students is a relatively bizarre one.  Also, the idea that non-greek people are inherently jealous of you because know other greek people is false. \n   If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology. If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology. Almost 50% of my (very large) fraternity is in engineering. Another chunk is MCB. Our house GPA is above the average GPA of non-Greeks on campus - in fact most houses are, and it's in the top third of the school for Greek life.\n\nGet off your high horse, some people just know how to manage their time to include these things. I completely agree. There is a really bad stereotype that all greeks do is party. There are several engineers in my house, as well as bio majors, chem, prelaw, and business. Its all about time management! \n\nHere are some \"fun facts\" about Greek life. \n\nNationally, 71% of all Greeks graduate, while only 50% of non-Greeks graduate.\n\nThe All Greek GPA is higher than the overall collegiate GPA \n\nSince 1910, 85% of the Supreme Court Justices have been Greek.\n\n85% of the Fortune 500 key executives are Greek.\n\nOf the nation's 50 largest corporations, 43 are headed by Greeks.\n\n76% of Who's Who in America are Greek.\n\nAll but two Presidents since 1825 have been Greek.\n\n70% of the U.S. Presidents' cabinet members since 1900 have been Greek.\n\n76% of U.S. Senators are Greek.\n\nBoth women elected to the U.S. Supreme Court were sorority members.\n\nOver 85% of the student leaders on 730 campuses are members of Greek-letter organizations.\n\nLess then 2% of an average college students expenses go towards Greek membership dues. 76% of Who's Who in America are Greek.\n\nSerious Question: What the fuck is Who's Who in America supposed to mean? I just copied this off of a website. I actually have no idea. Shame on me for not being more careful with my sources I completely agree. There is a really bad stereotype that all greeks do is party. There are several engineers in my house, as well as bio majors, chem, prelaw, and business. Its all about time management! \n\nHere are some \"fun facts\" about Greek life. \n\nNationally, 71% of all Greeks graduate, while only 50% of non-Greeks graduate.\n\nThe All Greek GPA is higher than the overall collegiate GPA \n\nSince 1910, 85% of the Supreme Court Justices have been Greek.\n\n85% of the Fortune 500 key executives are Greek.\n\nOf the nation's 50 largest corporations, 43 are headed by Greeks.\n\n76% of Who's Who in America are Greek.\n\nAll but two Presidents since 1825 have been Greek.\n\n70% of the U.S. Presidents' cabinet members since 1900 have been Greek.\n\n76% of U.S. Senators are Greek.\n\nBoth women elected to the U.S. Supreme Court were sorority members.\n\nOver 85% of the student leaders on 730 campuses are members of Greek-letter organizations.\n\nLess then 2% of an average college students expenses go towards Greek membership dues. If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology. If you major  in engineering you wont have time.  If you're not majoring in engineering consider a less expensive university because UI isn't worth it for kineseology.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18vqtw/greek_life_at_uiuc/"
  }, {
    "id" : 44,
    "title" : "Walking into my CS 418 Midterm today. The professor had similar thoughts.",
    "snippet" : "    ",
    "url" : "http://www.quickmeme.com/meme/3say2r/"
  }, {
    "id" : 45,
    "title" : "My buddy's dog ran away",
    "snippet" : "I don't have a picture unfortunately because he's new, but it's a mutt mixed with yellow lab, german shepherd, rottweiler, and husky. It just looks like a smaller and bit furrier yellow lab, and his name is Marley. Any information on a sighting would be appreciated, THANK YOU! \n\nedit: i have a link to a picture of him on facebook: https://www.facebook.com/photo.php?fbid=102341316618243&amp;set=a.102333749952333.4943.100005271246756&amp;type=1&amp;theater  Saw him on Springfield between ~~Sixth~~ Fourth and Fifth.  Almost behind the JSM office.  He was running back and forth in that parking lot on springfield there\n\nUPDATE:\n\nI just searched the square from second and white to fifth and green and did not see any signs of him.  Based on the way he was running from fence to fence in the parking lot (between fourth and fifth on Springfield) at approximately 9:00 PM, I would guess he left the parking lot going north or west.  I'm sorry I can't be of more help, but I hope this gives you something to go on. Sorry I didn't stop him BTW...with no collar I didn't know where to take him (my apartment doesn't allow pets) and I wasn't sure if he had his shots to where I should be holding on to him for an extended period of time       What area was he last seen? Is he wearing collar/tags? he was last seen at 5th and green, but unfortunately he slipped out of his collar. When did this happen? earlier today, not sure the exact time.  Has he been found?     I hope you don't mind, I shared your picture of the dog on my Facebook.  I'm not in Champaign anymore, but I have friends who are.  I also included the phone number listed in the comments. I hope you don't mind, I shared your picture of the dog on my Facebook.  I'm not in Champaign anymore, but I have friends who are.  I also included the phone number listed in the comments.  Any new news? I'm pulling for the pooch.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18uqp6/my_buddys_dog_ran_away/"
  }, {
    "id" : 46,
    "title" : "Hey guys, help me fundraise for the Polar Plunge on March 2nd! All funding goes towards the Special Olympics - Illinois! ",
    "snippet" : " ",
    "url" : "https://www.firstgiving.com/fundraiser/sean-sullivan-6/2013-polar-plunge-decatur"
  }, {
    "id" : 47,
    "title" : "UIUC Professor's study makes popular website io9.",
    "snippet" : " ",
    "url" : "http://io9.com/5985199/how-one-mans-lies-almost-destroyed-the-comics-industry?utm_campaign=socialflow_io9_twitter&amp;utm_source=io9_twitter&amp;utm_medium=socialflow"
  }, {
    "id" : 48,
    "title" : "Hello Music Enthusiasts! Looking to Hear Local Talent? Come Out to Allen Hall, March 8th!",
    "snippet" : "Music for the Masses-a musical RSO- is hosting a show at Allen Hall, showing off the likes of local talent! We hosted an event there a few weeks back and had tons of fun! Here are some photos to prove how awesome it was.\n\nhttp://www.facebook.com/media/set/?set=a.599217350094681.148539.519985618017855&amp;type=3  Is this a new name for Coffee House? It looks like coffee house with slightly less poetry. Is this a new name for Coffee House? It looks like coffee house with slightly less poetry.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18vbet/hello_music_enthusiasts_looking_to_hear_local/"
  }, {
    "id" : 49,
    "title" : "On Saturday at 6PM, the finals of the UIUC League of Legends Championships will take place in Gregory Hall 100! yay esports!",
    "snippet" : "   Congrats to the people who made it. :) Thanks.   smoke weed You better give me some boy. u should use commas  Nothing brings me greater joy than watching a terrible game Nothing brings me greater joy than watching a terrible game Then step up and improve it.",
    "url" : "http://www.facebook.com/events/473422892706243"
  } ],
  "processing-time-source" : 62,
  "processing-result.title" : "uiuc0_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc0_reddit.xml"
  }
}