{
  "processing-time-total" : 1429,
  "clusters" : [ {
    "id" : 0,
    "size" : 7,
    "score" : 35.9531529399353,
    "phrases" : [ "Reddit" ],
    "documents" : [ 17, 22, 26, 38, 43, 45, 49 ],
    "attributes" : {
      "score" : 35.9531529399353
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 35.76483605540786,
    "phrases" : [ "UIUC" ],
    "documents" : [ 5, 7, 16, 35, 38, 45, 49 ],
    "attributes" : {
      "score" : 35.76483605540786
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 74.2627708586058,
    "phrases" : [ "Time to Study" ],
    "documents" : [ 8, 18, 22, 25, 26, 28 ],
    "attributes" : {
      "score" : 74.2627708586058
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 52.151696921469586,
    "phrases" : [ "Bike" ],
    "documents" : [ 0, 16, 33, 43, 46 ],
    "attributes" : {
      "score" : 52.151696921469586
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 111.33489649757483,
    "phrases" : [ "Final Exam Grade" ],
    "documents" : [ 1, 9, 18, 19, 28 ],
    "attributes" : {
      "score" : 111.33489649757483
    }
  }, {
    "id" : 5,
    "size" : 5,
    "score" : 30.08456771335748,
    "phrases" : [ "Website" ],
    "documents" : [ 13, 19, 22, 34, 47 ],
    "attributes" : {
      "score" : 30.08456771335748
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 36.32451692957609,
    "phrases" : [ "Number of Times" ],
    "documents" : [ 10, 39, 41, 43 ],
    "attributes" : {
      "score" : 36.32451692957609
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 37.97818837916008,
    "phrases" : [ "Champaign" ],
    "documents" : [ 7, 23, 26 ],
    "attributes" : {
      "score" : 37.97818837916008
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 43.058434921264,
    "phrases" : [ "Crime Alert" ],
    "documents" : [ 0, 11, 16 ],
    "attributes" : {
      "score" : 43.058434921264
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 79.13202131129644,
    "phrases" : [ "Suburban Express" ],
    "documents" : [ 29, 36, 37 ],
    "attributes" : {
      "score" : 79.13202131129644
    }
  }, {
    "id" : 10,
    "size" : 2,
    "score" : 41.31626448875071,
    "phrases" : [ "Clear" ],
    "documents" : [ 14, 43 ],
    "attributes" : {
      "score" : 41.31626448875071
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 61.57466173510342,
    "phrases" : [ "Kid Asked him for Money and Left" ],
    "documents" : [ 26, 39 ],
    "attributes" : {
      "score" : 61.57466173510342
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 43.70683820716016,
    "phrases" : [ "Planning on Asking" ],
    "documents" : [ 12, 46 ],
    "attributes" : {
      "score" : 43.70683820716016
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 68.13159592676276,
    "phrases" : [ "Springfield and Mathews" ],
    "documents" : [ 14, 16 ],
    "attributes" : {
      "score" : 68.13159592676276
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 45.24760763386921,
    "phrases" : [ "Streets" ],
    "documents" : [ 24, 39 ],
    "attributes" : {
      "score" : 45.24760763386921
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 37.71258524135624,
    "phrases" : [ "Team" ],
    "documents" : [ 42, 45 ],
    "attributes" : {
      "score" : 37.71258524135624
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 46.7515015822141,
    "phrases" : [ "Text" ],
    "documents" : [ 0, 6 ],
    "attributes" : {
      "score" : 46.7515015822141
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 72.7692530963719,
    "phrases" : [ "Tip Insomnia Cookies" ],
    "documents" : [ 4, 26 ],
    "attributes" : {
      "score" : 72.7692530963719
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 61.704941917506446,
    "phrases" : [ "Urbana Police" ],
    "documents" : [ 16, 33 ],
    "attributes" : {
      "score" : 61.704941917506446
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 52.96454715530703,
    "phrases" : [ "Vector Marketing is a Scam" ],
    "documents" : [ 10, 44 ],
    "attributes" : {
      "score" : 52.96454715530703
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 34.10565023935181,
    "phrases" : [ "Woman" ],
    "documents" : [ 0, 30 ],
    "attributes" : {
      "score" : 34.10565023935181
    }
  }, {
    "id" : 21,
    "size" : 10,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 2, 3, 15, 20, 21, 27, 31, 32, 40, 48 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1367,
  "documents" : [ {
    "id" : 0,
    "title" : "Obvious boil",
    "snippet" : "\"Obvious growth or boil\"\n\n\nhttp://illinois.edu/lb/article/2668/69792  A childhood [nightmare](http://a69.g.akamai.net/n/69/10688/v1/img5.allocine.fr/acmedia/medias/nmedia/18/84/79/40/19758817.jpg) is what came to mind when I read that description...\n A childhood [nightmare](http://a69.g.akamai.net/n/69/10688/v1/img5.allocine.fr/acmedia/medias/nmedia/18/84/79/40/19758817.jpg) is what came to mind when I read that description...\n  hilarious that this guy didn't run from a fat homeless lady covered in boils.  hilarious that this guy didn't run from a fat homeless lady covered in boils.  [deleted]  Why can't the other robbery victims provide detail like this? [deleted] It could just be that crime alerts can only comment on race, gender, and whether or not there are boils. &gt;...and whether or not there are boils.\n\nI've yet to read a crime alert indicating that the offender \"had no boils to speak of\".  I think if I had my wallet stolen by the person described here I would have kept it to myself.  &gt;offender left the area walking Waddling probably more accurate ?  Boilll!!!\nhttp://imgur.com/GM7TW This is the first thought that popped into my head. I'm still giggling about it.   If some creepy lady with a knife approached me, I'd probably run like fuck, not stick around long enough to give her my wallet and let her walk away. Knowing that I can outrun my friend while he races me on his bike, I believe I could probably outrun most people trying to chase me.  I would most definitely run as you said.  Some people aren't very fast when running, though, so that may have been a motivation to just hand over the wallet. HEY GUYS I\"M REALLY FAST! Why when I say things like this do people take it out of context?  I'm not bragging.  I'm simply saying that some people are fast and some people are slow.  Not everybody should run.  That's all I was trying to say. Most students can probably run faster than an overweight forty year old homeless woman. I realize this.  In fact, I implied this.\n\n&gt; Not everybody should run.\n\nI swear you feel like I'm a douchebag or something.  I'm really not at all.  I'm a nice, agreeable person.    Out of curiosity, how many of you would have tried to fight her or run away? I think I would have fought her as she walked away. Out of curiosity, how many of you would have tried to fight her or run away? I think I would have fought her as she walked away. I carry pepper spray for this reason. Would I have used it? My guess is that I would probably be too busy being dumbfounded.  What brand do you carry? Have you ever used it? Pepper spray tends to blow backwards into your face so I wonder how effective it will be if used. If someone threatened me with a gun I think I would be very unlikely to aggravate them by using pepper spray; I would probably give them whatever they wanted. \n\nIf you lose your wallet you lose the cash (and maybe a good wallet); all the cards can be canceled (I would *really* miss all the loyalty cards from various cafes though). If you lose your cellphone it's a few hundred dollars. None of these are worth risking bodily harm for.  Out of curiosity, how many of you would have tried to fight her or run away? I think I would have fought her as she walked away. I've seen all these crime alerts the last few months, and been getting increasingly paranoid...\n\nI've started wearing a level 3A bulletproof vest and riot gear under my winter clothes. I also carry fox labs pepper spray and a 2.75\" folding knife and ball peen hammer. I'm also 6'1\" 200lbs.\n\nSomeone tries to mug me, they are going to have a seriously bad day. I've seen all these crime alerts the last few months, and been getting increasingly paranoid...\n\nI've started wearing a level 3A bulletproof vest and riot gear under my winter clothes. I also carry fox labs pepper spray and a 2.75\" folding knife and ball peen hammer. I'm also 6'1\" 200lbs.\n\nSomeone tries to mug me, they are going to have a seriously bad day.  Why wasn't this crime alert sent out via text message like the last one? I have wondered this as well. My guess is that the offender was not considered a huge risk to everyone else. A gun wielder is cause for more lockdown type response which is what Illini-Alert is. I have wondered this as well. My guess is that the offender was not considered a huge risk to everyone else. A gun wielder is cause for more lockdown type response which is what Illini-Alert is. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14xvcs/obvious_boil/"
  }, {
    "id" : 1,
    "title" : "What is the most heavily weighted final you have this semester?",
    "snippet" : "My Chem 102 final is worth 37.5% of the grade.  I'm surprised no one has posted about law finals yet.\n\n100%, by the way. Wait...seriously?  Good lord, I'm so very happy I chose a second round of undergrad rather than a JD. I'm surprised no one has posted about law finals yet.\n\n100%, by the way.  My CS final is worth a whopping 5 percent 398?  398?  I'm in 398 too From what I hear, the TAs in 398 are very handsome and intelligent. They're brilliant. It's a running joke that the course staff was handsome 15 years ago, but aren't now. My CS final is worth a whopping 5 percent Give me your classes.  My Math 220 final was worth 45.5% taking into account that the grade I get on the final also replaces my worst test grade. Wow. That's brutal. I wonder if there is a max percentage that instructors can weigh an exam...  Wow. That's brutal. I wonder if there is a max percentage that instructors can weigh an exam...  My Math 220 final was worth 45.5% taking into account that the grade I get on the final also replaces my worst test grade. You have murphy too? How was it? I really like him, definitely my favorite professor for the semester. He's good at explaining things and his tests are always straight forward.  Sorry meant how was the final, I'm taking it Friday. It also looks like I just took a chem 202 final with you too O_O I answered your question this morning when I was deliriously tired haha sorry for misreading it. I thought it was really easy but I also studied quite a bit. It's pretty much what you would expect. Really if you just study the hour exams you'll do fine. How did Chem treat you? My Math 220 final was worth 45.5% taking into account that the grade I get on the final also replaces my worst test grade. Math 220, how I miss my 5 credit hour A+. Best of luck!  ECE 313 final. 45%. Also the final has negative marking. Why must they do that to us? WHO GIVES MULTIPLE CHOICE WITH NEGATIVE POINTS FOR GUESSING???   40% in a math class I'm taking.      TAM 251 - 30%\nMATH 415- 42%\nIE 300 - 50% My IE 300 final was only 25% of my grade.  I take it you didn't have Dr. Sowers?          Standard 20%. I think anything higher than 25% is crazy. Standard 20%. I think anything higher than 25% is crazy.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14zbss/what_is_the_most_heavily_weighted_final_you_have/"
  }, {
    "id" : 2,
    "title" : "Abusing the transitive property",
    "snippet" : "    ",
    "url" : "http://imgur.com/z7Ujh"
  }, {
    "id" : 3,
    "title" : "Found I-card and key near Stoughton and McCullough",
    "snippet" : "The card belongs to Ann M Ferguson from the University of Illinois at Springfield. If you can put me in contact with her please PM me. (I do not have facebook, so my capabilities to reach her are limited)\n\nThanks.  Also not to knock you, but don't put peoples names out like that.  Also not to knock you, but don't put peoples names out like that.   [She doesn't exist in the directory...](http://illinois.edu/ds/search?skinId=0&amp;search=Ann+Ferguson&amp;search_type=all) That's the Urbana-Champaign directory, not Springfield. Springfield doesn't have students in their online directory. Oh whoops. I misread that as the card was found by Springfield (Avenue). Thanks for looking anyway. take it to the iCard office in the bookstore Ok. Will do. [deleted]  You still trying to find her? I attended a CC next to UIS for a year and have a handful of friends there who may be able to track her down. As of right now, yes. I am still trying to find her. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14yb48/found_icard_and_key_near_stoughton_and_mccullough/"
  }, {
    "id" : 4,
    "title" : "Delivery food",
    "snippet" : "What is everyone's opinion of the best delivery food on campus? Obviously excluding jimmy johns.  Wingin Out. They have free delivery. I always hate that. There's no such thing as free delivery, because you gotta tip. Wingin Out. They have free delivery. Yeah but their food is expensive as hell. $6.50 for 7 wings? No way in hell am I paying nearly $1.00 per wing.    Chopsix.  Dont know how many times I have placed an order and they tell me Ill get it in about 45 minutes only to have someone call me within ten minutes saying my food has arrived. I'm a sucker for their ho fun. Very surprised the first time I got it; wasn't expecting much from a late night chinese place.    I have a tip (no pun) for anyone ordering delivery: Instead of ordering off eatcu, just call the actual place! You will get your food faster and you will never have an order that was lost or \"didn't go through\".\n\nTo answer your question, I like me some DP Dough   Insomnia. Warm cookies on demand. Insomnia. Warm cookies on demand. do they still have seven hour delivery windows Insomnia. Warm cookies on demand.  geos",
    "url" : "http://www.reddit.com/r/UIUC/comments/14yg61/delivery_food/"
  }, {
    "id" : 5,
    "title" : "anyone else feel like this?",
    "snippet" : "    Are...  Are we not supposed to smoke during finals week?\n\nUh...  Hm.  Hmm.  Oops.  kinda.... mines more like this http://i.imgur.com/GOi0p.jpg I feel like I don't see many Ent related posts here. This needs to change.  uiuc subreddit == mostly engineering kids == as a general demographic, no love for trees == the downvotes your comment got\n\nEDIT: in this forum ==, not = lol     ",
    "url" : "http://i.imgur.com/twmF6.jpg?1"
  }, {
    "id" : 6,
    "title" : "Which one of you guys was texting Brandon Paul during his twitter text thing?",
    "snippet" : "  I am liable for at least one, possibly two, of those messages. He answered 100 duck sized horses by the way.  What if he gave different answers to different people, just to throw us off the trail?  Yeah... *roommates*... right guys?   [I thought I was being so creative...](http://imgur.com/74bS0) ",
    "url" : "http://www.youtube.com/watch?v=ClJPoTpYaEM&amp;feature=youtu.be#t=01m41s"
  }, {
    "id" : 7,
    "title" : "UIUC Grad Launches CliQs for iOS in Champaign",
    "snippet" : "  ",
    "url" : "http://techli.com/cliqs-champaign-startup"
  }, {
    "id" : 8,
    "title" : "Anyone have an ECE 290 study guide?",
    "snippet" : "Anyone have an ECE 290 study guide? It would be really helpful to have the info in a single place.     What's stopping you from making one? No point in making a study guide the day before the exam.  I'll respectfully disagree with that. Going through your notes and the book, organizing the material, and writing a study guide is a very good way to study (at least for me). In fact, it's usually all I do to study. By the time I'm done I've usually already committed it all to memory. If not, I can look over the study guide I just made. :D\n\nEdit: Spelling. Unfortunately I have tried doing just that before, and my brain doesn't work the same as yours.  No point in making a study guide the day before the exam. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14yi1o/anyone_have_an_ece_290_study_guide/"
  }, {
    "id" : 9,
    "title" : "Anyone else take their math 241 final in the Animal Science Lab? How awesome was that?",
    "snippet" : "Did that TA get a ticket?\n\nTo bring everyone up to speed... the building was locked so the majority of the people taking the exam (and the TAs administering it) were locked out of the building until ~6:52. I come back after going to the bathroom to hear some siren blaring from the TA apparently messing with the projector. After that, a lady cop shows up and proceeds to write said TA a warning or something.\n\nThan I got buttplowed by the exam.  &gt; Then I got buttplowed by the exam\n\nI know that feel all too well. thanks for fixing than v. then in your quote. I'll leave it for the embarrassment.  The building was locked? Did they unlock it so students could get in?\n\nI assumed that \"ticket\" was just some bureaucracy measure to record who tripped the alarm, not an actual punishment of any kind.   I took mine at 100 Noyes.  It was a blazing inferno, as if they didn't think the exam alone was going to make us all sweat.  It wasn't that bad, just kidding I bs'ed a good 6 problems I lost a negative on the damn Stokes' problem ... also ... how do you have a minimum with a gradient =/= 0? I thought that was against the laws of math. it is?  Unless it's a function in x,y,z because if I remember correctly only fx and fy have to equal zero. I lost a negative on the damn Stokes' problem ... also ... how do you have a minimum with a gradient =/= 0? I thought that was against the laws of math.  HA! I was there for that. The alarm was going off for like a solid 4 minutes, and somehow through all of that the test was only delayed lby 5 minutes...\n\nAnd then you had that random person who finished in literally 48 minutes... Seriously though.\n\nI guess I would've gotten buttplowed by the exam if I had continued to stay with Boca and go to his lectures. Protip: Don't go to Boca unless you can learn by yourself. It was exactly 48 minutes too. That was freaky. I wonder when grades will go up.  Seriously though. I can't really complain, I left a little over 1:15 from the start of the test. Pretty sure I was one of the first 10-15 people done.   I was in the room at about 6:35.  Did the rest of you not use the north door?  Wasn't there, but I'm one of the leaders of a large RSO and we deal with CITES equipment all the time.\n\nThe University takes it seriously if you mess with the projectors and shit and you aren't supposed to have access. Authentication involves a keycode that you input, which unlocks the cabinet. The problem is that CITES equipment sucks ass and is unreliable, and will sometimes go off even when you're supposed to have access. (Also, keycodes can be up to 12 digits long and there's, of course, no room for error when you input them) This means that they can and will go off at random times, especially if the person operating them is inexperienced. Uh, I work at CITES and all of our equipment is locked with  4 digit codes. Also, we respond to problems very quickly, so I'm guessing you have us confused with another department... Very quickly? Just last week an alarm went off during a club meeting, and it took about 1.5 hours for somebody to show up; by that time, the alarm had stopped on its own. When was this club meeting?\n\nedit: never mind, did some creeping, and I can now make my argument.\n\nIf your meeting is on a Saturday: we don't have techs working then. There are people we can call to take care of it, but it's on their time off. Why it took 90 minutes is beyond me.\n\nIf something goes wrong: 9/10 times, it's the user's fault. I say that not because I'm being condescending, but because almost every time I've had to go out in the field to respond to \"something isn't working,\" it's because the user doesn't know how to properly operate our equipment. Either you're doing something wrong, or someone who used the class previously was messing with equipment they shouldn't have been messing with.\n\nIf you're inexperienced: we offer training. You can meet with someone to go over how to properly use the equipment. It takes a half hour, and you learn some basic troubleshooting. That being said...\n\nIf you're an undergrad (which you apparently are): **you don't have access to that equipment.** CITES equipment is for grad students &amp; faculty only. This is why there is an alarm panel or padlock; only they can request access to it. You shouldn't be able to access the equipment. You can hire an operator to come to meetings &amp; oversee that equipment is working properly, or you can have a grad/faculty member that's been trained be there with you.\n\nAlso, our access codes are only 4 digits long. I don't know where you're getting a 12 digit code from.  Haha, nice! \n\nJust got [OWNED!](http://img.photobucket.com/albums/v672/jordanmacdonald07/Fatboy_reacts.gif) I didn't respond to him because most of what he said was based on inaccurate assumptions and I don't have the energy or willpower to have keyboard wars during finals week. Actually, your first post was full of inaccurate assumptions, starting with the assumption that the equipment you're using is supported by CITES.\n\n1. None of our equipment uses 12 digit codes.\n2. The equipment does have room for error when entering codes. If you enter it wrong, the alarm panel still displays a red light, indicating that it's still armed. It doesn't go off unless you open it while it is armed.\n3. Our alarms don't go off at random. They go off when a) someone opens the cabinet without disarming the system or b) when one of the sensors detects something is off (equipment stolen, cabinet door gets jostled, etc).\n\nWe both work at CITES so we know the equipment.  I suppose its easier to ignore the problems than to actually fix them. Very quickly? Just last week an alarm went off during a club meeting, and it took about 1.5 hours for somebody to show up; by that time, the alarm had stopped on its own. Yes, very quickly. When we're in our office (usually until 9PM), we'll get calls from our alarm company if an alarm goes off. As thencomesdudley also mentioned, if you're setting off the alarm that means you shouldn't be there. When we distribute codes they come with detailed instructions on how to use them. Why shouldn't we be there? We had the room reserved through FMS. We didn't have access to the CITES stuff for this particular event, but we didn't even touch it; it just went off by itself. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14xlwf/anyone_else_take_their_math_241_final_in_the/"
  }, {
    "id" : 10,
    "title" : "Just doing my civic duty.",
    "snippet" : "   Domain name  ಠ_ಠ  Can someone explain this things to me. I know they are a scam, but what exactly is the scam? For example, if I called that number and took the 'job' what series of events would follow? they don't do anything illegal, but they are very good at taking advantage at loopholes and tricks. It is a sales job.\n\nFor example, everyone gets accepted to the job. I was an assistant manager for them, and I can answer anything you'd like. \n\nThey are backed by the better business bureau because everything they do is lawful. \n\nHowever, they are quite good at brainwashing and tricking you into giving your own, unpaid time. \n\nthey give you all the money they say you will. appointments take about an hour, and you do indeed get 17 dollars per appointment you do. \n\nHowever, you spend a long time trying to get each appointment. \n\nYou start off with 3 days of unpaid training, and at the end, you get a sample kit of knives worth about 500 bucks. I think you get it for free now, but they used to charge you 150 dollars for the kit. It was a security deposit, so you can get all your money back if you want if they do charge you. You can sell it back to them at full price if you ever want to stop. \n\nAfter your unpaid training, you start with \"practice appointments\". You read out of a book to your family and family friends, and at the end of the appointment, they buy something, or they don't, but regardless you get paid 17 dollars. To get appointments, you just call people you know. at the end of appointments, you get \"refereces\" (leads) from your appointments, and you spread out from there. \n\nOnce you get out of training, there is a \"optional\" weekly meetings, and further training sessions, all unpaid and on your own time. You don't have to go to them, but it is frowned upon if you don't. \n\nYou start earning 10% of your sales, average sale being about 200 dollars. Once you sell over 1000 dollars in total sales, you go up to 15 % or something of your sales, and your percentage keeps going up until about 50%. However, the average sales rep only gets to about 3000 in total sales before quitting, making about 400 dollars on average. \n\nSo, in the end, they do everything they promise, but it's a lot of your own time you need to invest before you can make anything. You don't get paid unless you do appointments. \n\nOh, and the assistant managers get shit on by everyone else (that was me) so don't give them hassle and go in for an invterview just to yell to everyone that its a scam. \n\nI worked 70 hour  weeks and got shorted about 2000 dollars for the summer I worked, and ended up losing money that summer. So don't shit on the managers. Ever. I worked hard as shit just to get stabbed in the back. You can feel free to hate the company for not telling you everything but don't go in and give the managers a hard time. please. they don't do anything illegal, but they are very good at taking advantage at loopholes and tricks. It is a sales job.\n\nFor example, everyone gets accepted to the job. I was an assistant manager for them, and I can answer anything you'd like. \n\nThey are backed by the better business bureau because everything they do is lawful. \n\nHowever, they are quite good at brainwashing and tricking you into giving your own, unpaid time. \n\nthey give you all the money they say you will. appointments take about an hour, and you do indeed get 17 dollars per appointment you do. \n\nHowever, you spend a long time trying to get each appointment. \n\nYou start off with 3 days of unpaid training, and at the end, you get a sample kit of knives worth about 500 bucks. I think you get it for free now, but they used to charge you 150 dollars for the kit. It was a security deposit, so you can get all your money back if you want if they do charge you. You can sell it back to them at full price if you ever want to stop. \n\nAfter your unpaid training, you start with \"practice appointments\". You read out of a book to your family and family friends, and at the end of the appointment, they buy something, or they don't, but regardless you get paid 17 dollars. To get appointments, you just call people you know. at the end of appointments, you get \"refereces\" (leads) from your appointments, and you spread out from there. \n\nOnce you get out of training, there is a \"optional\" weekly meetings, and further training sessions, all unpaid and on your own time. You don't have to go to them, but it is frowned upon if you don't. \n\nYou start earning 10% of your sales, average sale being about 200 dollars. Once you sell over 1000 dollars in total sales, you go up to 15 % or something of your sales, and your percentage keeps going up until about 50%. However, the average sales rep only gets to about 3000 in total sales before quitting, making about 400 dollars on average. \n\nSo, in the end, they do everything they promise, but it's a lot of your own time you need to invest before you can make anything. You don't get paid unless you do appointments. \n\nOh, and the assistant managers get shit on by everyone else (that was me) so don't give them hassle and go in for an invterview just to yell to everyone that its a scam. \n\nI worked 70 hour  weeks and got shorted about 2000 dollars for the summer I worked, and ended up losing money that summer. So don't shit on the managers. Ever. I worked hard as shit just to get stabbed in the back. You can feel free to hate the company for not telling you everything but don't go in and give the managers a hard time. please. thanks for the explanation!  Can someone explain this things to me. I know they are a scam, but what exactly is the scam? For example, if I called that number and took the 'job' what series of events would follow? [Here you go](http://www.reddit.com/r/UIUC/comments/14qbj4/vector_marketing_is_a_scam/). i don't see the answer to the question on that thread. i'm also curious The thread I posted is full of people talking about Vector Marketing, which I assumed was the scam referenced in this thread.  I could be wrong.  Some of the comments which answer showmeurmoves' question were downvoted below the threshold, so you may want to go back and look. The thread I posted is full of people talking about Vector Marketing, which I assumed was the scam referenced in this thread.  I could be wrong.  Some of the comments which answer showmeurmoves' question were downvoted below the threshold, so you may want to go back and look.  ",
    "url" : "http://www.imgur.com/11Z64.jpeg"
  }, {
    "id" : 11,
    "title" : "CSL Vandalized",
    "snippet" : "Earlier today I received an email with the following:\n\n\"We're sorry to inform you that CSL was vandalized last night and many office door locks, and the north and south outside card readers, were destroyed. The offices affected were those on the southwest corridor of floors 2, 3, and 4.\"  What is up with all the shit that happened last night? I got the Illini-Alert about the armed robbery near Springfield and Matthews, my roommate was mugged walking home, and now this? wait he was mugged? or was that person in the alert him? He was mugged and no crime alert was sent out about it.  He ended up with a nice gash in the back of the head, we had to take him to the hospital to get it stapled shut.  This happened near Illinois and Coler. why wasn't there a crime alert about it? that actually sounds worse than what happened to that other guy  Maybe people were breaking into their professors' offices to change their grades and/or get exam answers.\n Are people actually that desperate to pay $30,000 then not learn? Are people actually that desperate to pay $30,000 then not learn?  misleading title, thank god Collegiate Starcraft 2 League is fine misleading title, thank god Collegiate Starcraft 2 League is fine j j misleading title, thank god Collegiate Starcraft 2 League is fine It seems that you are using a nontraditional definition of \"fine\"...   What's going on with all of these crimes? Can anyone explain the sudden increase? What caused it?\n\nI spend most of my days at Siebel and park at that lot behind NCSA. I don't get out until night time and I feel like it's only a matter of time until I get mugged.\n\nAs an improvement today, I saw 3 cops on my way from Grainger to the parking lot tonight, one of which was patrolling inside the lot.   Which building is the CSL? Which building is the CSL? Which building is the CSL? i read your post as \n&gt;how do i use google? i read your post as \n&gt;how do i use google? just fucking tell this man what CSL stands for",
    "url" : "http://www.reddit.com/r/UIUC/comments/14wqof/csl_vandalized/"
  }, {
    "id" : 12,
    "title" : "AMA Request: Someone who has ran multiple sessions on Compass 1G at the same time",
    "snippet" : "Is it possible?    AMA? Really?\n\nWhat are you planning on asking them, other than \"how do you do it\"? AMA? Really?\n\nWhat are you planning on asking them, other than \"how do you do it\"? Whether they would fight 1 duck-sized horse or 100 horse-sized ducks. I'd do one duck sized horse. It's smaller, and there are less of them. AMA? Really?\n\nWhat are you planning on asking them, other than \"how do you do it\"?  My school has no sense of humor.  Yeah, you just have to right click on the file you want to open and click on \"open in new tab\". I've had 10+ tabs of Compass 1G open sometimes.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14wy70/ama_request_someone_who_has_ran_multiple_sessions/"
  }, {
    "id" : 13,
    "title" : "Spring semester housing?",
    "snippet" : "Does anyone know when they will have the new assignments ready? Can't find anything on the housing website.   [deleted] Aren't we all looking for love? [deleted]  Like a room change? Usually happens a few weeks into the semester See my comment above.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14xpw6/spring_semester_housing/"
  }, {
    "id" : 14,
    "title" : "Sorry, but this doesn't exactly seem like an \"all clear\" to me...",
    "snippet" : "  hahahha, i saw the email subject, read the email, and then had to double check i was reading an email titled \"All Clear\" nice username by the way Did... did you just compliment yourself? Was this a 'meant to compliment myself with an alt account' fail? nice username by the way Huh? What? [deleted] [deleted]   You should probably continue to avoid Springfield and Mathews until the suspect is aprehended.     I interpreted it as \"all clear...to run and lock the doors and lock yourself in your room and not be able to concentrate on studying anymore because you are only 4 blocks away from that shit and you're dead now anyways so fuck you.\"  ",
    "url" : "http://i.imgur.com/hPEvT.png"
  }, {
    "id" : 15,
    "title" : "Thoughts on working student patrol for UI Police?",
    "snippet" : "http://www.dps.uiuc.edu/universitypolice/student.patrol.html\n\nI am interested in getting a job and would love to do something that I feel contributes more to society than the average job available here.\n\nThen again with all the robberies occurring that go unresolved would working for UIPD really be a learning experience.\n\nIf anyone has suggestions otherwise let me know. If any of you have worked for DPS please post your thoughts!  Maybe you should pass on the police force and become a masked vigilante instead.  It would spice up the Illini Alerts a little.  Not a bad gig. I can assure you it's more aimless walking than anything. You see some shit but it's not as if it's constant or anything other than drunken stupidity, really. The police radio is nice; you can listen to all the local PD ops. Go for it, you can always quit if you don't like the job  Does anyone actually use it? I have used SafeRides extensively, but never SafeWalks. Many people I know will talk to a friend to feel safe while walking alone late at night. I also carry a security whistle on my keychain. Does anyone carry pepper spray? Does anyone actually use it? I have used SafeRides extensively, but never SafeWalks. Many people I know will talk to a friend to feel safe while walking alone late at night. I also carry a security whistle on my keychain. Does anyone carry pepper spray? I think it is also just general patrolling, not necessarily escorting anyone around. But then again, I have never used it myself. What exactly is the point of that? (srs) What exactly is the point of that? (srs)",
    "url" : "http://www.reddit.com/r/UIUC/comments/14wo7t/thoughts_on_working_student_patrol_for_ui_police/"
  }, {
    "id" : 16,
    "title" : "Armed Robbery at Springfield and Mathews",
    "snippet" : "\"Suspect fled Southbound armed with handgun. Avoid area. More information to come.\"   Yeah, that's freakishly close to the obviously large population currently at Grainger. Yeah, that's freakishly close to the obviously large population currently at Grainger.  \"Suspect is a black male, twenty years of age, medium build, crew cut haircut, last seen wearing a brown waist length coat.\" I feel like that's the description for every crime alert.... I feel like that's the description for every crime alert.... \"Suspect is a black male, twenty years of age, medium build, crew cut haircut, last seen wearing a brown waist length coat.\" \"Suspect is a black male, twenty years of age, medium build, crew cut haircut, last seen wearing a brown waist length coat.\"  Are there any statistics on how many of these crime alerts ever get resolved? I feel like they probably never catch any of these people.  Are there any statistics on how many of these crime alerts ever get resolved? I feel like they probably never catch any of these people.  I feel like based upon the descriptions it's the same guy most of the time, so that doesn't help people feeling like things are ever being resolved. Well the descriptions are \"black male\".  Hey there was one white guy a couple weeks ago! Are there any statistics on how many of these crime alerts ever get resolved? I feel like they probably never catch any of these people.   That's near my apartment D: Right off the Bardeen Quad too. Bet it was some poor sap coming back from Grainger. Poor guy never had a chance, thanks finals.  That happened right as I leaving MEB from my final... walked right back in MEB  Did I grow up in Beaver Cleaverville, or is the University PD completely ineffective at fighting crime, despite their prodigious drinking ticket-writing skills? [deleted] Taking officers off beer patrol and jaywalking enforcement, and putting them on *real* cop duties would be a good start.  Trouble is, there's no revenue to be had in preventing violent crime. Email the school and tell them that. The more obnoxious emails we send to the university police department AND administration, the better\n DO NOT waste your time emailing U of I Police Department. They investigate their own problems. Think that's effective? It's not. Also not effective: contacting UIUC administrators. If you want a meaningful response, mail or email your elected representatives. Did I grow up in Beaver Cleaverville, or is the University PD completely ineffective at fighting crime, despite their prodigious drinking ticket-writing skills? From what I've seen, unless you're biking/driving like an asshole, underage with alcohol, or in possession of serious amounts of pot, the UPD doesn't really do anything. Ex: I don't recall there being a follow-up to the armed robbery at cafe paradiso last year, or any of the break-ins/arsons this year.  From what I've seen, unless you're biking/driving like an asshole, underage with alcohol, or in possession of serious amounts of pot, the UPD doesn't really do anything. Ex: I don't recall there being a follow-up to the armed robbery at cafe paradiso last year, or any of the break-ins/arsons this year.  From what I've seen, unless you're biking/driving like an asshole, underage with alcohol, or in possession of serious amounts of pot, the UPD doesn't really do anything. Ex: I don't recall there being a follow-up to the armed robbery at cafe paradiso last year, or any of the break-ins/arsons this year.   To be honest, I'm kind of expecting to get mugged at some point in the next 3(/4) years.  So I'm not going to be too surprised when it happens. Eh. You should be fine. When I was on campus, I'd go for walks late at night all the time, and I've never had anything worse than some shady guy trying to convince me to give him gas money in exchange for a ride to wherever I was going. You kinda figure out which areas are more or less dangerous and, hopefully, you'll develop a sort of sense for when you need to gtfo a place real quick-like. Also doesn't hurt to be big. Hit the gym. Yeah, if you're big enough people will actually avoid you on those late night walks. Yeah, if you're big enough people will actually avoid you on those late night walks. Eh. You should be fine. When I was on campus, I'd go for walks late at night all the time, and I've never had anything worse than some shady guy trying to convince me to give him gas money in exchange for a ride to wherever I was going. You kinda figure out which areas are more or less dangerous and, hopefully, you'll develop a sort of sense for when you need to gtfo a place real quick-like. Also doesn't hurt to be big. Hit the gym. [deleted] [deleted] [deleted] To be honest, I'm kind of expecting to get mugged at some point in the next 3(/4) years.  So I'm not going to be too surprised when it happens. I was just mugged tonight. Out of the hospital with 3 staples in my head. No crime alert on me since it was in Urbana... stay safe, don't walk alone why was there no crime alert? pics? Seriously, \"pics?\" Hell no. This was technically off campus (Illinois and Coler) so no crime alert.\n\nedit: I was hit with a baseball-sized rock on the back of my head. I can't even see them. why was there no crime alert? pics? [There was one](http://illinois.edu/lb/article/2668/69790). Check your email. That wasn't me Oh I thought he was responding to the OP. I am so sorry about your experience. Were Urbana Police not able to assist you? They were, there was just no further correspondence after I talked with an officer. They were, there was just no further correspondence after I talked with an officer. It's in the [News Gazette](http://www.news-gazette.com/news/courts-police-and-fire/2012-12-15/police-investigate-mugging.html) today. Staples in your head must be much worse than being robbed of your cellphone or wallet; I hope you are doing better now. That area is slightly off-campus but not an area where I would expect a violent crime to occur. I am surprised we didn't get an Illini Alert because we keep getting alerts about incidents near First and John which are equally far from campus. It's in the [News Gazette](http://www.news-gazette.com/news/courts-police-and-fire/2012-12-15/police-investigate-mugging.html) today. Staples in your head must be much worse than being robbed of your cellphone or wallet; I hope you are doing better now. That area is slightly off-campus but not an area where I would expect a violent crime to occur. I am surprised we didn't get an Illini Alert because we keep getting alerts about incidents near First and John which are equally far from campus.  That is one ~~ballsy~~ stupid criminal.  Grainger is right there, and the campus police station is a block away... He got away. Maybe he was carrying a fake moustache with him.  Right by Uni High!  This was incredibly comforting while I was in Siebel Why comforting? Was it because the suspect fled southbound instead of northbound?   I appreciate the 2 chainz lyrics in your name    Fuck It, Let's Just Ban Guns!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/14vkl0/armed_robbery_at_springfield_and_mathews/"
  }, {
    "id" : 17,
    "title" : "If you do this, especially during finals week... FUCK YOU !",
    "snippet" : "  I might just be a dick but I'd have no problem telling someone to go sleep somewhere else if the place is packed and people don't have enough room. If there are plenty of empty spaces then I wouldn't bother him.  I might just be a dick but I'd have no problem telling someone to go sleep somewhere else if the place is packed and people don't have enough room. If there are plenty of empty spaces then I wouldn't bother him.   Passive aggressive everywhere   I prefer the people who scatter as much shit as possible over the desks at grainger and then leave for a half hour I prefer the people who scatter as much shit as possible over the desks at grainger and then leave for a half hour      there is actually a couch if he went to the 2nd floor    Does being a passive-aggressive pussy who would rather take a photo of him and upload it to Reddit rather than just confront the guy make you feel better about it? Does being a passive-aggressive pussy who would rather take a photo of him and upload it to Reddit rather than just confront the guy make you feel better about it?  where is this? Agricultural Engineering and Sciences Building on the south quad.  People forget about us southerners from time to time.    At least it wasn't Jason. ",
    "url" : "http://i.imgur.com/IeYgq.jpg"
  }, {
    "id" : 18,
    "title" : "Anyone up for a healthy debate on if finals should be worth more or less of your grade?",
    "snippet" : "I'm currently staring down 2 finals that are worth 35% of my grade (math 241 and phys 213) and one that's worth 30% (history 141... puke).\n\nAfter looking back on the hellish semester I've had, I've started to fall in to the thinking that finals are worth too much of my grades. \n\nI look to the real world, and I feel like people learn and become familiar with what is important to them at the time (just from observing some family in the workforce.)\n\nAm I just being a bitch? I'm actually most stressed about my history exam ... lame I know. \n\nWhat's everyone's thoughts on this? I'm not the type that's always saying hard work should be worth more (GPA v. ACT, for example, I take the ACT side), but in this case, I am.   this is procrastination at its finest  this is procrastination at its finest   My MATH 285 final is worth 50% of my grade...30-35% sounds amazing compared to that oh.. yeah.. that'll be fun next semester. My Math 285 final was worth 5% of my grade so... depends who you have teaching it. Manfroi? I thought he was a great professor. I didn't take the final because I had an A without it (well, I had to show up and write my name on the exam, but I didn't have to take it).\n\nOf course, my not having to take the final isn't the reason I thought he was a great professor, but it certainly helped, haha. Manfroi? I thought he was a great professor. I didn't take the final because I had an A without it (well, I had to show up and write my name on the exam, but I didn't have to take it).\n\nOf course, my not having to take the final isn't the reason I thought he was a great professor, but it certainly helped, haha. My Math 285 final was worth 5% of my grade so... depends who you have teaching it. dafuq? Dammit how did I get stuck this 50% nonsense dafuq? Dammit how did I get stuck this 50% nonsense We had three Exams plus the final. Whichever you scored lowest on was worth 5%, the others were worth 25% each. Remaining 20% was HW. Ah that's so nice! We have 10% HW, two exams 20% each and the final. I've done pretty well so far but the final could possibly throw away a whole semester. I guess my prof is a bit of a dick who is your teacher? i'm talking 285 now also oh.. yeah.. that'll be fun next semester. The first 2/3 of the class is alright. Of the last 1/3 I've understood basically nothing.\n\nPHYS 213 on the other hand, I had no idea what was going on from the start Oh god, I was so depressed about that class, until I talked to other people and realized nobody really has any clue what's going on (213) Oh god, I was so depressed about that class, until I talked to other people and realized nobody really has any clue what's going on (213) The first 2/3 of the class is alright. Of the last 1/3 I've understood basically nothing.\n\nPHYS 213 on the other hand, I had no idea what was going on from the start 213 makes sense to me for some weird reason. I should get an A in that and 212 if I don't severely fuck up the finals. You're gonna get an A in 212??!?!?! Please become my best friend and tutor me How are you with Calc 3? If the answer is very good I'll trade an hour or so of tutoring today for my 212 services. I'm decent.  Depends on the subject area. My MATH 285 final is worth 50% of my grade...30-35% sounds amazing compared to that My MATH 285 final is worth 50% of my grade...30-35% sounds amazing compared to that      I think what you're beginning to realize is the overstressing of college and GPA and such things.  http://www.youtube.com/watch?v=xl7R8xIxzKI       History 141, really? That's nothing to complain about at all. Koslofsky is an awesome teacher and I got through all the 100s and 200s without opening a book. All you need to do is take notes and pay attention to pass those classes. Too bad that's not my professor. Ah, I just know he teaches it. If you have that chick shes crazy and I dislike her. Still didnt have to put much of an effort forward in her class though either. Yeah... Crowston. I just haaaaate the format of the exams. I don't know if you know but it's all based on these \"ID\" terms.. and each exam draws from a pool of like 50. So it's pretty much, learn ALLLLLLL 50 of these terms like the back of your hand so you can talk about 3 of them in a lot of detail. I just overloaded my semester and a history class (a subject which I'm already bad at) is not what I need to be worried about when I'm dealing with some BS weedouts.  I'm a first year law student right now, my final exams are between 80-100% of my grade. So....man up, study your ass off, take your exams, and quit complaining. Be thankful you got into Aerospace engineering at U of I and keep working your ass off because you're going to be in a great position when you graduate.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14vs9r/anyone_up_for_a_healthy_debate_on_if_finals/"
  }, {
    "id" : 19,
    "title" : "Are professors allowed to do this...?",
    "snippet" : "We've had 3-4 assignments and a midterm and the professor isn't telling us our scores for them. Is this allowed? Does the professor not think that the students have a right to know how well they did on assignments or midterms? This seems a bit ridiculous to me...\n\nEssentially we'll get a final grade in the course and then not know *why* we got the grade that we did. Final grades haven't been posted yet either so I guess we have to wait until December 26th? \n&gt;Your course grade has been registered with the university system. It will NOT show up on Compass, nor will the final exam or assignment scores. \nGenerally the class performed very well. 66% earned 90% or better.\nALL the points for the semester have been recorded in an offline, inaccessible file in the possession of the professor. This Compass website will NOT be updated any further.\n\n-Professor Jon Solomon of CLCV 114  I'm in that class and all of my grades are on compass except for the score for the last midterm. It's a CITES problem where some students' gradebooks weren't updating properly all semester and he had said to contact him if your grade wasn't working. Your end of semester class quiz attendance stuff is uploaded? I don't think it is Your end of semester class quiz attendance stuff is uploaded? I don't think it is Your end of semester class quiz attendance stuff is uploaded? I don't think it is You really were so quick badmouthing the Prof. Amazing. I'm in that class and all of my grades are on compass except for the score for the last midterm. It's a CITES problem where some students' gradebooks weren't updating properly all semester and he had said to contact him if your grade wasn't working.  Don't hate, Jon Solomon is the man. But this is a dick move Yeah, I like him. His passion on the subject makes his lectures very interesting. Good class overall but c'mon what's so hard about uploading some damn grades   I took CLCV 116 last semester with Solomon and all of our grades (homework, quizzes, papers, and both exams), were put into Compass. I'm not sure why things are different for this class. I'm curious as well. If he has the grades elsewhere it can't be too hard at all to upload them straight to compass from their spreadsheet. He's a great lecturer and I like his passion on the subject but he needs to work on his organization, I wouldn't be surprised if he lost some of the in class assignments and that's why he's not going to upload the grades (he'll probably give everyone a 100) That honestly might be it. Also, did your class have any TAs? We had 2 TAs who did the grading all the grading of papers and homework.  It's probably so people don't start blowing it off if they know they're going to get an A. \n\nI'm fairly certain professors are required to let their students know how they are doing periodically, so email him for your grade and hopefully you will get a report. It's probably so people don't start blowing it off if they know they're going to get an A. \n\nI'm fairly certain professors are required to let their students know how they are doing periodically, so email him for your grade and hopefully you will get a report.   Wow, dick move Mr. Solomon.\n\nYeah, I'd contact the CTE.\n\n[edit] I've emailed the CTE about the validity of contacting them in general. I'l let you guys know if it's the right place.     If you think that's bad, one of my physics classes we know essentially nothing about the weights of our grades in the class. We know that the labs make up 20% of our grade...and that's it.\n\nSomehow one midterm + homework + final adds up to 80% of our grade. Are things curved? Don't know. Is the class on the standard scale? Who knows?! The professor certainly doesn't. When my final grade is published it's going to be like Christmas...where the present has the potential to melt my face off.  Have you even checked your \"My Grades\" link on compass, you sound awfully huffy puffy for someone who probably didn't check all of their resources.\n\nMy grades are showing up just fine for that class including the midterm, I simply think he means that the FINAL exam grade will not be shown which isn't that big of a deal considering you're going to see your final grade and you can calculate your score range from that. Yeah, I did check the \"My Grades\" link on compass. The Final exam grade isn't up and neither are 3-4 of the end of class assignment grades. \n\nI need to have him put those grades up because I've had problems with him already. The first in-class quiz he gave me a 0 even though I had turned it in. I understand it's a large class but losing my quiz and then giving me a zero isn't tolerable (wouldn't give me the points back, I still have a zero and it's been 2 months since my complaint. I emailed him twice). Hm, yeah, dunno, I only ever dealt with the TAs for grading, as he said they were responsible for all of it.  You would probably have had better luck if you went through them first. Some of my assignments had 0's that I turned in as well. I still had the files (some as far back as from the 2nd week of class) and just shot the TA an email with the file attached and the grade was updated. \n\nThe in-class quizzes are only worth 2 or 3 points as well but yeah sucks if your grade depends on those points.  I had that guy back in 2006.... he pulled the same shit then too.  Good Luck ...  [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/14uxho/are_professors_allowed_to_do_this/"
  }, {
    "id" : 20,
    "title" : "How does our individual semester printer balance work?",
    "snippet" : "I'm a bit new to this. Do we get a certain amount of money allotted to an account or do we have to pay for whatever we use? How do we pay for this if we go over? And how do we check these sort of things? Thank you for any help!   You get 300 a semester as an engineer. Technically they give you money ($24) and then each page of black and white costs $0.08, and each color page costs $0.32. You can check it [here](https://my.engr.illinois.edu/login.asp?/printing/index.asp). Also, even if you print double sided, like most of the printers default to, they still charge you for two pages even though you only get one sheet of paper. And you must print from an ews computer. When I was there, 2 double-sided pages (1 sheet) counted as 1.  It did last year and the year before.  It used to say that on the EWS site too, but it appears to have been removed..so maybe they changed it. Double sided pages count as two pages even though the printing stations say 10/5 cents per page they actually charge per side.   You get 300 a semester as an engineer. Technically they give you money ($24) and then each page of black and white costs $0.08, and each color page costs $0.32. You can check it [here](https://my.engr.illinois.edu/login.asp?/printing/index.asp). Also, even if you print double sided, like most of the printers default to, they still charge you for two pages even though you only get one sheet of paper. And you must print from an ews computer. See below. You seem to be mistaken, my friend. They charge by the pieces of paper, not the number of sides you print on.  I'll check... But i'm pretty sure that this was recently changed. I print out lecture notes for my calc class. Each lecture is 6 pages (single sided). When I print double sided (3 actual sheets of paper). I'm still charged for 6. Look again. You should see that you were charged $0.24 for those 6 page (assuming they were black and white). I only know this because I just checked my quota when I sent that message and I printed a whole bunch of files on Friday. Yeah, you're right. :)        It's always painful to listen to engineering tour guides show prospective freshman around the EWS labs and say \"If you are engineering you get 300 free pages!\" while neglecting the extra few thousand dollars you pay in tuition. Those are some expensive pages! Hey you could be an MCB major, pay the same amount in tuition and get 0 free pages... Fucking college of LAS..",
    "url" : "http://www.reddit.com/r/UIUC/comments/14vm9w/how_does_our_individual_semester_printer_balance/"
  }, {
    "id" : 21,
    "title" : "South Side Express an Alternative to LEX",
    "snippet" : "  Have these guys actually been around a while? I've literally never seen their buses around campus before. That's because [according to USDOT](http://safer.fmcsa.dot.gov/query.asp?searchtype=ANY&amp;query_type=queryCarrierSnapshot&amp;query_param=USDOT&amp;original_query_param=NAME&amp;query_string=2036378&amp;original_query_string=LTJ3%20VIP%20TOURS%20&amp;%20SHUTTLE%20SERVICE) they only have three 'power units' and four drivers. \n\nIt looks like the guy runs the bus company [Southside Express](http://SOUTHSIDEEXPRESS.NET) ([and LTJ3](http://www.ltj3viptoursshuttleservice.com/)) out his house.  The [mortgage assigned to the address](http://www.co.champaign.il.us/recorder/online.htm) the company is registered is in his (and presumably his wife's) name.    inb4 \"avoidsouthsideexpress.com\", etc.",
    "url" : "http://www.southsideexpress.net/"
  }, {
    "id" : 22,
    "title" : "If you can read this, stop procrastinating on Reddit and get back to studying for finals!",
    "snippet" : "But seriously, I've been at ACES library for an hour now and I just opened my book.   I'm an alum! You can't tell me what to do! I'm an alum! You can't tell me what to do! One of us can't, but all of us....we'll just see.  We want a 12-page paper, MLA cited and footnoted.  Your topic is the classic 80s TV show, \"Who's the Boss.\"  Required: to empirically prove that Angela was the Boss.\n\nDue on Monday.  You'd better get going, assuming everyone else agrees that you should share our misery. Community reference? I'm an alum! You can't tell me what to do!  You know, I *could* shut down the subreddit for a day or two...\n\nBut TBH i'm too stressed from my own finals to bother. ARggggggg. Plus there's so much more reddit than just this subreddit....can you shut down reddit? Shut .. down .. EVERYTHING!!! Mod is on powertrip, I declare a coup d'etat. You just want another title for your flair. Shut .. down .. EVERYTHING!!!   I think I'll just reddit and watch an entire season of some random show on netflix instead. :)  http://imgur.com/tJmVi  I'm in Grainger right now. I'll be the one on Reddit.          Try using a timed website blocking app. I've been using one on and off today and have gotten so much more shit done than usual. I've been using SelfControl (http://selfcontrolapp.com/), but I'm sure there are others out there too.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14st4l/if_you_can_read_this_stop_procrastinating_on/"
  }, {
    "id" : 23,
    "title" : "Grad student looking for a cat sitter over winter break- can pay!",
    "snippet" : "Hey all, \nI'm going to be gone from CU for about two weeks and I'm hoping that I can find someone (preferably another student, but would be happy for help from anyone) to either check in on my kitty or even perhaps just let the little guy stay with them for the two weeks. He's adorable, used to living with other animals, and not needy or destructive. I can offer some payment, although not a ton as I'm a generally poor grad student. Thanks a ton!  Make sure to check with [this redditor](http://www.reddit.com/r/UIUC/comments/13br4w/looking_for_a_pet_sitter_over_winter_break_im/).   If my roommate weren't allergic to cats I'd totally try to help you out. I'll at least upvote so more people can see this.  Wow I really wish I was staying in Champaign this break.  Hell I'd pay you to let me watch the cat.  We've got a mouse problem and one of them just chewed into my stash of reeses.  Never chew into a man's stash of reeses.  Unfortunately I'm going back to the suburbs... Wow I really wish I was staying in Champaign this break.  Hell I'd pay you to let me watch the cat.  We've got a mouse problem and one of them just chewed into my stash of reeses.  Never chew into a man's stash of reeses.  Unfortunately I'm going back to the suburbs... sounds like you got roommate problems.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14u3vq/grad_student_looking_for_a_cat_sitter_over_winter/"
  }, {
    "id" : 24,
    "title" : "Google Street View coverage of C-U",
    "snippet" : "Just noticed that we now have google street view almost everywhere in town. Pretty cool! The photos seem to have been taken this summer. Weird that many of the campus streets are missing.  The zoomed out picture of the C-U area is actually over 10 years old. I first noticed it because as you zoom out one of the runways at Willard Airport disappears. That runway was built over 10 years ago.  Looks like early summer to me - probably late May or early June? There aren't any students at the law school, but most or all of the faculty are there. That means it's not a weekend, and it's not the middle of the summer, and it's not a time when classes are in session.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14tn1y/google_street_view_coverage_of_cu/"
  }, {
    "id" : 25,
    "title" : "AMA REQUEST: Someone who isn't at Grainger right now",
    "snippet" : "1. What are you doing with your life?\n2. How are classes going?\n3. Is it cold outside?\n4. Are there other possible places to study?\n5. Where?  1. Telling myself I should study CS 411, but actually watching It's Always Sunny\n2. Good! Three finals left, and one online.\n3. It's been worse.\n4. Yes.\n5. BIF, UGL, Starbucks, My apartment How is BIF? Isn't it loud in there? Never been inside  It's usually quiet in the classrooms because anyone in them is usually studying too. The Atrium can get a bit louder, but not really too loud. How is BIF? Isn't it loud in there? Never been inside   1. Earning a degree like the rest of y'all\n2. Awesome. Anticipating another perfect semester.\n3. A bit, but you should be fine with a stylin' jacket.\n4. Oh boy, are there\n5. Krannert,the second floor of the union, random classrooms.   1. I have worked 30 hours this week, I am working 30 hours next week, and I am trying to find time to study for 4 finals in between working. My cat is sleeping on lap presently, and preventing me from accessing my textbooks.\n2. Even though I don't have as much time to study as I would like, my classes are going pretty well.\n3. I haven't spent more than 20 minutes outside at a time this entire week. It's colder than it was, but not unbearable yet.\n4. Yes. \n5. I always study in my house. I can't focus in a place surrounded by a bunch of other people.   1. Ripping DVDs. 28 DVDs. I'd say \"this is terrible,\" but I'd be saying that to someone holed up at Grainger. So my problems seem insignificant by comparison.\n2. DONE.\n\n3. Yes.\n\n4. Probably.\n\n5. Espresso Royale? I know you. NO WAY How's the DVD ripping going? I was trying to burn adventure time only to learn my Mac is shit and won't write to DVD-Rs for some reason    A lot of students don't study at Grainger. for obvious reasons your going to find a spot that houses most of your classes in your major. So yeah engineers in grainger not a surprise. Non engineering majors go elsewhere.      1. Procrastinating studying for CS418 final in 10.5 hours, watching League of Legends streams.\n\n2. Decent enough.\n\n3. Yes, very.\n\n4. I guess.\n\n5. Off the top of my head, I don't know. I'm chilling in my apartment at the moment. How is that class? Easy or hard? It's not terribly hard if you spend the time to do the MP's right. The tests are pretty easy. I got done with the final in about an hour (it was non cumulative, same length as midterm). The first three MP's are pretty simple, and the last one was a bit of a time sink. Overall, my favorite class of the semester.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14trl8/ama_request_someone_who_isnt_at_grainger_right_now/"
  }, {
    "id" : 26,
    "title" : "Do you guys tip the deliveryman when ordering Jimmy Johns?",
    "snippet" : "Not to sound like a douche..but from the plentiful experiences ive had from ordering jimmy johns, alot of the delivery guys tend to just walk away right away and not expect a tip..was just wondering if i was the only one the whole time just tipping, while no one else is champaign was.\n\n\nOnce again, i feel like a douche for even asking..but aint nobody got cash lyk dat  if you can't afford to tip the delivery guy you should go get it at the store. I'd be shocked if their delivery drivers are getting minimum while on runs. if you can't afford to tip the delivery guy you should go get it at the store. I'd be shocked if their delivery drivers are getting minimum while on runs. if you can't afford to tip the delivery guy you should go get it at the store. I'd be shocked if their delivery drivers are getting minimum while on runs. Yeah looks like from now on I'm going to be eating cereal for dinner on the days I would have ordered Jimmy John's. I didn't know the delivery drivers felt so strongly about $1 tips. If I am going to tip $3 I could as well order a $20 pizza or Thai food and pay the same tip, and make that food last for several meals - and that tastes much better than Jimmy John's, whose prime appeal is that their sandwiches are cheap. \n\nEDIT: I expected the downvotes but my point was that if people are expected to tip $3 for a $5 sandwich they will choose more economically viable options. They will place bigger orders and Jimmy John's might find itself getting only bulk/catering orders. Doesn't the sheer volume of orders make up for the low tips per order? Everyone I know orders from Jimmy John's, and with the pass-the-baton kind of system they have with an employee waiting outside with a sandwich to pass on to a driver, I would think a driver makes many deliveries per hour. Your logic is mind-blowing, \"Doesn't the sheer volume of orders make up for the low tips per order\" It takes just as long to deliver a sandwich as it does to deliver a pizza.... Obviously there are more sandwiches than pizzas delivered each night, but there's a shit ton more sandwich delivery drivers than pizza drivers. It doesn't matter what the total volume of sandwiches delivered is, it matters what the volume *per driver* is.... how the heck do you think jimmy johns always gets there so fast? they have lots of drivers.... \n\nAnd $5 + $3, is still a lot less money than $15 + $3.... if cash is so tight for you, I'm confused why you are ordering delivery - or eating out (as opposed to packing your own food) in the first place A $5 sandwich is one meal. A $15 pizza is several meals. If I pay the same tip, $3, for both orders and make 3 meals out of the pizza, then the tip per meal is $3 in the first case and $1 in the second.   Most of the time I pay cash and I usually tip two dollars. Sometimes I tell them \"Keep the change, ya filthy animal!\"  Most of my friends deliver for Jimmy Johns. Tipping is expected, usually $1-2 per sandwich.  Is $2 expected? It is almost 40% for their sandwiches.  people make this argument. then, when the same people order a $100 giant pizza order, they only tip $3, and say \"percentage doesnt matter, its the same effort for him as if he delivered a $15 pizza\"\n\nEDIT: typo The drivers actually quite often get orders in the order of hundreds of dollars. While a 20% tip is not expected, they do appreciate a sizable tip as it takes a long time to load/unload all of the sandwiches.  absolutely. im saying that the same people who will tip 20% on a 5$ order, all of a sudden tip a \"flat fee\" when the order is large\n\nEDIT: to clarify, people will always use the \"tipping rule\" that allows them to tip the smallest amount Is $2 expected? It is almost 40% for their sandwiches.  Is $2 expected? It is almost 40% for their sandwiches.   I usually tip $3 during normal hours but I've tipped upwards of $8 once at like 4am. good man       One of my roomies worked at JJ over the summer and he said that people who tip $1 should go to hell. One of my roomies worked at JJ over the summer and he said that people who tip $1 should go to hell. ill tip 20% for a delivery so a $5 sandwich gets a $1 tip. I dont see any problem with that.  Granted if I buy more I stay with my percentage and dont just tip a flat rate. The problem is that you are fucking over the driver, it is simple math. You can reason your way out of it to make yourself feel better, but you are being a dick and the only one who will suffer is the driver.\n\nEDIT: you are the kind of person, who if they had a coupon for a free sandwich, would order it for delivery, and tip the driver nothing, because hey 20% of 0 is 0. Whether you think that is fair or not, you are screwing the driver, and there is no way around that fact. I have to admit I looked over your comment history, and see many of your posts are to /r/trees. It is unrealistic of you to expect people to pay you 60% tips to finance your pot habit. I have nothing against marijuana but if it costs you money that you can't afford, it isn't fair to go ballistic on poor students who don't tip you unreasonable amounts. I was almost going to stop ordering from Jimmy John's because I won't pay $8 for a cold sandwich. I assumed your belligerence was representative of all Jimmy John's drivers, and was surprised that I didn't detect that much repressed anger in the many, many delivery drivers who have brought me my sandwich. They seemed happy enough with the $1 tip I gave them. Maybe not delirious with joy but certainly not as belligerent as you. a) if you felt so compelled to look at my comment history - you'd see I said I haven't delivered in years. \n\nb) my belligeryence is just 'internet belligerence' - to be taken with a grain of salt. it just blew my mind that so many people felt $1 was a fair tip. obviously, if you tip a driver a shitty tip, they will smile and accept it... having you calling their manager and getting fired certainly isn't worth letting a customer know you are displeased with their tip\n\nc) despite what you may think of me - i would challenge you to find a single jimmy johns delivery driver who is cool with $1 tips. they may not be \"belligerent\", but they are certainly pretty unhappy\n\nEDIT: \n\nd) i am done replying  to this read - i was just hoping my angered replies would convince some people to tip more fairly (although of course arguing over reddit can be entertaining as well). if you want to keep on tipping $1 go ahead - it  doesn't effect me and its obviously not going to kill the driver Well you have done the opposite as now after reading your replies I now think of all delivery drives as entitled pricks and will never tip them more than 20%.  judging all delivery drivers based on one person who claims to be a delivery driver on reddit, love it Do you love it as much as I love the look in that sad pathetic driver trying to fund his pot habit as I leave him a dollar as a tip? ahhh, a bud hater, my favorite kind of person. if i had posted /r/beer not /r/trees i doubt you'd criticize me for drinking beer. people who think smoking pot is awful but drinking is legit.... i just... don't have the words\n\ni haven't delivered for years. i've been working remotely as a webdev for over a year, which provides ample cash for entertainment. \n\nEDIT: I made the assumption that you are okay with alcohol consumption judged on your \"Is It Unofficial Yet\" tag.     The more important question is how much do you tip when there is a delivery fee? A lot of restaurants I order from off of eatcu, like papa johns, have a $1.95 delivery charge. Does that just go straight to the driver? If it does then they are already getting $2 per delivery on top of any additional tip left for them. Drivers NEVER get any portion of the delivery fee. Businesses charge a delivery fee to cover the insurance needed to cover their drivers.  Businesses rarely actually buy insurance for their drivers. It's a clusterfuck when you get an accident because the driver's insurance will disclaim liability, as will the victim's, as will the business's. The more important question is how much do you tip when there is a delivery fee? A lot of restaurants I order from off of eatcu, like papa johns, have a $1.95 delivery charge. Does that just go straight to the driver? If it does then they are already getting $2 per delivery on top of any additional tip left for them. The more important question is how much do you tip when there is a delivery fee? A lot of restaurants I order from off of eatcu, like papa johns, have a $1.95 delivery charge. Does that just go straight to the driver? If it does then they are already getting $2 per delivery on top of any additional tip left for them.   I believe this classic scene is necessary. \n\nhttp://m.youtube.com/watch?v=Z-qV9wVGb38    I delivered at jimmy johns for a year, and to the people that tip one dollar, you suck. Gas and car repairs aren't cheap, nor do I think that any of you guys would like a dollar tip either. 3 dollars is solid  You expect a $3 tip on a $5 sandwich? If someone were to spend $8 why would they order Jimmy John's in the first place? Jimmy John's is popular because it is cheap and fast and doesn't have exorbitant delivery charges.\n\nYou should be paid more but your employer should pay you more, not customers. You expect a $3 tip on a $5 sandwich? If someone were to spend $8 why would they order Jimmy John's in the first place? Jimmy John's is popular because it is cheap and fast and doesn't have exorbitant delivery charges.\n\nYou should be paid more but your employer should pay you more, not customers. Yes. Don't like it? Get your lazy ass off your couch and drive to Jimmy John's. \n\nThe amount of money he pays in gas, insurance, and car maintenance does not change whether you order a $4.75 sandwich or a whole load for an entire party. \n\nIt was true in pizza delivery, and I bet it's true in sandwiches too:\n\n- $0 makes the driver pretend he hasn't seen your order, and you wait until a manager forces them to take it to you.\n- $1 is a shitty tip.\n- $2 is a mediocre tip.\n- $3 is a good tip.\n- $4+ makes you a friend, and drivers will fight to take your order as fast as possible. You'll get extra toppings and if something gets screwed up, you'll get it remade so that it's the best possible quality.   guys.... you should be tipping atleast $2. i've delivered pizza, sandwiches, and chinese food... and its pretty insulting when the shmuck who answers the door has enough money to eat a fucking 6 dollar sandwich but wont tip you more than a dollar.....\n\nthe worst is delivering to a group of kids studying... they're all sitting their with their MacBook Pros.... they can afford a 1.5K laptop, but can't afford a $2 tip... you people like that, go fuck yourselves They paid you $1 out of kindness to do your job, and you say they can go fuck themselves. You sound lovely. They paid you $1 out of kindness to do your job, and you say they can go fuck themselves. You sound lovely. They paid you $1 out of kindness to do your job, and you say they can go fuck themselves. You sound lovely. They paid you $1 out of kindness to do your job, and you say they can go fuck themselves. You sound lovely. tipping a delivery person is not \"out of kindness\", tipping beyond what is expcted is \"out of kindness\". there's a minimum expected amount,\n\nthere is a reason that the federal minimum wage for people who make tips is about $3\n\nafter tips and their hourly wage (let's forget about gas), the delivery driver is atleast entitled to minimum wage.\n\nit really blows my mind that you think delivery drivers simply deserve the $3 an hour they make which doesnt even come close to covering gas (let alone the miles on your car, risk of accident, etc.) and that any tips are out of the kindness of peoples hearts. \n\nthat's not how it works - as a decent human being you are expected toa tip a minimum or reasonable amount, if you are kind, you tip more than that, if you tip less than you are simply greedy\n\nyour tipping logic can be fairly applied to someone who earns a full wage or salary, and is occasionaly tipped, because people are kind. (perhaps a AAA mechanic who comes out and changes your tire). applying that logic to someone who makes $3 an hour and is legally paid less than minimum wage because tips are expected, is just straight up selfish If your tips don't make up for the rest of the $5.25 to get to $8.25/hr (minimum wage in IL), your employer must pay the difference to make sure you receive the equivalent of minimum wage in tip+wage. good to know.\n\njudging by downvotes - i feel many of you share the sentiment that tipping $1 is being kind, because the delivery driver is just doing his job.\n\nthat really depresses me. especially because a fair portion of this subreddit is comprised of kids whose lives are paid for entirely by mom and dad. I think people are downvoting you because you told $1 tippers to go fuck themselves.  Not people who didn't leave any tip, not people who treat you poorly, but people who give you one or two dollars less than the usual amount.\n\nThen to defend yourself you insult them and claim that these people MUST be funding college with the help of their parents.\n\nYou by all means deserve more than a $1 tip, but you also sound like an asshole. I completely stand  by the fact that if you own a $1500 laptop you should be tipping more than $1, and that people who tip really shitty, can indeed, &lt;insert vulgar expression here&gt;\n\n&gt; but people who give you one or two dollars less than the usual amount.\n\nIn the context of $3, $2 is a lot of money.....  I completely stand  by the fact that if you own a $1500 laptop you should be tipping more than $1, and that people who tip really shitty, can indeed, &lt;insert vulgar expression here&gt;\n\n&gt; but people who give you one or two dollars less than the usual amount.\n\nIn the context of $3, $2 is a lot of money.....  good to know.\n\njudging by downvotes - i feel many of you share the sentiment that tipping $1 is being kind, because the delivery driver is just doing his job.\n\nthat really depresses me. especially because a fair portion of this subreddit is comprised of kids whose lives are paid for entirely by mom and dad. Based upon my time in delivery, if I see someone that I know tipping a dollar, I will call them out on it and make sure that they know that they're being an asshole. I'm extending the same courtesy to reddit. thats hilarious. what do people usually say/how do they usually respond when you call them out on it? tipping a delivery person is not \"out of kindness\", tipping beyond what is expcted is \"out of kindness\". there's a minimum expected amount,\n\nthere is a reason that the federal minimum wage for people who make tips is about $3\n\nafter tips and their hourly wage (let's forget about gas), the delivery driver is atleast entitled to minimum wage.\n\nit really blows my mind that you think delivery drivers simply deserve the $3 an hour they make which doesnt even come close to covering gas (let alone the miles on your car, risk of accident, etc.) and that any tips are out of the kindness of peoples hearts. \n\nthat's not how it works - as a decent human being you are expected toa tip a minimum or reasonable amount, if you are kind, you tip more than that, if you tip less than you are simply greedy\n\nyour tipping logic can be fairly applied to someone who earns a full wage or salary, and is occasionaly tipped, because people are kind. (perhaps a AAA mechanic who comes out and changes your tire). applying that logic to someone who makes $3 an hour and is legally paid less than minimum wage because tips are expected, is just straight up selfish &gt; if you are kind, you tip more than that, if you tip less than you are simply greedy\n\nMaybe poor, not greedy? Most of us are poor and are always on the lookout for free food, and we aren't being miserly if we don't tip generously. You should also take into account the demographic to whom you are delivering. If this were a town full of people who are working full-time and they tip you poorly, that is different from students tipping the minimum decent amount.\n\n&gt; enough money to eat a fucking 6 dollar sandwich but wont tip you more than a dollar\n\nI think they probably ordered food that day because they had homework, deadlines - something that prevented them from cooking or preparing a cheaper meal. Also, a $1 tip on a $6 sandwich is still a &gt;15% tip. \n\nIf this upsets you so much, why take up a job where you are dependent on tips to reach minimum wage? You could get a desk job where you will be assured you will get minimum wage.  &gt; if you are kind, you tip more than that, if you tip less than you are simply greedy\n\nMaybe poor, not greedy? Most of us are poor and are always on the lookout for free food, and we aren't being miserly if we don't tip generously. You should also take into account the demographic to whom you are delivering. If this were a town full of people who are working full-time and they tip you poorly, that is different from students tipping the minimum decent amount.\n\n&gt; enough money to eat a fucking 6 dollar sandwich but wont tip you more than a dollar\n\nI think they probably ordered food that day because they had homework, deadlines - something that prevented them from cooking or preparing a cheaper meal. Also, a $1 tip on a $6 sandwich is still a &gt;15% tip. \n\nIf this upsets you so much, why take up a job where you are dependent on tips to reach minimum wage? You could get a desk job where you will be assured you will get minimum wage.  tipping a delivery person is not \"out of kindness\", tipping beyond what is expcted is \"out of kindness\". there's a minimum expected amount,\n\nthere is a reason that the federal minimum wage for people who make tips is about $3\n\nafter tips and their hourly wage (let's forget about gas), the delivery driver is atleast entitled to minimum wage.\n\nit really blows my mind that you think delivery drivers simply deserve the $3 an hour they make which doesnt even come close to covering gas (let alone the miles on your car, risk of accident, etc.) and that any tips are out of the kindness of peoples hearts. \n\nthat's not how it works - as a decent human being you are expected toa tip a minimum or reasonable amount, if you are kind, you tip more than that, if you tip less than you are simply greedy\n\nyour tipping logic can be fairly applied to someone who earns a full wage or salary, and is occasionaly tipped, because people are kind. (perhaps a AAA mechanic who comes out and changes your tire). applying that logic to someone who makes $3 an hour and is legally paid less than minimum wage because tips are expected, is just straight up selfish guys.... you should be tipping atleast $2. i've delivered pizza, sandwiches, and chinese food... and its pretty insulting when the shmuck who answers the door has enough money to eat a fucking 6 dollar sandwich but wont tip you more than a dollar.....\n\nthe worst is delivering to a group of kids studying... they're all sitting their with their MacBook Pros.... they can afford a 1.5K laptop, but can't afford a $2 tip... you people like that, go fuck yourselves guys.... you should be tipping atleast $2. i've delivered pizza, sandwiches, and chinese food... and its pretty insulting when the shmuck who answers the door has enough money to eat a fucking 6 dollar sandwich but wont tip you more than a dollar.....\n\nthe worst is delivering to a group of kids studying... they're all sitting their with their MacBook Pros.... they can afford a 1.5K laptop, but can't afford a $2 tip... you people like that, go fuck yourselves Yeah, what kind of ingrate only leaves a 17% tip? the same kind of person who will tip $3 on a $100 order, saying percentage is dumb, and deliveries should be tipped with a flat fee  I tip $1. Sometimes the sandwich costs $5.25 and I round it to $6 and feel bad that I tipped &lt;$1. $1 is between 15-20% of the sandwich's cost and should be OK I think. Or are the rules different when the amount is so small?\n\nHow much do you tip Insomnia Cookies?  I tip $1. Sometimes the sandwich costs $5.25 and I round it to $6 and feel bad that I tipped &lt;$1. $1 is between 15-20% of the sandwich's cost and should be OK I think. Or are the rules different when the amount is so small?\n\nHow much do you tip Insomnia Cookies?  As much as i hate to see someone tip me less than a dollar you don't have to feel too bad. Almost every delivery place will round up the drivers tips when they cash out so anything over about 75 cents will most likely end up being a dollar in the drivers pocket. Most drivers only get around $6 an hour on their check though so making $1 tips all night is barely enough to cover gas and bring you up to minimum wage not to mention the wear and tear on your car. That's not at all how it works. 75 cent tips aren't rounded up to a dollar. All the tips are added up, so for example if you got three 60 cent tips, 60+60+60 = 1.80, that total (the 1.80) is rounded up to $2. It's not 60 cents rounded to a dollar, plus 60 cents rounded to a dollar, plus 60 cents rounded to a dollar. I said 75 cents bud... How many 75 cent tips do you get a night? It's really not that many and it \"will most likely end up being a dollar\" provided you get a few. If your getting that many 75 cent tips to where it doesn't perhaps there's a reason people aren't tipping you well. Right, if you get 1 or 2 75 cent tips they will each essentially round to a dollar, but I think the point is you shouldn't be tipping a dollar in the first place  As much as i hate to see someone tip me less than a dollar you don't have to feel too bad. Almost every delivery place will round up the drivers tips when they cash out so anything over about 75 cents will most likely end up being a dollar in the drivers pocket. Most drivers only get around $6 an hour on their check though so making $1 tips all night is barely enough to cover gas and bring you up to minimum wage not to mention the wear and tear on your car. I have literally never heard of that policy of rounding up. When I delivered on a cash system, I got a \"bank\" ($50) at the start of my shift and had to buy every order when it came time for delivery. At the end of the night, I had to return my bank. When I delivered on an electronic system, I got a bank ($20) at the start of my shift and had to log every delivery I took, then pay for them at the end of the night. That's still how it works. At the end of the night whatever you owe the store (cash - card - card tips) is rounded up or down accordingly. I've delivered at 3 or 4 different places in my life, and none of them rounded.  So you had to pay the store in exact change? That sucks... Apparently they're all different now lol.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14ts1w/do_you_guys_tip_the_deliveryman_when_ordering/"
  }, {
    "id" : 27,
    "title" : "Where can I get my Toshiba laptop looked at on/near campus?",
    "snippet" : "A few problems have come up, mouse pad and a few keyboard buttons won't work.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14umen/where_can_i_get_my_toshiba_laptop_looked_at/"
  }, {
    "id" : 28,
    "title" : "FYI: If you miss your final exam due to illness, a doctor's note is not the only thing you need.",
    "snippet" : "I've been getting tons of questions about this lately and thought I'd post this even though it probably doesn't lead to much valuable discussion. Here is the relevant student code section:\n\n---\n\nhttp://admin.illinois.edu/policy/code/article3_part2_3-201.html \n\n  (1)\tUndergraduate students must obtain the approval of the dean of their college to defer a final examination. Undergraduate students who must miss a scheduled examination should report this fact to the dean of their college as soon as possible and before the examination period.\n\n  (2)\tFor satisfactory reasons, students may be “excused” by the dean of their college and examined later by their instructor. Absence from a final examination for any other cause is reported as a final grade of “absent” (ABS) in the course and counts as a failure. (See § 3-103.)\n\n---\n\nStay well everyone!  If you're comfortable answering here, would you mind explaining why it's so intensely difficult to drop a required course, despite a distinct lack of graduation concerns? I assume you are talking about Engineering's restricted drops.\n\nI don't know the reasoning behind the policy. I can tell you that I would support a restriction on drops of required courses in my major. The restriction would solve a lot of problems:\n\n* A lot of people take up valuable seats in required upper-level courses just to \"try it out,\" then drop those courses, screwing over other students and wasting thousands of dollars.\n* A lot of people take required lower-level courses, get a C+ on the first midterm, and then drop the course saying they will try again next year. What the hell man? Now you are a semester behind and we have no idea whether you are going to make it through the major. I guess you start over in the Spring....... and hopefully you eventually graduate. We have no idea!\n* A lot of people spend a lot of strategizing time agonizing over whether to drop a class instead of thinking about how to study more effectively. IF you take away the option to flee a class, then studnets are forced to actually think about the fact that hey -- there exist office hours and tutoring rooms and all sorts of resources that I am paying for and not using.\n\nSo -- it seems heartless, but I would support more of it. :P Sorry! Well, from the student's point of view I weight the opportunity to move away from professors and poorly organized classes that will eventually destroy my grade pretty heavily. And I do understand that there are some concerns over graduation dates. I haven't ever been in a situation where that's relevant. If I ever have the opportunity to talk with the persons responsible for this restriction, I'd be very content to discuss this at length. \n\nHowever, regardless of my personal opinions, I genuinely appreciate your response. Thank you.  Has it gotten that much harder to drop restricted classes?\n\nI'm a grad student now, but I was CompE for uindergrad. I just had to fill out a form in the office, get it rubber stamped by someone at ECE and someone at eng hall, and it was done. I was never questioned or given a hard time, and i dropped a lot of classes! I assume you are talking about Engineering's restricted drops.\n\nI don't know the reasoning behind the policy. I can tell you that I would support a restriction on drops of required courses in my major. The restriction would solve a lot of problems:\n\n* A lot of people take up valuable seats in required upper-level courses just to \"try it out,\" then drop those courses, screwing over other students and wasting thousands of dollars.\n* A lot of people take required lower-level courses, get a C+ on the first midterm, and then drop the course saying they will try again next year. What the hell man? Now you are a semester behind and we have no idea whether you are going to make it through the major. I guess you start over in the Spring....... and hopefully you eventually graduate. We have no idea!\n* A lot of people spend a lot of strategizing time agonizing over whether to drop a class instead of thinking about how to study more effectively. IF you take away the option to flee a class, then studnets are forced to actually think about the fact that hey -- there exist office hours and tutoring rooms and all sorts of resources that I am paying for and not using.\n\nSo -- it seems heartless, but I would support more of it. :P Sorry!  I have a question; What would happen if, say, you woke up at 7 for your 8:00 final with a huge fever, and then fell back asleep (because of the fever, or whatever) then woke up again after the final was over. How would you get permission to skip a final that you've already missed?  Thanks for posting.\n\nHow's finals week for the Academic Advisers? I'd bet you're swamped. Actually it's pretty quiet. The only people really showing up are new Spring transfer students and people who have drastically misunderstood the way the world works (\"I'd like to drop a class\" or \"I'd like to add a class, I've done all the work for it\"). The questions about finals are mostly by email so pretty unstressful. Are you serious? I'd like to add a class is hilarious.  As someone with a 102 degree fever on the night before 2 final exams, this is pretty relevant. Although, both professors are letting me take the conflict exam if I provide a doctor's note, which I will be getting tomorrow.  I'm hoping your still answering questions on here because I have an issue. I have the stomach flu and cannot really move without getting sick. I've been getting better though, and was wondering what happens if I say I'm too ill to take my tests, but by the time I get a doc appointment tomorrow I'm no longer vomiting. I'm just worried that by the time my final rolls around I might actually be able to move, but I've lost all my studying time.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14t7ky/fyi_if_you_miss_your_final_exam_due_to_illness_a/"
  }, {
    "id" : 29,
    "title" : "LEX closed permanently",
    "snippet" : "    Good. Yeah...super...less competition in the market.  That always turns out real well. Less bad competition is good. South Side Express and that new airport service company will pop up. Failing all of those, there's Amtrak and Greyhound. And Megabus and Peoria.  For all those who doubt him, Bob will be back. LEX wasn't his first failed business, nor will it be his last. Some of you may find it interesting to know that Bob's long-term goal was to own his own airline. You think riding LEX buses was scary? Imagine riding a LEX airplane...\n\nI'm a former LEX Employee. I wasn't there when he got shut down, I've been gone since 2011. Just curious if there's any interest in an AMA. For all those who doubt him, Bob will be back. LEX wasn't his first failed business, nor will it be his last. Some of you may find it interesting to know that Bob's long-term goal was to own his own airline. You think riding LEX buses was scary? Imagine riding a LEX airplane...\n\nI'm a former LEX Employee. I wasn't there when he got shut down, I've been gone since 2011. Just curious if there's any interest in an AMA.  I hate suburban express so much because the owner is an asshole. I liked having more competition in the market. Yeah, at least LEX didn't have a scummy ad campaign like Suburban Express did. Almost every time I would take a LEX, a Suburban Express 'representative' would hand everybody a coupon and a pamphlet saying things like LEX drivers are thieves, rapists, or drink and drive. \n\nTBH, I just liked the fact that LEX had more times and more convenient stops, never really had a problem with them. I value getting to my destination on time and not getting lost over scummy advertising. \n\nI only took LEX a few times when I was a freshmen and I learned from those experiences to never take them ever again.    boobs are cool",
    "url" : "http://www.news-gazette.com/news/transportation/2012-12-13/lincolnland-express-bus-company-shut-down-permanently.html"
  }, {
    "id" : 30,
    "title" : "Wut",
    "snippet" : "     Why are they in gray-face? I *think* that's supposed to be the restored Alma Mater statues? They are grey instead of green as this is how they'll look after restoration... maybe... But even then, wasn't that a woman and a man in the intro shot? And isn't the Alma Mater backup up by two men? The two figures flanking her are Learning (a young woman based on the Greek goddess Athena) and Labor (a young male iron worker).\n[From the News-Gazette story](http://www.news-gazette.com/news/university-illinois/2012-02-17/alma-mater-taking-leave-after-commencement.html) Why are they in gray-face?     ",
    "url" : "http://www.youtube.com/watch?v=J4G8t4ThoqE"
  }, {
    "id" : 31,
    "title" : "What's the best place to sell my old textbooks here?",
    "snippet" : "  [Illini Book Exchange](http://www.illinibookexchange.com/splash.php5) has never failed me So do they collect a comission on these books or is this site completely free to us? It's just like craigslist, but for students selling books only. So do they collect a comission on these books or is this site completely free to us?  Also be sure to check out Amazon. I actually got back about $40 more than I paid for one book through the Illini Book Exchange (paid $50, got back $90). Amazon does give you the money in the form of a gift card, but you can use it to buy books next semester if you want. Actually, if you become a merchant on Amazon (costs nothing) you can get paid directly into your bank account.  Of course, they do charge a fee (last time i checked it was lower than eBay/paypal) but you'll make more money selling directly to customers than if you sell only to Amazon, IUB, etc. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14tfww/whats_the_best_place_to_sell_my_old_textbooks_here/"
  }, {
    "id" : 32,
    "title" : "My prof didn't offer us ICES forms but I want to evaluate their GLORIOUS work.",
    "snippet" : "My professor didn't offer us ICES forms to evaluate the course. She decided it was going to be a 'self taught' course and I want to give some good ol' feedback on how this failed terribly. What other ways can I make  this known? Even though it probably won't make a difference? A girl can dream...  Go talk to the department. Every department has at least one person who cares that a professor is horrible. Bonus points if you get multiple people to complain, otherwise it gets ignored.\n\nIf it's tenured faculty, the best you can do is try to convince the department to get that professor to only teach grad courses. If it's an instructor or lecturer type, they were actually required to do ICES, probably...\n\nEdit: Also ... why not name the professor and course here?    \"Only online course and selected departments are using the web-based system.  Most courses are still using the paper-based system.  You can't access the system because you aren't enrolled in any sections using the web-based system.  Paper forms are ordered by your instructor or their department and then distributed to students.\" \n\nThis is what ICES sent me when I requested to evaluate my professor. So it appears that if the professor doesn't want to be evaluated and the department doesn't recognize this is a problem, no evaluations occur. This is pretty ridiculous. She is a professor in the college of education too... What can be done? I heard you pretty much can't do shit to tenured professors. This is true. I had a terrible professor for psych 353-social cognition. The Guy's name is Thomas Scrull and he is a terrible professor and human being. I found out he does no research, only teaches one class and is tenured.  I don't know what he does all day but he refused to even entertain the idea of having office hours and his syllabus just had the time of the class in it and the book to buy. I had to go home for my grandmother's funeral and he laughed in my face when I asked if I could meet with him to get the notes. He basically told me to fuck off and find a friend in the class and said he doesn't have office hours.\n  This is pretty ridiculous. She is a professor in the college of education too... What can be done? I heard you pretty much can't do shit to tenured professors. This is pretty ridiculous. She is a professor in the college of education too... What can be done? I heard you pretty much can't do shit to tenured professors.  I came here do look for this exact thing! For this exact teacher!\nI was so so mad when I couldn't fill out an ICES form (only reason I came to that useless last class).\nLet me know if you need back-up!  EPSY 485? CHLH 404. Prof Buki made a CHLH course a pain....which I didn't know was possible. I'll still get a decent grade, but she shouldn't think her attempt at making the course a 'do it yourself' version was beneficial for anyone. Her tests were ridiculously stressful too.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14sx00/my_prof_didnt_offer_us_ices_forms_but_i_want_to/"
  }, {
    "id" : 33,
    "title" : "Urbana Police/UIPD bike giveaway on Friday",
    "url" : "http://www.dailyillini.com/news/campus/article_421227d0-44e0-11e2-8795-001a4bcf6878.html"
  }, {
    "id" : 34,
    "title" : "To anyone looking for extra holiday money, here is a link to the paid psych studies website.",
    "snippet" : "        ",
    "url" : "http://uiuc-paid.sona-systems.com/Default.aspx"
  }, {
    "id" : 35,
    "title" : "Any good artists in the UIUC area",
    "snippet" : "Next year me and my roommates want to get a mural of us in our living room to creep out everyone who comes and visit.  Can anyone do this possibly?   Get it done in china. It'll be epic. \n\nhttp://www.oilpaintingproducer.com/Product.asp?BigClassName=Figure%20painting&amp;SmallClassName=Portrait%20paintings   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14tr3l/any_good_artists_in_the_uiuc_area/"
  }, {
    "id" : 36,
    "title" : "Alternative to Suburban Express?",
    "snippet" : "Ever since I saw [this](http://www.reddit.com/r/UIUC/comments/12joec/wtf_suburban_express/) post, I decided to boycott SubEx. This is one of the reasons I don't like LEX shutting down.    Amtrak, Peoria Charter, Greyhound, carpooling with people. Amtrak, Peoria Charter, Greyhound, carpooling with people. So is peoria charter the only alternative for a trip to O'Hare? So is peoria charter the only alternative for a trip to O'Hare?",
    "url" : "http://www.reddit.com/r/UIUC/comments/14tj57/alternative_to_suburban_express/"
  }, {
    "id" : 37,
    "title" : "Lex Burglarized",
    "snippet" : "    Would anyone be all that surprised if it turned out Suburban Express was responsible?",
    "url" : "http://www.news-gazette.com/news/courts-police-and-fire/2012-12-13/bus-company-burglary-reported.html"
  }, {
    "id" : 38,
    "title" : "Centralized UIUC Event or Info List?",
    "snippet" : "Hey. I was wondering if anyone knew of like an online bulletin board for UIUC events, or campus organizations to post like newsletters, event announcements etc. \n\nI mean obviously there is reddit, and facebook but I was wondering if there's anything else. I don't believe there is, but I'm supposed to find out for work and I figured this would be a lively place to ask.\n\nThanks  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14son6/centralized_uiuc_event_or_info_list/"
  }, {
    "id" : 39,
    "title" : "What's the deal with those kids that wander around campus approaching students for money for a charity?",
    "snippet" : "At least once a week, I'm approached by one or a few kids (they've always been African American in my experience... not being racist, just descriptive) that give me a long speech about how they are collecting money (at least $10 I think they say) for some kind of anti-drug organization or something like that to keep young kids off the streets.\n\nThey have literally chased me down before... I was walking to my girlfriend's today, and could hear them go \"hey, let's get that guy!\" and start running towards me. I entered the door code at my girlfriend's apartment and shut the door, and they must have been right behind me because immediately they started pounding on the door and ringing the doorbell.\n\nI've also frequently seen them with adults (parents?) in cars nearby who drive them around to other places to hit up college kids for money.\n\nAnybody else seen this? Anybody know more about their organization (or if it really is an organization)? I want to believe it's all legit, but I've just always had a weird feeling about it.  A friend of mine once was stopped by and talked to one of these kids. He said the kid said that they were out there for an after school program that was supposed to keep them off the streets and improve their communication skills but then the kid asked him for money and left.\n\nI'm not sure how true that kids story is though. What kind of after-school program dumps the kids onto the streets of a college campus to run around completely unsupervised and ask for money? Personally it seems more like some kind of scam but then again I get extremely skeptical of the stories of people asking for money. A friend of mine once was stopped by and talked to one of these kids. He said the kid said that they were out there for an after school program that was supposed to keep them off the streets and improve their communication skills but then the kid asked him for money and left.\n\nI'm not sure how true that kids story is though. What kind of after-school program dumps the kids onto the streets of a college campus to run around completely unsupervised and ask for money? Personally it seems more like some kind of scam but then again I get extremely skeptical of the stories of people asking for money.  Ask them if they have the name of the charity, an email address or phone number you can contact, or even better a business card. Then ask the kids for their names and tell them that you'll send your donation in and use reference their names so that they can get credit. If it's legit then feel free to donate if you'd like. If not then send the information to the cops. Ask them if they have the name of the charity, an email address or phone number you can contact, or even better a business card. Then ask the kids for their names and tell them that you'll send your donation in and use reference their names so that they can get credit. If it's legit then feel free to donate if you'd like. If not then send the information to the cops.  This isn't unusual to see in Chicago (although yelling \"hey get him\" might get you shot), they are just pocketing the cash. Ignore them and continue.    Why do they think college kids are the best people to fucking ask for money? I've seen them getting dropped off before, they get out and just scatter looking for their next victim.\n Why do they think college kids are the best people to fucking ask for money? I've seen them getting dropped off before, they get out and just scatter looking for their next victim.\n Because a large segment of college students have a lot of \"disposable\" income. Or at least they do when it comes to spending it at places like Panera, Starbucks, or the bars.  It's true whether you wanna believe it or not! You mean its true that some of us have jobs so we have money to spend? &gt; jobs\n\nyou're thinking of parents Is that it? All of my friends work jobs here.      I've never experienced this, but it does sound suspicious. Do you happen to remember the name of the organization they claim to represent?    They went door to door at my apartment complex one time. \n\nThis maybe ten year old kid was explaining to me what it was for, he was like \"it helps keep me away from violence and gangs\" condescending look and tone as he says \"I'm sure you can appreciate that\" right then I was like touché salesman, take my money. Just for the way he said it.         ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14rtt2/whats_the_deal_with_those_kids_that_wander_around/"
  }, {
    "id" : 40,
    "title" : "Are tutoring sessions worth it?",
    "snippet" : "Is it better to go to tutoring sessions offered by the course, or to just study on your own?   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14sqc4/are_tutoring_sessions_worth_it/"
  }, {
    "id" : 41,
    "title" : "Dial-A-Carol is back! Call 217-332-1882 for a FREE holiday song from Snyder Hall!",
    "snippet" : "    I remember staying up all night before finals freshman and sophomore year. great times. just called in for mariah carey ;) We have a giant poster paper on our wall with a \"mariah-o-meter\" for the number of times Mariah Carey is requested. It's definitely our most popular song haha.   But will they do the 12 days of Christmas???",
    "url" : "http://www.housing.illinois.edu/Housing/Current/Halls/Snyder/My%20Community%20Life/Dial-A-Carol.aspx"
  }, {
    "id" : 42,
    "title" : "Centennial product Michael Finke (6'9\" PF) commits to Illinois basketball team!",
    "snippet" : "    Honestly, with only one scholarship, they should be aiming higher. How many times have you see Finke play?  I also doubt we will only have 1 scholarship offer for that class, someone is going to leave. Honestly, with only one scholarship, they should be aiming higher. I keep hearing this and I have no idea how that works. Would you mind breaking down how scholarships work and who is taking what for me? Groce is expecting someone to transfer, probably Ibby or Mike Shaw since they get close to zero playing time every game. Did they ever end up offering that TheTulip guy a scholarship? Are they going to next year? The NCAA allows teams to grant 13 scholarships for basketball.  Check out [this](http://illinois.rivals.com/content.asp?SID=922&amp;CID=1195759) chart to see how this works for Illinois, keep in mind this is before the Finke announcement who will start his career in the 2014-2015 season.  As we have one open scholarship this year LaTulip or Berardini may have been granted one for this season, but will most likely not have one going forward. Do teams just kick the bad players off the team? or no? ",
    "url" : "https://twitter.com/finke_michael/status/278962547787444224"
  }, {
    "id" : 43,
    "title" : "Facilities and Services asking for feedback on bikes",
    "snippet" : "  Okay the number of times i've been on a bus and have seen a biker nearly get killed by the Illini rolling into the bike lane is ridiculous.  I know it's the job of both parties to make sure that it's all clear, but it is an Illini alert waiting to happen. To be fair, the Illini does need a lot of room to maneuver (as do the Yellow, Silver, and Teal buses). Nevertheless, you are correct about the Illini Alert waiting to happen. The bike lanes/paths on campus are a complete mess.      What we need: Smarter Bicyclists and Smarter Pedestrians.\n\nCurrently we have cyclists blowing red lights/going the wrong way down one-ways, and probably more dumb things.\n\nAnd the pedestrians in most places simply don't pay attention. Walking right into bike lanes like they are god damn side walks. I've run into two people already just blatantly barging into the bike lane near bus stops. Reddit is not the feedback form. These aren't really complaints that belong in that feedback form anyway. They want to know about road repair/upkeep and bike path safety etc. but this is just humans being humans.",
    "url" : "http://www.news-gazette.com/news/transportation/2012-12-12/ui-asking-bike-feedback.html"
  }, {
    "id" : 44,
    "title" : "Vector marketing is a scam.",
    "snippet" : "You might have seen people around campus  advertising work for winter break. They're called vector marketing and there a scam. A simple google [search](https://www.google.com/search?q=vector+marketing+job+scams&amp;aq=f&amp;oq=vecto&amp;aqs=chrome.2.60j0j59j57j0j61.3572&amp;sugexp=chrome,mod=1&amp;sourceid=chrome&amp;ie=UTF-8) should raise some serious concern about getting a job with them.   In other news, salt is salty. and black cleaver is OP 6 black cleaves, gg Nerf Irelia 0/10 in lane - it's the jungler's fault.  Yeah I rip down their advertisements when I see them Yeah I rip down their advertisements when I see them     Are they the one's who sell knives?  I know there was a company that contacted me and tried to get me to buy a demo set of knives etc, and the whole phone call just screamed scam! Thanks to a class-action lawsuit, you are no longer required to buy a demo set; you are now only required to put a deposit on it.\n\nReally, the scummy part is that, since cold calling is pretty much illegal, their marketing strategy is basically \"guilt your friends and family into buying knives\". &gt; since cold calling is pretty much illegal\n\nTell that to the insurance industry. Are they the one's who sell knives?  I know there was a company that contacted me and tried to get me to buy a demo set of knives etc, and the whole phone call just screamed scam! Are they the one's who sell knives?  I know there was a company that contacted me and tried to get me to buy a demo set of knives etc, and the whole phone call just screamed scam!    My brother sold knives for them for about a year back in 1999-2000. He spent the first month or two breaking even from buying the demo set (if I remember right) and made a good bit of money for the rest of the year - enough to pay for his living expenses for the first two years of college. He was working full time, essentially, doing a fair amount of cold-calling and \"networking.\" \n\nThe management is scummy (and that will vary regionally), but you can make money if you work at it. The knives they sell are quality, but not the best knives in the world the way they make them out.  \n\nNo more or less a scam than the college pro &amp; college works painting, or any other pyramid marketing and sales firms. It is a business model which funnels profits upwards, like so many others. &gt; No more or less a scam than the college pro &amp; college works painting\n\nso, very much a scam My brother sold knives for them for about a year back in 1999-2000. He spent the first month or two breaking even from buying the demo set (if I remember right) and made a good bit of money for the rest of the year - enough to pay for his living expenses for the first two years of college. He was working full time, essentially, doing a fair amount of cold-calling and \"networking.\" \n\nThe management is scummy (and that will vary regionally), but you can make money if you work at it. The knives they sell are quality, but not the best knives in the world the way they make them out.  \n\nNo more or less a scam than the college pro &amp; college works painting, or any other pyramid marketing and sales firms. It is a business model which funnels profits upwards, like so many others. First: I'm glad I avoided being duped into that CollegeWorks crap.\n\nSecond: Cutco knives rock.\n\nThird: Still a scam.      You're going to have to define \"scam\" here. dictionary definition: \"A dishonest scheme\" well what are they lying about? They use deceptive tactics to convince people to \"work\" for them as \"independent contractors.\"  These supposed employees are then required to buy their own products to sell to other people.  Doing so makes very little money for the employees who are often required to pay the business a decent fee to start selling.\n\nIt's similar to that Veema/Verve pyramid scheme shit, and in the same ballpark as those Mary Kay / Tupperware parties. They use deceptive tactics to convince people to \"work\" for them as \"independent contractors.\"  These supposed employees are then required to buy their own products to sell to other people.  Doing so makes very little money for the employees who are often required to pay the business a decent fee to start selling.\n\nIt's similar to that Veema/Verve pyramid scheme shit, and in the same ballpark as those Mary Kay / Tupperware parties. well what are they lying about?   [deleted] so...a pyramid scheme? essentially. I have a friend that worked for them. 1 week: 200 dollars in sales, pocketed maybe 20 dollars. 1 month: 2000 dollars in sales, pocketed maybe 200 dollars. 3 months: ran out of people to sell to, spent money buying more sets to try to sell to people. Ended up broke again. so...a pyramid scheme? [deleted] don't know why I was downvoted so hard but alrighty  If you check the dates on the top responses from the Google search, you will see that they are 4, almost 5 years old and the policies have changed. There is no longer a need to purchase the demo kit, meaning all you need to do is complete training and you have broken even. Also, try this [search](https://www.google.com/search?hl=en&amp;safe=off&amp;tbo=d&amp;q=catholic+church+scams&amp;oq=catholic+church+scams&amp;gs_l=serp.3..0i30.3650.7265.0.8099.17.16.1.0.0.0.149.799.15j1.16.0.les%3B..0.0...1c.1.tScOx9PWM8Q) and see what you think.  Well fine. I took out the word scams in the[search](https://www.google.com/webhp?hl=en&amp;tab=ww#hl=en&amp;safe=off&amp;tbo=d&amp;output=search&amp;sclient=psy-ab&amp;q=vector%20marketing&amp;oq=&amp;gs_l=&amp;pbx=1&amp;bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&amp;bvm=bv.1355272958,d.b2I&amp;fp=677d9cb28fc608b&amp;bpcl=39942515&amp;biw=1366&amp;bih=667&amp;pf=p&amp;pdl=300) bar and there's still results on the first page that say **DONT BE FOOLED VECTOR MARKETING IS A SCAM** ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14qbj4/vector_marketing_is_a_scam/"
  }, {
    "id" : 45,
    "title" : "/r/UIUC, what is your favorite writing utensil?",
    "snippet" : "After reading the comments on the post about the missing pencil, I realized that everyone (at least I'd hope) has a favorite writing utensil.  You know -- that type of pen that you only find in Japan and would cry without, or that pencil that costs $10 but is totally worth it.  So tell me, what is YOUR favorite writing utensil and why?  My favorite are the Pilot G-2 07 pens.  I buy them in multi-color packs from Sams Club, and do everything in them (even tests).  If I ever use a pencil, it's when I have a Scantron exam.  \n\nedit:  I like them because they're smooth as a baby's bum.  So smooth, so fetch! [These](http://www.attemptednovelist.com/images/3.jpg) are the best Pilot Pen. There is nothing better. My favorite are the Pilot G-2 07 pens.  I buy them in multi-color packs from Sams Club, and do everything in them (even tests).  If I ever use a pencil, it's when I have a Scantron exam.  \n\nedit:  I like them because they're smooth as a baby's bum.  So smooth, so fetch! My favorite are the Pilot G-2 07 pens.  I buy them in multi-color packs from Sams Club, and do everything in them (even tests).  If I ever use a pencil, it's when I have a Scantron exam.  \n\nedit:  I like them because they're smooth as a baby's bum.  So smooth, so fetch! You really think the G2s are smooth?  I've always considered them scratchy compared to Uniball 207s.\n\nDefinitely in the minority, though, so maybe it's just me; everyone I know seems to love the G2. My favorite are the Pilot G-2 07 pens.  I buy them in multi-color packs from Sams Club, and do everything in them (even tests).  If I ever use a pencil, it's when I have a Scantron exam.  \n\nedit:  I like them because they're smooth as a baby's bum.  So smooth, so fetch!  Kuru Toga Roulette.\n\nReddit did return my pencil, by the way.\n\nEdit: [link](http://www.jetpens.com/Uni-ball-Kuru-Toga-Auto-Lead-Rotation-Mechanical-Pencil-Series/ct/669) Kuru Toga Roulette.\n\nReddit did return my pencil, by the way.\n\nEdit: [link](http://www.jetpens.com/Uni-ball-Kuru-Toga-Auto-Lead-Rotation-Mechanical-Pencil-Series/ct/669) I just bought a cheaper ~~Bic~~ uni-ball version off of Amazon. Link? I'm curious to see it. http://www.amazon.com/gp/product/B0026ICM1E/  My favorite is definitely the Dixon Ticonderoga. Best pencils ever. \n\nEdit: Forgot to add why I like them. The erasers erase pretty cleanly. My favorite is definitely the Dixon Ticonderoga. Best pencils ever. \n\nEdit: Forgot to add why I like them. The erasers erase pretty cleanly. My favorite is definitely the Dixon Ticonderoga. Best pencils ever. \n\nEdit: Forgot to add why I like them. The erasers erase pretty cleanly. My favorite is definitely the Dixon Ticonderoga. Best pencils ever. \n\nEdit: Forgot to add why I like them. The erasers erase pretty cleanly. Love those! My scholastic bowl team specifically used black Ticonderogas for each match. I need to get more of those pencils.    I like the Zebra M-301. There's nothing special about it, but I like it.   [These cheap mechanical pencils](http://www.amazon.com/gp/product/B00006IEE4/ref=ox_sc_act_title_1?ie=UTF8&amp;smid=ATVPDKIKX0DER) are seriously my favorites.\n\nWhy? Not exactly sure. The lead doesn't break, they write well.\n  Pencil: Faber Castell Grip 1345 0.5mm. It's a good weight, decent grip, and slim twist-up eraser (absolutely necessary since I erase a lot...)\n\nPen: Micron 01 (0.25mm) or Pilot Hi-Tec-C (0.3mm)\nI don't know. I just like really fine-tipped pens and these are the ones I happened to have.    Pen: Parker Jotter w/ Fisher Space Pen ink cartridge.\nPencil: Pentel GraphGear 1000, or when I feel like slumming it, the Pentel P205.   Pentel P205 .5mm. Writes cleanly, erases very well.     [TUL.](http://www.officemax.com/brands/tul)  They're available at OfficeMax; I'm not sure if it's an upscale house brand or if you can get them elsewhere.  These are optimized to be the antithesis of AIDS_Pizza's self-sharpening pencil.  They're made for those of us who like to get a chisel point on our lead in order to achieve a slightly bolder (yet still precise) line.  And to that end, they have a cushioning mechanism to help prevent breakage, even if you use cheap lead.\n\nThe pens are excellent, too.  Very smooth ink flow. [TUL.](http://www.officemax.com/brands/tul)  They're available at OfficeMax; I'm not sure if it's an upscale house brand or if you can get them elsewhere.  These are optimized to be the antithesis of AIDS_Pizza's self-sharpening pencil.  They're made for those of us who like to get a chisel point on our lead in order to achieve a slightly bolder (yet still precise) line.  And to that end, they have a cushioning mechanism to help prevent breakage, even if you use cheap lead.\n\nThe pens are excellent, too.  Very smooth ink flow.  I always used BIC pens/pencils. They were cheap, but they worked just fine for me.   Got a pentel techniclick pencil from toyota at an engineering job fair.  that pencil made it through 2 years of engineering homework before i finally lost it. \n           my dick  i always loved these:\nhttp://www.amazon.com/Pilot-Precise-Rolling-Extra-12-Count/dp/B00006IEBI\n\nPilot Precise V5 extra fine. Just don't bring them on planes, they're never the same afterwards what happens after a plane ride?",
    "url" : "http://www.reddit.com/r/UIUC/comments/14r0md/ruiuc_what_is_your_favorite_writing_utensil/"
  }, {
    "id" : 46,
    "title" : "I'm graduating and need to get rid of my stuff",
    "snippet" : "I'm leaving Illinois forever and I need to reduce the amount of junk I'm taking with me. I hate throwing stuff away, so I figured I'd offer it here. I'm asking for money for a couple of things, but everything else is free.\n\n- $50 - 19\" ViewEra LCD monitor, 1440x900 resolution with built-in speakers. No scratches on the screen, includes DVI and VGA cables.\n\n~~- $40 - [Sennheiser eH 250 Headphones](http://www.newegg.com/Product/Product.aspx?Item=N82E16826159420). These aren't too bulky to take with me, I just don't use them. They're practically new.~~\n\n~~- Free - Halogen desk lamp [extremely similar to this one](http://www.walmart.com/ip/Mainstays-Halogen-Desk-Lamp-Black/13274886)~~\n\n~~- Free - Black leather office chair. [This exact chair](http://www.homedesignplaza.com/home-office-h100-04a.html) in perfect condition.~~\n\n~~- Free - Black &amp; Decker toaster oven. It's clean and in good shape, makes excellent pizza rolls.~~\n\n~~- Free - [Bike with lock and headlights](http://imgur.com/yv0OV). No, really. I'm actually giving away my bike. It came from the Bike Project in Urbana after my \"nice\" bike was stolen last year and has served me well. Actually, come to think of it, you can have that trashcan in the background too! I was planning on locking it up somewhere on campus and leaving National Treasure style clues to the key, but I think this is easier.~~\n\n~~- $50 - [Logitech X540 5.1](http://www.amazon.com/Logitech-Surround-Speaker-System-Subwoofer/dp/B000JJM8XE) surround sound speakers. They sound amazing, but they're too bulky for me to move. I'm actually sad about leaving these behind.~~\n\nSend me a message if you're interested in anything. I'm leaving town on Monday, so everything will be in the dumpster after that point!\n\n   [deleted] ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14r9vf/im_graduating_and_need_to_get_rid_of_my_stuff/"
  }, {
    "id" : 47,
    "title" : "Interest in Textbook List?",
    "snippet" : "Every semester, I make a textbook spreadsheet with pricing comparisons to Amazon, Half, and eBay, etc and send it to my friends.  Would you be interested in seeing it around early January, or is the IUB website good enough for you?\n  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14rd9i/interest_in_textbook_list/"
  }, {
    "id" : 48,
    "title" : "Police tonight at Wright and John:",
    "snippet" : "Police were not letting anyone drive or walk towards Wright and John tonight around 4:50 or 5:00.  Anyone know what was going on?      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14r2oi/police_tonight_at_wright_and_john/"
  }, {
    "id" : 49,
    "title" : "lost keys ",
    "snippet" : "Hi! I lost my keys at around 10:24AM yesterday after getting off the bus at Goodwin and Nevada. The keychain is a picture of Fuji Mountain.. aqua blue. I was walking toward Lincoln Hall. I was wondering if anyone had seen it or have turned it in. Thank you so much everyone!     Did you have any luck calling either the bus terminal or garage? yah i called MTD yesterday to report it as soon as i found out. They took down my information in case they come across it. I also called the bus terminal this morning and went to UGL to see if someone turned it in. So far I have had no luck. I have no idea where I could possibly lost it now. I've looked for it everywhere. Lack of sleep during finals is making me crazy. I hope the good people of Reddit UIUC can help me out!   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/14qc20/lost_keys/"
  } ],
  "processing-time-source" : 62,
  "processing-result.title" : "uiuc13_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc13_reddit.xml"
  }
}