{
  "processing-time-total" : 1378,
  "clusters" : [ {
    "id" : 0,
    "size" : 8,
    "score" : 32.85324403603418,
    "phrases" : [ "Professor" ],
    "documents" : [ 3, 6, 12, 19, 26, 28, 31, 41 ],
    "attributes" : {
      "score" : 32.85324403603418
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 51.306327175130775,
    "phrases" : [ "Open" ],
    "documents" : [ 10, 17, 19, 22, 25, 34 ],
    "attributes" : {
      "score" : 51.306327175130775
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 87.96206749221992,
    "phrases" : [ "Required Course" ],
    "documents" : [ 1, 6, 7, 19, 23, 48 ],
    "attributes" : {
      "score" : 87.96206749221992
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 68.30567033391019,
    "phrases" : [ "Able to Transfer" ],
    "documents" : [ 6, 7, 9, 34, 48 ],
    "attributes" : {
      "score" : 68.30567033391019
    }
  }, {
    "id" : 4,
    "size" : 5,
    "score" : 55.41689966757479,
    "phrases" : [ "Apartment" ],
    "documents" : [ 2, 6, 13, 17, 45 ],
    "attributes" : {
      "score" : 55.41689966757479
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 55.057029293199484,
    "phrases" : [ "Dogs" ],
    "documents" : [ 13, 17, 32, 39 ],
    "attributes" : {
      "score" : 55.057029293199484
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 62.573846879259456,
    "phrases" : [ "Engineering Physics" ],
    "documents" : [ 1, 6, 45, 48 ],
    "attributes" : {
      "score" : 62.573846879259456
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 53.94319610173685,
    "phrases" : [ "Bike" ],
    "documents" : [ 9, 37, 47 ],
    "attributes" : {
      "score" : 53.94319610173685
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 71.13949816530577,
    "phrases" : [ "Finals Week" ],
    "documents" : [ 28, 39, 40 ],
    "attributes" : {
      "score" : 71.13949816530577
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 77.7767780789258,
    "phrases" : [ "Like a Block from my Work" ],
    "documents" : [ 9, 18, 25 ],
    "attributes" : {
      "score" : 77.7767780789258
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 33.461950654297006,
    "phrases" : [ "Send" ],
    "documents" : [ 17, 34, 44 ],
    "attributes" : {
      "score" : 33.461950654297006
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 75.39119541722415,
    "phrases" : [ "Shows up without a Ticket" ],
    "documents" : [ 25, 30, 47 ],
    "attributes" : {
      "score" : 75.39119541722415
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 46.605228405106416,
    "phrases" : [ "Book" ],
    "documents" : [ 5, 41 ],
    "attributes" : {
      "score" : 46.605228405106416
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 33.62173463678464,
    "phrases" : [ "Easily get some Bar Pull" ],
    "documents" : [ 25, 47 ],
    "attributes" : {
      "score" : 33.62173463678464
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 22.716603143648364,
    "phrases" : [ "Google" ],
    "documents" : [ 9, 11 ],
    "attributes" : {
      "score" : 22.716603143648364
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 32.642321708606524,
    "phrases" : [ "Major Card" ],
    "documents" : [ 25, 28 ],
    "attributes" : {
      "score" : 32.642321708606524
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 38.802061763683014,
    "phrases" : [ "Pretty Clear but every Time I Ride" ],
    "documents" : [ 30, 47 ],
    "attributes" : {
      "score" : 38.802061763683014
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 51.15507614704742,
    "phrases" : [ "Time to Focus on the Class" ],
    "documents" : [ 1, 27 ],
    "attributes" : {
      "score" : 51.15507614704742
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 43.678944687725156,
    "phrases" : [ "Trade" ],
    "documents" : [ 5, 35 ],
    "attributes" : {
      "score" : 43.678944687725156
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 38.91520832964513,
    "phrases" : [ "Video" ],
    "documents" : [ 38, 45 ],
    "attributes" : {
      "score" : 38.91520832964513
    }
  }, {
    "id" : 20,
    "size" : 16,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 4, 8, 14, 15, 16, 20, 21, 24, 29, 33, 36, 42, 43, 46, 49 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1315,
  "documents" : [ {
    "id" : 0,
    "title" : "r/UIUC Post Finals Meetup @ Murphy's 12/21/2012 at 9pm!",
    "snippet" : "If you don't come, you will make me sad. \n\nI'll put an orange towel on the table I'm sitting at.\n\nEdit: I'm a dumbass. Two hours late. I relinquish all of my flair.\n\nConflict meet up on Saturday 9pm, first two pitchers on me.\n    But, [FNM](http://armored-gopher.com/events/card-games/collectable/magic-gathering/2012-12-21/mtg-fnm-rtr-draft)! I don't know why this made me smile so widely...\n\na while back someone had an epic post about how their tabletop group broke down based on one individual... and for a bit I was convinced it was actually someone from round there parts, and that guy who owns the dragon's table...\n\ni miss going to the gopher  Where are you?  Double rainbow t-shirt- \"what does it mean\". Still here, [f]ront room Where are you?  Reaaally late. This is why I can't have nice things. Reaaally late. This is why I can't have nice things. Reaaally late. This is why I can't have nice things. If I weren't leaving tomorrow afternoon I would come to the conflict as well. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/158ig4/ruiuc_post_finals_meetup_murphys_12212012_at_9pm/"
  }, {
    "id" : 1,
    "title" : "Grade Replacement?",
    "snippet" : "So I didn't do so well in 212. Definitely could've done better, that's for sure. But that is in the past. For grade replacement, do you have to take the class at UIUC? Ideally I would like to be able to take it outside of UIUC, perhaps online or something, but can I do that?\n\nAs a follow up, if I got a D+, can I take 214 and retake 212 next year, or will I be required to take 212 again in the spring? I'm an engineer if that makes a difference   You can take 213 or 214 no matter what you get in 212.    I would recommend retaking 212 in the summer. It tends to be a little easier, and you will have more time to focus on the class. But would that work with grade replacement? But would that work with grade replacement? But would that work with grade replacement? Yes, I don't see why not! It's the same as the regular course. Is it online or do you actually had to stay on campus for it? I would recommend retaking 212 in the summer. It tends to be a little easier, and you will have more time to focus on the class. How expensive would it be to take a summer semester at UIUC? I would recommend retaking 212 in the summer. It tends to be a little easier, and you will have more time to focus on the class. Couldn't disagree more. Did this and got a C, I felt there wasn't enough time for me to adequately learn the material. Granted, I suck at 212. Hmm, well, I guess it worked for me. I'm not fantastic at physics, and I got an A+. Did you take another course with it or work a lot? It can move fast if you don't take time/have time to study for it.     I would have gotten an A- in that class if I didn't sleep through one of the labs...",
    "url" : "http://www.reddit.com/r/UIUC/comments/158cb5/grade_replacement/"
  }, {
    "id" : 2,
    "title" : "Does anyone happen to have a link to the apartments behind Legends?",
    "snippet" : "I'm hunting right now and I remember being in one of these one time. It was a real nice, two level apartment. Does anyone have the link or more info on looking into these places? It's the building across the lot west of that liquor store too.\n      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/159147/does_anyone_happen_to_have_a_link_to_the/"
  }, {
    "id" : 3,
    "title" : "How long are Professors supposed to keep old final exams and final papers on file?",
    "snippet" : "**EDIT:** Thanks for all the responses, everyone! Unfortunately for me, the Professor who gave the exam that I wanted to see left the University this semester, so the old exams and papers were recycled. Oh well, c'est la vie.     Cs finals sit for years in a storage room. So some may be quick and others may be kept long after you have graduated. I would assume at least a year just to face any disputes about the grade.  Odd. I always thought we had two years to dispute grades. Not that it stopped me from disputing older grades than that, but I was pretty sure \"two years\" was what a dean told me.",
    "url" : "http://www.reddit.com/r/UIUC/comments/157pxa/how_long_are_professors_supposed_to_keep_old/"
  }, {
    "id" : 4,
    "title" : "Phys 420 ( Space, Time and Matter)",
    "snippet" : "Has anyone taken this course here? Or know any one else who has? \nI'm interested in finding out if this course is actually as good as it sounds...  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/158ift/phys_420_space_time_and_matter/"
  }, {
    "id" : 5,
    "title" : "End of the Semester Reddit Book exchange?",
    "snippet" : "If there's a subreddit this belongs in I'll delete it! But, I thought that this would be a convenient spot to just list all the books you're trying to get rid of and see if there's any biters. I hate trying to spam Facebook groups and it's easier to Ctrl+F something on this page.\n\nAlso, I made this with a throwaway as I don't know the university's policy about selling completed homework/labs/etc... \n\nSo... let's get the festivities rolling. I'll comment so I don't have priority or anything.\n\n   **Physics 212** &gt; textbook, lecture notes, discussion book (you probably want your own though), most of the labs (completed, mostly 100s), all of my discussion quizzes (all above 85 except 2), and my 3 exams (all above 80%. I marked which ones were wrong.) Also included is the practice exam book AND a PDF of the answer key to the discussion book... shhh...\n\n**TAM 210** &gt; textbook, lecture book, all of my completed homework, and my first exam (trust me, you don't want the second two.)\n\n**History 141** &gt; textbook, source book (ew), some Women on The Margins book that I literally did not take out of the shipping envelope, and a boatload of exam prep I did. I'll also email you the ID terms and notes I have. The ID terms are literally the only reason to attend class.\n\n\n\n  I'm looking for a CS125 book, if anyone has one, I'd be happy to buy it off you, or trade for EV trained pokemon. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/157igb/end_of_the_semester_reddit_book_exchange/"
  }, {
    "id" : 6,
    "title" : "Engineering Physics ",
    "snippet" : "I am planning on switching my major to Engineering Physics, specifically Material Sciences.  My question is a genuine one. How difficult is studying physics at U of I? I know it depends on the amount of work I'm willing to put in, but we all know that some subjects require more than just hard work and I really want to know what you guys think about the Engineering Physics program here.. Any kind of information will be greatly appreciated.  This is one of the best physics programs in the country, especially in materials physics. Going hand in hand with that: it attracts some of the best students (from other states and outside the US) and the courses are not easy.\n\nIncidentally: we're looking for an undergrad in my lab. Which lab is that ? I'm really interested in materials .. Fascinated rather!  The best thing I see about the program is the huge number of free electives I'm asked to take! Any good MSE courses apart from the required ones to take ?  I couldn't tell you about specific courses since I wasn't a student here. I'm a little confused though: are you thinking MSE or engineering physics? \n\nWe're a brand new lab in MRL. We don't even have any real equipment yet, but we do have a lot of stuff we've ordered! Might not be that exciting for a while yet. I don't mean to steal OP's thunder here but I'm a Freshman engineering physics student.  I wasn't really planning on doing research until sophomore or junior year but I figured I could always ask.  What kinds of requirements are you looking for in an undergrad?  Obviously I haven't taken any serious lab courses but I'm not at all opposed to sweeping floors and whatnot.  I suppose this question would apply to OP as well since undergrad research is so important for Physics students.\n\nTo OP as well, I've only been here for a semester but I may be able to answer a question or two about the basics of the major. I'm not really sure. We'll be doing crystal synthesis once we get our equipment in. I just know that right now it's me and my PI, and it's going to get hard to deal with once stuff starts arriving, and supposedly we have money for an undergrad. I should really just put both of you in touch with my boss. I don't mean to steal OP's thunder here but I'm a Freshman engineering physics student.  I wasn't really planning on doing research until sophomore or junior year but I figured I could always ask.  What kinds of requirements are you looking for in an undergrad?  Obviously I haven't taken any serious lab courses but I'm not at all opposed to sweeping floors and whatnot.  I suppose this question would apply to OP as well since undergrad research is so important for Physics students.\n\nTo OP as well, I've only been here for a semester but I may be able to answer a question or two about the basics of the major.  If you're legitimately concerned with difficulty, then you shouldn't do it.  But if you really want it, then commit yourself to work as hard as you can without worrying about difficulty. If you're legitimately concerned with difficulty, then you shouldn't do it.  But if you really want it, then commit yourself to work as hard as you can without worrying about difficulty. I'm not scared per Se, I got Bs in 211/212 and As in 213/214\nI LOVE physics, but I understand the distinction between Interests and Abilities. I'm only worried if I'm able enough or not. To be honest, a major like physics already feels so daunting and challenging, and self doubt only hurts after that. \nI think I'll take 225 and see how it goes? I'm not scared per Se, I got Bs in 211/212 and As in 213/214\nI LOVE physics, but I understand the distinction between Interests and Abilities. I'm only worried if I'm able enough or not. To be honest, a major like physics already feels so daunting and challenging, and self doubt only hurts after that. \nI think I'll take 225 and see how it goes? If you're legitimately concerned with difficulty, then you shouldn't do it.  But if you really want it, then commit yourself to work as hard as you can without worrying about difficulty.  It depends on what your future plans are after finishing undergrad:\n\n* If you want to go to grad school, choose Physics. It will give you a solid background for research in physics and related areas like material science. The rigor and theoretical background of a physics program will be useful in any kind of research.\n\n* If you want to easily find a job, choose ECE. Many subjects like optics and E&amp;M are part of the ECE curriculum, and you will have to take the lower-level physics courses anyway to get an ECE degree, so if you like physics you will have plenty of opportunity to study physics.\n\n* Material science probably falls somewhere in between the above two.\n\nThere are not many major-related jobs in physics after a bachelor's degree. Getting an undergraduate degree in electrical engineering makes you an electrical engineer, but getting an undergraduate degree in physics doesn't make you a physicist - you need a PhD for that.\n\nI think that getting a bachelor's degree in a \"core\" field like Physics, Math, ECE, ME, CS is better than getting one in an applied field like Material Science, Industrial Engineering, etc., but that is solely my personal opinion (I think it is better to be a master of one field than jack of many at the undergraduate level). You can always branch out later. Many (maybe most) people end up working in a field different from their major anyway.  That is actually one of my majors in Engineering Physics with Material Science as well. You honestly have to be interested in physics in order to enjoy this class. The materials science portion of it is easy because there isn't a whole lot to get about materials, and I'm assuming you are doing materials because you like materials. For the PHYS courses themselves, you have to be ready to struggle though it unless you really get it. Phys 225 and 485, and well.. to be honest 325 all kicked my ass because I decided to skip a few classes and didn't attend the office hours. There is plenty of room to wiggle around with different Physics courses you would like.\n\nTL;DNR Don't skip classes and actually put in plenty of effort and you'll be \n\nedit: I can't word  I just got an A- in Phys 325. It's not easy, but it's definitely do-able. Gollin asked me to get a B- in 225 to be able to transfer thougj   Physics major here.\n\nEverything I've ever learned in a math class here has come up in a physics class. Especially the things my math professors told me I wouldn't need to know.\n\nThe upper level physics classes will take a lot of time (I'm thinking 326 and 486 here). They are difficult and some of your homeworks will be several pages of math.\n\nIt can be enjoyable though. It's a great feeling when you finally get your head around a difficult concept and suddenly a bunch of other related stuff makes sense too.  It would help to know where you are transfering from to be a better judge of how difficult a time you might have.    I can see you don't know what physics is at U of I yet. Materials Science is not physics and not affiliated with our physics department. They work on similar stuff to what one branch of physics, condensed matter, does but the approach is different. Materials science is more about the applications and characterization of materials and physics is more nuts-and-blots \"why?\" using quantum mechanics and electrodynamics to investigate phenomena.\n\nEngineering physics is identical to the LAS specialized ('research track') physics is. You pay the same tuition as all the rest of physics undergrads and have one less required class than the LAS kids. So pick one or the other, there is no functional difference between them other than a few gen-eds.\n\nAlso, I am a little worried you're not really clear on what the hell physics is. Investigate it before you enroll, and not just asking a reddit forum what they think. I have seen people come on here and think it is some sort of higher form of engineering, which it is most certainly not. It is not a badge for smart people and no one gives a twirly fuck if you really love Brian Greene or Micho Kaku or wormholes because that is not what the majority of physics is. We lose over half of our freshman physics majors because a lot of them just have no idea what physics is other than it gives them an opportunity to jack their ego all over engineers. It is also hard. Being smart is not enough to make it in physics. You have to be incredibly tenacious because you WILL get the shit kicked out of you a few times before you leave if you're actually trying to learn anything. \n\nThat being said, good luck if this is what you want. I picked physics and have not regretted it. It has been the hardest and most worthwhile thing I have ever done and I am looking forward to doing more condensed matter physics is grad school next year as well. I can see you don't know what physics is at U of I yet. Materials Science is not physics and not affiliated with our physics department. They work on similar stuff to what one branch of physics, condensed matter, does but the approach is different. Materials science is more about the applications and characterization of materials and physics is more nuts-and-blots \"why?\" using quantum mechanics and electrodynamics to investigate phenomena.\n\nEngineering physics is identical to the LAS specialized ('research track') physics is. You pay the same tuition as all the rest of physics undergrads and have one less required class than the LAS kids. So pick one or the other, there is no functional difference between them other than a few gen-eds.\n\nAlso, I am a little worried you're not really clear on what the hell physics is. Investigate it before you enroll, and not just asking a reddit forum what they think. I have seen people come on here and think it is some sort of higher form of engineering, which it is most certainly not. It is not a badge for smart people and no one gives a twirly fuck if you really love Brian Greene or Micho Kaku or wormholes because that is not what the majority of physics is. We lose over half of our freshman physics majors because a lot of them just have no idea what physics is other than it gives them an opportunity to jack their ego all over engineers. It is also hard. Being smart is not enough to make it in physics. You have to be incredibly tenacious because you WILL get the shit kicked out of you a few times before you leave if you're actually trying to learn anything. \n\nThat being said, good luck if this is what you want. I picked physics and have not regretted it. It has been the hardest and most worthwhile thing I have ever done and I am looking forward to doing more condensed matter physics is grad school next year as well. I know what engineering physics is at U of I and I also know that I was referring to the tech elective option called Material Sciences in the major which amounts to a total of 20 credit hours. \nDont try to assume that the only interest I have in physics is science fiction related and don't talk to me condescendingly about what I'm aware of and not. I like taking advice of other people I know might help, but it doesn't mean I base my future on what people on the Internet have to say. \n  Physics 225 is a horrible experience",
    "url" : "http://www.reddit.com/r/UIUC/comments/157cbk/engineering_physics/"
  }, {
    "id" : 7,
    "title" : "I'm starting at UIUC in January, transferring in from a college I can no longer afford. Any advice?",
    "snippet" : "Anyone want to be my friend? Or recruit me for their favorite club?  What year are you going to be? Where are you living?  I'm a Junior, and I haven't gotten my housing assignment yet. I'm hoping for the Transfer Cluster in Ike North. I'm a Junior, and I haven't gotten my housing assignment yet. I'm hoping for the Transfer Cluster in Ike North. [deleted] History, but I'm planning to transfer to computer science once my GPA is high enough. There are [requirements](https://wiki.engr.illinois.edu/display/undergradProg/Transferring+into+CS+from+other+UIUC+departments) to transfer to CS. CS/Math/Chem/Physics all which you probably don't have. They also don't like admitting upperclassmen. The non-Engineering CS may be different. I actually have taken all of those courses (except for the computer science ones, which I'll be taking this semester) and have at least a B in all of them. The only issue is my 2.96 GPA (so close...).\nThanks for the link! Just a heads up, the CS department is full at the moment. I have a friend with a 4.0 and all prerequisites taken with the exception of the logic based 173. He's still has not received any indication that he will be able to transfer. Don't assume it's a guarantee.  Well damn. Thanks for letting me know... I may have to transfer somewhere else if that's the case. I'm a Junior, and I haven't gotten my housing assignment yet. I'm hoping for the Transfer Cluster in Ike North.  What do you study? Where are you transferring from? I got accepted into the history program, but I'm planning to transfer to computer science once my GPA is high enough. I used to go to Florida Institute of Technology, which was awesome but insanely expensive. cool. I'm a sophomore in CS. hit me up when you are on campus",
    "url" : "http://www.reddit.com/r/UIUC/comments/15865f/im_starting_at_uiuc_in_january_transferring_in/"
  }, {
    "id" : 8,
    "title" : "Interested in seeing something obscure near Chambana? This seems interesting. ",
    "snippet" : "  That's my landlord!\nEDIT: Here's his terribad 90's website: http://www.lincolnshireprop.com/museum/index.html That's my landlord!\nEDIT: Here's his terribad 90's website: http://www.lincolnshireprop.com/museum/index.html Well, if you live at the same complex that I do, I just finished salting our parking lot, since we have to do it on our own. Elm/busey? Hiya neighbor. Thanks I guess, but I'm already out of town for break. Isn't Charles supposed to do that? Last year he was always good about keeping the driveways clear. ",
    "url" : "http://www.news-gazette.com/news/arts-and-entertainment/miscellaneous/2012-12-20/sadorus-museum-crammed-full-maritime-history-mo"
  }, {
    "id" : 9,
    "title" : "How is this guy still in business? Bruce is such an asshole and ugh, what a shithole",
    "snippet" : "   I consider Bruce to be something of the Dr. House of bikes in Champaign. He can be opinionated and blunt, but he knows his stuff. I have had more than one experience of other bike shops telling me \"that can't be fixed, here buy this bike instead\", but Bruce fixed the problem and at a reasonable price because it's \"the fun part of the job\". I think he likes the challenge. (And it's not that he fake-fixes it either, that one bike has been hit by a car while locked up, then again while I was on it, and both times fixed, and still riding really nice after 10 years of heavy use).\n\nI know that a lot of people just don't like his attitude or bluntness, but I don't mind it, and when I'm willing to humble myself and hang around for an afternoon, and just watch and ask questions, I've learned a lot about bikes and how they work. And, contradictory to what one would expect, he teaches pretty well - he's flat out said \"If I can teach you how to do this simple stuff, I don't have to do it, and when you come in it will most likely be one of the fun problems\".\n\nHe has changed since his stroke, some of the fire has gone away, and it's sad... 5 or 6 years ago it was a joy to watch him do the work - like watching any good craftsman when he gets in the zone.\n\nFortunately for the OP, there are several good alternatives in town. They are all a bit different in their target customer base and in their style. This means that you don't have to go to Bikeworks if you don't like it. Everyone has their preferences, getting angry about a bike shop you don't like is as silly as getting angry about pizza places you don't like.   I miss Bruce. He was a regular at the pinball machine at Murphy's in the late 90s when I was in school. True pinball wizard. He was there regularly in 06-08 too, but the stroke...saw him every now and then after that.  It basically comes down to he doesn't need the money to fix crappy bikes and he will tell you this... bluntly.   Seems about right; somebody actually interviewed him: http://www.youtube.com/watch?v=_L1m1QIFTtg It basically comes down to he doesn't need the money to fix crappy bikes and he will tell you this... bluntly.    I called him once and he asked me what type of bike I said. Dude literally started laughing and asked \"Did you buy this crap at walmart or something?\" When I told him I got at at sears he made fun of and said he wouldn't pay 20 dollars for my bike. I told him to screw off and went to Durst. They charge a lot but atleast they are nice guys. Durst will keep your bike for weeks without actually doing anything to it or telling you why.  That's not much better. Durst will keep your bike for weeks without actually doing anything to it or telling you why.  That's not much better. I called him once and he asked me what type of bike I said. Dude literally started laughing and asked \"Did you buy this crap at walmart or something?\" When I told him I got at at sears he made fun of and said he wouldn't pay 20 dollars for my bike. I told him to screw off and went to Durst. They charge a lot but atleast they are nice guys.  From the looks of the reviews it seems that he's only nice to girls. LOL just like that dude from Dragon's Table. Reading those reviews I couldn't help think of Dragon's Table.   Go to Flats Fixed down the road, got my road bike there, great but quirky guy. Ask him about his Sturmy Archer 3 Speeds.   It seems Bruce has long since stopped caring about the cycling community hes due to retire.  I know he had a stroke a while ago however the state he keeps that shop in borders on hoarding.  \n\nI am the service manager over at Champaign Cycle, and I want your business.  I try my hardest with students to keep their bikes serviceable at a low cost. for the remainder of their time here or indefinitely (at some point you have to keep air in your tires and oil your chain from time to time) \n\nI know our location is not ideal for students.  though I think we are right off the green and orange bus lines.  If  I could plug a closer to campus shop it would be Tim over at Neutral Cycles.  He seems to have his stuff together.       Someone should mention the kickass bike dude a block east of Bruce.\n\nI forget his name, and if there's a name for his place ... but he's *awesome*. That guy is just as big of a creep  - [Brent Racobs](http://www.isp.state.il.us/sor/offenderdetails.cfm?SORID=E04B9514&amp;CFID=83421092&amp;CFTOKEN=28be7254924f857b-BE8BEB2D-E1DF-DC7B-4E8458410E9E3599&amp;jsessionid=ec3070b240499bc26d8cf5e483147a960641) I don't know the details of that, but I wouldn't call him a creep.\n\nA quick Google search shows that it was over a decade ago, and that the state he was convicted in no longer even lists him on their registry.\n\nJudge if you want, I suppose, but he's a nice guy. Your loss. &gt; it was over a decade ago, and that the state he was convicted in no longer even lists him on their registry.\n\nThat's what they thought about Jerry Sandusky also (supposedly nice and affable too) - that being reprimanded by his superiors in 2001 would be enough to stop his activities.  ",
    "url" : "https://plus.google.com/106270234518916620731/about?gl=us&amp;hl=en"
  }, {
    "id" : 10,
    "title" : "Heated indoor pools",
    "snippet" : "I want to swim. Where go?  CRCE? Not sure if it'll be open over the break though. There's a lap pool somewhere but I don't know the name of the building. Freer Hall has a pool. Not sure if it's open to students or what the deal is    The arc of course. http://www.campusrec.illinois.edu/facilities/schedules/indoor.html Arc is closed until Jan6. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/157vg6/heated_indoor_pools/"
  }, {
    "id" : 11,
    "title" : "Somebody does NOT like Google",
    "snippet" : "  I know this kid haha hes a redditor ",
    "url" : "http://goo.gl/maps/1XlbE"
  }, {
    "id" : 12,
    "title" : "Are there any ABE majors on r/UIUC?",
    "snippet" : "I'm an MCB major who's thinking about transferring to ABE with a BioE concentration. My questions aren't about how difficult transferring will be, but more about students' personal experiences in the program. Thanks in advance for any help!   I can't speak for ABE, but I transferred into TSM a year ago, which is a sort of subset of ABE\nI've really enjoyed it so far   I transferred out of ABE into another engineering department after three semesters. The ABE faculty &amp; staff are very helpful and the ABE classes during freshman &amp; sophomore year were pretty easy. What was it about the program that made you transfer out?   I'm an undergrad in ABE but in the soil and water conservation section. I've done research in the bio side. If you have any questions just let me know! * How small do the core ABE classes (232, 234, 225, 226) tend to be?\n* The program touts virtually 100% job placement after 6 months of graduation. \n* How willing are professors to take on undergrad research assistants as freshmen? Would it help if you have previous lab experience but not in the field of your PI?\n* I'm not sure how much you'll know about jobs after graduation, but do you get a sense that a lot of people get jobs?\n\nThanks! * How small do the core ABE classes (232, 234, 225, 226) tend to be?\n* The program touts virtually 100% job placement after 6 months of graduation. \n* How willing are professors to take on undergrad research assistants as freshmen? Would it help if you have previous lab experience but not in the field of your PI?\n* I'm not sure how much you'll know about jobs after graduation, but do you get a sense that a lot of people get jobs?\n\nThanks! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/157j5l/are_there_any_abe_majors_on_ruiuc/"
  }, {
    "id" : 13,
    "title" : "Looking for dog friendly sublease for spring semester",
    "snippet" : "Looking for an apartment sublease for Spring '13 on campus that's dog friendly. My dog is a golden retriever/shepherd mix. Please PM me if you have an availability or any questions.  Speak of the devil.\n\nhttp://www.reddit.com/r/UIUC/comments/156cpg/roommate_wanted_for_spring_semester/ too far  Is your dogs name Alex bolin? maybe. who dis?",
    "url" : "http://www.reddit.com/r/UIUC/comments/1579cf/looking_for_dog_friendly_sublease_for_spring/"
  }, {
    "id" : 14,
    "title" : "Just some photos I took of campus today",
    "snippet" : "  Thumbs up. What kind of camera? Thumbs up. What kind of camera?  ",
    "url" : "http://www.flickr.com//photos/64654711@N08/sets/72157632289032171/show/"
  }, {
    "id" : 15,
    "title" : "Any Android users?",
    "snippet" : "I'm trying to sync illinois email to my android; any android app recommendations?\n(If the sync works with the Gmail Android app... then I'm probably dumb because I could never figure it out how to do it)  set up forwarding to a gmail account\n\nuse gmail\n\nget bitches This is the system i use. Could never get it to sync right even with the help of the CITES desk. set up forwarding to a gmail account\n\nuse gmail\n\nget bitches  Hey! I've done this exact thing, and it's not as easy as you might expect. Gimme a sec to review how I did it and I'll put up a step-by-step guide for ya Thanks! Thanks! Did it work? You are awesome   Weird. I didn't have to jump through any hoops with my galaxy s3. What kind of phone do you have?  galaxy s3...",
    "url" : "http://www.reddit.com/r/UIUC/comments/156b4c/any_android_users/"
  }, {
    "id" : 16,
    "title" : "What does Dining Services do with extra food?",
    "snippet" : "I heard that it is just thrown away, but I wanted to confirm with someone else. It seems like such a waste when there are homeless and poor people who could use it.  I used to work for the dining hall.\n\nWe used to give our food to the homeless.\n\nThen one person sued us because he claimed he got sick from it.\n\n[edit] I don't actually have a source for that, but it's what the guy in charge of our dining hall told me [/edit] Couldn't they find a way to protect themselves from being sued? It just seems like such a waste to not try anymore.\n\nI remember reading an article about the holding company of Red Lobster donating food and making a disclaimer that they cannot be sued. (Granted they do have more money and lawyers.)\n\nEdit: This is what I was referencing [Good Samaritan Law](http://www.ilga.gov/legislation/ilcs/ilcs3.asp?ActID=2076&amp;ChapterID=58) I used to work for the dining hall.\n\nWe used to give our food to the homeless.\n\nThen one person sued us because he claimed he got sick from it.\n\n[edit] I don't actually have a source for that, but it's what the guy in charge of our dining hall told me [/edit]   The fact that it is all thrown away is really depressing. I know two grad students whose funding was cut, and now they can barely afford rent, let alone food. They get most of their food from dumpster diving now because DHS (Illinois Department of Human Services) doesn't think they are poor enough to qualify for SNAP (food stamps) most of the time.     I used to work at the Ike and 57 north. ALL that shit gets thrown away. They don't let anyone (like employees) take it home or anything. Doesn't matter if it just came out of the oven two minutes ago and no one has touched it, or that they're wrapped items. Doesn't matter if there are 50 untouched cheeseburgers. If it's closing time, they toss it.  What is the reasoning for that?  Are they worried employees will make extra food just so they can take it home at night?",
    "url" : "http://www.reddit.com/r/UIUC/comments/155pm3/what_does_dining_services_do_with_extra_food/"
  }, {
    "id" : 17,
    "title" : "Roommate wanted for Spring Semester!",
    "snippet" : "Hello! My name is Eric and I am a senior in actuarial science.  A room in my two bedroom apartment just opened up very recently. I know its late, but I am in need of a roommate for the spring semester. The apartment itself is in very nice condition with two bathrooms and in-unit washer and dryer. Also, both bedrooms have walk-in closets. \n\nThe apartment is a little bit away from campus (903 N. Lincoln) but the 22 Bus comes by every ten minutes, so getting to campus is never a problem.\n\nRent would be around $450 and that includes internet and parking. Electricity and Water are the only other utilities that we would need to cover. Dogs are welcome and having them (2 max) won't add any additional cost to the rent.\n\nIf you are at all interested in this apartment (or know someone who might be), send me a message and I can send pictures of the place and tell you a bit about myself.\n\nThanks!  Have you guys met yet?\n\nhttp://www.reddit.com/r/UIUC/comments/1579cf/looking_for_dog_friendly_sublease_for_spring/ Have you guys met yet?\n\nhttp://www.reddit.com/r/UIUC/comments/1579cf/looking_for_dog_friendly_sublease_for_spring/ M.Night Shamalan, They were roomates, but had a falling out, so one is looking for a new place, while the other is looking for someone to fill that vacant spot. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/156cpg/roommate_wanted_for_spring_semester/"
  }, {
    "id" : 18,
    "title" : "Yet another armed robbery (off-campus)",
    "snippet" : "  Christ, that's like a block from my work. Crims need to sort their shit out and stop being dicks. Christ, that's like a block from my work. Crims need to sort their shit out and stop being dicks.  ",
    "url" : "http://www.news-gazette.com/news/courts-police-and-fire/2012-12-19/champaign-police-investigate-armed-robbery.html"
  }, {
    "id" : 19,
    "title" : "Now is the best time to talk to recruiters. We are engineering recruiters. AMA.",
    "snippet" : "Winter Break is the best time to push for internships, co-ops, and full time positions. Students normally take a break from their job search during this time of year, leaving recruiters wide open. So, ask us questions about how to do this.\n\nWe are a group of engineers who are a few years out of college and recruit too. We've been on both sides of the equation: nervously handing out resumes to companies and listening to nervous students give their resume to us. We quickly realized once we were on this side of the equation, the whole process isn’t so bad. So, we want to help people relax and win at the recruiting game. We've decided to put our minds together to help people out. While our target audience is primarily engineering students and recent graduates, we hope our advice can be applicable to most anyone else!\n\nWe've made a few posts on Reddit already. Read 'em over if you're curious. They're [here](http://www.reddit.com/r/EngineeringStudents/comments/136wyw/trends_in_engineering_student_resumes_top/), [over here](http://www.reddit.com/r/jobs/comments/11ygye/we_are_a_group_of_engineering_recruiters_ask_us/), and [all the way over here!](http://www.reddit.com/r/EngineeringStudents/comments/14qu7l/add_meat_to_your_resume_by_avoiding_one_simple/)\n\nWe have started a newsletter which talks about the biggest problems we see and other thoughts that career centers might not put forth, so if you like what we have to say, check us out! [careerpigeon.com](http://www.careerpigeon.com)\n\nAs for this thread, we will be checking it throughout the day. \n\nAsk us anything! We'll do our best to help.  Hi, thanks for doing an AMA. I'm a sophomore in Civil Engineering who doesn't have much to put on a resume in terms of engineering experience. What do you think would make employers want to hire me for a first time internship, or something of the sort? Hi, thanks for doing an AMA. I'm a sophomore in Civil Engineering who doesn't have much to put on a resume in terms of engineering experience. What do you think would make employers want to hire me for a first time internship, or something of the sort? Well, although it always suck to say this but without experience, GPA starts to become a heavier factor. Have a good GPA early on in college and more opportunities are available for you. \n\nBut if your GPA is average or below, then start to make your own experiences. Don't wait to get an official experience. There is nothing stopping you from starting a blog, learning an instrument, founding a club at school (note: take this stuff to the next level, don't just join a club, FOUND a club or be the PRESIDENT). All of these experiences can be twisted into an \"engineering\" experience because they all have complexities which can be solved using real-world experimenting. \n\nFor the blog as an example: \n\nThe absolute first problem every blogger encounters is:\nHow do you get people to read it? \n\nBam! Just by asking the question, you turn from dude who posts stuff to Problem Solver. \n\nSo, here is how to solve the problem:\n\n\nHypothesis: /r/insert_subredditname_here seems like my blog material. \nMaybe people here would like my stuff. \n\nTest: Post it on that subreddit\n\nResults: Did it work?\n\nWhen you can say you performed experiments with a blog and then explain your though process to a recruiter: either on your resume or in an interview, you show exactly how valuable YOU are, even when it fails completely. Recruiters eat this stuff up. \n\nSo, my advice. Get out there and start looking for experiences you can have which you can then put on your resume. \n\nOne caveat: Everybody hates the person who did something only for their resume so it is really important that it is something you genuinely are passionate about. That passion will come out and you will really enjoy your experience. Thank you, I really appreciate it. I have one last question. What do you consider an average GPA? I have a 3.15, so where would you rank that as a recruiter?  That is right about average.   What are some good websites to search for engineering internships? Most of the times I try to search, I end up on webpages looking for fulltime positions.  I must point out these people on campus: ECS\nhttp://engineering.illinois.edu/current-students/career-services\n\nThey helped immensely with my job search, advice, and so on. They would be an excellent supplement to these good people's AMA. Best part: mock interviews! These are excellent practice and help build confidence.  Engineering will be my second bachelor's degree.  I've never used my first degree to get a job, but could the fact that I have it make me overqualified for internships and entry-level engineering jobs?  If so, what can I do to mitigate that problem?  [deleted]  I'm in Aerospace engineering and am a sophomore. I'll probably have around a 3.18 or 3.19 GPA after this semester. Is there any chance whatsoever of finding a job? I know some people here scoff at questions like that but I've had people tell me that without a 3.5 there is no point in applying and I've had others tell me that graduating from here with an engineering degree is fine.\n\nI should point out I haven't put in any real work in college yet (I obviously can't tell recruiters this upfront) and that I plan on getting my crap together but I know courses are going to get significantly harder soon.\n\nBasically my question is am I freaking out about jobs for no reason or am I really screwed?\n\nAlso I've been told the job market for Aerospace engineers isn't to hot right now. Do you know anything about that?\n\nLastly I have a question about useful skills. I speak spanish decently well and arabic pretty well. Are these things that interest any engineering companies even a little? Is putting the fact that I'm getting an Arabic studies minor worth it on my resume?  Yeah. You are freaking out for no good reason. Having a 3.5 is nice and doors will be easily opened for you. But a 3.18 is pretty average. And average people do get jobs. All you have to do is show you are above average and you will have as many opportunities.\n\nI don't know much about the aerospace engineering market (I'm a Chemical). But, the beauty about engineering, you can do anything and the recruiters hiring you (engineers themselves) know this too.\n\nAs for languages/skills, these are the spice that make you a person rather than applicant #23. And who knows, the head recruiter may even know Arabic - making you instantly memorable. So, yes, definitely put these things on your resume. The funny thing about GPA's is, once you get some good experience, companies don't care about it anymore. 3.18 is a great GPA, especially at a premier engineering university. I have slightly above that, and I was able to get an internship last summer and subsequently a job offer because I had worked on campus in IT help the summer before. That experience definitely caught their eye and matters way more than some number.\n\nSimilarly, one of my friends got a job this past fall, and his GPA is lower than 3.18 and lower than the minimum required GPA for his employer. Upon seeing that he goes to U of I, however, they said it didn't matter, because they knew how tough of a curriculum this is. He also had worked a research job with a professor on campus this summer.\n\nIt's all about getting job experience.  What are the pros and cons are of working/having a job?  Do you recommend that students list courses on their resume? I have a couple of summers of internship experience as well as a technical job on campus, but some companies still advise me to list courses that I am taking/have taken instead of that experience.  I would think that the work experience from internships would get priority but another perspective would be nice.  [deleted]  [deleted]  I am looking for an internship, but I only have 2 and a half months of break before I have to be back on campus. Any tips for internships on a tight time budget?  Hi, I am expecting a GPA of 3.92 or 4.0, but the problem is I am only a freshman in cs. I have taken math 241, cs 125, and cs 173. Are there decent chances of getting an internship in the summer?",
    "url" : "http://www.reddit.com/r/UIUC/comments/154hlb/now_is_the_best_time_to_talk_to_recruiters_we_are/"
  }, {
    "id" : 20,
    "title" : "Turn a paragraph of text into a paragraph of images",
    "snippet" : " ",
    "url" : "http://pikd.herokuapp.com/"
  }, {
    "id" : 21,
    "title" : "Projector",
    "snippet" : "Does anyone know if I can rent a projector from the library ? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/155fgh/projector/"
  }, {
    "id" : 22,
    "title" : "Does anyone know if Ike will be open for lunch on Friday?",
    "snippet" : "I've tried the website and it doesn't say anything. Any help would be great! Thanks!  [looks like no](http://www.housing.illinois.edu/en/Announcements/Home%20Page/diningclosings.aspx)  Last meal is Thursday dinner.\n\nSource: I work there.",
    "url" : "http://www.reddit.com/r/UIUC/comments/155436/does_anyone_know_if_ike_will_be_open_for_lunch_on/"
  }, {
    "id" : 23,
    "title" : "Is a D considered passing for a required course in Engineering?",
    "snippet" : "Just bombed a final and from what I've tallied up, I may be getting a D in a required course... I know it is recommended to retake, but is it required to get credit for an engineering required course?  From some CS department-provided information when I taught over the summer:\n\n - \"A grade of 'D-' still passes (but we require students with grades lower than C- to retake a course if it is a prerequisite for a subsequent course).\"\n\nI can't promise this is the same for all departments in engineering, but I don't see any reason why it wouldn't be. Of course, you should talk with an academic advisor about this; in addition to being able to answer this question, they'll know how important a course is for future courses, job interviews, etc.   I would think so...are you anywhere near academic probation? Nope... thought I heard somewhere that C- or above was required for engineering core courses. Nope... thought I heard somewhere that C- or above was required for engineering core courses. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/155nja/is_a_d_considered_passing_for_a_required_course/"
  }, {
    "id" : 24,
    "title" : "[EVENT] Rock and Roll show at the Red Herring Tonight! 9PM",
    "snippet" : "Finals are coming to a close, Christmas shopping is wrapping up, your friends are drinking egg nog, and you're coming to this show!\n\nHANK. (Local math sweat-hearts)\nhttp://hanktheband.com/\n\nCinema Verite (St. Louis rockers with nothing else to lose)\nhttp://cinemaverite1.bandcamp.com/\n\nKites (Collinsville music to make your heart song)\nhttp://www.youtube.com/watch?v=UyU_YnLdkzk\n\nAn Evening With Your Mother (Folk Rock locals, DIY-ing for revenge.)\nhttp://aneveningwithyourmother.bandcamp.com/\n\nRED HERRING\n9 PM | $3\n///NoDrUGS or DRINKING\\\\\\\n\n\nhttps://www.facebook.com/events/449776608415772/  Had a good time last night! Cinema Verite should swing by more often. On another note, I still can't fathom why local music/shows are down voted so heavily here.  Cinema Verite was indeed very good. Hell, they were all good.  How many shows can you go to where there's the threat of getting cut by glass from a broken plate. :) Anything goes at a Hank show. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/154btb/event_rock_and_roll_show_at_the_red_herring/"
  }, {
    "id" : 25,
    "title" : "KAM'S IS OFFICIALLY 21+",
    "snippet" : "heard from several bartenders -- kam's is 21+ starting next semester.  there were too many 18 year old's ticketed.  thoughts?  People over 21 go to Kam's? Hah, seriously, they're gonna tank. 18 year old freshman is their bread and butter. that and football players who bring their entourage Freshwomen + Entourage = Roofies: A Dateline NBC Special Why don't you have a seat right over th-......you know what, that's disgusting; let's just stand. Hah, seriously, they're gonna tank. 18 year old freshman is their bread and butter. Spread dem cheeks boy, Ill show you some bread and butter ;) People over 21 go to Kam's? 5.5 years at UIUC... not once did I step in Kam's... 5.5 years at UIUC... not once did I step in Kam's... People over 21 go to Kam's? &gt;People over 21 go to Campus Town?\n\nFTFY Bar hipster  \"The City of Champaign handed down severe penalties to Kam's today. Kam's will close for 3 weeks effective this Friday. We will reopen Friday Jan. 11 with 21 entry for the Spring Semester. A large fine was also imposed. This was the result of many 18 year olds found on premise.. A press release is expected Thursday or Friday. Refunds will be made for NYE.\"\n\nEdit: Sent to me by someone who works at Kams Who would willingly go to Kams for New Years? \"The City of Champaign handed down severe penalties to Kam's today. Kam's will close for 3 weeks effective this Friday. We will reopen Friday Jan. 11 with 21 entry for the Spring Semester. A large fine was also imposed. This was the result of many 18 year olds found on premise.. A press release is expected Thursday or Friday. Refunds will be made for NYE.\"\n\nEdit: Sent to me by someone who works at Kams \"The City of Champaign handed down severe penalties to Kam's today. Kam's will close for 3 weeks effective this Friday. We will reopen Friday Jan. 11 with 21 entry for the Spring Semester. A large fine was also imposed. This was the result of many 18 year olds found on premise.. A press release is expected Thursday or Friday. Refunds will be made for NYE.\"\n\nEdit: Sent to me by someone who works at Kams \"The City of Champaign handed down severe penalties to Kam's today. Kam's will close for 3 weeks effective this Friday. We will reopen Friday Jan. 11 with 21 entry for the Spring Semester. A large fine was also imposed. This was the result of many 18 year olds found on premise.. A press release is expected Thursday or Friday. Refunds will be made for NYE.\"\n\nEdit: Sent to me by someone who works at Kams If I had to spend my new years there I would kill myself.  If I would actually choose to spend it there, I should kill myself.   If I had to spend my new years there I would kill myself.  If I would actually choose to spend it there, I should kill myself.   \"The City of Champaign handed down severe penalties to Kam's today. Kam's will close for 3 weeks effective this Friday. We will reopen Friday Jan. 11 with 21 entry for the Spring Semester. A large fine was also imposed. This was the result of many 18 year olds found on premise.. A press release is expected Thursday or Friday. Refunds will be made for NYE.\"\n\nEdit: Sent to me by someone who works at Kams  Kameron's Bar and Grill is going to be over 21? It's going to be so much classier.  Well I suppose that I'm the only one here who enjoys Kam's. It's great to let loose once in a while, and I'd say that this is Kam's largest asset. You are basically allowed to do whatever you want there, like play drinking games in the basement, de-ice and chug your blue guys, and easily get some bar pull. Some redditors may hate on it, but Kam's block is a lot of fun as well. I enjoy KAMs until I breathe through my nose.  I think I would enjoy it a lot, I mean I do enjoy the atmosphere, but it just smells like vomit. Not saying the other bars smell fantastic, but kams is the only place where I walked in and was literally repulsed. Well I suppose that I'm the only one here who enjoys Kam's. It's great to let loose once in a while, and I'd say that this is Kam's largest asset. You are basically allowed to do whatever you want there, like play drinking games in the basement, de-ice and chug your blue guys, and easily get some bar pull. Some redditors may hate on it, but Kam's block is a lot of fun as well. ~~de-ice~~ Ice-out\nFTFY Well I suppose that I'm the only one here who enjoys Kam's. It's great to let loose once in a while, and I'd say that this is Kam's largest asset. You are basically allowed to do whatever you want there, like play drinking games in the basement, de-ice and chug your blue guys, and easily get some bar pull. Some redditors may hate on it, but Kam's block is a lot of fun as well. Well I suppose that I'm the only one here who enjoys Kam's. It's great to let loose once in a while, and I'd say that this is Kam's largest asset. You are basically allowed to do whatever you want there, like play drinking games in the basement, de-ice and chug your blue guys, and easily get some bar pull. Some redditors may hate on it, but Kam's block is a lot of fun as well. Well I suppose that I'm the only one here who enjoys Kam's. It's great to let loose once in a while, and I'd say that this is Kam's largest asset. You are basically allowed to do whatever you want there, like play drinking games in the basement, de-ice and chug your blue guys, and easily get some bar pull. Some redditors may hate on it, but Kam's block is a lot of fun as well. Well I suppose that I'm the only one here who enjoys Kam's. It's great to let loose once in a while, and I'd say that this is Kam's largest asset. You are basically allowed to do whatever you want there, like play drinking games in the basement, de-ice and chug your blue guys, and easily get some bar pull. Some redditors may hate on it, but Kam's block is a lot of fun as well. THIS  Do you think this will change the smell? **Nothing** can change the smell.   Seems like there's a lot of hate on Kams here. I don't get it. Kams is always a great time. It's not the bar that you go to that determines how good of a night you have, it's the people you're with. Being a grad, this news doesn't effect me, but it's sad to think that this could potentially be the downfall of one of the more iconic establishments on campus.  &gt; It's not the bar that you go to that determines how good of a night you have, it's the people you're with.\n\nSee, that's usually what I say when referencing the Illini Inn. It's a crappy bar full of fun interesting people who make it worth it. But Kam's? To me, Kam's is always full of a bunch of jackasses either puking on their shoes or starting fights. I'm entirely open and accepting of all types of atmospheres, but I've never seen the appeal of Kam's...at all. &gt; It's not the bar that you go to that determines how good of a night you have, it's the people you're with.\n\nSee, that's usually what I say when referencing the Illini Inn. It's a crappy bar full of fun interesting people who make it worth it. But Kam's? To me, Kam's is always full of a bunch of jackasses either puking on their shoes or starting fights. I'm entirely open and accepting of all types of atmospheres, but I've never seen the appeal of Kam's...at all. Seems like there's a lot of hate on Kams here. I don't get it. Kams is always a great time. It's not the bar that you go to that determines how good of a night you have, it's the people you're with. Being a grad, this news doesn't effect me, but it's sad to think that this could potentially be the downfall of one of the more iconic establishments on campus.  It smells terrible.  I've also heard a rumor that Red Lion is closing, can anyone shed light on where it started and whether or not there is any truth to it? I've also heard a rumor that Red Lion is closing, can anyone shed light on where it started and whether or not there is any truth to it? Did RL get in some trouble last year? It seems to me that they stepped up their security somewhat up from last year. Like now they have that guy who always wears a suit who kinda creeps me out. Fat guy with long hair is notorious among townies for yanking ID's left and right Including my legitimate ID. The bastard is strict. Honestly who would get a fake of a 20 year old, from illinois no less? (I had other forms ID proving I was the person on the card, not just 18 trying to get in). did he get away with it? did you get your id back? I have a California ID and that guy is *always* double-checking it. Including my legitimate ID. The bastard is strict. Honestly who would get a fake of a 20 year old, from illinois no less? (I had other forms ID proving I was the person on the card, not just 18 trying to get in). Including my legitimate ID. The bastard is strict. Honestly who would get a fake of a 20 year old, from illinois no less? (I had other forms ID proving I was the person on the card, not just 18 trying to get in).  It's going the route of CO's!   This isn't going to change anything. People with fakes or any sort of bar connections (\"bar pull\") will still be able to get in. I thought the problem was that it was the people with the bar pull who were getting in? I avoid Kam's like the plague but it seems to me like a popular spot for the frats since they can gain influence with the bartenders, and so they bring all their freshmen in. I've rarely seen a freshman with a decent group of friends or a decent taste in bar scenes sekeing to go to Kam's, its all the frats and clubs who drag their freshmen along. I thought the problem was that it was the people with the bar pull who were getting in? I avoid Kam's like the plague but it seems to me like a popular spot for the frats since they can gain influence with the bartenders, and so they bring all their freshmen in. I've rarely seen a freshman with a decent group of friends or a decent taste in bar scenes sekeing to go to Kam's, its all the frats and clubs who drag their freshmen along. Because every frat or club is a bad crowd to get involved with. Because every frat or club is a bad crowd to get involved with. I thought the problem was that it was the people with the bar pull who were getting in? I avoid Kam's like the plague but it seems to me like a popular spot for the frats since they can gain influence with the bartenders, and so they bring all their freshmen in. I've rarely seen a freshman with a decent group of friends or a decent taste in bar scenes sekeing to go to Kam's, its all the frats and clubs who drag their freshmen along. I thought the problem was that it was the people with the bar pull who were getting in? I avoid Kam's like the plague but it seems to me like a popular spot for the frats since they can gain influence with the bartenders, and so they bring all their freshmen in. I've rarely seen a freshman with a decent group of friends or a decent taste in bar scenes sekeing to go to Kam's, its all the frats and clubs who drag their freshmen along.     This is just for next semester. It's going back to 19 next year. Why would they do that? Why would they do that? If a bar gets too many citations for minors drinking in their establishment they can get put on probation.  Then if theres still trouble with minors there the police can shut it down for good. So Kams probably got in some trouble for having too many minors there and are making it 21+ until they're off probation.  Same thing happened to Fire Station last year and I'm pretty sure  it had a major role in it being shut down. Why would they do that?  Just another excuse to put off going there once before I graduate Just another excuse to put off going there once before I graduate     Idgaf. I don't go anywhere near Kam's anyway.   I'm not going there anyway. Nope. Not really the JD scene anyway. If I want to drink with children, I'll bring liquor to a chuck-e-cheeses. Not really the JD scene anyway. If I want to drink with children, I'll bring liquor to a chuck-e-cheeses.  NOOOOO!!!!! HOW WILL I HIT ON DRUNK NON 21 GIRLS!!!!! I'M DRUNK I SHOULD HAVE GONE TO LE KAMMMMSS!!!  [deleted] [deleted] It's not owned by him [deleted] what is a cockring bar, please elaborate  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/152ohs/kams_is_officially_21/"
  }, {
    "id" : 26,
    "title" : "The College of Law has a Professor Lawless!",
    "snippet" : "   Yes, and he's the man. \n\nThere's also Professor Hurt (who teaches Torts). Yes, and he's the man. \n\nThere's also Professor Hurt (who teaches Torts).  If you think that's good, did you know there's a psychiatrist in Champaign by the name of Dr. Jeckel? Even better is that he apparently had a college friend named Mr. Hyde, and they became friends only because of their names. Well there is a [Prof. Hyde](http://www.psychology.illinois.edu/people/dchyde) in the Psychology department.\n\nEdit: Also a [Prof. Beever](http://ansci.illinois.edu/directory/jonathan-beever) in the Animal Sciences department. Well there is a [Prof. Hyde](http://www.psychology.illinois.edu/people/dchyde) in the Psychology department.\n\nEdit: Also a [Prof. Beever](http://ansci.illinois.edu/directory/jonathan-beever) in the Animal Sciences department.",
    "url" : "http://www.law.illinois.edu/faculty/profile/robertlawless"
  }, {
    "id" : 27,
    "title" : "Any Psych Majors?",
    "snippet" : "I'm a Math/CS major, but I'm interested in taking a class in cognitive science for fun. I would normally ask my adviser this question but I'm not sure a math adviser would know.\n\nCan you explain to me the difference between:\n\n* Intro to Brain and Cognition\n* Behavioral Neuroscience\n* Cognitive Psych\n* Learning and Memory\n\nThe descriptions on my.illinois are kind of vague. Also if you could tell me how difficult each class is, that would be amazing. Thanks!  I took PSYC 224, Cognitive Psych as a junior.  It was definitely easy.  All the test material comes from lectures/slides.  There were weekly online quizzes, but they only had 5 questions, and you could retake it as many times as you want.  You do have to attend lecture to get iClicker participation points.  You can also get extra credit by participating in psych experiments (not as scary as it sounds).\n\nThe course is a good intro survey in Cognitive Psych.  There's a broad range of topics, that aren't covered in much depth past the basics.  If you have minimal to no background in cognitive psych, this might be an easy place to start.   Just so you know, this has changed since it isn't Roberts and is now Federmeier.  Attendance is no longer iClicker based.  I've had both, I think that Roberts had easier tests but that Federmeier is a bit more focused on certain things (especially language, which if I'm not mistaken, is her specialty).  \n\nI've also taken Learning and Memory, which dealt mainly with how information is stored, cued, and reexamined.  I would say its a bit ironic that I can remember little else...  Oh ok. I had Braverman   If you were interested in an interesting neuroscience/philosophy class for the fall, look into NEUR 433 - Evolutionary Neuroscience.\n\nNo background information necessary (though it helps) and Dr. Rhodes is the man. \n\n I wanted to take this class so badly this semester.  I wish he taught it in the spring too. Have you taken NEUR 413?\n\nGulley is a baller; I loved that class. I've signed up for the spring semester! \n\nGlad to hear it. Now I'm even more stoked for the class. :D If you were interested in an interesting neuroscience/philosophy class for the fall, look into NEUR 433 - Evolutionary Neuroscience.\n\nNo background information necessary (though it helps) and Dr. Rhodes is the man. \n\n  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1535u7/any_psych_majors/"
  }, {
    "id" : 28,
    "title" : "r/UIUC Post-Finals Support Group Meetup",
    "snippet" : "I need emotional reassurance after this last week.\n\nPlus, the last meetup was in July.\n\nI propose a meetup at Murphy's at the end of the week. I dunno how people's schedules are set up, so we'll go majority vote on the day/time. I was thinking Friday or Saturday night.\n\nI will be drinking, but no need to do so if you don't want to.\n\nI have my MATH 415 final in 3.5 hours with Haboush. I want to die.\n\nIN OTHER NEWS: I'M PANICKING, HABOUSH GAVE ME WRONG ROOM WAT DO   While Haboush's MATH 415 class was hands down the most poorly taught class I have ever taken and anticipate that I will ever take in my entire life, his tests were very easy. All straight computation, and the answers came out as such that if you had done something wrong, the numbers would be crazy and you would know. That being said, good luck! And take comfort in knowing that every student of Haboush's you will ever meet will agree with you that he is the absolute worst professor to have ever walked the planet. While Haboush's MATH 415 class was hands down the most poorly taught class I have ever taken and anticipate that I will ever take in my entire life, his tests were very easy. All straight computation, and the answers came out as such that if you had done something wrong, the numbers would be crazy and you would know. That being said, good luck! And take comfort in knowing that every student of Haboush's you will ever meet will agree with you that he is the absolute worst professor to have ever walked the planet.  i already took that final, assuming you are taking a similar one it wasn't too bad... Conflict.  [deleted] NO IT WON'T, HABOUSH EMAILED ME WRONG ROOM LOL GG  I take mine tomorrow. How'd it go for you? I'm sitting here waiting for a response e-mail so I can take it.     Looks at list of majors....\n\n...nerds\n\nIs this just a meetup of redditors or specific to any department... I'll throw down my \"I used to be a TAM major\" card if I have to. Wait... is TAM still a thing? I know they merged with ME dept a while back, but is it even still a major?\n\nAlso, did you expect reddit to be crawling with business and leisure studies majors? It's just about the same program, just called Engineering Mechanics now.  First they took our major, then shortly after I think they took our building... Isn't Talbott for Nuclear now?  \n\n Looks at list of majors....\n\n...nerds\n\nIs this just a meetup of redditors or specific to any department... I'll throw down my \"I used to be a TAM major\" card if I have to.",
    "url" : "http://www.reddit.com/r/UIUC/comments/1520jm/ruiuc_postfinals_support_group_meetup/"
  }, {
    "id" : 29,
    "title" : "What's that noise? ",
    "snippet" : "Sounds like a tornado siren over here at Fourth &amp; Chalmers. Anyone know what's going on?  santa claus   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1530lv/whats_that_noise/"
  }, {
    "id" : 30,
    "title" : "Suburban Express Policy/Inconsistency?",
    "snippet" : "I'm not here to rant, even though I am extremely tempted to. So I just had the worst experience of my life with Suburban Express. So their policy is, all passengers must carry a physical print-out of the ticket issued by them on their website during the time of boarding. I can bring myself to understand this with a bit of skepticism regarding their archaic system (as opposed to LEX who simply gives the bus driver a list of passengers and checks for ID).\n\nThe following happened to my girlfriend. We were boarding a 4:30 a.m. bus on the south side of ISR, we got there 15min early, and she had forgotten her physical copy of the ticket. They directed her to go to ISR in order to print it out, even though she has no access to the building. While she waited at the door for someone to be on the way out, 2 more people showed up with similar problems. Except one person had a print out of the screenshot of the ticket, which they refused as a proof of ticket. After the person bitched and moaned, they decided to check his confirmation e-mail as proof, and let him on the bus. Apparently they couldn't do it for my girlfriend and the other guy. While my girlfriend is inside ISR printing out her ticket, they decided 5min past 4:30 a.m. is too much to wait for, they left.\n\nNow, they haven't violated any of their policies, I agree, except maybe the guy who had an incorrect print out of the ticket. But really, 5 minutes? And really, you can do something special for one person and not for 2 more? who obviously purchased a ticket? I am very disappointed in their customer service and overall attitude towards their customers.\n\nAm I just biased in this situation because my girlfriend got shafted? Is this a common theme in Suburban Express customer service? Please share if you have any insights.     Is their policy clearly stated? Yes. \n\nIs it archaic? Does it COMPLETELY screw over a lot of people who forgot tickets or were unable to print them? Absolutely. \n\nI too have had to watch a Suburban Express bus pull away because a screenshot wasn't enough even though I had clearly purchased one!   Guys, I would recommend looking at Amtrak. In the past the tickets were always $35+, but this past year, $14 ones are popping up from Champaign to Chicago.  You can usually get tickets for ~$14 if you buy them early enough (and you can be a little flexible with your departing time). If you wait until last minute, you're probably going to pay $35. \n\nI travel back home often and typically pay $28 round trip. \n\nEDIT: I usually head home Thursday night, and head back Sunday morning. My ticket has always been $14 dollars for the 6:49 PM train home and 8:25 AM train back on Sunday. \n\nI just checked the website, next Friday there are tickets (I know this doesn't help because most people want to be home for the holidays but I'm using it as an example) available for the ~6:00 PM train at $14. Two weeks from that there are tickets for $26 and $14. \n\nAlso, most - if not all - of the buses will take you to the terminal. \n Guys, I would recommend looking at Amtrak. In the past the tickets were always $35+, but this past year, $14 ones are popping up from Champaign to Chicago.  I considered Amtrak, the only issues is that you need an additional hour to go from the Union Station to whatever station it is that's close to O'Hare =( I don't even care. Even though I'll have to spend an extra hour or two, and the trip is costing me more (I was supposed to have a ride up originally, so the ticket purchase was last-minute), I'm still taking Amtrak + Metra to get home for break, because the whole experience is better. The comfy seats, leg room, tray tables, more room for carry-ons, snack car, and no need to worry about a bad driver. I don't even care. Even though I'll have to spend an extra hour or two, and the trip is costing me more (I was supposed to have a ride up originally, so the ticket purchase was last-minute), I'm still taking Amtrak + Metra to get home for break, because the whole experience is better. The comfy seats, leg room, tray tables, more room for carry-ons, snack car, and no need to worry about a bad driver. I considered Amtrak, the only issues is that you need an additional hour to go from the Union Station to whatever station it is that's close to O'Hare =(   Is it really that hard to print out your ticket? I feel they make it pretty clear but every time I ride one of their busses there is someone that shows up without a ticket! Is it really that hard to print out your ticket? I feel they make it pretty clear but every time I ride one of their busses there is someone that shows up without a ticket! Like I said, their policy was clearly stated, and I respect it if they follow through, but I didn't feel comfortable with their special treatment on that one guy.\n\nI also think LEX did spoil a lot of people into thinking they don't need any preparation prior to boarding the bus, but at the same time it's also a convenience they could perhaps look into implementing? Now that LEX is gone, I am sure they can invest some money from their newly regained monopoly into something similar.    [deleted] Any reason you guys choose to publicly shame people who have not paid? \n\nInstead of attacks on other bus companies wouldn't your marketing be better spend trying to show what is good about your company?\n\nAnd I've never been on a  bus that was on time/arrived before the time stated, would it not be better to just change the times on arrival instead of being late every time?(The bus driver complain you guys don't allow time for disembarking when considering the times) \n\n [deleted] [deleted] [deleted] &gt;As another poster noted, paper tickets are the basis for our extremely efficient boarding system. We would never be able to get hundreds of people on buses quickly if we messed around with lists, ID's, and garbage like that. \n\nI'm sorry, but this is bullshit. Checking a name on a list does *not* take significantly longer than checking a ticket. And you could shorten it further by checking only those who have forgotten their tickets. One small change, and suddenly you can make 99.9% happy instead of 99.5%. And before you say that this will lead to everyone \"forgetting\" their ticket and significantly lengthening loading times: Charge a \"lost ticket fee\" for anyone who shows up without a ticket and has to have their name looked up. Warn them about that fee four times throughout the purchase, just as you do about the current ticket policy.\n\nPlease keep in mind that I think your ticket policy really is fair; I just think that a few small changes could make *everyone* happy for a *very* small amount of additional effort.\n\nSecondly, I'd like to bring up the apparent policy of banning anyone who posts complaints about Suburban Express. I'm not saying that *is* what happens, but I have no choice but to believe it until I hear a better explanation. Believe it or not, *customer complaints are good for you*. A complaining customer, especially one who complains directly to you first, is *trying to tell you how to make it right*, not trying to slander your company name. Quite frankly, banning complainers harms you far more than Internet complaints could ever do.\n\nOh, and the following isn't directed at you, but to others who might be reading this comment:\n\n###DO NOT DOWNVOTE SUBURBANEXPRESS JUST BECAUSE THEY'RE SUBURBANEXPRESS. PEOPLE PROBABLY WANT TO SEE THEIR COMMENTS, AND I VERY MUCH DOUBT THAT SUBURBANEXPRESS CARES ABOUT KARMA OR OTHER IMAGINARY INTERNET POINTS. [deleted] [deleted] [deleted] [deleted] [deleted] [deleted]       Try selling a picture of your passport on your iphone to immigration officials and see how that works out.",
    "url" : "http://www.reddit.com/r/UIUC/comments/1524mm/suburban_express_policyinconsistency/"
  }, {
    "id" : 31,
    "title" : "I'm looking for a class rumored to exist, but a catalog search has turned up nothing.",
    "snippet" : "Hey guys, I'm looking for a brewing class that was rumored to exist, but I can't find any evidence of that in the catalog. The closet I can find is MCB 312 Applied Microbiology Methods which is about industrial cultivation of microbes it seems. \n\nSimilarly there was talk of a wine tasting class, but I hear it doesn't exist anymore. \n\nIf anyone has good places to start with brewing, let me know, I'm interested in taking it up.  it's right next to underwater basket weaving  I'm assuming you're talking about the FSHN grad level course on fermented and distilled beverages. The professor that taught it just retired.   I'll bet ~~[the homebrew club](http://www.buzzhomebrewclub.com/)~~ [the homebrew club](http://www.buzzbrewclub.org/) could teach you a thing or two. That should be [Buzz Brew Club](http://www.buzzbrewclub.org), not [Buzz Homebrew Club](http://www.buzzhomebrewclub.com/) - Buzz Homebrew Club is in West Chester, Pennsylvania. That should be [Buzz Brew Club](http://www.buzzbrewclub.org), not [Buzz Homebrew Club](http://www.buzzhomebrewclub.com/) - Buzz Homebrew Club is in West Chester, Pennsylvania. Wait, so it's Pizza by Alfredo, not Alfredo's Pizza Cafe? I always get it mixed up.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/152jy8/im_looking_for_a_class_rumored_to_exist_but_a/"
  }, {
    "id" : 32,
    "title" : "[Special Mod Announcement] I got a puppy!",
    "snippet" : "[Isn't he cute](http://imgur.com/a/4RaxU)?\n\nHis name is Totoro!\n\nHe's a St. Bernard  these are the type of important mod announcements that a college subreddit needs, PUPPIES! *squeal*  This is the most egregious abuse of the [M] tag that I have ever seen, and I'm not even mad. This is the most egregious abuse of the [M] tag that I have ever seen, and I'm not even mad.  http://i.imgur.com/YsUqJ.jpg http://i.imgur.com/YsUqJ.jpg   he is cute you shouldn't eat him  OH. MY. GOD. I think my brain just exploded. So you have two giant dogs now?\n Yes!\n\nTessy is a Newfoundland =)\n\nGiant dogs are the best dogs.    http://www.quickmeme.com/meme/3s8lmk/          What does Tessy think of Totoro? She's a bit jealous of the attention he gets, but otherwise pretty happy.\n\nAt night, sometimes he whines in his crate then she goes over and sleeps next to him.  i don't get how i can post a relevant question pertaining to the university and get downvoted to hell, yet this post gets 100+ upvotes... ",
    "url" : "http://www.reddit.com/r/UIUC/comments/150n7u/special_mod_announcement_i_got_a_puppy/"
  }, {
    "id" : 33,
    "title" : "Looking for Computer Science major",
    "snippet" : "I just got accepted to Illinois school of Engineering as a Computer Science major, but am still not sure if I will attend. I have a lot of questions, and was looking for someone (or many people) to answer my questions.",
    "url" : "http://www.reddit.com/r/UIUC/comments/152fku/looking_for_computer_science_major/"
  }, {
    "id" : 34,
    "title" : "So...is it mandatory or not?",
    "snippet" : "    So glad as a transfer student I never had to deal with that or the alcohol bullshit. Then you missed a Tony-worthy acting performance in ACE IT theater. \"Oh hey sis!\" \n\n*leaps out of tree* *yelling in the quad*\n\nWERE YOU GUYS DRUNK?\n\nYEAH BRO I RAPED HER *yelling in the quad*\n\nWERE YOU GUYS DRUNK?\n\nYEAH BRO I RAPED HER So glad as a transfer student I never had to deal with that or the alcohol bullshit. [deleted] So glad as a transfer student I never had to deal with that or the alcohol bullshit. WAIT. I was a transfer student and had to go to it, what the hell. Were you over 21?  I ripped them a new one for A Presenting men as not able to control themselves and being innate rapists and B for telling girls \"OMGZ don't go outside!! They will rape you!!! Never drink around guys if you don't wanna be raped and C for saying that whoever regrets drunk sex can claim rape..\nThe whole thing is BS IMO. What are you talking about? I'm a FYCARE facilitator and that's the exact opposite of the message we try to send... Maybe you could point to some materials that support what you're saying. So far, all I can find are some non-starter Myth/Fact blurbs on https://www-s.odos.uiuc.edu/care/\n\nA good start may be to bring up that the [CDC's National Intimate Partner and Sexual Violence Survey (NISVS)](http://www.cdc.gov/violenceprevention/nisvs/) suggests that in 2010 approximately 44% of rapes committed against a partner of the opposite sex were committed by women against men. If popular opinion is that your program is sexist, opening like this would knock that right out.\n\nAnother area to tackle might be in the definition of rape itself. It wasn't until this year, 2012, that the federal definition of rape even [allowed for the possibility of a male victim](http://www.nytimes.com/2012/01/07/us/politics/federal-crime-statistics-to-expand-rape-definition.html). Many young men may not even realize that they've been raped, let alone know how to handle such a situation or who to approach to talk about it. We have a list of sources in case anyone asks about our material.\n\nCould you point out the exact page number for that 44%? I read through that section and couldn't find the statistic you pointed out. Maybe I read past it.\n\nA good chunk of the workshop is defining rape, and pointing out that the term is gender-neutral. We talk through a few different scenarios that involve male victims and how they should be treated no differently from female victims (i.e. their concerns shouldn't be blown off because \"dudes love sex brahhh\") and what they can do about it. &gt; We have a list of sources in case anyone asks about our material.\n\nCould you provide a link to this list? Is it online? I don't doubt that you have a list, but it would be nice to see what you're using as references.\n\n&gt; Could you point out the exact page number for that 44%? I read through that section and couldn't find the statistic you pointed out. Maybe I read past it.\n\nYou didn't read past it. It isn't reported, because the definitions of rape used in the NISVS report aren't consistent between men and women, which affects the reported numbers. The NISVS report was conducted before the new male-inclusive federal definition.\n\nI spend time over in /r/MensRights, which sees a lot of analysis of statistics like these. One user [broke down the NISVS report](http://www.reddit.com/r/MensRights/comments/143skb/2010_cdc_survey_on_sexual_violence_shows_that/) in such a way that accounts for the discrepancy in definitions, and arrived at the 44% statistic. I ran through his numbers on my side and couldn't find any glaring errors, though his commentary is a little hyperbolic.\n\nBear in mind that this is a statistic for rapes reported in the year prior to the study, before the new federal definition went into effect, so the user is potentially extrapolating incorrectly. We'll have to give it a couple more years before we can do an apples-to-apples comparison between men and women, if only to account for the revised definition. Until then, *any* nontrivial extrapolation is worth discussion, and this is one.\n\n&gt; A good chunk of the workshop is defining rape, and pointing out that the term is gender-neutral. We talk through a few different scenarios that involve male victims and how they should be treated no differently from female victims (i.e. their concerns shouldn't be blown off because \"dudes love sex brahhh\") and what they can do about it.\n\nAwesome. Keep it up. :) Maybe you could point to some materials that support what you're saying. So far, all I can find are some non-starter Myth/Fact blurbs on https://www-s.odos.uiuc.edu/care/\n\nA good start may be to bring up that the [CDC's National Intimate Partner and Sexual Violence Survey (NISVS)](http://www.cdc.gov/violenceprevention/nisvs/) suggests that in 2010 approximately 44% of rapes committed against a partner of the opposite sex were committed by women against men. If popular opinion is that your program is sexist, opening like this would knock that right out.\n\nAnother area to tackle might be in the definition of rape itself. It wasn't until this year, 2012, that the federal definition of rape even [allowed for the possibility of a male victim](http://www.nytimes.com/2012/01/07/us/politics/federal-crime-statistics-to-expand-rape-definition.html). Many young men may not even realize that they've been raped, let alone know how to handle such a situation or who to approach to talk about it. Can a woman really rape a man? Men are physically stronger. And how can it be done without the man's cooperation/willingness?  Yes. Some women are strong...some women coerce men into having \"sex\" (\"sex\" that involves coercion is assault)...some women may use drugs/alcohol to incapacitate a man...there are many ways of getting around a man's (potential) physical strength. Yes. Some women are strong...some women coerce men into having \"sex\" (\"sex\" that involves coercion is assault)...some women may use drugs/alcohol to incapacitate a man...there are many ways of getting around a man's (potential) physical strength. Still, how can it be done without the man's cooperation and willingness? A man can have sex with an unwilling woman, but a woman cannot possibly have forced sex with an unwilling man.\n\n&gt; some women coerce men into having sex\n\nYou mean they seduce them? That is different from rape. Erections are not voluntary actions.\n\nIf a woman's vagina gets wet while she's being raped, does that mean it's not rape?\n\nIf a man or a woman orgasm during a rape, does that mean it wasn't rape?\n\nErection does not equal consent. \n\nYou also seem a little hazy on the definitions of coercion and blackmail and how they relate to rape. &gt; You also seem a little hazy on the definitions of coercion and blackmail and how they relate to rape.\n\nI am no expert on these matters, but on a layman-level, I understand rape is different from coercion and blackmail with regard to the degree of control available to the victim. In rape, the victim is physically overpowered or is drunk/drugged or is kidnapped and has no chance of avoiding being sexually violated. The victim does not give consent, it isn't asked for, and no cooperation of the victim is needed. Rape happens when there is penetration, without that it is sexual assault. \n\nWhen I think of coercion, I think of sexual harassment - for example, an employee being asked to provide sexual favors to their boss or risk getting fired. They are still giving consent, though under duress. They could not give consent and get fired, and be unable to make ends meet, and that might be a very high price to pay depending on their circumstances, and capitulating to the demands for favors might be easier. \n\nWhen I think of blackmail, I think of sexual favors as a price for keeping an embarrassing secret or keeping some information about the victim private. There is still some choice there, the victim gives consent under duress, because the shame of the information in question becoming public might be too much for them to bear.\n\nI am not saying the above two circumstances are good or acceptable or are not abusive or are not traumatic for the victim, but calling these situations rape diminishes \"real rape\", in which the victim is completely powerless and cannot get away. If you include the above two situations in rape, it seems to me that that will dilute the definition of rape. \n\nEDIT: Going by the numerous downvotes I got for my comments in this thread, I suppose these are all rape, just different degrees of rape. After all, this is reddit, where upvotes and downvotes determine the legitimacy of any viewpoint. You are right if you get upvoted and wrong if you get downvoted.\n\nEDIT2: I wouldn't have minded the downvotes if they were from /r/uiuc, but a lot of comments (and possibly downvotes) are from non-UIUC visitors from /r/MensRights. A (woman) friend of mine told me she doesn't reddit because they have hateful, misogynistic subreddits like /r/MensRights where they are always trashing women, and I told her she could always avoid those subreddits. Visitors from /r/MensRights, please keep your radical views to that subreddit where you validate and affirm each other about how horrid all women are and how you are victimized by them all, and please don't infiltrate local subreddits like /r/uiuc where there are a fair number of women. \n\nYou are unwelcome here unless you have a question about UIUC or CU. if you read the sidebar, you can see that this is a subreddit for people affiliated to UIUC or Champaign-Urbana in some way:\n\n\"*This subreddit is for anyone/anything related to UIUC. Students, Alumni, Faculty, and Townies are all welcome.*\n\n*Given the lack of a regional subreddit, it also covers most things in the Champaign-Urbana area.*\"\n\nPlease keep your ridiculous claims of 44% of rapes being woman-on-man (which diminishes the trauma of real women (and child) victims of violent rape), as well as claims of perfectly sober and physically stronger men being incapable of resisting a women's advances and letting themselves be raped in order to avoid conflict and confrontation to that subreddit.  &gt; You also seem a little hazy on the definitions of coercion and blackmail and how they relate to rape.\n\nI am no expert on these matters, but on a layman-level, I understand rape is different from coercion and blackmail with regard to the degree of control available to the victim. In rape, the victim is physically overpowered or is drunk/drugged or is kidnapped and has no chance of avoiding being sexually violated. The victim does not give consent, it isn't asked for, and no cooperation of the victim is needed. Rape happens when there is penetration, without that it is sexual assault. \n\nWhen I think of coercion, I think of sexual harassment - for example, an employee being asked to provide sexual favors to their boss or risk getting fired. They are still giving consent, though under duress. They could not give consent and get fired, and be unable to make ends meet, and that might be a very high price to pay depending on their circumstances, and capitulating to the demands for favors might be easier. \n\nWhen I think of blackmail, I think of sexual favors as a price for keeping an embarrassing secret or keeping some information about the victim private. There is still some choice there, the victim gives consent under duress, because the shame of the information in question becoming public might be too much for them to bear.\n\nI am not saying the above two circumstances are good or acceptable or are not abusive or are not traumatic for the victim, but calling these situations rape diminishes \"real rape\", in which the victim is completely powerless and cannot get away. If you include the above two situations in rape, it seems to me that that will dilute the definition of rape. \n\nEDIT: Going by the numerous downvotes I got for my comments in this thread, I suppose these are all rape, just different degrees of rape. After all, this is reddit, where upvotes and downvotes determine the legitimacy of any viewpoint. You are right if you get upvoted and wrong if you get downvoted.\n\nEDIT2: I wouldn't have minded the downvotes if they were from /r/uiuc, but a lot of comments (and possibly downvotes) are from non-UIUC visitors from /r/MensRights. A (woman) friend of mine told me she doesn't reddit because they have hateful, misogynistic subreddits like /r/MensRights where they are always trashing women, and I told her she could always avoid those subreddits. Visitors from /r/MensRights, please keep your radical views to that subreddit where you validate and affirm each other about how horrid all women are and how you are victimized by them all, and please don't infiltrate local subreddits like /r/uiuc where there are a fair number of women. \n\nYou are unwelcome here unless you have a question about UIUC or CU. if you read the sidebar, you can see that this is a subreddit for people affiliated to UIUC or Champaign-Urbana in some way:\n\n\"*This subreddit is for anyone/anything related to UIUC. Students, Alumni, Faculty, and Townies are all welcome.*\n\n*Given the lack of a regional subreddit, it also covers most things in the Champaign-Urbana area.*\"\n\nPlease keep your ridiculous claims of 44% of rapes being woman-on-man (which diminishes the trauma of real women (and child) victims of violent rape), as well as claims of perfectly sober and physically stronger men being incapable of resisting a women's advances and letting themselves be raped in order to avoid conflict and confrontation to that subreddit.  &gt; You also seem a little hazy on the definitions of coercion and blackmail and how they relate to rape.\n\nI am no expert on these matters, but on a layman-level, I understand rape is different from coercion and blackmail with regard to the degree of control available to the victim. In rape, the victim is physically overpowered or is drunk/drugged or is kidnapped and has no chance of avoiding being sexually violated. The victim does not give consent, it isn't asked for, and no cooperation of the victim is needed. Rape happens when there is penetration, without that it is sexual assault. \n\nWhen I think of coercion, I think of sexual harassment - for example, an employee being asked to provide sexual favors to their boss or risk getting fired. They are still giving consent, though under duress. They could not give consent and get fired, and be unable to make ends meet, and that might be a very high price to pay depending on their circumstances, and capitulating to the demands for favors might be easier. \n\nWhen I think of blackmail, I think of sexual favors as a price for keeping an embarrassing secret or keeping some information about the victim private. There is still some choice there, the victim gives consent under duress, because the shame of the information in question becoming public might be too much for them to bear.\n\nI am not saying the above two circumstances are good or acceptable or are not abusive or are not traumatic for the victim, but calling these situations rape diminishes \"real rape\", in which the victim is completely powerless and cannot get away. If you include the above two situations in rape, it seems to me that that will dilute the definition of rape. \n\nEDIT: Going by the numerous downvotes I got for my comments in this thread, I suppose these are all rape, just different degrees of rape. After all, this is reddit, where upvotes and downvotes determine the legitimacy of any viewpoint. You are right if you get upvoted and wrong if you get downvoted.\n\nEDIT2: I wouldn't have minded the downvotes if they were from /r/uiuc, but a lot of comments (and possibly downvotes) are from non-UIUC visitors from /r/MensRights. A (woman) friend of mine told me she doesn't reddit because they have hateful, misogynistic subreddits like /r/MensRights where they are always trashing women, and I told her she could always avoid those subreddits. Visitors from /r/MensRights, please keep your radical views to that subreddit where you validate and affirm each other about how horrid all women are and how you are victimized by them all, and please don't infiltrate local subreddits like /r/uiuc where there are a fair number of women. \n\nYou are unwelcome here unless you have a question about UIUC or CU. if you read the sidebar, you can see that this is a subreddit for people affiliated to UIUC or Champaign-Urbana in some way:\n\n\"*This subreddit is for anyone/anything related to UIUC. Students, Alumni, Faculty, and Townies are all welcome.*\n\n*Given the lack of a regional subreddit, it also covers most things in the Champaign-Urbana area.*\"\n\nPlease keep your ridiculous claims of 44% of rapes being woman-on-man (which diminishes the trauma of real women (and child) victims of violent rape), as well as claims of perfectly sober and physically stronger men being incapable of resisting a women's advances and letting themselves be raped in order to avoid conflict and confrontation to that subreddit.  &gt; You also seem a little hazy on the definitions of coercion and blackmail and how they relate to rape.\n\nI am no expert on these matters, but on a layman-level, I understand rape is different from coercion and blackmail with regard to the degree of control available to the victim. In rape, the victim is physically overpowered or is drunk/drugged or is kidnapped and has no chance of avoiding being sexually violated. The victim does not give consent, it isn't asked for, and no cooperation of the victim is needed. Rape happens when there is penetration, without that it is sexual assault. \n\nWhen I think of coercion, I think of sexual harassment - for example, an employee being asked to provide sexual favors to their boss or risk getting fired. They are still giving consent, though under duress. They could not give consent and get fired, and be unable to make ends meet, and that might be a very high price to pay depending on their circumstances, and capitulating to the demands for favors might be easier. \n\nWhen I think of blackmail, I think of sexual favors as a price for keeping an embarrassing secret or keeping some information about the victim private. There is still some choice there, the victim gives consent under duress, because the shame of the information in question becoming public might be too much for them to bear.\n\nI am not saying the above two circumstances are good or acceptable or are not abusive or are not traumatic for the victim, but calling these situations rape diminishes \"real rape\", in which the victim is completely powerless and cannot get away. If you include the above two situations in rape, it seems to me that that will dilute the definition of rape. \n\nEDIT: Going by the numerous downvotes I got for my comments in this thread, I suppose these are all rape, just different degrees of rape. After all, this is reddit, where upvotes and downvotes determine the legitimacy of any viewpoint. You are right if you get upvoted and wrong if you get downvoted.\n\nEDIT2: I wouldn't have minded the downvotes if they were from /r/uiuc, but a lot of comments (and possibly downvotes) are from non-UIUC visitors from /r/MensRights. A (woman) friend of mine told me she doesn't reddit because they have hateful, misogynistic subreddits like /r/MensRights where they are always trashing women, and I told her she could always avoid those subreddits. Visitors from /r/MensRights, please keep your radical views to that subreddit where you validate and affirm each other about how horrid all women are and how you are victimized by them all, and please don't infiltrate local subreddits like /r/uiuc where there are a fair number of women. \n\nYou are unwelcome here unless you have a question about UIUC or CU. if you read the sidebar, you can see that this is a subreddit for people affiliated to UIUC or Champaign-Urbana in some way:\n\n\"*This subreddit is for anyone/anything related to UIUC. Students, Alumni, Faculty, and Townies are all welcome.*\n\n*Given the lack of a regional subreddit, it also covers most things in the Champaign-Urbana area.*\"\n\nPlease keep your ridiculous claims of 44% of rapes being woman-on-man (which diminishes the trauma of real women (and child) victims of violent rape), as well as claims of perfectly sober and physically stronger men being incapable of resisting a women's advances and letting themselves be raped in order to avoid conflict and confrontation to that subreddit.  Still, how can it be done without the man's cooperation and willingness? A man can have sex with an unwilling woman, but a woman cannot possibly have forced sex with an unwilling man.\n\n&gt; some women coerce men into having sex\n\nYou mean they seduce them? That is different from rape. Women can penetrate men using their fingers or other objects, or can use drugs like Viagra to make a man get an erection (I'm assuming that's what you were leaning towards in your question).\n\nExamples of coercion: a woman badgering a man over and over and over again for sex and he does it to shut her up, or trying to use blackmail or something else in order to make him \"have sex\" with her. &gt; use drugs like Viagra to make a man get an erection\n\nIs that true? My understanding is that Viagra does not *cause* an erection, it helps you get one if you want one, and is thus pretty much redundant for young men.\n\n&gt; a woman badgering a man over and over and over again for sex and he does it to shut her up\n\nThat hardly sounds like rape to me though. If he \"does it to shut her up\", he still gives his consent. I think lack of consent is required in order for it to be called rape. Otherwise it sounds like sexual harassment which as I understand it is different from rape. &gt; use drugs like Viagra to make a man get an erection\n\nIs that true? My understanding is that Viagra does not *cause* an erection, it helps you get one if you want one, and is thus pretty much redundant for young men.\n\n&gt; a woman badgering a man over and over and over again for sex and he does it to shut her up\n\nThat hardly sounds like rape to me though. If he \"does it to shut her up\", he still gives his consent. I think lack of consent is required in order for it to be called rape. Otherwise it sounds like sexual harassment which as I understand it is different from rape. From what I understand about Viagra (aka what I've been told from young male friends who have taken it), it gave them an erection sort of randomly (as in they weren't really aroused on their own). Obviously, I can't speak from personal experience but that's just what I've been told.\n\nIf you truly don't want to have sex, but you feel like your hand is forced to because someone else wants it and won't drop the idea at all, it is still rape. &gt; use drugs like Viagra to make a man get an erection\n\nIs that true? My understanding is that Viagra does not *cause* an erection, it helps you get one if you want one, and is thus pretty much redundant for young men.\n\n&gt; a woman badgering a man over and over and over again for sex and he does it to shut her up\n\nThat hardly sounds like rape to me though. If he \"does it to shut her up\", he still gives his consent. I think lack of consent is required in order for it to be called rape. Otherwise it sounds like sexual harassment which as I understand it is different from rape. Women can also rape men by inserting objects into their anus. I think that would pretty much count as rape. Think of a woman drugging a man and inserting an object into him while he's unable to fight back. \n\nAlso, Viagra increases blood flow in the body, so it indirectly does cause an erection. &gt; use drugs like Viagra to make a man get an erection\n\nIs that true? My understanding is that Viagra does not *cause* an erection, it helps you get one if you want one, and is thus pretty much redundant for young men.\n\n&gt; a woman badgering a man over and over and over again for sex and he does it to shut her up\n\nThat hardly sounds like rape to me though. If he \"does it to shut her up\", he still gives his consent. I think lack of consent is required in order for it to be called rape. Otherwise it sounds like sexual harassment which as I understand it is different from rape. Still, how can it be done without the man's cooperation and willingness? A man can have sex with an unwilling woman, but a woman cannot possibly have forced sex with an unwilling man.\n\n&gt; some women coerce men into having sex\n\nYou mean they seduce them? That is different from rape. Can a woman really rape a man? Men are physically stronger. And how can it be done without the man's cooperation/willingness?  Speaking specifically toward penetrative rape, an erection can arise (heh) simply from genital stimulation. No emotion, desire, or consent necessary. Poke around for stories of men who were tied down, held at weapon-point, or otherwise incapacitated or coerced. Men can also be penetrated against their will by dildos and other objects, under similar circumstances.\n\nI'm upvoting you because you present a serious misconception regarding rape of men, and I want people to see the responses. I suggest the downvoters reverse their position. Speaking specifically toward penetrative rape, an erection can arise (heh) simply from genital stimulation. No emotion, desire, or consent necessary. Poke around for stories of men who were tied down, held at weapon-point, or otherwise incapacitated or coerced. Men can also be penetrated against their will by dildos and other objects, under similar circumstances.\n\nI'm upvoting you because you present a serious misconception regarding rape of men, and I want people to see the responses. I suggest the downvoters reverse their position. I know men can be raped, they can be sodomized by other men, but the idea of a woman doing that to a man is hard to imagine. I understand it is theoretically possible, but doesn't seem very probable. Is rape of an adult man by a woman common?  Can a woman really rape a man? Men are physically stronger. And how can it be done without the man's cooperation/willingness?  What are you talking about? I'm a FYCARE facilitator and that's the exact opposite of the message we try to send... Do a better job? Do a better job? What are you talking about? I'm a FYCARE facilitator and that's the exact opposite of the message we try to send... Seriously you guys should do a better job. I ripped them a new one for A Presenting men as not able to control themselves and being innate rapists and B for telling girls \"OMGZ don't go outside!! They will rape you!!! Never drink around guys if you don't wanna be raped and C for saying that whoever regrets drunk sex can claim rape..\nThe whole thing is BS IMO. I'm a FYCARE facilitator and that's not what we promote at all. Try actually listening to what we teach with an open mind without bringing in preconceptions that influence what you take in from the workshop. Well, as a woman and a victim of sexual assault I did not leave feeling empowered from your workshop. I felt like all of those girls were told they were probably gonna be victims so prepare for that now. It also made me feel like you are promoting the idea that women can just claim rape if they regret having sex with someone. Being drunk and/or making a poor choice does not a rape make. Well, as a woman and a victim of sexual assault I did not leave feeling empowered from your workshop. I felt like all of those girls were told they were probably gonna be victims so prepare for that now. It also made me feel like you are promoting the idea that women can just claim rape if they regret having sex with someone. Being drunk and/or making a poor choice does not a rape make. I'm a FYCARE facilitator and that's not what we promote at all. Try actually listening to what we teach with an open mind without bringing in preconceptions that influence what you take in from the workshop. I ripped them a new one for A Presenting men as not able to control themselves and being innate rapists and B for telling girls \"OMGZ don't go outside!! They will rape you!!! Never drink around guys if you don't wanna be raped and C for saying that whoever regrets drunk sex can claim rape..\nThe whole thing is BS IMO.  I never even did FYCARE. Whoops. I never even did FYCARE. Whoops. Neither did I  Just took it, doesn't ask for UIN or NetID or anything, so I doubt its mandatory. Really? They asked me to swipe my card.   It had to take you more than the 5 minutes that the survey said it would take to post this onto reddit.  It had to take you more than the 5 minutes that the survey said it would take to post this onto reddit. ",
    "url" : "http://i.imgur.com/8SbAi.png"
  }, {
    "id" : 35,
    "title" : "Westvleteren 12 for sale or trade",
    "snippet" : "i bought the Westy 12 special release last week and need to sell one to pay for xmas gifts.  i was looking for $50 or maybe a good trade if you have any ideas.\n\n[action shot](http://i.imgur.com/cT4qj.jpg)   Did you get it in Bloomington? Was there a line?  Are you selling one six-pack or one beer? If it's the 6-pack I'm interested. \n\nEdit for clarification  How many exactly are you selling for $50.  U still have the Westvleteren?\n  $50 for a beer?  I'll take 3-4 cases of fratty light or keystone (90-120 stones). $50 for a beer?  I'll take 3-4 cases of fratty light or keystone (90-120 stones).",
    "url" : "http://www.reddit.com/r/UIUC/comments/1529jp/westvleteren_12_for_sale_or_trade/"
  }, {
    "id" : 36,
    "title" : "Peoria Charter offers $5 discount if you use promo code LEXISGONE or HELLOPCC",
    "snippet" : "    Greyhound seems to also have great deals right now.  $12 one way to downtown Chicago.  I doubt people haven't bought tickets back to Chicago yet though.   Where did you see the $12? Looking now and all I see are $29 tickets. They still have $12 tickets.  If you leave tomorrow: http://i.imgur.com/8ScMJ.png",
    "url" : "https://www.facebook.com/PeoriaCharterCoachCompany/posts/395620577185201"
  }, {
    "id" : 37,
    "title" : "Y-CYCLES: Help launch a bike share program!",
    "snippet" : "  This is great, I saw this at the LINC fair last week. Let's get this shit going ",
    "url" : "http://igg.me/p/276977/x/1463118"
  }, {
    "id" : 38,
    "title" : "President Easter's season's greetings video",
    "url" : "http://www.youtube.com/Illinois1867"
  }, {
    "id" : 39,
    "title" : "There are PUPPIES at the UGL!",
    "snippet" : "There will be therapy dogs at the UGL from 2-5pm today!\nGo get your fill of wagging tails, puppy breath, and drool!      Thanks so much, that was a great stress reliever. Felt great!  Is this a one-time thing? Or will they be back? I missed it :( Is this a one-time thing? Or will they be back? I missed it :(  any Labradors?    Pictures or it didn't happen.  Pictures or it didn't happen.   Will they be there for all of finals week? Will they be there for all of finals week?",
    "url" : "http://www.reddit.com/r/UIUC/comments/150ejy/there_are_puppies_at_the_ugl/"
  }, {
    "id" : 40,
    "title" : "In the spirit of finals week, I've made Finalsbook: a chrome extension that replaces your facebook newsfeed with posts from future you telling present you to get back to studying. ",
    "snippet" : "Also hides notification bar and chat. A few bugs, but it was just for fun. Just thought I'd share! \n\nhttp://bit.ly/RwG4nD  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/150jhw/in_the_spirit_of_finals_week_ive_made_finalsbook/"
  }, {
    "id" : 41,
    "title" : "Just to give you guys a heads up, Zumdahl apparently released a new book for all you in chem 102. No one is buying the old book anymore",
    "snippet" : "  I'm sure that as professors, they see the plight of expensive textbooks that are forced upon their students, and have created a cheap and effective textbook.   \n\n  \n...\n\n$280   \n\n...   \n\nheads to thepiratebay  im surprised people actually buy that book.\n\nit's horribly overpriced, not helpful to read at all, and a PDF can be found online in about 10 seconds. Well now, I certainly feel like an idiot.  I'm not in Chem 102 anymore, but that really grinds my gears.  What could have *possibly* changed with science's knowledge of chemistry?  At the graduate level, I'm sure there are new things being discovered every day, but Freshman chemistry?  Have we been calculating buffer solutions incorrectly all these years? Updated reference tables, pictures, diagrams, explanations, etc. It's the same reasons other low-level textbooks get replaced: They found a better way to instruct the material, and the data tables just get more and more accurate. The Zumdahls make pretty good textbooks too. And as one of the best Chemistry programs in the country, it'd wouldn't hurt to be on the cutting edge of course material. Then again they haven't upgraded the Chem Annex labs in fucking forever.  Updated reference tables, pictures, diagrams, explanations, etc. It's the same reasons other low-level textbooks get replaced: They found a better way to instruct the material, and the data tables just get more and more accurate. The Zumdahls make pretty good textbooks too. And as one of the best Chemistry programs in the country, it'd wouldn't hurt to be on the cutting edge of course material. Then again they haven't upgraded the Chem Annex labs in fucking forever.  Updated reference tables, pictures, diagrams, explanations, etc. It's the same reasons other low-level textbooks get replaced: They found a better way to instruct the material, and the data tables just get more and more accurate. The Zumdahls make pretty good textbooks too. And as one of the best Chemistry programs in the country, it'd wouldn't hurt to be on the cutting edge of course material. Then again they haven't upgraded the Chem Annex labs in fucking forever.   Actually, it might be smart to buy the older edition. If anyone is going to be in 102 next semester, email the professor and ask if the older edition is okay. Oftentimes, the newer edition is just the older edition shuffled around with minor changes here and there. If problem sets are assigned out of the book, the professor may give the problem numbers for both the old and new textbook.\n\nOr at least that's what my professors did in CHEM 202 &amp; 204. Actually, it might be smart to buy the older edition. If anyone is going to be in 102 next semester, email the professor and ask if the older edition is okay. Oftentimes, the newer edition is just the older edition shuffled around with minor changes here and there. If problem sets are assigned out of the book, the professor may give the problem numbers for both the old and new textbook.\n\nOr at least that's what my professors did in CHEM 202 &amp; 204. gruebele? he was the best dude  the only thing worse than that book was tom hummel \"teaching\" while he wore latex gloves to hold the chalk...  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15081z/just_to_give_you_guys_a_heads_up_zumdahl/"
  }, {
    "id" : 42,
    "title" : "When someone wakes me up after finals",
    "snippet" : "  [When someone wakes me up after my final is over](http://www.youtube.com/watch?v=umDr0mPuyQc)",
    "url" : "http://www.youtube.com/watch?v=QTc6cBWhqvw"
  }, {
    "id" : 43,
    "title" : "NIU has jokes",
    "snippet" : "  [Two can play that game.](http://i.imgur.com/dvene.jpg) wanna photoshop it to say \"The biggest fruits in Illinois: NIU\" for me? I have a friend who needs a little quieting Yeah, I should be able to. Do you want anything else changed? nah that'd be fine haha thanks man! [Here](http://i.imgur.com/EeT0X.jpg) is what you asked for earlier. Hopefully your friend has a good sense of humor ;) [Two can play that game.](http://i.imgur.com/dvene.jpg) click \"save for web &amp; devices,\" otherwise the colors look gross &amp; washed out.     Man, as someone who started off at UIUC and is now at NIU, I have some pretty mixed feelings about this...  Sure, they're the best orange until you want to major in science, engineering, liberal arts or fine arts.\n\nps. I don't know shit about sports so if UIUC has a better team, good, but I honestly have no clue what sport this is even over.  Sure, they're the best orange until you want to major in science, engineering, liberal arts or fine arts.\n\nps. I don't know shit about sports so if UIUC has a better team, good, but I honestly have no clue what sport this is even over.  I am studying CS here at UIUC and my fiancé went to NIU for CS for his grad and undergrad. In CS 125 I learned the material in NIU's CS 340. We don't really talk about NIU, he is trying to forget going there. [deleted] [deleted] Sure, they're the best orange until you want to major in science, engineering, liberal arts or fine arts.\n\nps. I don't know shit about sports so if UIUC has a better team, good, but I honestly have no clue what sport this is even over.  Except that their school of music is fantastic. Except that their school of music is fantastic. Except that their school of music is fantastic.  Just wanted to say that I'm rooting for NIU 100%.  Yes, I'm biased.  My parents and brother went there.  My dad took me to a ton of game as a kid.  I was at the game in 2003 beat #14 Maryland and many other monumental games (if you think they are unknown now, you should have seen the news back then).  \n\nSo, I am rooting for them.  No, I don't care if you agree.  However, I do think if you are from Illinois, then you should root for them just because the state of Illinois is way better than Florida.  It's an awesome opportunity for NIU.\n\nAlso, NIU has a history of playing the underdog and beating the bigger D1 schools.  I legitimately (again, biased) that this game could go either way. Just wanted to say that I'm rooting for NIU 100%.  Yes, I'm biased.  My parents and brother went there.  My dad took me to a ton of game as a kid.  I was at the game in 2003 beat #14 Maryland and many other monumental games (if you think they are unknown now, you should have seen the news back then).  \n\nSo, I am rooting for them.  No, I don't care if you agree.  However, I do think if you are from Illinois, then you should root for them just because the state of Illinois is way better than Florida.  It's an awesome opportunity for NIU.\n\nAlso, NIU has a history of playing the underdog and beating the bigger D1 schools.  I legitimately (again, biased) that this game could go either way. I'm a huge Illinois fan and I as well am rooting for NIU. Upvote for you. Seriously: ITT butthurt negative nancies who can't take a joke. NIU fb has been more entertaining to watch for a long while now. They're not in our conference and are fun as fuck to watch. They're also representing our state, go Huskies. ITT: People who dont get out, dont know sports, and think Starcraft and comparing education makes them feel better because of a sports joke. Seriously: ITT butthurt negative nancies who can't take a joke. NIU fb has been more entertaining to watch for a long while now. They're not in our conference and are fun as fuck to watch. They're also representing our state, go Huskies.   Doesn't matter; we beat them hard in sc2 and LoL, and that's all that I care about Downvote this man. Handegg and ape-hoop are clearly superior sports and e-sports are for nerds.  Downvote this man. Handegg and ape-hoop are clearly superior sports and e-sports are for nerds.  Downvote this man. Handegg and ape-hoop are clearly superior sports and e-sports are for nerds.  ",
    "url" : "http://myniu.com/wp-content/uploads/2012/12/Best-Orange_website.jpg"
  }, {
    "id" : 44,
    "title" : "To thy happy children of the future, those of the past send greetings",
    "snippet" : "      If you're a Doctor Who fan, and you didn't piss yourself when you saw this, you are a better man (or woman, or timelord) than I. I'm a huge Doctor Who fan, but what am I missing? [Don't blink.](http://www.youtube.com/watch?v=sH0R01gP3m0)  ",
    "url" : "http://imgur.com/6AosZ.gif"
  }, {
    "id" : 45,
    "title" : "Just stumbled across this... Champaign Welcomes You ",
    "snippet" : "  Holy shit! That girl was in the Morrow Plots!!! But seriously. How was that allowed? But seriously. How was that allowed? But seriously. How was that allowed? But seriously. How was that allowed? [deleted] Get. Out. Now. What'd they say, I am super curious.\n What'd they say, I am super curious.\n Holy shit! That girl was in the Morrow Plots!!!  &gt; No boyfriend or girlfriend doesn't matter. Don't be anxious, you will have one soon.\n\n*sob* &gt; No boyfriend or girlfriend doesn't matter. Don't be anxious, you will have one soon.\n\n*sob* they meant only if you're chinese.   Champaign welcomes you, Urbana on the other hand...\n We don't talk about Urbana..     Man, I feel like I'll never understand how the Chinese don't feel like yelling, \"Bullshit!\" to assertions of the importance of setting new academic records in a happy life. Happiness = success/achievement in many cultures. uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyuuyyyyyyyyyyyyyyyyyyyyuuyhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhjhgghnbbbbbbbbbbbbbbbbbbbbmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb bnm,m nbvcbhjhgttghjhgoooooooooooooooooooooooooo0ppooooooooooooooooooooooooiuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuiiuuuuuuuuu You fall asleep on the keyboard there, man? Actual reason: I was showing my IT coworker how on some lines of macbook pro you get a purple shift on your text if you scroll similar characters left or right. DUDE. I don't even have a mac and it does this. That is freaking cool You fall asleep on the keyboard there, man?  Yeah... I'm just gonna go ahead and say it: I've never seen a Chinese student partying. [0:28] Not super surprising. Unless they're very americanized, a Chinese party would mostly be a get together at someone's house or apartment. The International Chinese students tend to stick together so you wouldn't exactly be invited to their parties.  Yeah. I made really good friends with the LLMs at the law school, so in between inviting them to my cookouts and vice versa to their hotpots, we had a lot of fun.  Although it was kind of odd, I enjoyed this video. [deleted] Roughly half of this was filmed in Urbana. Why is only Champaign getting a plug? In Chinese UIUC is just referred to as University of Illinois Champaign. I don't think there's a chinese equivalent for Urbana.  You mean there is a Chinese \"equivalent\" for Champaign, a proper noun?  Roughly half of this was filmed in Urbana. Why is only Champaign getting a plug? [deleted]    I'm confused...is this supposed to be a joke or is it supposed to be serious? If I had to guess, the university commissioned it in order to get more Chinese students to come here... The fact that it looks like a joke is because Chinese culture is ridiculously different from ours, it would seem. I could be wrong on both counts, though. I'm just white and in-state.   to be honest lots of chinese students here are annoying. to be honest lots of chinese students here are annoying. I've never had problems with Chinese students. South Koreans on the other hand . . . to be honest lots of chinese students here are annoying. to be honest lots of chinese students here are annoying. Not really. But they are probably not the fun people to hang out with. They will consistently show off their achievements ( perfect gpa in university and awards they received back in china) .sometimes hangout with Chinese students make me feel that I am a loser. Hanging out with Taiwanese or Singapore  students is probably a more pleasant experience because they seem to understand our culture better.  Why does hanging out with Chinese students make you feel like a loser? Is it solely because of their (real or perceived) academic achievement? And if so, why do you feel that associating with your perceived academic superiors is a limit to friendship? Surely they, too, have feelings, including feelings of inadequacy (such as not understanding why Americans dislike them) ? When you have a friend keep bragging himself, you will understand how does Polk6565 feel... Are all 6,000 or whatever Chinese students braggarts? I don't like braggarts either, but I suspect that a nonzero number of the Chinese students here are perfectly cool people who would love to make American friends, and would not be all \"Bro, not only did I get a 100% on an exam the other day, but I also won the Nobel Prize in everything, Medicine, Chemistry, Physics and Peace.\"  Soon there will be a Chinatown on campus... Soon there will be a Chinatown on campus... Granger.        The part about \"no matter how long it takes to graduate\" is some BS.  At least in the college of engineering, you only get 5 years to complete your degree.  On the presentation it says \"Champaign Welcome You\"...did they get no one to proofread that?\nbut yeah this was out during the Chinese New Year thingy that happened that only Chinese people went to because it was all in Chinese. China.  Without English subtitles, it looks like Chinese students screaming \n\"Hey!We just occupied UofI!\"  nothing is special about this video itself. the only thing special and controversial about this video is the fact it is made by chinese students.﻿ we are in a public school full with chinese students. we need international students for diversity. admitting a huge amount of chinese students is not fair for people from other countries and illinois residents and will hurt the diversity of student body.really, we need more illinois students and international students from other countries.otherwise, the tax we paid for building university will eventually go to our competitors﻿ pocket nothing is special about this video itself. the only thing special and controversial about this video is the fact it is made by chinese students.﻿ we are in a public school full with chinese students. we need international students for diversity. admitting a huge amount of chinese students is not fair for people from other countries and illinois residents and will hurt the diversity of student body.really, we need more illinois students and international students from other countries.otherwise, the tax we paid for building university will eventually go to our competitors﻿ pocket Counterargument: The more Chinese that attend an American university in a city and state that is, in many ways, a microcosm of the USA, the higher likelihood that educated Chinese who go home to be the leaders in politics, corporations, and more, will view the USA with love, recalling warm experiences with the people they met here, American and otherwise. Counterargument: The more Chinese that attend an American university in a city and state that is, in many ways, a microcosm of the USA, the higher likelihood that educated Chinese who go home to be the leaders in politics, corporations, and more, will view the USA with love, recalling warm experiences with the people they met here, American and otherwise. really? please stop stealing from us!\nmore likely they will just use tech they steal from us to make cheap products and sell back.\nhttp://www.bloomberg.com/news/2011-11-03/u-s-intelligence-report-calls-china-world-s-biggest-cyber-thief.html   [deleted] [deleted]",
    "url" : "http://www.youtube.com/watch?v=TD2v0f6SX5I"
  }, {
    "id" : 46,
    "title" : "When I check my final grade",
    "snippet" : "  ",
    "url" : "http://24.media.tumblr.com/tumblr_lzjfmf7EgI1qkyzt0o1_400.gif"
  }, {
    "id" : 47,
    "title" : "AMA Request: CU Police Officer",
    "snippet" : "1. How many drinking tickets have been given out on campus in 2012?\n2. How many muggings/violent crimes have been reported on campus in 2012?\n3. What can us students do to protect ourselves from violent crime?\n4. Why do you focus on policing underage drinking when you can't keep campus safe?\n5. What is the department's plan to curb the recent crime wave?\n\nIn my 3.5 years on campus, I've seen all sorts of violent crime alerts including sexual assault and muggings. I've also seen campus cops raiding bars what seems to be every other weekend or so. I want to know why you focus on \"protecting us from our selves\" when you can't keep campus and students safe at our homes or educational buildings. \n\nEDIT: See below, it looks like there's a good chance someone from the department will stop by and answer some of this. I appreciate all of the productive conversation so far, it's educated me and others. If a CU police officer does stop by here, I suggest you start a new thread so you aren't bogged down by all the conversation already here.   Not a police officer, but I can answer a few of these. Some myths can be dispelled pretty easily, but there are some things I'd really like the police to answer. \n\n1. Champaign compiles those stats in January every year, but records show it's been between 1,000-1,200 each year since 2008, when they cut down on patrols doing the barchecks instead (more on that later). At $320 each, that converted to $370,000 in ticket revenue in 2011 (1157 tickets). I'm too lazy to find Urbana, but they run liquor enforcement kind of randomly since there's no big bar scene there.\n\n2. I don't know, but there are ways to find out. Crimereports.com lets you go back to June right now, and I can't filter by the University Police's beat... but it's about 280 for this [little horizontal slice](http://imgur.com/aUgDu). There's also the school's [Clery Act report](http://www.dps.illinois.edu/universitypolice/CurrentASR.pdf), which could be unmitigated bullshit -- 14 assaults reported in 2011, which I think is probably a low estimate. \n\n3. A few days ago, I would have said don't walk home drunk alone or wear headphones blasting music, but now I have to add, \"Don't get into your car right outside of Grainger at 8 p.m.\" Perhaps a can of bear mace wouldn't hurt either. \n\n4. **They do not focus on underage drinking.** It might look like they pull officers from their routine patrols to nail students, but the liquor enforcement is just a fun, safe way for 4-5 cops to rack up overtime hours at $52/hr (on average). There's no full-time staff with the Champaign Police that runs the bar raids. Now whether it's wise for them to spend overtime hours on raiding the bars and making around $16 for the city for every $1 they spend rather than patrolling the areas that have seen more crime recently... is kind of a loaded question, but it could be a valid one. The first thing you would want to know is how many overtime hours are spent on extra patrols.\n*Campus police don't directly participate in bar raids*, but the Illinois State Police will often join in.\n\n5. You might want to call the campus police chief [Jeff Christensen](http://dps.illinois.edu/universitypolice/staffdirectory.html) and ask him yourself. Hopefully he'll have an answer for you. If not, keep going down the list. And then you can post it here! &gt;the liquor enforcement is just a fun, safe way for 4-5 cops to rack up overtime hours at $52/hr (on average)\n\nSounds like a bunch of fun-loving overall cool dudes If I were a cop I'd do it for 52/hr. That money sounds like fun. Not a police officer, but I can answer a few of these. Some myths can be dispelled pretty easily, but there are some things I'd really like the police to answer. \n\n1. Champaign compiles those stats in January every year, but records show it's been between 1,000-1,200 each year since 2008, when they cut down on patrols doing the barchecks instead (more on that later). At $320 each, that converted to $370,000 in ticket revenue in 2011 (1157 tickets). I'm too lazy to find Urbana, but they run liquor enforcement kind of randomly since there's no big bar scene there.\n\n2. I don't know, but there are ways to find out. Crimereports.com lets you go back to June right now, and I can't filter by the University Police's beat... but it's about 280 for this [little horizontal slice](http://imgur.com/aUgDu). There's also the school's [Clery Act report](http://www.dps.illinois.edu/universitypolice/CurrentASR.pdf), which could be unmitigated bullshit -- 14 assaults reported in 2011, which I think is probably a low estimate. \n\n3. A few days ago, I would have said don't walk home drunk alone or wear headphones blasting music, but now I have to add, \"Don't get into your car right outside of Grainger at 8 p.m.\" Perhaps a can of bear mace wouldn't hurt either. \n\n4. **They do not focus on underage drinking.** It might look like they pull officers from their routine patrols to nail students, but the liquor enforcement is just a fun, safe way for 4-5 cops to rack up overtime hours at $52/hr (on average). There's no full-time staff with the Champaign Police that runs the bar raids. Now whether it's wise for them to spend overtime hours on raiding the bars and making around $16 for the city for every $1 they spend rather than patrolling the areas that have seen more crime recently... is kind of a loaded question, but it could be a valid one. The first thing you would want to know is how many overtime hours are spent on extra patrols.\n*Campus police don't directly participate in bar raids*, but the Illinois State Police will often join in.\n\n5. You might want to call the campus police chief [Jeff Christensen](http://dps.illinois.edu/universitypolice/staffdirectory.html) and ask him yourself. Hopefully he'll have an answer for you. If not, keep going down the list. And then you can post it here! Thanks for the responses, This definitely clears some things up, I **did not** know about the State Police and their involvement in the bar raids and appreciate you clearing that up. \n\nValid point on number 4, I'm concerned because I don't think the police should be run as a for profit institution racking up revenues on students. That said, it is completely within their right to do so for people who are breaking the law.  Not a police officer, but I can answer a few of these. Some myths can be dispelled pretty easily, but there are some things I'd really like the police to answer. \n\n1. Champaign compiles those stats in January every year, but records show it's been between 1,000-1,200 each year since 2008, when they cut down on patrols doing the barchecks instead (more on that later). At $320 each, that converted to $370,000 in ticket revenue in 2011 (1157 tickets). I'm too lazy to find Urbana, but they run liquor enforcement kind of randomly since there's no big bar scene there.\n\n2. I don't know, but there are ways to find out. Crimereports.com lets you go back to June right now, and I can't filter by the University Police's beat... but it's about 280 for this [little horizontal slice](http://imgur.com/aUgDu). There's also the school's [Clery Act report](http://www.dps.illinois.edu/universitypolice/CurrentASR.pdf), which could be unmitigated bullshit -- 14 assaults reported in 2011, which I think is probably a low estimate. \n\n3. A few days ago, I would have said don't walk home drunk alone or wear headphones blasting music, but now I have to add, \"Don't get into your car right outside of Grainger at 8 p.m.\" Perhaps a can of bear mace wouldn't hurt either. \n\n4. **They do not focus on underage drinking.** It might look like they pull officers from their routine patrols to nail students, but the liquor enforcement is just a fun, safe way for 4-5 cops to rack up overtime hours at $52/hr (on average). There's no full-time staff with the Champaign Police that runs the bar raids. Now whether it's wise for them to spend overtime hours on raiding the bars and making around $16 for the city for every $1 they spend rather than patrolling the areas that have seen more crime recently... is kind of a loaded question, but it could be a valid one. The first thing you would want to know is how many overtime hours are spent on extra patrols.\n*Campus police don't directly participate in bar raids*, but the Illinois State Police will often join in.\n\n5. You might want to call the campus police chief [Jeff Christensen](http://dps.illinois.edu/universitypolice/staffdirectory.html) and ask him yourself. Hopefully he'll have an answer for you. If not, keep going down the list. And then you can post it here! Remember two years ago http://studentactivism.net/2009/05/05/pre-finals-drug-bust/\nwhen the cops had a whole year-long investigation ($$$) into drugs on campus - and after that enormous investigation they ended up arresting around a dozen kids for pipes, small amount of weed, etc...\n\n\"to protect and serve....\" psh Ermagawd I broke the law and am complaining when caught.   If you legitimately want a CU police officer to do an AMA, you probably shouldn't dive into it assuming you know more about what cops 'focus on' because of the occasional bar raid you see. I think it's okay for OP to state his viewpoint/opinion/impression. If someone from Campus Police does an AMA they can correct OP. It is customary for AMA requests on /r/IAmA to contain 5 questions, so I don't see any problem with OP asking questions based on his experience. Perhaps, but I don't see the incentive for a CU officer to participate if from the get-go they'd be asked question based on false premises. As NikaRiots posted below underage drinking is by no means the focus of the police. Perhaps, but I don't see the incentive for a CU officer to participate if from the get-go they'd be asked question based on false premises. As NikaRiots posted below underage drinking is by no means the focus of the police. I think it's okay for OP to state his viewpoint/opinion/impression. If someone from Campus Police does an AMA they can correct OP. It is customary for AMA requests on /r/IAmA to contain 5 questions, so I don't see any problem with OP asking questions based on his experience.    I think its the state police that drive the paddy wagon and bust bars. Also, considering the poverty rate is higher here then in Chicago I'm surprised more shit doesn't happen. I never see cars patrolling campus at night so I assume they stay further north.   I can tell you this much - not nearly all muggings make it into crime reports. \n\nExample 1 - Three friends of mine were robbed at gunpoint last year a block from county. It was reported to the police and showed on the DI blotter, but no crime alert.\n\nExample 2 - My friend was mugged 2 years ago  in Urbana (a few blocks East of Mckinley, past Lincoln). It made it into the blotter, but no crime report.\n\n**tl;dr: there are a lot more muggins and such happening on campus, they just don't all become crime alerts**  Yeah they need to focus on more serious stuff rather than penalizing harmless people. I got a ticket for riding a bike on a sidewalk (though it was Urbana Police), and I didn't even know I was breaking some rule. $100 ticket, no warning or lesser fine even though it was a first-time \"offense\". When the police focus on [actus reus](http://en.wikipedia.org/wiki/Actus_reus) rather than [mens rea](http://en.wikipedia.org/wiki/Mens_rea), people stop trusting and respecting them. Yeah they need to focus on more serious stuff rather than penalizing harmless people. I got a ticket for riding a bike on a sidewalk (though it was Urbana Police), and I didn't even know I was breaking some rule. $100 ticket, no warning or lesser fine even though it was a first-time \"offense\". When the police focus on [actus reus](http://en.wikipedia.org/wiki/Actus_reus) rather than [mens rea](http://en.wikipedia.org/wiki/Mens_rea), people stop trusting and respecting them. thank fucking god you got ticketed.  i can't tell you the number of times i've been nearly run over by some psycho biker who decides biking at full speed down an urbana sideWALK is a good idea. How many people do you know who suffered grievous injuries because they were hit by a bicyclist? I understand you are annoyed by people biking on sidewalks, but annoyance is different from danger; bike riders pose no serious risk to anyone but themselves. Anyway I was told the police started ticketing people because the restaurant owners complained; they wanted their customers to be able to sit outside on the sidewalk during summer without being bothered by bicycles whizzing past them. I think the sidewalk, being public property, belongs as much to me as it does to people who choose to sit outside on the sidewalk to eat and drink. Screw that, I am glad they ticked your ass.  Sidewalks are public property used for WALKING.  A bicycle is a vehicle and should be used on the street, which is public property used for vehicles.  There is a reason this law exists dumbass, people have gotten hurt by people riding bikes on sidewalks.\n\nDo not tell me bike riders pose no risk to anyone but themselves.  If a bike is whizzing down a sidewalk and nails someone exiting a shop on the sidewalk, it will (and has) pose a great risk to the person stuck (and in fact generally more risk to the person stuck than the person riding the bike).\n\nSo fuck you, should be more than $100.  This is more serious than a 19 year old drinking.... Screw that, I am glad they ticked your ass.  Sidewalks are public property used for WALKING.  A bicycle is a vehicle and should be used on the street, which is public property used for vehicles.  There is a reason this law exists dumbass, people have gotten hurt by people riding bikes on sidewalks.\n\nDo not tell me bike riders pose no risk to anyone but themselves.  If a bike is whizzing down a sidewalk and nails someone exiting a shop on the sidewalk, it will (and has) pose a great risk to the person stuck (and in fact generally more risk to the person stuck than the person riding the bike).\n\nSo fuck you, should be more than $100.  This is more serious than a 19 year old drinking.... i totally agree, at least when you're drinking the only person you're potentially injuring is yourself.  Ever heard of DUI? Or disorderly conduct under the influence of alcohol? How many people do you know who suffered grievous injuries because they were hit by a bicyclist? I understand you are annoyed by people biking on sidewalks, but annoyance is different from danger; bike riders pose no serious risk to anyone but themselves. Anyway I was told the police started ticketing people because the restaurant owners complained; they wanted their customers to be able to sit outside on the sidewalk during summer without being bothered by bicycles whizzing past them. I think the sidewalk, being public property, belongs as much to me as it does to people who choose to sit outside on the sidewalk to eat and drink. Yeah they need to focus on more serious stuff rather than penalizing harmless people. I got a ticket for riding a bike on a sidewalk (though it was Urbana Police), and I didn't even know I was breaking some rule. $100 ticket, no warning or lesser fine even though it was a first-time \"offense\". When the police focus on [actus reus](http://en.wikipedia.org/wiki/Actus_reus) rather than [mens rea](http://en.wikipedia.org/wiki/Mens_rea), people stop trusting and respecting them.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14yrad/ama_request_cu_police_officer/"
  }, {
    "id" : 48,
    "title" : "Do you really need a 3.0 GPA to declare engineering cs your major?",
    "snippet" : "  Yes. CS is pretty competitive.  Nobody I know who has transferred in has had under a 3.0 GPA. Fuck... What are you at now?  Also, are you already within the college of engineering, and have you been talking to Steve Herzog (the CS advisor)? Freshman in DGS. I don't have a GPA yet. The only person I have met with is my academic advisor. Would you suggest setting up a meeting with Steve for suggestions? Yes. CS is pretty competitive.  Nobody I know who has transferred in has had under a 3.0 GPA.  Why does it matter if you are CS-LAS or CS-ENG? You take and can take pretty much the same classes..... you're just missing out on some physics and stuff, which is pretty useless to CS anyways. \n\nAm I missing something?\n\nEDIT: need to learn english more better They are technically different degrees They are technically different degrees Why does it matter if you are CS-LAS or CS-ENG? You take and can take pretty much the same classes..... you're just missing out on some physics and stuff, which is pretty useless to CS anyways. \n\nAm I missing something?\n\nEDIT: need to learn english more better \"CS-LAS\" [does not exist](http://www.las.illinois.edu/students/programs/majors/). Math&amp;CS is in LAS, and it is pretty mathy. Stat&amp;CS is in LAS, and it is pretty stat-y....  Engineering CS is out of space...like literally, no more spots.  They're figuring out ways to expand quickly, but in the meantime, only the TOP of the top are going to be let in...and I know 3 Sophomores who have a GPA over a 3.7, have taken 125 and 173 and have gotten A's in both, AND do research, and the CS department is making them wait a little longer.     Currently in a similar position as you and from experience CS makes it as difficult as they possibly can to switch over.  \n\nAnd personally I loath DGS I almost feel like DGS is here to just take your money and not really help you transfer... Yeah, DGS doesn't do a great job of actually helping anyone, but it really is your job to figure it all out. Don't bother talking to your DGS advisor. They generally don't know anything.  I agree with that. Everytime Ive talked to my DGS advisor they just tell me they dont know and to go talk to someone else.  Also hate how the whole idea behind it is to explore potential majors, yet they make it virtually impossible to register for any classes that are not gen-eds.  If you are looking to go into CS attempt to register for CS225 any chance you get.  Im currently going on semester number 3 of trying to get that class and probably wont get off the waiting list.  Best of luck to you tho, maybe in the end you will be able to get the required courses to transfer unlike me.  Not necessarily. I know someone who switched into CS from DGS with a GPA way lower than 3.0 \n\nAlready has an internship and everything now.  Was it LAS or ENG computer science? Be careful of people who know someone who knows someone who... Was it LAS or ENG computer science?",
    "url" : "http://www.reddit.com/r/UIUC/comments/14zf9r/do_you_really_need_a_30_gpa_to_declare/"
  }, {
    "id" : 49,
    "title" : "Does anyone need a ride to Pittsburgh or NYC?",
    "snippet" : "I'm leaving either the evening of the 18th or early morning the 19th and have extra space in my car. If anyone needs a ride, and is willing to split gas PM me.",
    "url" : "http://www.reddit.com/r/UIUC/comments/14ycy8/does_anyone_need_a_ride_to_pittsburgh_or_nyc/"
  } ],
  "processing-time-source" : 63,
  "processing-result.title" : "uiuc12_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc12_reddit.xml"
  }
}