{
  "processing-time-total" : 1439,
  "clusters" : [ {
    "id" : 0,
    "size" : 8,
    "score" : 67.00980138314817,
    "phrases" : [ "Drop this Class" ],
    "documents" : [ 4, 14, 21, 24, 30, 31, 34, 36 ],
    "attributes" : {
      "score" : 67.00980138314817
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 62.642204015690574,
    "phrases" : [ "Oh Good" ],
    "documents" : [ 19, 20, 23, 30, 31, 44, 48 ],
    "attributes" : {
      "score" : 62.642204015690574
    }
  }, {
    "id" : 2,
    "size" : 6,
    "score" : 39.08935672488939,
    "phrases" : [ "Spring" ],
    "documents" : [ 14, 23, 32, 37, 39, 45 ],
    "attributes" : {
      "score" : 39.08935672488939
    }
  }, {
    "id" : 3,
    "size" : 6,
    "score" : 42.82600675730899,
    "phrases" : [ "UIUC Students" ],
    "documents" : [ 7, 8, 20, 37, 38, 46 ],
    "attributes" : {
      "score" : 42.82600675730899
    }
  }, {
    "id" : 4,
    "size" : 6,
    "score" : 94.0835180225343,
    "phrases" : [ "University of Illinois" ],
    "documents" : [ 3, 20, 29, 37, 38, 44 ],
    "attributes" : {
      "score" : 94.0835180225343
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 35.30744708122431,
    "phrases" : [ "Semester Starts" ],
    "documents" : [ 32, 37, 38, 45 ],
    "attributes" : {
      "score" : 35.30744708122431
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 86.43091020980123,
    "phrases" : [ "Time so they don't Know the Severity" ],
    "documents" : [ 1, 20, 30, 32 ],
    "attributes" : {
      "score" : 86.43091020980123
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 45.81999097232436,
    "phrases" : [ "Adding" ],
    "documents" : [ 4, 18, 20 ],
    "attributes" : {
      "score" : 45.81999097232436
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 58.880678281684446,
    "phrases" : [ "Displays as Open" ],
    "documents" : [ 20, 31, 37 ],
    "attributes" : {
      "score" : 58.880678281684446
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 97.43201365611539,
    "phrases" : [ "Love for the Chief" ],
    "documents" : [ 12, 20, 44 ],
    "attributes" : {
      "score" : 97.43201365611539
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 62.149189902250626,
    "phrases" : [ "Seat" ],
    "documents" : [ 31, 44, 48 ],
    "attributes" : {
      "score" : 62.149189902250626
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 43.428135613007704,
    "phrases" : [ "Tonight" ],
    "documents" : [ 33, 41, 43 ],
    "attributes" : {
      "score" : 43.428135613007704
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 49.0172521409769,
    "phrases" : [ "Weekend" ],
    "documents" : [ 9, 27, 29 ],
    "attributes" : {
      "score" : 49.0172521409769
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 38.92837325771211,
    "phrases" : [ "ARC" ],
    "documents" : [ 37, 45 ],
    "attributes" : {
      "score" : 38.92837325771211
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 48.47823528892042,
    "phrases" : [ "Answer your Question" ],
    "documents" : [ 2, 20 ],
    "attributes" : {
      "score" : 48.47823528892042
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 116.68735055906906,
    "phrases" : [ "Book Scanner" ],
    "documents" : [ 6, 38 ],
    "attributes" : {
      "score" : 116.68735055906906
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 69.49478065167831,
    "phrases" : [ "Campus Spirit" ],
    "documents" : [ 20, 44 ],
    "attributes" : {
      "score" : 69.49478065167831
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 45.22921310980282,
    "phrases" : [ "E-mail" ],
    "documents" : [ 15, 30 ],
    "attributes" : {
      "score" : 45.22921310980282
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 61.47701762034122,
    "phrases" : [ "Guitar" ],
    "documents" : [ 18, 35 ],
    "attributes" : {
      "score" : 61.47701762034122
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 40.25173872915919,
    "phrases" : [ "Reading Groups" ],
    "documents" : [ 1, 20 ],
    "attributes" : {
      "score" : 40.25173872915919
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 134.01983641143931,
    "phrases" : [ "Virtual Job Board" ],
    "documents" : [ 5, 17 ],
    "attributes" : {
      "score" : 134.01983641143931
    }
  }, {
    "id" : 21,
    "size" : 13,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 10, 11, 13, 16, 22, 25, 26, 28, 40, 42, 47, 49 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1379,
  "documents" : [ {
    "id" : 0,
    "title" : "How is Espresso Royale's ground coffee?",
    "snippet" : "I figured this was the appropriate board to ask this since I only see these shops around Urbana-Champaign.\nAnyway, I use a french press to make my coffee and am sick of the ones at Walgreens and Wal-mart.  However, I don't want to risk buying a bag without some recommendations first since money is short.\nSo basically, is ER's ground coffee good?  It's not on campus, but the best place to buy beans is the [Columbia Street Roastery](http://www.csrcoffee.com/) (in my opinion, of course). But if they're in Champaign, I could make a trek there. Thanks for the recommendation!  Espresso Royale is okay...Their self-named blend sucks, but the Guatemala and the Peru blends are quite good.\n\nColumbia Street Roastery has a few good blends: The Escobar blend comes to mind. Needless to say, the coffee at Escobar is awesome!\n\nStrange as it may seem, I prefer Caribou Coffee's blend from county market to all of the above! It's available in the coffee aisle by the pound. Best!\n\nIf you french press, you should try Aeropress... At least equally good and less mess to clean!\n  I'm so confused by coffee snobs (not a dig, just the general term used)... Is it the taste or the energy it provides that you so covet?    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16pmby/how_is_espresso_royales_ground_coffee/"
  }, {
    "id" : 1,
    "title" : "Are undergrads welcome in reading groups?",
    "snippet" : "I keep getting emails from my major's listserv regarding reading groups for various subjects within my discipline. I've heard that graduate students are the target audience here - is it encouraged/acceptable/appropriate for undergrads to attend these reading groups?  If you do, here's a tip for reading academic papers when you are first familiarizing yourself with a field.\n\nYou might not understand 10% of it.  That's all right.  Read it through once just so you've seen the whole argument.  A second time for structure of the argument, which sections of the paper establish which aspects of the argument.  Third time for what is the logic of the argument, even though you don't understand many of the concepts.\n\nYou will now find that there are several key concepts that the paper cannot be understood without, and that you don't understand.  Google them.  Wikipedia them.  Now read the paper again.\n\nMore key concepts you don't understand.  Google/wikipedia.  You will also have questions about the logic and evidence that an intelligent novice would ask.  Ask them privately to the most helpful person in the reading group.  Once you have a feel for what the level of discussion is, you will even know which ones are appropriate for public discussion.\n\nOne of the very most valuable aspects of the Illinois academic culture is the pre-graduate-school flavor of the last two years.  So they are kind of expecting you.  :-)  Dive in!   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16pfb8/are_undergrads_welcome_in_reading_groups/"
  }, {
    "id" : 2,
    "title" : "Anyone who took FIN 221 with Dyer please help with question about WSJ quizzes",
    "snippet" : "I have a general rule for classes, if the teacher cares I care, if the teacher doesn't care I don't either.\n\nFrom what I heard about this class I already know that this teacher doesn't teach, and for these WSJ quizzes I've heard he steals all the questions and answers from a test bank online. I can't confirm any of this information for sure, but I have found an online WSJ test bank with weekly quizzes. I can post the website and/or questions if someone from last year would think they would be able to let me know if I found the correct test bank.\n\nAlso if anyone knew where previous years got the answers and would be willing to let me know that would be great, because everyone else I know has been keeping quite about where the answers are.  Your rule is silly.  Just do the work. It's mostly about not having to pay a subscription to Wall Street Journal It's mostly about not having to pay a subscription to Wall Street Journal  im in this class, too. what exactly have you heard about deier? That his class is boring and you have to teach yourself. Some people I knew just confirmed the reviews on ratemyprofessor. Its an online course of course you teach yourself...  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16pv84/anyone_who_took_fin_221_with_dyer_please_help/"
  }, {
    "id" : 3,
    "title" : "Union to picket at University of Illinois.",
    "url" : "http://www.news-gazette.com/news/politics-and-government/2013-01-12/union-picket-ui.html"
  }, {
    "id" : 4,
    "title" : "What classes are you dropping or adding and why?",
    "snippet" : "I am just curious to see why people are already changing their classes. Is the teacher out to get you or that the TA has a very thick accent? Are you adding an easy class to buff you GPA?   dropped: because the class is all the way at the Krannert Art Museum \n\nadded: american revolution class because a spot was open and i wanted to take it before PS 322?!?!?? Me too...   Ice Skating  I wanted to take it, but then I saw what it entailed online. I thought it would just be free skate and learning how to skate. Nope. Plus it's all figure skating (I already know how to skate with hockey skates)z  the math 213 professor this year has a ridiculously heavy accent, and the textbook is shit, so I'm really considering dropping it.    dropped: LER 100 first 8 weeks because I was informed its no longer easy. when I saw the syllabus it was a hell no\n\nadded: SPAN 200 because it is online and cant be that bad since span 141 is super easy too   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16opb0/what_classes_are_you_dropping_or_adding_and_why/"
  }, {
    "id" : 5,
    "title" : "Job board for on-campus jobs? (aside for virtual job board)",
    "snippet" : "Is there a central location where you can see job listings on campus? I applied to pretty much all jobs on the virtual board and I am also looking for a second job somewhere.. I looked at craigslist but it seems a bit.. lacking. Do you guys know of any job boards other than those two? I could really use the extra cash this semester. Thanks.  Are you looking for a minimum wage job?  You already have one and you want another?\n\nGFY.",
    "url" : "http://www.reddit.com/r/UIUC/comments/16p3xh/job_board_for_oncampus_jobs_aside_for_virtual_job/"
  }, {
    "id" : 6,
    "title" : "Book scanner availability?",
    "snippet" : "Does anyone know where there is a book scanner available for me to use at school? I remember seeing somewhere that the university has one available somewhere, but I can't find it again. Does anyone know if there is one, and if so where it is?    I built one, it does 1200 pages per minute.  I'm afraid that due to the great cost to me, and possible law issues, it is not free, though it is pretty cheap.  Not to mention that mine goes way faster (by quite a mile), and is of greater quality because the Book Eye scanners don't use platens on the book.   20 pages per second? That's pretty fast. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16p7rk/book_scanner_availability/"
  }, {
    "id" : 7,
    "title" : "[Event] Two UIUC student bands (Shy Guy Says/Earth Witch) playing  at Mike N' Molly's Saturday",
    "url" : "https://www.facebook.com/events/278950875561509/"
  }, {
    "id" : 8,
    "title" : "Anybody want to play Dungeons and Dragons?",
    "snippet" : "My 4 friends and I are starting a new game, and we would like 2 or 3 more people to play.  People that have never played before are welcome, and I promise it is a lot of fun.  We plan to play on Saturdays, and the sessions usually last anywhere from 3-6 hours.\n\nWe are all UIUC students, but we live off campus in Urbana.  Our place is kind of far (2 miles from the quad), so you may need some form of transportation. There is also a green bus stop a few blocks from our apartment.\n\nIf you are interested, pm me your phone number or email address and we can set up some sort of meeting on campus so you can be sure I'm not a serial killer.\n\nLet me know if there is any info I left out.\n\nEdit: We are playing 3.5, and there is obviously a lot of interest so I need to talk to the DM about how many people can join.  Also, we usually play at about 2:00 or 3:00in the afternoon. Ill get back to you all shortly.    If you don't get any interest here, go talk to Dave at the Armored Gopher.  He can probably hook you up with some people. If you don't get any interest here, go talk to Dave at the Armored Gopher.  He can probably hook you up with some people.        YES and I have the basement ready. Don't have a DM though. I do have 3-5 interested people. PM me or reply. I live in Champaign, just off Neil.   I'll play, but only if you can deal with me trying to break the game while in character. When you say break, do you mean pun pun/1d2 crusader break, or super munchkin optimization break? I mean  name myself \"Masterwork\" and rip off my own limbs to use in combat. Well that's stupid. Why not name yourself \"masterwork magic +20\" you'd get a much better bonus on your ripped off limbs. My original plan is much more convoluted, I assure you. Please do explain; I love to hear about broken builds. Mind you, I've never actually played D&amp;D, I just had fun brainstorming ridiculous shit with a friend that does. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16o2gp/anybody_want_to_play_dungeons_and_dragons/"
  }, {
    "id" : 9,
    "title" : "Anybody know a good fish and chips place around here? Have a car so off campus works too. ",
    "snippet" : "  Seaboat Seaboat Seaboat Seaboat Seaboat [deleted]  The food car on Matthews (Derald's?) has a good fish sandwich on Fridays. Black Dog's Friday fish special is also legit. Are you talking about the Cod sandwich? I love The Black Dog, but I was seriously disappointed with the Cod sandwich. Just a slab of bland fish on a bun. So unlike them.\n\nMaybe it was because it was carryout, or just a bad day.\n\n   Black Dog's Friday fish special is also legit.  1. [Bevier cafe](http://beviercafe.illinois.edu/index.cfm) serves fish 'n chips for lunch every other week on Tuesdays. Keep checking their website for their menu. The next time they will have it is [January 29](http://beviercafe.illinois.edu/lunch.cfm?menu=weekafter).\n1. [Dublin O'Neils](http://dublinoneils.com/) - Irish pub.  Big JJ's on Market Street.  Legends weekend fish sandwich Legends weekend fish sandwich Legends weekend fish sandwich   At first i thought this was r/Edinburgh. Gl man.   [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/16nid2/anybody_know_a_good_fish_and_chips_place_around/"
  }, {
    "id" : 10,
    "title" : "Are there any engineering frats on campus?",
    "snippet" : "I'm a freshman in physics and I am looking to rush    Definitely Triangle  Definitely Triangle     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16o90m/are_there_any_engineering_frats_on_campus/"
  }, {
    "id" : 11,
    "title" : "Need a PHYS 213 tutor - willing to pay!",
    "snippet" : "If anyone really knows their Physics 213 stuff, I need a tutor on rather short notice (like in the next day or so) to ask some questions for a couple or few hours. And I will pay you money! PM me if you're interested.  The physics department keeps a list of physics tutors:\n\nhttp://physics.illinois.edu/courses/tutors.pdf  Why ya need one now? 213 is during the second 8 week term of the semester! I'm trying to proficiency out of it.",
    "url" : "http://www.reddit.com/r/UIUC/comments/16ntao/need_a_phys_213_tutor_willing_to_pay/"
  }, {
    "id" : 12,
    "title" : "So I hear we need a new Chief logo...",
    "snippet" : "   I DON'T LIKE THAT I HATE BEING SOBAH\n        -Love Sosa\n\nI actually enjoyed a good chunk of that album. There are like 3 \"good\" songs then the rest are so bad that they are good.     You'll be seeing this on a shirt for unofficial.    in jail now lol\nhttp://www.chicagotribune.com/news/local/breaking/chi-chief-keef-jailed-20130115,0,6580088.story",
    "url" : "http://i.imgur.com/wyC36.jpg"
  }, {
    "id" : 13,
    "title" : "iClicker lending/purchasing",
    "snippet" : "anybody have an iClicker they don't need this semester? I am in the market to borrow it (+collateral) / buy it from you.\n\nThanx,\nNindgod\n  There's a student government program for that!  [iRent](https://www.facebook.com/il.studentsenate?fref=ts)   If those other options don't work out for you, I have an iClicker I won't be needing this semester. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16nmba/iclicker_lendingpurchasing/"
  }, {
    "id" : 14,
    "title" : "Thoughts on CS 440/ECE 448 (Artificial Intelligence)?",
    "snippet" : "I'm looking for another class to take and was thinking about CS 440/ECE 448. I've read/heard mixed things about it on /r/uiuc and from friends, but nothing specific. How's the workload and do you feel like you got anything out of the class? The class is being taught by Eyal Amir this semester if it matters.  took it 2 years ago, it was kind of interesting but I was expecting to learn more \"cool\" things.  Then again I only attended about 40% of the lectures so I'm probably not the best critic.  I got a B with pretty minimal effort, didn't get a whole lot out of it since I didn't follow up with machine learning or anything  Great class, but don't take it with Eyal Amir. I've heard similar opinions. Any specific reasons? Great class, but don't take it with Eyal Amir. I heard that at least half of the class dropped last Spring when Prof. Amir was teaching it. I decided to take CS 440 next semester in order to avoid him as a professor. I heard that at least half of the class dropped last Spring when Prof. Amir was teaching it. I decided to take CS 440 next semester in order to avoid him as a professor. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16nj2d/thoughts_on_cs_440ece_448_artificial_intelligence/"
  }, {
    "id" : 15,
    "title" : "Inspired by Dr. Wise's latest e-mail: If Chancellor Phyllis Wise lived during the days of MLK",
    "snippet" : "    TIL people actually read the University's mass mails....  ",
    "url" : "http://i.imgur.com/GkvOM.png"
  }, {
    "id" : 16,
    "title" : "Why does UIUCnet now redirect to bing.com after logging in? ",
    "snippet" : "       The only time I used Bing was to search \"How to uninstall Bing\" I too would be interested to know how to uninstall a web site.  ",
    "url" : "http://www.bing.com"
  }, {
    "id" : 17,
    "title" : "2013 January Jobs Thread",
    "snippet" : "Are any of you working at places that are currently hiring? I'm in need of a job with flexible hours.  Try the [Virtual Job Board](https://secure.admin.illinois.edu/osfa/vjb/) Try the [Virtual Job Board](https://secure.admin.illinois.edu/osfa/vjb/) Do you know of any additional websites that I can look at for job postings? Virtual job board definitely helped. Thanks.   I know of a place that pays $17/hr with great job experience :)  Do share.  I need to hire an experienced JavaScript person. What skills do you have? Do share.    I think Bread Company is hiring. I remember seeing a help wanted sign in their window, but I could be wrong.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16mxdz/2013_january_jobs_thread/"
  }, {
    "id" : 18,
    "title" : "Anyone know of or is a good guitar teacher around C-U?",
    "snippet" : "I've hit a wall in my guitar playing and could use a teacher to help me get better at lead guitar and soloing.   You could always put up an ad in Smith Hall or the Music Building. I'm sure there are music students who would be very willing to give you guitar lessons for a negotiable price.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16mrea/anyone_know_of_or_is_a_good_guitar_teacher_around/"
  }, {
    "id" : 19,
    "title" : "Class Rosters",
    "snippet" : "Does anyone know a way to look at our class rosters?  Other than just asking for their info.  Thanks.\n\n  Generally speaking, class rosters are not published as that is FERPA protected data. I was thinking this would be the case.  Oh well.  Thanks anyway!  Haven't done much with 2g, so I'll figure out how to send a course message from there.   ECE Hacker? I was thinking this would be the case.  Oh well.  Thanks anyway!  Haven't done much with 2g, so I'll figure out how to send a course message from there.   You bring up a good point-Compass 1g did allow you to view it, and some teachers would actually use that feature to put you into groups and such.     Why do you want to? Stalking a cute girl in his class. Why do you want to?",
    "url" : "http://www.reddit.com/r/UIUC/comments/16mja0/class_rosters/"
  }, {
    "id" : 20,
    "title" : "No snark - why are people so stuck on the Chief?",
    "snippet" : "I figured with the new mascot contest and with seeing all of the \"Chief!!\" comments on posts related to that contest, this would be a good time to ask.\n\nBefore I go on with my question, I'll give you guys a little background info on me to explain why I'm asking.\n\nI transferred here in Fall 2010 as a sophomore. The only person that I knew (outside of friends of acquaintances) who went to Illinois was my boyfriend at the time. These two things are important because 1. I came here after the Chief was no longer our mascot and 2. Unlike many people who go here, I didn't have any friends or family who went to Illinois while the Chief was popular/still around (except for the bf) and therefore was never really exposed to that culture/\"pride\"/etc. So basically, I've never had any sort of \"allegiance\" to the Chief and don't really have much of an opinion either way, outside of a slight negative feeling.\n\nThe [APA](http://www.apa.org/pi/oema/resources/indian-mascots.aspx) and the [NCAA](http://sports.espn.go.com/ncaa/news/story?id=2125735) both agree that the use of Native American mascots is harmful and creates a \"hostile environment\". I can definitely see where they're coming from.\n\nSo to those of you who support the use of the Chief: why? How do you feel about the views from organizations like the APA? \n\n**tl;dr: I came to this school after the Chief was retired and didn't know anyone who came here/was never exposed to love for the Chief. I don't really have much of an opinion either way and I'm curious as to why people are such strong defenders of the mascot.**\n\nThanks! =D\n\n**Edit: Wow, I'm overwhelmed and surprised by the amount of feedback I've gotten! The vast majority of the responses were very calm and respectful on both sides, and I thank you for that; I was expecting a serious shitblizzard, to be honest!**\n\n**It seems like this whole thing is broken down two different ways.**\n\n**For: The Chief was a symbol of honor, leadership, unity, and other positive things. He brought the campus community together and was an important part of the University culture. The loss of this symbol has left a hole in the community. Since he was always portrayed respectfully, and had support from Native Americans at some point (?), it is unfair to call him racist and anyone who says otherwise is being oversensitive or is unaware of all of the details of the Chief. Some people have said that the Chief was banned simply because the NCAA wished it to be so, without any feedback from the campus community. Some people in this group respect the decision to cease use of the Chief, while some are very unhappy with it.**\n\n**Against: The Chief is a racist caricature of what it means to be Native American. He would dress up in the expected attire, and do a dance that people would expect a Native American to do. The dance is offensive because it is based on stereotypical movements with Boy Scout routines or religious ceremonial dance (both have been stated in the comments), and the costume is offensive because there are parts of it that have significance with spirituality, community, and other important aspects of NA culture. Positive stereotypes/generalization are still harmful to minority groups, and the Chief and Native Americans are an example of this.**\n\n**Overall, most of the comments have really helped me gain a better understanding of Chief Illiniwek and his impact on campus culture, both positive and negative. I'm very grateful for that, and am always open to more information!**  This really is the right question to ask. Not (only) whether the Chief is or isn't racist, but what's at the root of the school's attachment to this figure in particular.\n\nWould students and alumni have such a deeply-rooted emotional attachment to the Chief if it arose around the same time period but was something else -- an animal, for example? That is, is the attachment to the Chief just about history/tradition?\n\nIs the attachment to the Chief rooted in the principles that supporters often say he stands for -- leadership, honor, unity and so forth? If so, why can't another figure stand in for those principles? An American soldier, for example? Why would an Indian be uniquely evocative of those concepts in ways that nothing or no one else could? Is it the principles themselves that are most important or what supposedly represents them?\n\nOr is loyalty toward the Chief really just displaced loyalty toward the university, the team, or the town? And if so, can another figure stand in for that equally well? Does school/town spirit really depend on what supposedly symbolizes it to exist (to the same extent)? \n\nSeveral posters have suggested that schools with cartoonish mascots don't command the same kind of devotion that the Chief does. Would they, if they were figures similar to the Chief -- native figures dancing in full dress? \n\nHow much of the university's relationship to the Chief is tied into American popular culture's relationship with native people, in other words? Is the devotion the Chief commands uniquely rooted in his Indianness, or in something else?\n\n Very good questions. The American soldier angle fits in with the supposed origin of \"Fighting Illini\" - UIUC students who went off to fight in WWI. I think the Indian-ness makes the Chief a more \"mystical\" figure, rather than an American soldier, which any of us could be. Unfortunately, I think there was very little connection between the Chief and the actual native people, their cultures, and values. That may be one of the biggest failures, and reasons for the Chief's retirement: the use of this symbol without a widespread understanding of Indian culture and history among the student community.\n\nI also wonder if those values of honor, tradition, etc. were instilled in the Chief from his inception, or if those were applied gradually over time. I know that in the last years, the Chief ONLY appeared at halftime of home sporting events. Earlier in his history, the Chief appeared more frequently - away games, parades, and promotional shots (I remember some random pictures of the Chief at different locations on the 1952 Rose Bowl trip). It seems like the reverence with which the Chief acted increased over time. I don't know if that was an attempt to embody those values more fully or to curb some anti-Chief backlash. This really is the right question to ask. Not (only) whether the Chief is or isn't racist, but what's at the root of the school's attachment to this figure in particular.\n\nWould students and alumni have such a deeply-rooted emotional attachment to the Chief if it arose around the same time period but was something else -- an animal, for example? That is, is the attachment to the Chief just about history/tradition?\n\nIs the attachment to the Chief rooted in the principles that supporters often say he stands for -- leadership, honor, unity and so forth? If so, why can't another figure stand in for those principles? An American soldier, for example? Why would an Indian be uniquely evocative of those concepts in ways that nothing or no one else could? Is it the principles themselves that are most important or what supposedly represents them?\n\nOr is loyalty toward the Chief really just displaced loyalty toward the university, the team, or the town? And if so, can another figure stand in for that equally well? Does school/town spirit really depend on what supposedly symbolizes it to exist (to the same extent)? \n\nSeveral posters have suggested that schools with cartoonish mascots don't command the same kind of devotion that the Chief does. Would they, if they were figures similar to the Chief -- native figures dancing in full dress? \n\nHow much of the university's relationship to the Chief is tied into American popular culture's relationship with native people, in other words? Is the devotion the Chief commands uniquely rooted in his Indianness, or in something else?\n\n This really is the right question to ask. Not (only) whether the Chief is or isn't racist, but what's at the root of the school's attachment to this figure in particular.\n\nWould students and alumni have such a deeply-rooted emotional attachment to the Chief if it arose around the same time period but was something else -- an animal, for example? That is, is the attachment to the Chief just about history/tradition?\n\nIs the attachment to the Chief rooted in the principles that supporters often say he stands for -- leadership, honor, unity and so forth? If so, why can't another figure stand in for those principles? An American soldier, for example? Why would an Indian be uniquely evocative of those concepts in ways that nothing or no one else could? Is it the principles themselves that are most important or what supposedly represents them?\n\nOr is loyalty toward the Chief really just displaced loyalty toward the university, the team, or the town? And if so, can another figure stand in for that equally well? Does school/town spirit really depend on what supposedly symbolizes it to exist (to the same extent)? \n\nSeveral posters have suggested that schools with cartoonish mascots don't command the same kind of devotion that the Chief does. Would they, if they were figures similar to the Chief -- native figures dancing in full dress? \n\nHow much of the university's relationship to the Chief is tied into American popular culture's relationship with native people, in other words? Is the devotion the Chief commands uniquely rooted in his Indianness, or in something else?\n\n   Its something which has been a tradition at the U of I for a long time, and people have trouble letting go of that, I'd say this is the biggest thing.  The Chief in general and the halftime dance was a ritual which was revered at the university and kind of brought the fans together, like any other group ritual.  It would have been a similar thing to take away a long tradition, for instance \"jump around\" after the 3rd quarter of Wisconsin football games (which they tried to remove due to damage to the stadium and failed). \n\nThe large majority of people who want the chief back / reminisce about him do not see it as racism.   He was not cartoony, did not run around getting into shenanigans during the game or anything.  He would come out do the dance, lead the alma mater only.  He wasn't really a mascot so much as a symbol of the good things that illini wanted to be.  I think people went out of their way to treat the chief with respect and make it authentic (even though it is a mish-mash of a few different tribes). \n\nUltimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist.  Even if it is not meant with bad intentions.  \n\ntl;dr People who love the chief don't see it as racist, and hold it with high reverence due to it being a long running group ritual.   Its something which has been a tradition at the U of I for a long time, and people have trouble letting go of that, I'd say this is the biggest thing.  The Chief in general and the halftime dance was a ritual which was revered at the university and kind of brought the fans together, like any other group ritual.  It would have been a similar thing to take away a long tradition, for instance \"jump around\" after the 3rd quarter of Wisconsin football games (which they tried to remove due to damage to the stadium and failed). \n\nThe large majority of people who want the chief back / reminisce about him do not see it as racism.   He was not cartoony, did not run around getting into shenanigans during the game or anything.  He would come out do the dance, lead the alma mater only.  He wasn't really a mascot so much as a symbol of the good things that illini wanted to be.  I think people went out of their way to treat the chief with respect and make it authentic (even though it is a mish-mash of a few different tribes). \n\nUltimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist.  Even if it is not meant with bad intentions.  \n\ntl;dr People who love the chief don't see it as racist, and hold it with high reverence due to it being a long running group ritual.   I see what you mean; the Chief was meant as a symbol for the university that brought a lot of people together and instilled pride in something they shared.\n\n&gt; Ultimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist. Even if it is not meant with bad intentions.\n\nYeah, I understand that for sure. Like in the APA article:\n&gt;According to Dr. Stephanie Fryberg, University of Arizona, this appears to have a negative impact on the self-esteem of American Indian children. \"American Indian mascots are harmful not only because they are often negative, but because they remind American Indians of the limited ways in which others see them. This in turn restricts the number of ways American Indians can see themselves.\"\n\nThank you for your response! &gt;Ultimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist. Even if it is not meant with bad intentions.\n\n\"It would be wrong to call the art of Native American dancing inherently demeaning if performed by a non-Native American, even in a more public venue. Certainly, the evidence from Native American gatherings does not justify the claim of sacrilege.\"\n\nI find it completely ridiculous to assert that any portrayal of a Native American dance by a non Native American as racist.  I think the best way to understand the pro-Chief side of things would be to read through the FAQ section for The Tradition on the [Honoring The Chief site](http://www.honorthechief.com/Tradition/index.html).\n\n &gt;I find it completely ridiculous to assert that any portrayal of a Native American dance by a non Native American as racist.\n\nWe know that Chief's apparel is not representative of the Illini tribe's apparel. I'm inclined to assume, absent evidence to the contrary, that his dance is likewise not representative. It was created by the Souix tribe.  While it might not be representative of the Illini tribe exactly, seeing as they don't exist anymore, there's really nothing better than having an authentic regalia made by a tribe for us.\n\nThe dance is taught to each Chief under the tutelage of one of the nearby tribes, and is accurate to dances that they do.  When you assume, it makes an ass out of u and me. The Sioux and the 12-13 tribes that we recognize as the Illini Confederation were/are completely different cultural groups. It makes no sense to argue that substituting one group's authentic clothing and another group's authentic dance for an entirely different group's dress and dance is \"accurate enough\" because they're all Native American.\n\nAt a different level, you can question whether the performance would be authentic even if the costume and the dance were truly accurate to one of the Illini Confederation tribes. If the mascot was the General, and a student who never served in the military put on his great grandfather's World War I uniform, and did a historically accurate Drill Team routine, would this be an authentic representation of a Veteran? Would you expect Veterans to feel honored? If the performer did not earn every medal and honor that the uniform symbolizes, then the performance is inaccurate, inauthentic, and disrespectful, regardless of how authentic the actual uniform and routine are. Several elements of the Chief's uniform symbolically represent particular acts of bravery, community, and spirituality, that the actual Chief who first wore it earned--any student who wore it after, no matter how good of a student, did not deserve to wear it. It wasn't worn by any actual Native American Chief.  It was made by the Souix specifically for this purpose. Everything else you said, I have to say I agree with, however. My apologies for that error. The Sioux and the 12-13 tribes that we recognize as the Illini Confederation were/are completely different cultural groups. It makes no sense to argue that substituting one group's authentic clothing and another group's authentic dance for an entirely different group's dress and dance is \"accurate enough\" because they're all Native American.\n\nAt a different level, you can question whether the performance would be authentic even if the costume and the dance were truly accurate to one of the Illini Confederation tribes. If the mascot was the General, and a student who never served in the military put on his great grandfather's World War I uniform, and did a historically accurate Drill Team routine, would this be an authentic representation of a Veteran? Would you expect Veterans to feel honored? If the performer did not earn every medal and honor that the uniform symbolizes, then the performance is inaccurate, inauthentic, and disrespectful, regardless of how authentic the actual uniform and routine are. Several elements of the Chief's uniform symbolically represent particular acts of bravery, community, and spirituality, that the actual Chief who first wore it earned--any student who wore it after, no matter how good of a student, did not deserve to wear it. Devil's Advocate: We put on Civil War re-enactments all of the time and I wouldn't say that people are \"dishonored\" by someone pretending to be a civil war hero. They're just acting a part... &gt;Ultimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist. Even if it is not meant with bad intentions.\n\n\"It would be wrong to call the art of Native American dancing inherently demeaning if performed by a non-Native American, even in a more public venue. Certainly, the evidence from Native American gatherings does not justify the claim of sacrilege.\"\n\nI find it completely ridiculous to assert that any portrayal of a Native American dance by a non Native American as racist.  I think the best way to understand the pro-Chief side of things would be to read through the FAQ section for The Tradition on the [Honoring The Chief site](http://www.honorthechief.com/Tradition/index.html).\n\n I see what you mean; the Chief was meant as a symbol for the university that brought a lot of people together and instilled pride in something they shared.\n\n&gt; Ultimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist. Even if it is not meant with bad intentions.\n\nYeah, I understand that for sure. Like in the APA article:\n&gt;According to Dr. Stephanie Fryberg, University of Arizona, this appears to have a negative impact on the self-esteem of American Indian children. \"American Indian mascots are harmful not only because they are often negative, but because they remind American Indians of the limited ways in which others see them. This in turn restricts the number of ways American Indians can see themselves.\"\n\nThank you for your response! Its something which has been a tradition at the U of I for a long time, and people have trouble letting go of that, I'd say this is the biggest thing.  The Chief in general and the halftime dance was a ritual which was revered at the university and kind of brought the fans together, like any other group ritual.  It would have been a similar thing to take away a long tradition, for instance \"jump around\" after the 3rd quarter of Wisconsin football games (which they tried to remove due to damage to the stadium and failed). \n\nThe large majority of people who want the chief back / reminisce about him do not see it as racism.   He was not cartoony, did not run around getting into shenanigans during the game or anything.  He would come out do the dance, lead the alma mater only.  He wasn't really a mascot so much as a symbol of the good things that illini wanted to be.  I think people went out of their way to treat the chief with respect and make it authentic (even though it is a mish-mash of a few different tribes). \n\nUltimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist.  Even if it is not meant with bad intentions.  \n\ntl;dr People who love the chief don't see it as racist, and hold it with high reverence due to it being a long running group ritual.   Its something which has been a tradition at the U of I for a long time, and people have trouble letting go of that, I'd say this is the biggest thing.  The Chief in general and the halftime dance was a ritual which was revered at the university and kind of brought the fans together, like any other group ritual.  It would have been a similar thing to take away a long tradition, for instance \"jump around\" after the 3rd quarter of Wisconsin football games (which they tried to remove due to damage to the stadium and failed). \n\nThe large majority of people who want the chief back / reminisce about him do not see it as racism.   He was not cartoony, did not run around getting into shenanigans during the game or anything.  He would come out do the dance, lead the alma mater only.  He wasn't really a mascot so much as a symbol of the good things that illini wanted to be.  I think people went out of their way to treat the chief with respect and make it authentic (even though it is a mish-mash of a few different tribes). \n\nUltimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist.  Even if it is not meant with bad intentions.  \n\ntl;dr People who love the chief don't see it as racist, and hold it with high reverence due to it being a long running group ritual.   Its something which has been a tradition at the U of I for a long time, and people have trouble letting go of that, I'd say this is the biggest thing.  The Chief in general and the halftime dance was a ritual which was revered at the university and kind of brought the fans together, like any other group ritual.  It would have been a similar thing to take away a long tradition, for instance \"jump around\" after the 3rd quarter of Wisconsin football games (which they tried to remove due to damage to the stadium and failed). \n\nThe large majority of people who want the chief back / reminisce about him do not see it as racism.   He was not cartoony, did not run around getting into shenanigans during the game or anything.  He would come out do the dance, lead the alma mater only.  He wasn't really a mascot so much as a symbol of the good things that illini wanted to be.  I think people went out of their way to treat the chief with respect and make it authentic (even though it is a mish-mash of a few different tribes). \n\nUltimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist.  Even if it is not meant with bad intentions.  \n\ntl;dr People who love the chief don't see it as racist, and hold it with high reverence due to it being a long running group ritual.   Its something which has been a tradition at the U of I for a long time, and people have trouble letting go of that, I'd say this is the biggest thing.  The Chief in general and the halftime dance was a ritual which was revered at the university and kind of brought the fans together, like any other group ritual.  It would have been a similar thing to take away a long tradition, for instance \"jump around\" after the 3rd quarter of Wisconsin football games (which they tried to remove due to damage to the stadium and failed). \n\nThe large majority of people who want the chief back / reminisce about him do not see it as racism.   He was not cartoony, did not run around getting into shenanigans during the game or anything.  He would come out do the dance, lead the alma mater only.  He wasn't really a mascot so much as a symbol of the good things that illini wanted to be.  I think people went out of their way to treat the chief with respect and make it authentic (even though it is a mish-mash of a few different tribes). \n\nUltimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist.  Even if it is not meant with bad intentions.  \n\ntl;dr People who love the chief don't see it as racist, and hold it with high reverence due to it being a long running group ritual.   Its something which has been a tradition at the U of I for a long time, and people have trouble letting go of that, I'd say this is the biggest thing.  The Chief in general and the halftime dance was a ritual which was revered at the university and kind of brought the fans together, like any other group ritual.  It would have been a similar thing to take away a long tradition, for instance \"jump around\" after the 3rd quarter of Wisconsin football games (which they tried to remove due to damage to the stadium and failed). \n\nThe large majority of people who want the chief back / reminisce about him do not see it as racism.   He was not cartoony, did not run around getting into shenanigans during the game or anything.  He would come out do the dance, lead the alma mater only.  He wasn't really a mascot so much as a symbol of the good things that illini wanted to be.  I think people went out of their way to treat the chief with respect and make it authentic (even though it is a mish-mash of a few different tribes). \n\nUltimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist.  Even if it is not meant with bad intentions.  \n\ntl;dr People who love the chief don't see it as racist, and hold it with high reverence due to it being a long running group ritual.   &gt; Ultimately though, to have a white guy in a native american chief costume dancing at halftime of a sporting event is racist. Even if it is not meant with bad intentions.\n\nThis suggests if he was american indian, it wouldn't be racist.  I hate to tell you but saying because he was portrayed by a white person it is wrong is racism.\n\nNot caring about the race of the actor playing the symbol isn't racism. This was not my intention to say \"its only racist because its a white guy in the costume\", if that was what I meant that is what I would have said.  The rest is you inferring things.\n\n  I'm just trying give my thoughts on the OP's question from the perspective of someone who grew up here, went to school here, still lives here, and comes from a couple generations of graduates from the U of I.   You don't need to pick apart what I said looking for racism.\n\n  My opinions on the chief are irrelevant, since [the group that mascot is supposed to represent requested the Chief's retirement](http://aistm.org/2000peoria.htm). My opinions on the chief are irrelevant, since [the group that mascot is supposed to represent requested the Chief's retirement](http://aistm.org/2000peoria.htm). My opinions on the chief are irrelevant, since [the group that mascot is supposed to represent requested the Chief's retirement](http://aistm.org/2000peoria.htm). That's a very interesting document! Thank you for sharing. Do you think other people don't really care about the concerns of that tribe? Do you know what the response was from the campus community in regards to the tribe's request to cease use of the Chief? I don't know if people care or not. It's easy to brush off a group's concern as \"over-sensitivity\" when you're not a member of the marginalized group. \n\nIn regards to community response: apparently some alums stopped donating &amp; refuse to return to campus, according to /u/Trakis. If that's true, I think that speaks volumes about their pride in the school. That's very true.\n\nAs far as the community response, I meant directly towards the tribe; did people brush them off as being \"oversensitive\"? That's very true.\n\nAs far as the community response, I meant directly towards the tribe; did people brush them off as being \"oversensitive\"? This article shows a reason people think the tribe is being over sensitive. It says that around the time the Chief was being scrutinized, 2002, a poll showed 75% of native americans were not offended by the NFL's Washington Redskins. Redskins, arguably is one of the most offensive misnomers for Native Americans. \n\nhttp://bleacherreport.com/articles/267285-native-american-mascots-honorable-or-ignorant\n\nI remember reading another article that showed similar results (though I cannot find it) that showed something like 70% of Native Americans were unopposed to Universities using Native American culture as their mascot name. \n\nEdit: I feel that since the tribe doesn't want the Chief, we definitely shouldn't have him. Although I do believe we should never change our name. And to answer your question: people are upset about it because what once was theres is being taken away without their say, and they feel entitled to an opinion on the matter. Whether they deserve one or not is another debate.  This article shows a reason people think the tribe is being over sensitive. It says that around the time the Chief was being scrutinized, 2002, a poll showed 75% of native americans were not offended by the NFL's Washington Redskins. Redskins, arguably is one of the most offensive misnomers for Native Americans. \n\nhttp://bleacherreport.com/articles/267285-native-american-mascots-honorable-or-ignorant\n\nI remember reading another article that showed similar results (though I cannot find it) that showed something like 70% of Native Americans were unopposed to Universities using Native American culture as their mascot name. \n\nEdit: I feel that since the tribe doesn't want the Chief, we definitely shouldn't have him. Although I do believe we should never change our name. And to answer your question: people are upset about it because what once was theres is being taken away without their say, and they feel entitled to an opinion on the matter. Whether they deserve one or not is another debate.  So if white Europeans don't like it when black people dress up as knights, is it their right to say \"You can't dress up like our long dead ancestors anymore\"?\n\nWhat you are suggesting is racism. **While I do not have strong feelings on this, I feel compelled to respond to your argument since I think it is deeply flawed. Please remember that my response is not a rabid political correctness screed, but rather a critique of your analogy.**\n\nAttempts to analogize the experience of a historically marginalized, discriminated-against people who have been the victims of genocide, despoliation, or forced labor to the experience of a group that is a historical control majority with no such background of atrocities is inherently flawed. \n\nSecondly, this isn't about \"white folks\" using Chief - if you hadn't noticed, there's a lot of diversity at Illinois - it's about a public entity using Chief. The decisions it makes represents us all. In that way, your analogy to \"black people dressing up like knights\" fails.\n\nEven if a Knight MIGHT be a good analogy to a Chief or a Brave, remember that the appearance of Chief Illiniwek is not based upon authentic tribal dress of the Illini tribe; it is a stereotyped minstrel show. In this way, perhaps our hypothetical Knights name is not offensive, but the mascot itself is wearing an amalgam of armor from Japanese Samurai and Zulu warriors. The people using the name don't care about authenticity no matter what they claim, they're happy with their false caricature that marginalizes the group targeted. Now, we're going to have to also assume a hypothetical where African warriors poured out of Africa into Europe and exterminated white Europeans with disease and warfare, snatching up their land, and leaving them relegated to dwelling on small reservations as a pittance. \n\n----\n\nI don't understand the attachment to Chief Illiniwek. Or to the Redskins. Or the Cleveland Indians, or the Atlanta Braves, or the Pekin Chinks, or the Florida State Seminoles, or a hypothetical basketball team called the New Orleans Fighting Mandingos. \n\nMascots can have a great deal of meaning, but I can't understand why that's worth hurting other people. Maybe many Native Americans don't have a problem with it. Some do. And it's with good reason - just as good as outrage against the Chinks or Fighting Mandingos. Racism isn't cool. \n\nSo yeah, I came here gladly. I shout \"CHIEEEEEEEF!\" along with everyone else at the football games. But, while I'm not driven to change the name, I can understand why it's an issue, and I don't understand the desire to defend a racist past. I certainly don't think, \"It's not really THAT racist\" is a good reason to defend it. \n\nMy biggest reason for opposition? God, I don't want to wind up with a 9 foot hillbilly as a mascot and a name like the Cornhuskers. But surely we're more creative than Nebraska? &gt; Attempts to analogize the experience of a historically marginalized, discriminated-against people who have been the victims of genocide, despoliation, or forced labor to the experience of a group that is a historical control majority with no such background of atrocities is inherently flawed.\n\nNo living member claiming relation to the american indian population was ever the victim of any such atrocity.  As a native american myself I associate as strongly with the Illiniwek, in fact perhaps more so, than they do.\n\nThey have no special right due to the color of their skin.  To believe otherwise is racist.\n\nIt is about white folks, it was specifically cited in the complaint.\n\n&gt; Even if a Knight MIGHT be a good analogy to a Chief or a Brave, remember that the appearance of Chief Illiniwek is not based upon authentic tribal dress of the Illini tribe; it is a stereotyped minstrel show.\n\nThis is completely incorrect.  Chief Illiniwek's dress is based on a gift to the University of Illinois from the chief of the Oglala Sioux.  The real regalia was retired immediately out of respect as it contained real Eagle feathers.  It was presented to the University in 1982 by Chief Fools Crow himself.  Prior to this point Chief Illiniwek's regalia was authentic to the Illiniwek.  His appearance is and was and remembrance of the great honor Chief Fools Crow provided us through the regalia.\n\nLearn your history. You seem to be forgetting that the permission to use the regalia was [revoked several years ago by Chief Fools Crow and the tribe, and the university was forced to give it back](http://www.ucimc.org/content/chief-illiniwek-regalia-returned-ogalala-lakota), because the tribe did not agree with how it was being used as part of a minstrel show.\n\nLearn your history. &gt; Attempts to analogize the experience of a historically marginalized, discriminated-against people who have been the victims of genocide, despoliation, or forced labor to the experience of a group that is a historical control majority with no such background of atrocities is inherently flawed.\n\nNo living member claiming relation to the american indian population was ever the victim of any such atrocity.  As a native american myself I associate as strongly with the Illiniwek, in fact perhaps more so, than they do.\n\nThey have no special right due to the color of their skin.  To believe otherwise is racist.\n\nIt is about white folks, it was specifically cited in the complaint.\n\n&gt; Even if a Knight MIGHT be a good analogy to a Chief or a Brave, remember that the appearance of Chief Illiniwek is not based upon authentic tribal dress of the Illini tribe; it is a stereotyped minstrel show.\n\nThis is completely incorrect.  Chief Illiniwek's dress is based on a gift to the University of Illinois from the chief of the Oglala Sioux.  The real regalia was retired immediately out of respect as it contained real Eagle feathers.  It was presented to the University in 1982 by Chief Fools Crow himself.  Prior to this point Chief Illiniwek's regalia was authentic to the Illiniwek.  His appearance is and was and remembrance of the great honor Chief Fools Crow provided us through the regalia.\n\nLearn your history. &gt;No living member claiming relation to the american indian population was ever the victim of any such atrocity.\n\n\nIncorrect. Do you know anything about American Indian history in the last 50-80 years? I grew up next to a reservation, with many extremely active American Indian friends. You need to look up your statements, specifically the blanket/absolute ones. Try not to attempt to think for an entire culture, ok?\n\n**EDIT** Edited, so we can stay on topic ;) So if white Europeans don't like it when black people dress up as knights, is it their right to say \"You can't dress up like our long dead ancestors anymore\"?\n\nWhat you are suggesting is racism. My opinions on the chief are irrelevant, since [the group that mascot is supposed to represent requested the Chief's retirement](http://aistm.org/2000peoria.htm). My opinions on the chief are irrelevant, since [the group that mascot is supposed to represent requested the Chief's retirement](http://aistm.org/2000peoria.htm). Why are their names non-Native American?   I think more people would rather have no new mascot than a replacement for the Chief. Most people I know aren't calling to have the Chief back, he is banned for good reason. But he was around for 80 years, and still means a lot to the U of I community. \n\nTo create an analogy, imagine that U of I and the Chief were married, and all the alumni and students that enjoyed his presence were their children. Now it would be like U of I and the Chief are divorced, and U of I is trying to replace the children's parent. It is not going to go over well in the eyes of the \"children\" But the \"children\" will graduate and the new students deserve to have a mascot if they want one.  I too didn't go to Illinois until after the Chief was retired.  But don't forget:  U of I are still the Fighting Illini.  Chief Illiniwek is the symbol for that.  And when you talk to Alumni who did experience the chief, it was a HUGE part of their life at Illinois.  There are people who refuse to return to campus, or have cancelled their annual donations just because the Chief is gone.  \n\nAlso, have you ever seen an old football or basketball halftime dance by the Chief?  Shit gives you goosebumps. Hopefully some other people can also give you some insight.    The goosebumps depend on the spectator. I took a girlfriend to an Illini game who had just moved here from Minnesota to establish residency prior to grad school. She knew nothing of the Chief. She was absolutely horrified at halftime by the dance.\n\nI still get a little teary eyed watching the dance online, but it comes both from the attachment I have to this institution as well as the conflict that the Chief represented. Horrified?  Sounds like you had a girlfriend that was a little too emotional.  There is nothing remotely \"horrifying\" about the performance.  If it was all made up and impromptu, then sure.  If the portrayer wasn't trained for weeks on how to accurately portray the dance alongside several members of the tribe, maybe.  But all this happened, and still does. &gt; Sounds like you had a girlfriend that was a little too emotional. There is nothing remotely \"horrifying\" about the performance. \n\nSo you get to decide (for others) what is horrifying and who is too emotional? It's my opinion, so yes, I do get to decide.  Who said that I am deciding anything for other people? Horrified?  Sounds like you had a girlfriend that was a little too emotional.  There is nothing remotely \"horrifying\" about the performance.  If it was all made up and impromptu, then sure.  If the portrayer wasn't trained for weeks on how to accurately portray the dance alongside several members of the tribe, maybe.  But all this happened, and still does. Accurately portray the dance?\n\nThe dance was created by Boy Scouts. It was based on fancy dance, yes, but that doesn't mean it's authentic in any way. I too didn't go to Illinois until after the Chief was retired.  But don't forget:  U of I are still the Fighting Illini.  Chief Illiniwek is the symbol for that.  And when you talk to Alumni who did experience the chief, it was a HUGE part of their life at Illinois.  There are people who refuse to return to campus, or have cancelled their annual donations just because the Chief is gone.  \n\nAlso, have you ever seen an old football or basketball halftime dance by the Chief?  Shit gives you goosebumps. Hopefully some other people can also give you some insight.    I too didn't go to Illinois until after the Chief was retired.  But don't forget:  U of I are still the Fighting Illini.  Chief Illiniwek is the symbol for that.  And when you talk to Alumni who did experience the chief, it was a HUGE part of their life at Illinois.  There are people who refuse to return to campus, or have cancelled their annual donations just because the Chief is gone.  \n\nAlso, have you ever seen an old football or basketball halftime dance by the Chief?  Shit gives you goosebumps. Hopefully some other people can also give you some insight.    I too didn't go to Illinois until after the Chief was retired.  But don't forget:  U of I are still the Fighting Illini.  Chief Illiniwek is the symbol for that.  And when you talk to Alumni who did experience the chief, it was a HUGE part of their life at Illinois.  There are people who refuse to return to campus, or have cancelled their annual donations just because the Chief is gone.  \n\nAlso, have you ever seen an old football or basketball halftime dance by the Chief?  Shit gives you goosebumps. Hopefully some other people can also give you some insight.    Thank you for your input! I guess that's a major reason why I'm asking about this - I don't know the magnitude of the love for the Chief/how it was when he was still around. I'm from around SIUC, and I feel like they don't have as much love for the Saluki as they do the Chief, so I didn't really think that a mascot following could be so strong. =) No prob.  And to add on.  It's interesting you mentioned that you were from SIU (I have no intention of bashing, or being offensive at all to them right now).  I have absolutly no idea what life at/on SIU is like.  But Illinois is a MASSIVE Big 10 school.  With this conference, comes a massive love for our sports teams.  Not to bash SIU, but they aren't a Division 1A school, that competes on a national level in all sports (Technically...)  That's where the Chief comes in.\n\nSchool spirit is wrapped around our mascot.  Every half time game would have the Chief give a wonderful performance that gets EVERYONE fired up.  And overnight, it was taken away.  \n\nAnd I guess that is what makes Illinois unique.  You don't really see Michigan going crazy over the Wolverine.  Our mascot and The Chief is something that this school was really founded on.  And he was gone in the blink of an eye. Don't worry, SIU is boring (which is one reason why I didn't go!). No offense taken. ;)\n\nSo do you feel like people think that there is something missing? Like they lost a symbol to bond over that represents the school and the pride they have in it? Don't worry, SIU is boring (which is one reason why I didn't go!). No offense taken. ;)\n\nSo do you feel like people think that there is something missing? Like they lost a symbol to bond over that represents the school and the pride they have in it?  As someone who grew up in Urbana, I can say that I was absolutely devastated when they got rid of the Chief.  The Chief's dance was always my favorite part of any sporting event, and I will never forget the feeling of pride that it always inspired in me.\n\nI understand that some of the people who are the descendants of those the Chief is meant to be a depiction of find it to be racist, but I have never understood why.  The Chief may not be an accurate depiction, but I knew a couple of the chief dancers and the amount of work they put into studying and learning that dance was massive.  The Chief was universally idolized and loved by anyone who followed Illinois sports at all, and the camaraderie inspired by supporting him was great.  I don't at all understand why that was viewed to create a negative stereotype of a people (particularly when I guarantee you that the majority of students couldn't tell you exactly who he was supposed to be based off of).\n\nBut, even though I strongly disagree with and do not understand the motivation behind the removal of the Chief, I do respect it.  That doesn't mean I have to like it, though. Putting a lot of work into memorizing the dance is all fine and good. Nobody is saying that the Chief dancers didn't take their dance seriously.\n\nThe problem is that the dance was made-up and effectively a caricature of native american culture. We parade out our little Indian, have him dance around for a few minutes for our amusement, and then get back to our sport.\n\nYeah, the chief was fun to watch... But he was a caricature of the society he was supposed to represent. Absolutely, any mascot is a caricature.  He was a caricature based in research and created in collaboration with a tribe of Sioux.  Hell, the costume worn by the Chief since the 80s was made by the wife of a Sioux Chief.  I will grant that the likelihood that the representation of the Chief changed somewhat since its inception is high, but he was universally loved and respected by the students, and stood for absolutely nothing unholy, and I don't see at all how he could be seen as \"degrading racial stereotype that reflects negatively on all American Indian people\".\n\nI understand that it's how they feel and I don't fault them that, there's no one that can tell someone else how they should feel, I simply don't understand where the feeling comes from. One Sioux Chief's wife making the head dress doesn't mean anything. That's akin to saying that it's okay for me to wear blackface as long as a black guy put it on me. Obviously, an extreme example - but can you see the similarities? Just because one person, even one small group of people, said it's okay, doesn't mean it's okay with everybody else.\n\nIf he was universally loved and respected by the students, how come there are groups of students who are against the chief?\n\nI was talking to a Native American friend once, and she explained it to me sort of like this - let me see if it gives you some insight;\n\nImagine that you have everything taken away from you. Your family used to own the entire US. Now, you're forced onto squalid reservations, and everybody's poor, alcoholic, and uneducated... But you've still got your heritage to hold on to. It sounds funny, but that heritage as a Native American is that one last thing you have - so you hold onto it like hell.\n\nThen some college kids dress up in a costume like yours, make up a dance, put it to brass music, and go hopping around while people do the Tomahawk Chop - something that literally emphasizes the most brutish aspect of Native American lifestyle. After a few minutes of him hopping around, they shove him away.\n\nYour heritage - that list thing you had - has just been taken away from you. Instead, you're something for people to watch while they drink beers - you have become half-time entertainment. Oh I in no way meant it was ok just because the Sioux said it was ok, I was just saying that it wasn't just completely made up based on stereotypes.  The dance was created in collaboration with the Sioux so it was based SOMEWHAT on something real, as opposed to just some white kids coming up with something they think looks Native American.\n\nAnd fair enough, universally loved was a poor choice of words.  What I meant was, no one watched the Chief and laughed (I use the word \"no one\" with the knowledge that there's ALWAYS someone), people watched the Chief and cheered.  Those who supported the Chief didn't think he was funny or stereotypical, they thought he was badass.  They loved him and supported him and cheered his name.  It just doesn't compute with me that having an even horribly inaccurate representation of your people that people love and cheer for and think is awesome could be construed as a bad thing.\n\nThe heritage thing makes sense, and I can sympathize with it, although in that place my reaction would be more \"look at the silly white men trying to emulate us\" instead of \"those assholes are making fun of us\".\n\nAgain I want to reiterate that I in no way fault them for feeling that way, or believe that they should feel another way, it's just a very different reaction than my brain would have, but I am admittedly a very hard person to offend.  I don't want to come off as a racist prick here haha. &gt;The heritage thing makes sense, and I can sympathize with it, although in that place my reaction would be more \"look at the silly white men trying to emulate us\" instead of \"those assholes are making fun of us\".\n\nIt's easy to say that when you view yourself on equal footing. They are the oppressed - the white man the oppressors. Therein lies the problem.\n\n&gt;Again I want to reiterate that I in no way fault them for feeling that way, or believe that they should feel another way, it's just a very different reaction than my brain would have, but I am admittedly a very hard person to offend. I don't want to come off as a racist prick here haha.\n\nDon't worry. I've enjoyed hearing your points and seeing the way you think. While I disagree with you, I still respect your opinion - and I really appreciate you taking the time to listen to me! Upboats for everyone! As someone who grew up in Urbana, I can say that I was absolutely devastated when they got rid of the Chief.  The Chief's dance was always my favorite part of any sporting event, and I will never forget the feeling of pride that it always inspired in me.\n\nI understand that some of the people who are the descendants of those the Chief is meant to be a depiction of find it to be racist, but I have never understood why.  The Chief may not be an accurate depiction, but I knew a couple of the chief dancers and the amount of work they put into studying and learning that dance was massive.  The Chief was universally idolized and loved by anyone who followed Illinois sports at all, and the camaraderie inspired by supporting him was great.  I don't at all understand why that was viewed to create a negative stereotype of a people (particularly when I guarantee you that the majority of students couldn't tell you exactly who he was supposed to be based off of).\n\nBut, even though I strongly disagree with and do not understand the motivation behind the removal of the Chief, I do respect it.  That doesn't mean I have to like it, though. They may have put a lot of time into learning the dance, but it doesn't seem to be an accurate depiction of Native American dance: \n\n\"Professor Farnell cited the following:\n\n. it is frequently claimed that the person portraying the Chief is knowledgeable about Native American cultures, dances and music. The faculty members in our department whose areas of research and teaching focus specifically upon the music and dances of Native North America find this claim untenable. In marked contrast to indigenous dance forms, the choreographed movements performed by the Chief are a combination of stereotyped gestures and steps taken from the Boy Scout movement and Wild West Shows of the 1920s and 30s, supplemented by acrobatic display. The musical accompaniment is likewise a stereotypic misrepresentation derived from early Hollywood movies.\"\n\nhttp://www.uillinois.edu/trustees/dialogue/report_files/addendum.htm As someone who grew up in Urbana, I can say that I was absolutely devastated when they got rid of the Chief.  The Chief's dance was always my favorite part of any sporting event, and I will never forget the feeling of pride that it always inspired in me.\n\nI understand that some of the people who are the descendants of those the Chief is meant to be a depiction of find it to be racist, but I have never understood why.  The Chief may not be an accurate depiction, but I knew a couple of the chief dancers and the amount of work they put into studying and learning that dance was massive.  The Chief was universally idolized and loved by anyone who followed Illinois sports at all, and the camaraderie inspired by supporting him was great.  I don't at all understand why that was viewed to create a negative stereotype of a people (particularly when I guarantee you that the majority of students couldn't tell you exactly who he was supposed to be based off of).\n\nBut, even though I strongly disagree with and do not understand the motivation behind the removal of the Chief, I do respect it.  That doesn't mean I have to like it, though. It sounds like a lot of people were unhappy that a symbol that was important to them was taken away, and I can certainly understand that.\n\nThat's interesting to hear that the people who did the Chief thing had to put in a lot of time in order to do it. Do you know if they had to study any other cultural things associated with the Chief, or was it just the dance?\n\nThanks for your response!   I'm a lifelong Urbana resident and now that I attend UIUC I can't help being frustrated by students who side Chief without even understanding the complexity of the issue, or the fact the university spent multiple years conflicted over the decision.  The Chief didn't simply up and go.  People fought long and hard on both sides, and ultimately the university decided to retire a mascot that represents stereotyping and repression. I'm aware the OP asked for comments who support the chief, but I just thought I 'd share my thoughts, and a bit of background for those who feel so strongly.  Yes, though the university did it in the worst possible way: They convened a meeting during a snow closure (The St. Valentine's Day storm of 2007 where we got 14\" of snow), which was orchestrated by a now-disgraced group of trustees, and told students they would not hear any dissenting opinions.\n\nThe primary reasoning behind this was the NCAA coming down and denying our ability to host post-season events as long as we had a offensive mascot, don't let anyone tell you otherwise.\n\nEdit: Corrected spelling. &gt;The primary reasoning behind this was the NCAA coming down and denying our ability to host post-season events as long as we had a offensive mascot, don't let anyone tell you otherwise.\n\nThis. 100% this.  If there were no postseason bans, or any monetary downside to them keeping The Chief, he would still be here.  Guarantee it.  If only the tribe that he represents were still around, like FSU and the Seminoles, then everything would be just fine. Read the top comment, the tribe he represents requested him retired. Read the top comment, the tribe he represents requested him retired. That could not be any farther from the truth.  The tribe he represents no longer exists.  Random other Native American activists requested that he be retired.  There have been many studies that show that something like 90% of Native Americans support the use of Native American imagery and iconography in sports/schools.  There is a LARGE difference between the feelings of Native Americans and Native American activists. &gt; There is a LARGE difference between the feelings of Native Americans and Native American activists.\n\nThat is misguided, saying that non-Native Americans have no right to empathize with or participate in activism on behalf of Native Americans. It's like saying non-Jews shouldn't have an opinion about the Holocaust, because hey, it didn't concern them, or, white people shouldn't have had a problem with slavery, because hey, it didn't concern them, and in fact they benefited from it. Social justice transcends immediate and personal connections. The Chief issue is nowhere as bad as the Holocaust or slavery, which were terrible human rights violations, but the underlying principle of non-directly-affected people protesting is similar. So you don't think that you should take the opinions of those who are supposedly \"bastardized\" by this symbol as more important than an assortment of activists?  I never stated once that the activists were non-Native Americans. &gt;There is a LARGE difference between the feelings of Native Americans and Native American activists.\n\nand\n\n&gt;I never stated once that the activists were non-Native Americans.\n\nI don't really understand you. The above two statements are inconsistent, or tautological, depending on which way you look at it. &gt;There is a LARGE difference between the feelings of Native Americans and Native American activists.\n\nand\n\n&gt;I never stated once that the activists were non-Native Americans.\n\nI don't really understand you. The above two statements are inconsistent, or tautological, depending on which way you look at it. That could not be any farther from the truth.  The tribe he represents no longer exists.  Random other Native American activists requested that he be retired.  There have been many studies that show that something like 90% of Native Americans support the use of Native American imagery and iconography in sports/schools.  There is a LARGE difference between the feelings of Native Americans and Native American activists. Yeah, I'm going to need a source. &gt;Over the years, the Chief Illiniwek tradition has had continued endorsement of Native American descendents. Since the tradition's inception in 1926, there has been considerable support for the Chief by Native American leaders, including several that trace their lineage to the original Illini tribes. \nIn 2002, a Peter Harris Research Group poll showed that 81% of Native Americans support the use of Indian nicknames in high school and college sports, and 83% of Native Americans support the use of Indian mascots and symbols in professional sports. The accompanying commentary concluded that the poll suggests that although Native American activists are virtually united in opposition to the use of Indian nicknames and mascots, the Native American population sees the issue far differently. \nIn September 2004, the University of Pennsylvanias National Annenberg Election Survey reported the results of a year-long poll which showed that the vast majority of American Indians say that calling Washingtons professional football team the Redskins does not bother them (90% of Indians took that position, while 9% said they found the name offensive).\n\nhttp://www.honorthechief.com/Tradition/index.html Works for me thanks! Doesn't work for me, I would like to have a look at the original references, not excerpts on a \"Honor the Chief\" site. Doesn't work for me, I would like to have a look at the original references, not excerpts on a \"Honor the Chief\" site. I'm a lifelong Urbana resident and now that I attend UIUC I can't help being frustrated by students who side Chief without even understanding the complexity of the issue, or the fact the university spent multiple years conflicted over the decision.  The Chief didn't simply up and go.  People fought long and hard on both sides, and ultimately the university decided to retire a mascot that represents stereotyping and repression. I'm aware the OP asked for comments who support the chief, but I just thought I 'd share my thoughts, and a bit of background for those who feel so strongly.  I'm a lifelong Urbana resident and now that I attend UIUC I can't help being frustrated by students who side Chief without even understanding the complexity of the issue, or the fact the university spent multiple years conflicted over the decision.  The Chief didn't simply up and go.  People fought long and hard on both sides, and ultimately the university decided to retire a mascot that represents stereotyping and repression. I'm aware the OP asked for comments who support the chief, but I just thought I 'd share my thoughts, and a bit of background for those who feel so strongly.  Interesting comments from someone who has no fucking idea what he is talking about.  The University retiring the chief had everything to do with NCAA post season ban and nothing to do with representing \"stereotyping\" and \"repression\".   The post-season ban is the result of a stereotypical mascot.  Thus, when the university removes said mascot, as a result of pressures by NCAA (who have moral obligations to the Chief), they are retiring a mascot that was much maligned for being a stereotype. My statement stands.  how does it feel to be wrong You should tell me.  I don't understand why the \"Chief\" continues to make appearances at sporting events. Does taking a walk through the horseshoe at MS or a stroll around the C-level concourse at AH really embody the spirit of loyalty, honor, and tradition the Save the Chief people are looking to preserve? I would think it would be better to have a memory of the Chief in his pre-retirement glory than the current marginalized version. But I suppose the crowds will continue to cheer as long as he shows up.  I hate the word \"Mascot\". Bucky Badger is a mascot. Brutus the Buckeye is a mascot. They dance and fire up the crowd and hold signs and mess with the cheer leaders and all that crap. They're a fun tradition of entertainment and a staple of the college football experience. Chief Illiniwek appeared for 1 song, performed the dance, lead the alma mater, and then left. He's a symbol to be revered by students so they strive to be \"the complete man\", one that is physically, intellectually, and spiritually strong... at least that was Zuppke's original intention. The tradition has NOTHING to do with the sport of football aside from being started by a coach. It has NOTHING to do with entertainment and being fun to watch and look at. It has EVERYTHING to do with the spirit and loyalty of the students, alumni, fans, and surrounding community.  The only reason we see him perform at sporting events is because there are no larger gatherings on campus of the aforementioned crowd than for those events. The routine has been altered once for aesthetic reasons since it started. The moves are visually impressive but mostly because the people lucky enough to portray the Chief study and work their asses off to get it completely perfect in order to maintain authenticity. When you see the Chief dance, you're not supposed to be pointing and laughing at the minority while wearing the headdress from shitty kids Indian Halloween costume you thought would be funny to wear drunk to the game. You're not supposed to be squinting and asking yourself \"Is that a white guy dressed up on the field?\". You're not supposed to see him as a current representation of all Native Americans. You're just supposed to be proud to be a Fighting Illini. Washington Redskins - Obviously racist. Cleveland indians, cartoony and politically incorrect. These 2 are among many others who create a disrespectful image of Native Americans. I feel that Chief Illiniwek was unjustly bundled into that group. &gt; He's a symbol to be revered by students so they strive to be \"the complete man\", one that is physically, intellectually, and spiritually strong\n\nThe \"complete man\"'s tribe got decimated by white people ... so not sure he is someone to strive towards, especially by a largely white school. The above statement is hypocritical and makes a mockery of the history of genocide. &gt; He's a symbol to be revered by students so they strive to be \"the complete man\", one that is physically, intellectually, and spiritually strong\n\nThe \"complete man\"'s tribe got decimated by white people ... so not sure he is someone to strive towards, especially by a largely white school. The above statement is hypocritical and makes a mockery of the history of genocide.    The thing that bugs me about this is the non-uniformity of it. If the NCAA and the APA agree that the use of Native American mascots is harmful and creates a \"hostile environment\", why is it that the Florida State Seminoles get to keep their mascot? Hell they even chant \"Scalp-em!\" at their sporting events which is a bit more racist than \"Chiiieeeeeefff.\" Why is that ok, but a mascot who uses traditional dances isn't?   my take on it is that anyone who adamantly argues \"bring back the chief\" is essentially saying \n\n\"it is more important I feel enthused about my school mascot, which can be argued to be institutionalized racism, than it is important that some group of people remain uninsulted.\"\n\nEven if you don't perceive it as racist (which if you don't...ughhhh) some people do. Not only people of native american descent, but people of other nationalities may feel that using a character that represents any ethnicity opens up the notion that one's nationality can be generalized with certain concepts of \"honor\" or \"heritage\" which can be insulting no matter how positive you think they might be. I agree with what you're saying, which is why I'm curious as to why people support the Chief so strongly. Thank you for your input! an example that people might understand the problem with a little bit more clearly.\n\nSuppose a public university were to be called the fighting africans and their mascot was a very tall, lean, black man who was characteristically talented at basketball.\n\nNow someone could argue \"this isn't insulting, we are praising the figure for it's talents\" which on the surface level is conceivably true, but the reality of the matter is that it reinforces stereotypes and imposes an ideology at the expense of a race.\n\nNow i'm sure some will find that example extreme, but the only reason that is, is because the conflict of White/Black relations in America is so drilled into our heads (though not enough if you ask me) that the average person tends to be more aware of what may/may not constitute a racist gesture. When it comes to concerning ourselves with the treatment of Native Americans, we are entirely uneducated. So many people feel comfortable allowing these stereotypes to be reinforced by the character, because they can say to themselves \"well, the demonstration is supposed to be positive, therefore not racist\" but that just isn't the case. an example that people might understand the problem with a little bit more clearly.\n\nSuppose a public university were to be called the fighting africans and their mascot was a very tall, lean, black man who was characteristically talented at basketball.\n\nNow someone could argue \"this isn't insulting, we are praising the figure for it's talents\" which on the surface level is conceivably true, but the reality of the matter is that it reinforces stereotypes and imposes an ideology at the expense of a race.\n\nNow i'm sure some will find that example extreme, but the only reason that is, is because the conflict of White/Black relations in America is so drilled into our heads (though not enough if you ask me) that the average person tends to be more aware of what may/may not constitute a racist gesture. When it comes to concerning ourselves with the treatment of Native Americans, we are entirely uneducated. So many people feel comfortable allowing these stereotypes to be reinforced by the character, because they can say to themselves \"well, the demonstration is supposed to be positive, therefore not racist\" but that just isn't the case. I still don't see how having the chief was racist. He only danced. If we say that it was racist or didn't accurately represent the real tribe, then where do we stop? The Chicago Bears's mascot is a bear (obviously) which is depicted as aggressive and angry, when really bears aren't really like that. So should we start a petition saying this is a bad representation of a bear and it the team needs to change its mascot? Or the Minnesota Vikings. Vikings didn't play football in the past, so why are they a mascot? If we are going to say the chief can't be allowed then EVERY mascot that is misrepresented to any extent shouldn't be allowed. I still don't see how having the chief was racist. He only danced. If we say that it was racist or didn't accurately represent the real tribe, then where do we stop? The Chicago Bears's mascot is a bear (obviously) which is depicted as aggressive and angry, when really bears aren't really like that. So should we start a petition saying this is a bad representation of a bear and it the team needs to change its mascot? Or the Minnesota Vikings. Vikings didn't play football in the past, so why are they a mascot? If we are going to say the chief can't be allowed then EVERY mascot that is misrepresented to any extent shouldn't be allowed. There really, truly is a difference between marginalized groups and privileged ones. I didn't use to believe this, because I grew up being told that everyone was supposed to be treated equally, regardless. But when inequality exists, and treating people \"equally\" ignores that fact, you end up with unequal consequences. Story time!\n\nI spent two years in a rural West African village, serving with the Peace Corps. The hardest part of the whole thing was the way that strangers would treat me. It's hard to explain, but they didn't treat me like a human being. I was a curiosity, or a means to an end. Sure, once people got to know me, everything was fine. I made some deeply meaningful friendships, and met some truly remarkable people. But every morning, before I opened my door, I knew that I would probably meet someone that day who treated me like less than a person, and it was exhausting.\n\nNow, there's a charming (not) custom of yelling \"white person\" at any non-African person you see. It's mostly kids that do it, and they don't mean anything by it. I can tell you, though, that it is universally reviled by the non-Africans living there. It's a big, fat reminder that you're not a person until you prove you are. That you're an Other. Most people, myself included, initially try calling back \"black person,\" hoping people will see how annoying it is. It's incredibly disappointing. Usually, the person will just smile and say \"Yeah! I'm a black person.\" Why would they be offended?  It's like saying \"Hey, you! You have two arms!\" This is a case where treating people equally produces unequal results. When people yelled my race at me, it was annoying because it was emblematic of a larger problem. When I yelled their race back, it didn't have any comparable emotional connection. It was a totally neutral statement. That's what I think of when people equate the Vikings with the Redskins.\n\ntl;dr: Stereotyping visible minorities is not the same as stereotyping a privileged class.  I'm done fighting for the Chief.  If native americans want their only legacy to be alcoholism and casinos, then so be it.   The Chief is respectful as fuck. To my knowledge he was never portrayed  in a negative light. Part of me wishes there was a school somewhere with an Asian mascot that's good at math. Pekin, IL had a high school whose teams were known as the Chinks until 1981. The Chief is respectful as fuck. To my knowledge he was never portrayed  in a negative light. Part of me wishes there was a school somewhere with an Asian mascot that's good at math.  Overcompensating for racism is just as bad as racism itself.  Could you elaborate on that a bit? There doesn't seem to be much racism in the mascot to virtually everyone, but in the name of being politically correct no one gets to enjoy the mascot because there's always those few people that get offended over nothing. From the APA article:\n\n&gt; According to Dr. Stephanie Fryberg, University of Arizona, this appears to have a negative impact on the self-esteem of American Indian children. \"American Indian mascots are harmful not only because they are often negative, but because they remind American Indians of the limited ways in which others see them. This in turn restricts the number of ways American Indians can see themselves.\"\n\nDo you think that their concerns are invalid/overblown? There doesn't seem to be much racism in the mascot to virtually everyone, but in the name of being politically correct no one gets to enjoy the mascot because there's always those few people that get offended over nothing. There doesn't seem to be much racism in the mascot to virtually everyone, but in the name of being politically correct no one gets to enjoy the mascot because there's always those few people that get offended over nothing.  The Chief continues to have an effect on the university even after he was removed.  I've never seen him perform, yet i have strong opinions about this. \n\nMy question is, why does the NFL have a team named the Redskins, yet we can't have a guy dress up and dance?  One is obviously much more offensive. The Chief continues to have an effect on the university even after he was removed.  I've never seen him perform, yet i have strong opinions about this. \n\nMy question is, why does the NFL have a team named the Redskins, yet we can't have a guy dress up and dance?  One is obviously much more offensive.  I can't see why we aren't allowed to have the chief and the NFL can have the Washington Redskins....common now The NFL is not funded by the taxpayer's money, unlike the University.  Very little of the University is still funded by taxpayer money, and none of the DIA is taxpayer money. The university is a public institution regardless and should represent all citizens fairly.  What if more of its residents wish for the mascot to return? Wouldn't that be fair to the majority then? Very little of the University is still funded by taxpayer money, and none of the DIA is taxpayer money. If 30% is very little, then yes, \"very little.\"\nhttp://www.uillinois.edu/our/news/budget/Charts/UofI.financials.jpg\n\nAdding...It's 45% if you combine state+federal. I can't see why we aren't allowed to have the chief and the NFL can have the Washington Redskins....common now i'm pretty sure those of us who don't support the chief also think that a team called the \"Redskins\" is pretty damn offensive.    People think the chief is bad yet some how no one says shit about [this](http://cloudfront.inthecapital.com/files/2013/01/redskins-logo.jpg). Literally the name of the team is a racist term for native americans. \n\nEither ban it all or let it all be. People think the chief is bad yet some how no one says shit about [this](http://cloudfront.inthecapital.com/files/2013/01/redskins-logo.jpg). Literally the name of the team is a racist term for native americans. \n\nEither ban it all or let it all be. It seems like people [are discussing it](http://www.latimes.com/sports/sportsnow/la-sp-sn-redskins-name-change-20130110,0,5050971.story), though.  [deleted] The last was Dan Maloney...",
    "url" : "http://www.reddit.com/r/UIUC/comments/16khrp/no_snark_why_are_people_so_stuck_on_the_chief/"
  }, {
    "id" : 21,
    "title" : "Anyone had/have Joseph Bentsman for ME360?",
    "snippet" : "I'm looking for some advice on how to approach this class. This guy freaked everyone out with quite possibly the worst introduction to a semester I have ever witnessed.\n\nIt's frustrating because I was really looking forward to signal processing as I want to get into controls. Any help?  I'm actually in Toussaint's section and curious. What happened in the other dudes class? Well he comes in and hands out six packets. \n\nThree are horribly formated syllabus stuff, \n\none is a nine page homework assignment, \n\none is a paper titled \"Robust Rejection of Sinusoids in Stable Nonlinearly Perturbed Unmodelled Linear Systems: Theory and Application to Servo\" \n\nand the last packet turns out to be his lecture slides for the day (not that he told us that) titled \"Mold Velocity Profile Distortion Removal in Mold Oscillation System at Nucor Steel Thin Slab Continuous Steel Casters\". \n\nHe doesn't explain any of it. I'm not sure he even said his name or what class it was.\n\nHe launches directly into the slides which are so far above everybody's head it's comical. Then at the end of class says we need to have questions on the homework by Wednesday because that's when the only help session is and the homework is due next week.\n\nTL;DR I should drop this class now. Well he comes in and hands out six packets. \n\nThree are horribly formated syllabus stuff, \n\none is a nine page homework assignment, \n\none is a paper titled \"Robust Rejection of Sinusoids in Stable Nonlinearly Perturbed Unmodelled Linear Systems: Theory and Application to Servo\" \n\nand the last packet turns out to be his lecture slides for the day (not that he told us that) titled \"Mold Velocity Profile Distortion Removal in Mold Oscillation System at Nucor Steel Thin Slab Continuous Steel Casters\". \n\nHe doesn't explain any of it. I'm not sure he even said his name or what class it was.\n\nHe launches directly into the slides which are so far above everybody's head it's comical. Then at the end of class says we need to have questions on the homework by Wednesday because that's when the only help session is and the homework is due next week.\n\nTL;DR I should drop this class now.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16mc6a/anyone_hadhave_joseph_bentsman_for_me360/"
  }, {
    "id" : 22,
    "title" : "Is Wendy's open yet?",
    "snippet" : "I couldn't find it yesterday, but I heard the Wendy's near Green is supposed to open some time in January.   there should be a website called iswendysopenyet.com theere should be a website called lickmynuts.com  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16m4iu/is_wendys_open_yet/"
  }, {
    "id" : 23,
    "title" : "For anyone who has taken CS 242 in the recent semesters, can you recommend a good TA?",
    "snippet" : "I've been hearing that your experience of the class will differ depending on how lax/strict your TA grades, and was wondering if anyone who has taken CS242 in the past few semesters could describe/recommend the TA they had. I'm interested in hearing about the TAs who graded very leniently, causing you to not learn so much, about the TAs who graded very strictly, causing you to learn a ton, and anything in between. Any input would be very much appreciated.\n\nEDIT: Below is a list of the moderators/TAs.\n\n* Ramit Arora\n* Jeffrey Bailey\n* Kevin Banker\n* Devin Bhushan\n* Grzegroz Blaszczuk\n* Max Braun\n* Brendan Caffrey\n* Nicholas Ciaglia\n* Fan Fu\n* Siddharth Gandhi\n* Lavanya Iyer\n* Johnston Jiaa\n* Thomas Johnston\n* William Kennington\n* Le Xu\n* Zitian Liu\n* Eric Mills\n* Snehal Pachigar\n* Chirag Patel\n* Andrew Rachwalski\n* Timur Reziapov\n* Adriaan Schuffelen\n* Samuel Sharps\n* Ng Simeon\n* Michael Sittiq\n* Yerzhan Suleimenov\n* Justin Thorsen\n* Timothy Park\n* Marcell Vazquez-Chanlatte\n* Wei Chan\n* Keith Wiersema\n* Thomas Zhang  I think you're looking at last semester's moderators/TA's. They haven't updated that page yet, but they did update the list on the front page.\n\nModerators for Spring 2013\n\n* Ramit               Aroraarora15@ililnois.edu\n* Jeffrey Bailey\tbailey27@ililnois.edu\n* Kevin Banker\tbanker2@ililnois.edu\n* Devin Bhushan\tbhushan1@ililnois.edu\n* Grzegorz Blaszczuk\tblaszcz2@ililnois.edu\n* Max Braun\tbraun20@ililnois.edu\n* Brendan Caffrey\tcaffrey1@ililnois.edu\n* Nicholas Ciaglia\tciaglia1@ililnois.edu\n* Fan Fu\tfanfu2@ililnois.edu\n* Siddharth Gandhi\tgandhi17@ililnois.edu\n* Lavanya Iyer\tiyer6@ililnois.edu\n* Johnston Jiaa\tjiaa1@ililnois.edu\n* Thomas Johnston\tjohnst26@ililnois.edu\n* William Kennington\tkenning1@ililnois.edu\n* Le Xu\tlexu1@ililnois.edu\n* Zitian Liu\tliu238@ililnois.edu\n* Eric Mills\tmills16@ililnois.edu\n* Snehal Pachigar\tpachiga1@ililnois.edu\n* Chirag Patel\tpatel178@ililnois.edu\n* Andrew Rachwalski\trachwal1@ililnois.edu\n* Timur Reziapov\treziapo1@ililnois.edu\n* Adriaan Schuffelen\tschuffe2@ililnois.edu\n* Samuel Sharps\tsharps2@ililnois.edu\n* Ng Simeon\tsimeon2@ililnois.edu\n* Michael Sittig\tsittig2@ililnois.edu\n* Yerzhan Suleimenov\tsuleime1@ililnois.edu\n* Justin Thorsen\tthorsen1@ililnois.edu\n* Timothy Park\ttspark2@ililnois.edu\n* Marcell Vazquez-Chanlatte\tvazque16@ililnois.edu\n* Wei Chen\tweichen7@ililnois.edu\n* Keith Wiersema\twiersem1@ililnois.edu\n* Thomas Zhang\tzhang156@ililnois.edu I think you're looking at last semester's moderators/TA's. They haven't updated that page yet, but they did update the list on the front page.\n\nModerators for Spring 2013\n\n* Ramit               Aroraarora15@ililnois.edu\n* Jeffrey Bailey\tbailey27@ililnois.edu\n* Kevin Banker\tbanker2@ililnois.edu\n* Devin Bhushan\tbhushan1@ililnois.edu\n* Grzegorz Blaszczuk\tblaszcz2@ililnois.edu\n* Max Braun\tbraun20@ililnois.edu\n* Brendan Caffrey\tcaffrey1@ililnois.edu\n* Nicholas Ciaglia\tciaglia1@ililnois.edu\n* Fan Fu\tfanfu2@ililnois.edu\n* Siddharth Gandhi\tgandhi17@ililnois.edu\n* Lavanya Iyer\tiyer6@ililnois.edu\n* Johnston Jiaa\tjiaa1@ililnois.edu\n* Thomas Johnston\tjohnst26@ililnois.edu\n* William Kennington\tkenning1@ililnois.edu\n* Le Xu\tlexu1@ililnois.edu\n* Zitian Liu\tliu238@ililnois.edu\n* Eric Mills\tmills16@ililnois.edu\n* Snehal Pachigar\tpachiga1@ililnois.edu\n* Chirag Patel\tpatel178@ililnois.edu\n* Andrew Rachwalski\trachwal1@ililnois.edu\n* Timur Reziapov\treziapo1@ililnois.edu\n* Adriaan Schuffelen\tschuffe2@ililnois.edu\n* Samuel Sharps\tsharps2@ililnois.edu\n* Ng Simeon\tsimeon2@ililnois.edu\n* Michael Sittig\tsittig2@ililnois.edu\n* Yerzhan Suleimenov\tsuleime1@ililnois.edu\n* Justin Thorsen\tthorsen1@ililnois.edu\n* Timothy Park\ttspark2@ililnois.edu\n* Marcell Vazquez-Chanlatte\tvazque16@ililnois.edu\n* Wei Chen\tweichen7@ililnois.edu\n* Keith Wiersema\twiersem1@ililnois.edu\n* Thomas Zhang\tzhang156@ililnois.edu Oh wow, I didn't realize this, I'll edit my post again. Thanks!  I think that you're strongly overestimating the correlation between grading leniency and good TA'ing. I think that you're strongly overestimating the correlation between grading leniency and good TA'ing.  Would help if you gave the list of TAs available. Most of us probably only know the TAs who are our friends - not necessarily all of the mods.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16lg9p/for_anyone_who_has_taken_cs_242_in_the_recent/"
  }, {
    "id" : 24,
    "title" : "Math 415 with Rinat Kedem",
    "snippet" : "On ratemyprofessors.com, she is given overall 1.4 and an easiness of 2. I am decent in math and I can self study, but would I then be fine in her class? Are her tests same difficulty as other teachers' tests? Any input on her would be very useful. Thanks in advance.  be prepared to self study for any 415 section all the teachers suck\n Thank god for [Paul's Notes](http://tutorial.math.lamar.edu/Classes/LinAlg/LinAlg.aspx)     crap I didnt look at ratemyprofessors.com when i registered now im stuck with her....  Could not learn anything in class from her, a position shared by several other people in the class.  I pretty much self studied in math 241 and did good, would I be able to do that in this class, or should i just constantly look at the add/drop page to get another teacher? If you can take the time to self study then you should be alright. As long as you were willing to put the time into it. I admit I did not put as much effort into it, partly because of the teacher, partly because it was an 8am, but I was just not motivated to learn like in my other classes.     These lecture videos saved me\nhttp://www.youtube.com/course?list=ECE7DDD91010BC51F8",
    "url" : "http://www.reddit.com/r/UIUC/comments/16l5k8/math_415_with_rinat_kedem/"
  }, {
    "id" : 25,
    "title" : "AMA- Online Relationship (I.e Catfish)",
    "snippet" : "Hey everyone,\n\nI was wondering if anyone had experience in a solely online romantic relationship such as in the documentary Catfish (http://www.imdb.com/title/tt1584016/) that they would be willing to share and possibly be interviewed about. \nEssentially, I am looking for someone who has met another person online and has a relationship with them that has not involved skype of other live interaction. \nAny insight into your experiences and opinions on this issue are appreciated. Thanks in advance for any help you can give.  I've had a few friends that have met partners in chatrooms- but all have gone to programs like skype or phone calls before they even thought of dating. :/   That sounds more like penpals.   I had two relationships that were purely online. No skype but there were pictures and phone calls. Each lasted about a year (non-concurrent).\n\nBoth were romantic in nature and started in World of Warcraft.\n\nBoth of the relationships ended because of lies. I don't want to be interviewed about it. Posting this on a throwaway so you know someone is out there that fits your criteria.",
    "url" : "http://www.reddit.com/r/UIUC/comments/16lq3u/ama_online_relationship_ie_catfish/"
  }, {
    "id" : 26,
    "title" : "What is tmobile cell coverage like on campus?",
    "snippet" : "   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16luhl/what_is_tmobile_cell_coverage_like_on_campus/"
  }, {
    "id" : 27,
    "title" : "Anyone going back to the Chicago 'burbs this weekend?",
    "snippet" : "The buses seem overbooked (I can't sign up for them) so my Mom and I will be driving back and forth, in the Naperville area. If you want to trade rides, (us on the way up, you on the way down?) or if you want to hitch for a little moolah (20$ per trip [not round]?), gimme a shout! :D\n\nLooking for something on the 18th and 21st  I'm interested, but I'm going towards the Palatine area. I understand if it's out of your way. Whoa, they just opened up again!\n\nhttps://www.busline.com/\n\nI can't get a return trip though, maybe they'll open up later. If they don't, I'll be driving. If you're in the burbs and need a lift then, feel free to reply!",
    "url" : "http://www.reddit.com/r/UIUC/comments/16ldtr/anyone_going_back_to_the_chicago_burbs_this/"
  }, {
    "id" : 28,
    "title" : ".edu email troubles...help?",
    "snippet" : "Has anyone on here been able to sync their iCal to their Google email calendar? I can't figure out how to do it.  I had to resort to setting up an exchange account on my iPad to get my calendars to sync properly. Google has a good set of instructions. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16k4zy/edu_email_troubleshelp/"
  }, {
    "id" : 29,
    "title" : "Anyone driving to/around ISU this weekend?",
    "snippet" : "I would appreciate a ride, and you will appreciate the gas money.  Just saying ISU isn't very specific. Illinois State, Indiana State, or Iowa State? I think it's pretty safe to assume someone at U of I (University of Illinois, not University of Iowa, to clear up any confusion) when referring to \"ISU\" probably means Illinois State.",
    "url" : "http://www.reddit.com/r/UIUC/comments/16kuvl/anyone_driving_toaround_isu_this_weekend/"
  }, {
    "id" : 30,
    "title" : "Terrible apartment stories? (Gabe's Place)",
    "snippet" : "This is my second post ever on reddit and I wanted to rant. I have had a terrible time in Gabe's Place for the last three years. I just wanted to see if anyone else had any other horror stories to make me feel a little better. Here is the abridged version of my current problems. \n\nMy 3 room mates and I lived in the same apartment for 3 years. It was owned by this company called Gabes Place. Last summer 2012, Gabes Place was disbanded by the court for some sort of money scandal and was taken over by this company from South Carolina called Preiss MGMT. Preiss people came to U of I and opened up a parent company here under the name of University Village. University Village owns Gabes Place (they kept the name) as well as this other company called Sleep UofI. So there are basically 4 different companies under the parent name of Preiss. And they all don't communicate with each other. They also lost all of our paperwork and records. We have had to go to the bank multiple times to give them records that we paid the rent. Sometimes they will attempt to evict us or bill us by just placing a note on the door (with our bank account info) and when we call to figure things out, they just claim there is \"a system error\" or make us go back to the bank for records. This has happened multiple times within the last six months. They also changed our locks twice this summer without notice. They locked me and my room mates out without notice, we couldn't get into our apt for a day... they changed the locks at 10am when we were all out... and their office was closed until 3pm the next day. That was a good day...... And every time we call to figure things out, they are always saying we are missing payments (false) security deposits (false) or last months rent (false). And when you call the Gabes Place number, they say \"oh University Village has this info.. call them\" and when you call UV, they say \"oh Gabes Place has this info...\" and no one gets back to you. The only person who seemed competent was this woman named Megan, and she just recently left the job. My room mates and I all moved out to begin student teaching this week and they emailed us saying we are going to be evicted this week. We don't even live there anymore! \n\nOur lease also said we were to live there until December 2012. They have records of us living there until July 2013. Even when we send over the documents, it seems as if they cannot process it and completely ignore them and continue to use their \"system.\" \n\nI also had a squirrel living in my ceiling for two months that dug a hole through my ceiling above my bed. They refused to come out to fix it for the longest time. Doubtful I'll be getting any sort of security deposit back it seems...\n\nHopefully none of you had to go through such a cruddy experience, but I would like to know if anyone else had any problems with Gabe's Place or anywhere else. I hope I am not alone with this mess!  FUCK PRIESS COMPANY aka Gabes Place, UV Village, SleepUofI. I live there now and these chumps wouldnt fix the heat even when the city inspector came. They made us switch units to a shittier one for the same rent. I talked to their \"Regional Manager\" from Texas at their office and she told me to fuck off and that they can do whatever they want since I signed a lease. They also pulled the you didnt pay rent shit to me once.\n\nAccording to student legal services the buildings have been foreclosed upon. The original owner (Gabe) committed suicide after taking out massive loans with the properties as collateral. \n\nAccording to them they are running the properties for the bank and are not interested in any long term investment. They dont give any fucks. The office is run by kids. Half the windows on the first floor were broken and they didnt fix them for months. Also, have the units are empty.  Every time I attempt to go into the Gabe's Place office, there is some young sophomore undergrad working there. They have no clue, and there are boxes and just random papers lying about. I've been to the office on Moorland too. It is continuously a mess.\n\nWhat did you end up doing when they said you didn't pay the rent? They actually had a glitch when we switched units, they figured it out.\n\n The only person Ive met thats competent is the maintenance guy. Hes a decent dude. Ive talked to him and he says that they basically dont give him a budget to fix stuff. Hes also the only one for all of Gabes Place. Some girl also had her unit flood and they refused to fix it and it molded over. They also made her move into a different unit.\n\nBut yeah I went through a load of shit to get heat. Over 6 weeks of calling, going to the office, and taking every avenue possible and they didnt fix anything. Let me know if you get your deposit back. I have a gut feeling non of us are. They actually had a glitch when we switched units, they figured it out.\n\n The only person Ive met thats competent is the maintenance guy. Hes a decent dude. Ive talked to him and he says that they basically dont give him a budget to fix stuff. Hes also the only one for all of Gabes Place. Some girl also had her unit flood and they refused to fix it and it molded over. They also made her move into a different unit.\n\nBut yeah I went through a load of shit to get heat. Over 6 weeks of calling, going to the office, and taking every avenue possible and they didnt fix anything. Let me know if you get your deposit back. I have a gut feeling non of us are.    As you said, it isn't really Gabe's anymore.  If you have a the time to document every little communication you might chat with a lawyer or try small claims court when they try to stiff you.  I would also make sure these issues are documented at the tenant's union.  Gabe's Place was horrible when I was there and sounds worse now. Avoid at all costs.  I think I might be the only person who had a good experience renting from Gabe's place. I lived there when Gabe was still alive though and never had any major maintenance issues. They did a bunch of roof repairs once and drilled holes in my ceiling. I woke up to banging and plaster falling on my face and could see sunlight. They did fix that after I bitched. They also couldn't figure out a way to get my couch down the stairs and threw it off a balcony. I guess my standards were a bit low as a first time renter.   Contact the tenant unit, report them to the better business bureau, and/or [take them to small claims court](http://ohmyapt.apartmentratings.com/how-to-take-your-landlord-to-small-claims-court-for-violating-the-rental-agreement.html)\n\nmy apartment from university group was pretty bad...\n\n* the place was disgusting when i moved in.\n* during the winter i had to choose between the extremely expensive and inefficient heating in the apartment or huddling next to a space heater. some nights i couldnt sleep there because it was so cold.\n* there was a hole in the wall.. from my apartment i could see to the outside. i stuffed plastic bags into it until maintenance fixed it\n* for a year and half my ceiling dripped on and off. theyd come and fix it sometimes but it was always a problem. it was so bad that the back door rotted and had to be replaced. (luckily they replaced it, but then that one started rotting too.)\n* they tried to take half of my deposit for bullshit reasons, but i called and said they had to return my deposit because the lease said they couldn't keep it past 30 days. they called their lawyer and offered me part of it back. keep an eye on this, it might help.\n\nthey were no gabes place, but man i'm glad to be out of there...\n\nps. maybe you can ask for a receipt if you physically go in to drop off your rent check? That is awesome advice! Sorry your living situation was so crappy. \n\nWhat company were you renting from? And was this 30 day deposit clause in the lease? I definitely have to check that out. They said something about 45 days I'll get my deposit back or something... but I am not sure if that was just a random person making that up at the front desk. No one seems to know anything and everyone is so young/clueless.  Gabe's Place IS THE DEVIL. One time I rented there and one of the maintenance men actually shit on my pillow when I was in class and when I called the office to complain I got told to fuck off. Safe to say I never rented from those goons again.  Gabe's Place IS THE DEVIL. One time I rented there and one of the maintenance men actually shit on my pillow when I was in class and when I called the office to complain I got told to fuck off. Safe to say I never rented from those goons again.   Do you live in Urbana?\n\nThe tenant protection laws are strong and good.    Can't you get an image of the check online from your bank and e-mail that to them? Would save you the trip to the bank and then to them to drop it off.\n\nRamshaw did this to me once too (losing my rent mysteriously), but an e-mail cleared things up. I am worried about Gabes Place. We have tried the email thing as well as actually going into the bank. They are continually contacting me and my room mates about the missing money, security deposits, last months rent, and other balance issues. This has happened probably about five times now.\n\nDo you have any suggestions on how to clear this mess up? I'm glad it worked out for you at Ramshw.. hmm not really anything beyond the normal. When you e-mail them the check ask for confirmation it was received, if not call them the next day to check if it got to the right person. My guess is they're just disorganized and the person who says the money is missing didn't get the image (or lost it if they're a little incompetent). \n\nEach time I send an e-mail to them I would include the record of what happened in the past. Something like:\n\n1. March's rent was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\n2. May's rent was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\n3. Security Deposit was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\nYou're probably reaching a different person each time so they don't know the severity of the problem. Or maintain the e-mail chains from before. hmm not really anything beyond the normal. When you e-mail them the check ask for confirmation it was received, if not call them the next day to check if it got to the right person. My guess is they're just disorganized and the person who says the money is missing didn't get the image (or lost it if they're a little incompetent). \n\nEach time I send an e-mail to them I would include the record of what happened in the past. Something like:\n\n1. March's rent was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\n2. May's rent was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\n3. Security Deposit was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\nYou're probably reaching a different person each time so they don't know the severity of the problem. Or maintain the e-mail chains from before. hmm not really anything beyond the normal. When you e-mail them the check ask for confirmation it was received, if not call them the next day to check if it got to the right person. My guess is they're just disorganized and the person who says the money is missing didn't get the image (or lost it if they're a little incompetent). \n\nEach time I send an e-mail to them I would include the record of what happened in the past. Something like:\n\n1. March's rent was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\n2. May's rent was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\n3. Security Deposit was lost and I had to get a copy of the (on-time) cashed check from the bank.\n\nYou're probably reaching a different person each time so they don't know the severity of the problem. Or maintain the e-mail chains from before.        WHY would you live there for three years?!  [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/16iq5j/terrible_apartment_stories_gabes_place/"
  }, {
    "id" : 31,
    "title" : "Yet again the course registration website tricks me out of a seat in a course I need.",
    "snippet" : "So I was trying to jump from one section of Stat 420 to the other.  It looks (even still) like there are open seats in the section I want to register for.  But sure enough, I dropped my seat in the section I was in, tried to register for the other one, and I get some error I don't understand.  Now, I can't register for the class at all, and it's required for me.  I just can't figure out why it won't let me in.\n\nWill emailing the statistics department do any good here?\n\nEDIT: Phew, after a few days of stress, got my old seat back.  Now to get on the bookstore for not having my book order ready...LOL  The stat department set up Reserved Seats in Stat 420. It's complicated to set up and the class schedule software isn't smart enough to see it so even on http://courses.illinois.edu, it displays as Open. In fact, it's difficult for most university officials to see it! If you are talking to almost anyone, they will think the class is open.\n\nI would not email the stat department. I would walk in to the stat department in Illini Hall and explain how you were screwed, then just ask for your old seat back. Point out (calmly) that you were in a class and it told you there were seats open, and there is nothing posted on the class schedule telling you that the seats were reserved. **Do not** passive-aggressively suggest that they post it to the class schedule when they do crazy stuff like this. That's for me to do. :) This.  Thanks a bunch, this response is great!  I've already emailed someone from the stats dept., and he got right back to me and said they'd look into it and get back to me soon, so I think I'll give them a day or so to do so.  If I don't get a good response by then, I'll try what you suggested, and see what that does for me.  But seeing as this class is literally required for me to graduate, I should hope that I'll be able to get back in. Well, I sent the passive-aggressive email either way. :) Haha, thank you!\n\nEDIT:  So I stopped by the stat office this afternoon and was told that the seats are reserved for new stats majors this semester, and that they don't make any exceptions to that.  Basically, they just said to wait until the restriction is lifted and hope that there are still seats left.\n\nGreat. Did they say when it would be lifted, or how you can see when it is lifted? The woman I spoke with would only say to keep trying, and that it would be lifted once the new students have finished registering (which is currently happening now, apparently.)\n\nAlso, I haven't heard back from the gentleman that I emailed, so maybe that will get something accomplished.  I really don't know. Good luck! The stat department set up Reserved Seats in Stat 420. It's complicated to set up and the class schedule software isn't smart enough to see it so even on http://courses.illinois.edu, it displays as Open. In fact, it's difficult for most university officials to see it! If you are talking to almost anyone, they will think the class is open.\n\nI would not email the stat department. I would walk in to the stat department in Illini Hall and explain how you were screwed, then just ask for your old seat back. Point out (calmly) that you were in a class and it told you there were seats open, and there is nothing posted on the class schedule telling you that the seats were reserved. **Do not** passive-aggressively suggest that they post it to the class schedule when they do crazy stuff like this. That's for me to do. :) Chris is the best!   Sections D1G and N1G are 4 credit hours for grad students, so if you tried to register for one of those as an undergrad your standing would probably prohibit it.  What's the error that you see? They can be a little hard to understand but i've never had trouble figuring it out. He'll see \"Closed Section -X\" if I understand what is happening, and ... that is a nonsense error in this specific situation. :) Nailed it almost exactly...the error I'm seeing is \"Reserve Closed -X\" Oh! That's not terrible. It's just... bad. What?   I think this same thing happened to my friend with CS 225. She wanted to pick up another class but had to move her discussion in order to do so. But she had to drop the lecture and the discussion and then got blocked from registering for both. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16jahk/yet_again_the_course_registration_website_tricks/"
  }, {
    "id" : 32,
    "title" : "Quick question about dermatologists at McKinley.",
    "snippet" : "Are there any dermatologists at McKinley?  If so, how would I get in contact with them or even find them for that matter?  Thanks a ton!  I've been going to see a dermatologist in the area for several years (not at McKinley) who is fantastic: [Dr. Lester Fahrner](http://www.christieclinic.com/primary-care-and-specialties/doctor/107/fahrner-lester-j/) at Christie Clinic. He's been practicing for 34 years, and also teaches in the College of Medicine. I had horrible cystic acne for a long time, saw several different dermatologists beginning at age 14, and only after seeing Dr. Fahrner did it clear up. If you have acne scars, he can also help with that (though since mine were quite extensive, he sent me to a specialist in Indianapolis). Good luck! I know how horrible cystic acne can be, but it'll get better eventually!  Yes, if you are a male this might seem strange to you but I saw three different people there and Kim Smith in the women's health clinic was far and away the best for skin in McKinley. Otherwise I started out with my general practitioner that was assigned to students based on your last name, so depending on who your gp is ymmv as far as how verse they are in treating skin conditions.   I did research on this last semester when I needed a prescription and found that there aren't any legit dermatologists at McKinley (unless I'm mistaken).\n\nI also contacted the private dermatologists in the area because at that point I just needed one appointment with anyone who could prescribe my next batch, and literally all of them told me they weren't taking new patients (said something about there being a shortage of dermatologists here or something). I legit had to give up and just go to my dermatologist back home. Hmm.  Okay.  Well, I guess I'll just have to go to a dermatologist back home during spring break.  Thanks for the help. Hmm.  Okay.  Well, I guess I'll just have to go to a dermatologist back home during spring break.  Thanks for the help. I have cystic acne and did not go on accutane.  I apply two topical gels on my face (adapalene and clindamycin) every night, and it's cleared up my cystic acne like magic!",
    "url" : "http://www.reddit.com/r/UIUC/comments/16j0pg/quick_question_about_dermatologists_at_mckinley/"
  }, {
    "id" : 33,
    "title" : "Are you Going back to champaign tonight?",
    "snippet" : "I'm at midway and can pay for your gas if you take me there.  Im in chicago, where are you located?",
    "url" : "http://www.reddit.com/r/UIUC/comments/16izen/are_you_going_back_to_champaign_tonight/"
  }, {
    "id" : 34,
    "title" : "failed a james scholar add on... what to do?",
    "snippet" : "Last semester I registered for CS241 and it's corresponding honors section. Midway through the semester I dropped 241 but forgot to drop the 1 credit hour honors add on. My final grades show a failing grade on the add on, and it's destroying my semester GPA. Technically, you cannot enroll in an add on for a class if you are not enrolled in the actual class. Is there anything I can do about this? Thanks!  you could try asking your advisor you could try asking your advisor Top comment in every \"omfg i need academic/financial advise pls halp\" thread in r/UIUC, every damn time.\n\nAdvisors advise, real hard concept.\n\nI don't understand why these posters don't go to the people who literally get paid to help them. this is reddit, human interaction must be avoided at all costs    Ask Herzog. Herzog knows all.  You're screwed.  Theres nothing you can do now.",
    "url" : "http://www.reddit.com/r/UIUC/comments/16jgzz/failed_a_james_scholar_add_on_what_to_do/"
  }, {
    "id" : 35,
    "title" : "Question about theft in Champaign-Urbana",
    "snippet" : "As we know, there's a fair amount of crime in the campus community.  Usually it's armed robbery of some sort.\n\n\n\nMy question is, why don't houses/apartments get wildly broken into over Holiday breaks?  There are so many decrepit houses around town with obviously no security systems.  One solid kick to a backdoor would get a criminal in the house, and he'd probably come out with a flatscreen TV or two, maybe a few gaming systems, a guitar, several printers, whatever.  Campus is relatively dead for three weeks, ya know?\n\n\n\nObviously I'm not condoning it or recommending it.  I just want to know why it doesn't (knock on wood, I'm not back yet!) seem to happen.\n\n\nEdit: I'm sorry to all who have been robbed over breaks.  Thanks for sharing your stories - I guess it happens more than one may realize in any city, not just Champaign.   My apartment was robbed over thanksgiving break  My apartment was robbed over thanksgiving break   I've known two people who had their places broken in to and two who were mugged on campus.  By comparison, in my nice, rich, upscale suburb, I've had my house broken in to and know three people who have been mugged.\n\nCrime really *isn't* a problem on campus.  It's not that bad.  But when you're living in Naperville, Skokie, Elgin, Schaumburg, etc, you don't get emails when someone is robbed at gunpoint.  You only think it's bad because you hear about it 1000x more than you do back in your suburb. Really? Suscribe to every block in the CITY and deal with all the robberies mugging and rape. There is a lot more than suburanites see going on. WhileI was at school people were getting shot around the corner fron my house.    Casing a place to figure out it is empty, then searching a place for valuables, then selling the valuables requires a lot of planning and calm deliberation.\n\nWandering around armed and angry until you finally snap at some kid, who looks like they have it made, to take their cash, requires no planning or calm deliberation. &gt; Wandering around armed and angry until you finally snap at some kid\n\nWhy do you think anger is a prerequisite? I think they rob because they want money, not because they are generally angry.   I had my place robbed on Christmas day.  Luckily a roommate was home, the robber only got my xbox and a 12 pack of Rolling Rock.  My roommate called the police and they brought the k-9 unit.  The k-9 unit was able to track the thief to his place and the police arrested him.  Still took over a fucking year to get my Xbox back since it was evidence.  lots of places get robbed during breaks actually. The reporting is kept to a minimum, either people don't report or it's not widely known. There's a lot of bad stuff that happens on campus actually...some of it is swept under the rug...bad publicity for the university... Go on My roommate was assaulted by five kids at fifth and green with a knock to the back of the head. Luckily the cops were there to witness it and immediately chased the kids away so he wasn't robbed. You would imagine a through report would be taken, but the officer did not even take my roommate's name or anything. I even asked the officer for his name and he said something along the lines of, \"Do you want me to stand here talking to you or do you want me to catch these guys.\" There were other police already on the scene so I wasn't buying the excuse. The next  day we followed up with the police department and there was no record of the event. We tried filing a report over the phone but were told that we could not until the night shift was back on duty. A police report was finally filled when I took my roommate to the hospital to check out his concussion. Shit like this use to be prime crime alert fodder. This led me to believe that these types of crimes were still happening and it pissed me off that the campus community is not aware.  Was your roommate assaulted recently? lots of places get robbed during breaks actually. The reporting is kept to a minimum, either people don't report or it's not widely known. There's a lot of bad stuff that happens on campus actually...some of it is swept under the rug...bad publicity for the university...       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16hcki/question_about_theft_in_champaignurbana/"
  }, {
    "id" : 36,
    "title" : "Waitlist for registration",
    "snippet" : "A prof told me I'm on the \"unofficial waitlist\" for a course. What does this mean and how does this work?  I assume that it means when people drop the course he'll allow them in based on the order of that waitlist.\n\nUsually, a decent number of people drop any given class in the first two weeks of the semester. Yeah, that's what I thought...what does it mean to \"allow\" though, since Enterprise is open to everyone? If I understand correctly, the professor could 'close' the course preventing open registrations. They can then 'override' the system and add students. Ah...that's cool...Thanks! Technically, AFAIK, a professor can add students to a course in any situation that they want. I've often gotten into closed courses by asking nicely. That's why you see courses with -1 or -2 remaining slots - someone has overbooked them.\n\nOf course, if the room is physically full or there is a lot of work grading, it's more than understandable if the professor declines to overbook a class.\n\nAlso, I had a class once where you were required to do the homework if waiting to get in - and people were accepted in order of decreasing homework average! It made me laugh. One more detail -- different departments handle this differently. In my department, we don't let the professors make any decisions about who is in their classes. I think smaller departments are more likely to allow professors to do their overrides themselves. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16ikyi/waitlist_for_registration/"
  }, {
    "id" : 37,
    "title" : "Looking to get involved in clubs/organizations this semester. What groups are you in, r/uiuc?",
    "snippet" : "   Illini Pole Fitness--pole fitness and dance instruction for men and women at UIUC Will this be a resume booster when I try to become a stripper one day? We don't teach stripping, so probably not. But you do teach how to work that pole, right? I suppose you would say that what we do is more of a form of acrobatics. Many professional pole-ers were formerly employed by Cirque du Soleil and similar acts. But, like any form of dance, it can really be whatever the dancer decides to choreograph and perform--whether sensual, dramatic, energetic, athletic, or yes, sexy. Here are a few vids you might want to check out: (skip to 1:00 for this first one) http://www.youtube.com/watch?v=ICMBYCS7sLs ; http://www.youtube.com/watch?v=4EMQEsxnuGo ; http://www.youtube.com/watch?v=MhgPc0GaF-E  Illini EMS, we're exactly what we sound like, Emergency Medical Services. We'll train you to get CPR certified, or even up to an EMT-Basic. Plus you get to volunteer to work things like football games, volleyball, Krannert events, and hockey games.  Also, most of the events you can volunteer for give you some sort of free food, which is freaking awesome. How can I do this? I have CPR and want emt  How can I do this? I have CPR and want emt  Illini EMS, we're exactly what we sound like, Emergency Medical Services. We'll train you to get CPR certified, or even up to an EMT-Basic. Plus you get to volunteer to work things like football games, volleyball, Krannert events, and hockey games.  Also, most of the events you can volunteer for give you some sort of free food, which is freaking awesome. Illini EMS, we're exactly what we sound like, Emergency Medical Services. We'll train you to get CPR certified, or even up to an EMT-Basic. Plus you get to volunteer to work things like football games, volleyball, Krannert events, and hockey games.  Also, most of the events you can volunteer for give you some sort of free food, which is freaking awesome. I have severely lapsed certs, are there remedials?  Also... I hate to sound like a cheapskate, but is it on our dime?   Yeah you have to pay for the classes, and we can guide you through the recert process. How much are they    Treasurer of DDRIllini. We play rhythm games and stuff. And a tournament with stuff like this: https://www.youtube.com/watch?v=oQTzrWp9yoc&amp;list=UUO1rxG0A2he3jf1zSKEdVYQ&amp;index=16\n\nWe basically just sit around the Rec Room and play. \n\nAlso in Taekwondo @ UIUC. We're an ITF club, and meet Mondays and Wednesdays 5:30-7 in ARC's combat room. Wear something comfortable but be warned the warmups can be pretty daunting for new students.   Illinois Congressional Debate Society\n\nWe want YOU. \n\nReally, please join us, the few of us are lonely! :'(\n\n(but seriously, we need more members. Just started up last spring and really want to grow to a stable point by the end of this year!) all right ill bite what do u guys usually do Weekly meetings at which we work on skills in impromptu public speaking in a debate setting. Debate centers around student-written bills and resolutions. It is done in a format of alternating \"pro\" and \"con\" speeches. We follow parliamentary procedures as it is, essentially, a mock-congress.\n\nWe compete at three tournaments per year. Our next one is at the University of Chicago next month, the third is here in the Spring.\n\nI say we are lonely because there are like 5 of us that actually show up to meetings and we are really, REALLY needing to grow. So the downvotes are kind of depressing. What would you say the male/female ratio is at these tournaments?     Illini Wushu- Traditional and Modern Chinese Martial arts. We perform for many Asian RSOs like AAA and PSA. Heck, this Thursday, we're going to be performing at halftime for the Men's basketball game against Northwestern, iirc. \n\nI'm also part of Illini Formula Electric, where the goal is to build a fully electric racecar with a team. And we're not just talking about some low-end remote control car. This is a full sized electric F-1 style car (albeit smaller). We're split into separate subsystems, so it isn't hard to find a group specializing in something you're interested in, from designing and construction to advertising and website building. Really wanted to learn some Wushu forms and such. Is it possible to join you guys midway through or should I wait till next year? You can join any time, really. Especially after Thursday, our next show. If you're interested you can still join, just talk to the club president, Mel.   Tricking Club. It's fun regardless of skill level and friendly towards beginners.  [ACM](http://acm.uiuc.edu) if you're CS (or even have an interest in CS/ECE/etc.) What projects does ACM do? ACM has a few sub-groups within it, like SigBOT, SigMUSIC, etc. that do most of the projects (the full list of special interest groups is [here](http://www.acm.uiuc.edu/sigs/)).  Some past projects include Tacchi (touch-driven display), Caffeine (ACM's soda machine), and a host of games that get shown off for EOH.\n\nWe'll be having an open house on January 24th (7p, Siebel 1404) if you'd like to hear from each SIG and get a better feel for the people and running projects we have.  MCB major here. Interested to see replies MCB major here. Interested to see replies MCB major here. Interested to see replies  I'm in ACM as well as I-Invent. Both are great clubs. I might check i-invent out, when/where does it meet? I was unable to find much about it online.   Stress Management Peers\n\nPeer group through McKinley that hosts workshops involved in managing stress as well as time management.  We also campus wide events and give out stress relief packs during finals week. I've had some friends of friends who were members. What do you guys do or discuss? Are you guys a small club?              [Japanese Animation Club](http://uiucjac.org/), for all your weeaboo needs. (But seriously we're cool and want more people.) We do showings every Saturday afternoon in Siebel Center and generally hang out and be nerds.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16hauy/looking_to_get_involved_in_clubsorganizations/"
  }, {
    "id" : 38,
    "title" : "9 Textbook Buying Tips Every Illini Should Know",
    "snippet" : "As the semester starts I'm sure many of you are wondering how you can get books without forking over a fortune for texts. Here are a few tips to save you some dough I've learned over the past 3.5 years as a student from a low-income family:\n\n* 1) All instructors are required to make texts available on reserve (usually at the main stacks or ugl). If the instructor is giving you a BS \"invest in your education\" response or is resisting to do so in any way explain how not putting the book on reserve (either in a library or on e-reserves) is an act of discrimination against low income students. **Be polite in emails** and go above your professor only if they refuse to put something on reserve.\n\n* 2) Use our library system! There are usually a few copies of smaller books/novels in one of the over 20 libraries on campus. Check early before the semester starts and you can renew a book up to 4 times (that's 14 weeks).\n\n* 3) Use the I-SHARE system (http://vufind.carli.illinois.edu/all/vf/). You can use your UIUC Library account to access this. Basically how this works is you search a database of university libraries in Illinois for books you need. If you find it, and you usually will, you can request the book to be sent to UIUC's main stacks where you can check it out. You can renew up to 4 times with these books as well.\n\n* 4) Help yourself and other Illini by using the Illini Book Exchange (http://www.illinibookexchange.com/splash.php5). Here you can buy and sell used texts (this is especially nice for harder to find math/science/engineering texts).\n\n* 5) Rent you texts! You can do this at one of the local greedy textbook shops or online through various websites (Amazon, Chegg, etc..). Shop around for the cheapest rate for a semester.\n\n* 6) If you absolutely need to buy a text, don't go to Follets, TIS, or the Union Bookstore unless you can't find cheaper options online. These stores are convenient but are almost always incredibly expensive.\n\n* 7) Buy or rent older editions of textbooks. Many professors write the books for their classes and require students to buy the most up to date edition. 9 out of 10 times these new editions are just scams to get more money. Most professors will be honest when you ask if an older edition is okay, so be sure to ask. If they say you need the newest edition (usually a response if they wrote the book), ask exactly why. Chances are the old one will work just fine.\n\n* 8) Share texts with friends. If you need to buy an expensive text, share the financial burden with someone else! A $150 text isn't as daunting when you split it with a friend. Just be sure to create a fair plan for who uses the book when (this can lead to conflict near exam time).\n\n* 9) Thank your professors/TA's who make every effort to get texts on reserves and help you find the cheapest option. It is always refreshing to meet a university instructor who actually cares about you as a student.\n\n* Hope these help! Please comment with any additional tips. \n  10) PDFs. And if you can't find them, make your own!  The IUB has a pretty generous return period (this semester, it should be Jan 26), I have a scanner that I made myself that I use.  I can do roughly two textbooks an hour.   Just a disclaimer, this is almost always a violation of copyright law, even if you're not sharing it with anyone else. Am well aware.  But thanks!  \n\nEdit:  Whoever downvoted jmurphy42 needs to learn reddiquette.  Just because you disagree with copyright laws doesn't mean you should take it out on him, nor that you should hide the information presented.  If anything, you're making it worse for everyone.   And if you can't find them, make your own!  The IUB has a pretty generous return period (this semester, it should be Jan 26), I have a scanner that I made myself that I use.  I can do roughly two textbooks an hour.   You made a book scanner? I would love to be able to use one of them for a little bit just to get all my books on my Nexus.\n\nOn a side note, isn't there a library or building at UIUC that has one? And if you can't find them, make your own!  The IUB has a pretty generous return period (this semester, it should be Jan 26), I have a scanner that I made myself that I use.  I can do roughly two textbooks an hour.   I would love to know how you did this.  I would love to know how you did this.  10) PDFs.   Its simple: there's a torrent for everything. You just gotta find it. I've been able to torrent 90% of my books for ECE  What site do you go to? What site do you go to?  http://www.abebooks.com is also a good site for international editions. Abe Books is great for international editions. Same book for about 90% less cost.       I'm going to take issue with #3.  You say \"you usually will\" find the book in I-Share, but that's misleading.  I'm a librarian who regularly helps students search I-Share for their textbooks, and your odds of finding them in the catalog are only a little better than 50/50.  Once you've found it, the majority of the time it'll be unrequestable from the library that owns it (either it's permanently unrequestable, they have it in course reserves themselves, or it's already checked out).  \n\nI'm not saying not to *try* getting your books through I-Share, just that it's not going to have a high rate of success and you pretty much have to do it as soon as you can find out what textbooks you need.    Regarding #1, what does on  \"on reserve\" mean?      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16g2sq/9_textbook_buying_tips_every_illini_should_know/"
  }, {
    "id" : 39,
    "title" : "Living for the Spring of 2014",
    "snippet" : "I feel like I have an especially challenging situation here. A friend of mine and I are travelling abroad for the Fall 2013. We still don't have a place to live for the Spring. We were hoping to live together in some 2-bedroom deal. It's a bit frustrating that there seems to be no solid system in place for finding somewhere to live when coming back from travel abroad. Is there anyone on here who knows of a place that we can sublease for the Spring of 2014, or some other solution to our woes?    What about [University Housing](http://www.housing.illinois.edu/en/Future/Upperclassmen/Easy%20Contracts.aspx)?\n\n&gt;If you are student teaching or studying abroad for a semester, University Housing is your best choice.\n\nPretty sure you could get a two-bedroom in Ashton Woods.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16gkqp/living_for_the_spring_of_2014/"
  }, {
    "id" : 40,
    "title" : "Does OSFA cover laptop purchases?",
    "snippet" : "My laptop is old and I can't take it to class without it dying 30 minutes in. I called the OSFA and asked if they cover laptops for class and the lady said something something there's forms on the website. I couldn't find them. Anybody know anything about this?  Go to the OFSA website --&gt; resources--&gt;forms\n\nAlso don't go and buy a 2000+ macbook. Get like a $300-400 asus computer. It really depends on your major. If you are going to need this laptop for the next few years, buy a reasonably nice/powerful/future-proof laptop for about 1000. It will save you money in the future.  I'm not trying to sound like a dick, but have you thought about buying a new battery (~70$) and/or a new hard drive (~50$)? This could be a short term solution so that after you graduate you can get something really good.",
    "url" : "http://www.reddit.com/r/UIUC/comments/16gw7y/does_osfa_cover_laptop_purchases/"
  }, {
    "id" : 41,
    "title" : "Changing time of suburban express ticket?",
    "snippet" : "Bought a late ticket on Sunday cause that was the only one they had in stock...then checked tonight and what do you know! They have more earlier times in stock.\n\nI was wondering if anyone has tried changing the time of their ticket and whether they called in or just directly went to the bus driver and asked them       [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/16gz6a/changing_time_of_suburban_express_ticket/"
  }, {
    "id" : 42,
    "title" : "Anybody know any good online courses available?",
    "snippet" : "Just looking for something i can take online.  Any recommendations would be helpful!   SHS 120. All online, second 8 weeks of semester. You have to meet up weekly for 30 min at night using Elluminate.  How easy was it for an A?  Orgo    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16gblt/anybody_know_any_good_online_courses_available/"
  }, {
    "id" : 43,
    "title" : "Tonight",
    "snippet" : "Any fun stuff happening on campus or in CU tonight? Party? Good band....  nope Not a thing. Campustown's gonna be quieter than an male ECE major at a sorority house. No reason to specify male as there are no female ece majors I know one. I live with one.    I imagine there would be a lot of people watching the Pro Football playoffs so you could go to a bar and watch those with a bunch of people. I imagine there would be a lot of people watching the Pro Football playoffs so you could go to a bar and watch those with a bunch of people.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16fqz2/tonight/"
  }, {
    "id" : 44,
    "title" : "In all seriousness, What would you like the new mascot to be? ",
    "snippet" : "And lets not have fifty people say 'I liked the old one!'- as no matter what we want they aren't going to bring him back. :P  It should be a World War I soldier. The name Fighting Illini originally referred to Illinoisans who fought in World War I, whose names are inscribed on the pillars of Memorial Stadium.  I actually like the \"Big I\" idea someone posted to the Facebook page. It let's us keep the same familiar image, but also provides an entertaining figure at games.\n\nSomething about a giant mechanical \"I\" rolling around on tank treds sounds hilariously awesome to me. I actually like the \"Big I\" idea someone posted to the Facebook page. It let's us keep the same familiar image, but also provides an entertaining figure at games.\n\nSomething about a giant mechanical \"I\" rolling around on tank treds sounds hilariously awesome to me.  I would like if we were the Fighting Il-Lincolns. Then we could have a Notre Dame leprechaun-style Abraham Lincoln that dances around on our side lines. No one to offend right. Been talking about changing it to the fighting abe's since I got here. We can get a guy out on stilts dressed up like Lincoln at halftime.  Been talking about changing it to the fighting abe's since I got here. We can get a guy out on stilts dressed up like Lincoln at halftime.  I don't know why you got downvoted because I actually think this is a cool idea. All I know is that it's been marinading up in the old noodle for the past four years. Now I got downvoted... Well, guess I'll take one for the team. I would like if we were the Fighting Il-Lincolns. Then we could have a Notre Dame leprechaun-style Abraham Lincoln that dances around on our side lines. No one to offend right. I would like if we were the Fighting Il-Lincolns. Then we could have a Notre Dame leprechaun-style Abraham Lincoln that dances around on our side lines. No one to offend right. Though I am still in support of having no mascot, I like Lincoln as a mascot idea, would definitely be interested in using him. I still wanna keep the \"Fighting Illini\" because that's just who we are and never going to change. Too much merchandise purchased, too many I-L-L chants made, and too much history to change that. The mascot, I guess, could be replaced as long as we are still the Illini. Another commenter suggested ways to add fun to Lincoln: jokes about us being the \"drinkin Lincolns\", maybe making fun of the city of Lincoln whenever we play Nebraska, wearing beards and top hats to our games, and generally having a good time in our 16th president's memory. I would like if we were the Fighting Il-Lincolns. Then we could have a Notre Dame leprechaun-style Abraham Lincoln that dances around on our side lines. No one to offend right. The Lincoln thing really isn't that bad. Could be the Railsplitters or just have a figure called Honest Abe. Lincoln was famous for being a raconteur; somebody good at stand up could wear the costume. I would like if we were the Fighting Il-Lincolns. Then we could have a Notre Dame leprechaun-style Abraham Lincoln that dances around on our side lines. No one to offend right.   I actually don't like mascots, symbols are cool but I tend to think mascots are generally stupid. Purdue Pete and Goldy Gopher just to name a few seem really odd and dumb so I would rather not see us have a mascot. A new symbol to put on some clothing maybe I could consider that. And definately no name changes.   Someone suggested the \"Bootleggers\", with a Chicago-style gangster from the 30's be our mascot. Not bad. Someone suggested the \"Bootleggers\", with a Chicago-style gangster from the 30's be our mascot. Not bad.  Just replace the Illini face with a turkey so you can keep the feather design. The Fighting Turkeys! George Washington (I think it was him?) originally wanted our national bird to be a turkey, because the wild turkey is incredibly smart. However, domestic turkeys are the complete opposite and will drown when it starts to rain because they look up at the sky and become so interested in the rain their lungs fill with water, so the other founding fathers opposed the idea.  George Washington (I think it was him?) originally wanted our national bird to be a turkey, because the wild turkey is incredibly smart. However, domestic turkeys are the complete opposite and will drown when it starts to rain because they look up at the sky and become so interested in the rain their lungs fill with water, so the other founding fathers opposed the idea.   I think the alumni and long-term U of I fans would prefer we just don't get a new one if we don't bring the chief back. We certainly don't need a mascot, and the chief will always be an unofficial symbol. Why have a pretend mascot?  Even though I would love to see the Chief back I don't think it will ever happen and school spirit has suffered tremendously.  How has it suffered? Block I may have  been less popular, but we can see why, nothing to do with the Chief. Same with Orange Krush. So in that regard spirit is fine. Can you give me an example of what you're referring to? I worked for the UI Foundation (called alumni and asked for donations) and believe me, people are still irate at the Chief and it hurts our donations considerably. The clout list also hurt, and the shitty job market is probably starting to be the #1 reason donations are so low. How has it suffered? Block I may have  been less popular, but we can see why, nothing to do with the Chief. Same with Orange Krush. So in that regard spirit is fine. Can you give me an example of what you're referring to? Obviously this is an opinion. Just being at the basketball games as a freshman, now three years ago, I used to go with a bunch of seniors to the games and they'd teach me all the dances and the things people used to do associated with the Chief. They said those traditions were dying off more and more every year since they had been freshmen.\n\nI've seen the same thing happen over the past three years, there is literally pretty much nobody who knows the dances and traditions as far as I'm aware. oh no our poor school spirit.\n\nmaybe it has something to do with our horrible sports programs? Obviously this is an opinion. Just being at the basketball games as a freshman, now three years ago, I used to go with a bunch of seniors to the games and they'd teach me all the dances and the things people used to do associated with the Chief. They said those traditions were dying off more and more every year since they had been freshmen.\n\nI've seen the same thing happen over the past three years, there is literally pretty much nobody who knows the dances and traditions as far as I'm aware. Some of the ones directly related to the chief may be fading, but I don't know if that is necessarily representative of campus spirit as a whole. As long as the majority stands behind the chief, I see no reason for a new Mascot/Symbol or whatever the phrase of the day is. Just my take, but I think the whole Campus Spirit Revival and new mascot/symbol issue is disrespectful to the alumni who make the school what it is- a nationally recognized network for success, essentially- and to change it is essentially starting fresh and casting tradition aside. I think the alumni and long-term U of I fans would prefer we just don't get a new one if we don't bring the chief back. We certainly don't need a mascot, and the chief will always be an unofficial symbol. Why have a pretend mascot?   The Fighting Iroquois?  Then we'd have someone we could pay off.   You guys forgot Farmbot? http://youtu.be/TUvOSwiliBg   Idk. If we can't have chief I don't want a mascot  i'm okay with not having a racist mascot so k I'm actually part native american and don't have an issue with it. \n\nIf you want to be all \"political\" about it go talk to schools and teams like the Washington Redskins, Brooklin Redmen, Bedord Road Collegiate Redmen, Cuyahoga Heights High School Redskins,  Hurricane (WV) High School Redskins, Knox (Indiana) High School Redskins, Lamar High School (Houston, Texas) Redskins, or Liberal (KS) High School Redskins just to name a few. Those are racist mascots.  \n\nOur school, while maybe stereotyping a little like the Illini mascot wears Sioux clothes and accessories, which are different from actual Illini traditions. But our school gave nothing but respect to our mascot and Native Americans. \n\nThe Peoria Tribe of Indians of Oklahoma are the closest living descendants of the Illiniwek Confederacy, having been relocated to Oklahoma in the 19th century. The position of the tribal leadership has evolved over the years. In a television interview with WICD-TV in 1995, Don Giles, then Chief of the Peoria Tribe, said, \"To say that we are anything but proud to have these portrayals would be completely wrong. We are proud. We're proud that the University of Illinois, the flagship university of the state, a seat of learning, is drawing on that background of our having been there. And what more honor could they pay us?\" Supporting Chief Giles was another tribal elder, Ron Froman, who stated that the protesters \"don't speak for all Native Americans, and certainly not us.\n\n I'm actually part native american and don't have an issue with it. \n\nIf you want to be all \"political\" about it go talk to schools and teams like the Washington Redskins, Brooklin Redmen, Bedord Road Collegiate Redmen, Cuyahoga Heights High School Redskins,  Hurricane (WV) High School Redskins, Knox (Indiana) High School Redskins, Lamar High School (Houston, Texas) Redskins, or Liberal (KS) High School Redskins just to name a few. Those are racist mascots.  \n\nOur school, while maybe stereotyping a little like the Illini mascot wears Sioux clothes and accessories, which are different from actual Illini traditions. But our school gave nothing but respect to our mascot and Native Americans. \n\nThe Peoria Tribe of Indians of Oklahoma are the closest living descendants of the Illiniwek Confederacy, having been relocated to Oklahoma in the 19th century. The position of the tribal leadership has evolved over the years. In a television interview with WICD-TV in 1995, Don Giles, then Chief of the Peoria Tribe, said, \"To say that we are anything but proud to have these portrayals would be completely wrong. We are proud. We're proud that the University of Illinois, the flagship university of the state, a seat of learning, is drawing on that background of our having been there. And what more honor could they pay us?\" Supporting Chief Giles was another tribal elder, Ron Froman, who stated that the protesters \"don't speak for all Native Americans, and certainly not us.\n\n i'm okay with not having a racist mascot so k  [Girls' Generation Im Yoona](http://www.youtube.com/watch?v=4iqMUz8FNb4) Hold up now, but if we're going for Girls generation members, [Jessica](http://best-wallpaper.net/wallpaper/1280x1024/1209/Girls-Generation-Jessica_1280x1024.jpg) is the best. Just saying.  Hold up now, but if we're going for Girls generation members, [Jessica](http://best-wallpaper.net/wallpaper/1280x1024/1209/Girls-Generation-Jessica_1280x1024.jpg) is the best. Just saying.     I understand we won't go back to chief.  But as long as that's the case, I don't want a new mascot.  Chief or bust.  Fighting Illini is a good slogan.     I feel like it should have something to do with corn...\n\nthe fighting corn husks??? yea. yea thatd do I feel like it should have something to do with corn...\n\nthe fighting corn husks??? yea. yea thatd do I feel like it should have something to do with corn...\n\nthe fighting corn husks??? yea. yea thatd do     I like the idea of the \"Fighting Illini Thunderbirds\"  Like this-ish: http://image.spreadshirt.com/image-server/v1/designs/12109607,width=190,height=190/Thunderbird---Native-Symbol---Totem.png\n\nStill fits with the Native American theme that the Chief is.      Be aware that by using the term \"new mascot\", you are accusing everyone who honored the Chief of dishonesty, that they pretended that they were honoring the Illini, but were actually in minstrel/mascot mode with an entire people group.  So the term is not neutral.  No, just now. Chief or nothing. You need to dropout if you support anything else.  CHIEF II ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16eow6/in_all_seriousness_what_would_you_like_the_new/"
  }, {
    "id" : 45,
    "title" : "Arc vs CRCE?",
    "snippet" : "So I am a skinny guy, always have been, and I know that I need to gain weight. Currently, especially with my spring schedule, it will be hard to truly dedicate myself to a decent program, but I have to try. I was going to try to do the Stronglifts 5x5, or perhaps starting strength, but since most of the exercises involved free weights (squats, Benches, OHP) I would definitely need to go either ARC or CRCE. \n\nFirst off, which is better for these types of exercises; ARC or CRCE? I am currently at FAR/PAR as well.\n\nSecond, you generally need a spotter for certain exercises. Anyone have experience as a super skinny person not lifting much at all (tbh, I am not sure I could even bench the bar by itself) how easy would it be to get a decent spot? And are there people who bench not a lot that usually, or would I just look ridiculous?\n\nThanks  I have worked out at both ARC (2 years) and CRCE (1.5 years) in my 3.5 years here, and they both have pro's and con's.\n\nARC as a facility is much better than CRCE, having deadlift platforms, abundant free weights, and rubber plates (which are nice to have for deadlifts, since you need to do those for SL5x5).  But, the facility is generally much more crowded than CRCE will be.\n\nCRCE on the other hand has more basic equipment, shying away from being powerlift friendly (deadlifts, cleans, squats) due to the lack of padding/platforms/rubber plates, as well as there only being 1 squat rack.  But, it's less crowded, and you can manage to do all the lifts you need for SL5x5 with some effort.\n\nSince you are at FAR/PAR, I would probably say CRCE, because going all the way to ARC during the Winter is a hassle.  22N Illini takes 20 minutes there, which adds a total of 40 minutes to your workouts.\n\nIf I recall, SL5x5 has deadlifts, squats, bench, a freeweight press and something else... I can't remember.  For deadlifts, you can choose to do them outside the squat rack if you'd like.  Just grab 2 yoga mats, fold them into thirds, and place them under each weight area of the bar.  As for bench, since you don't think you can use the bar itself, use the Smith Machine.  It's right next to the squat rack and you can spot yourself with just the twist of your wrists.  Although, I suggest moving away from the Smith Machine once you feel comfortable, because using it does not develop stability muscles that you need.\n\nLike some of the other people have already said, good luck, and set some goals for yourself.  I've seen a guy workout 6 months straight without seeing any gains, but my current workout partner also put on 30 lbs of muscle in 3 months.  Be safe, but push your limits.\n\nTL;DR I recommend CRCE, just look at my 5th paragraph for my suggestions as to how to do some of the lifts SL5x5 requires.  Good luck! 30lbs of muscle in 3 months...sorry but no. Granted, 5-7 lbs of his weight gain was water weight from creatine, and his lean muscle gain was measured using caliper fat tests compared to his current body weight, so yeah you're probably right, his gains were more likely near the 18-22 lb area, but massive gains like that aren't unheard of.\n\nWe're also talking about someone who went from not doing any leg workouts to doing ATG squats twice a week..  Hit up the ARC. Trust me, it's worth the bus ride (or walk when the weather is nice).\n\nIt's nice to see fellow lifters at UIUC. Check out the Illini Bodybuilding Club if you're looking for a great lifting community and/or a lifting partner. It's an RSO that I started. I am interested in this. Is there a set place when/where you guys meet up? Hit up the ARC. Trust me, it's worth the bus ride (or walk when the weather is nice).\n\nIt's nice to see fellow lifters at UIUC. Check out the Illini Bodybuilding Club if you're looking for a great lifting community and/or a lifting partner. It's an RSO that I started. Do they do a \"getting started\" type thing? I'm aiming to start Starting Strength this semester but I'm worried about form.  You need to do it at the ARC. There are no deadlift platforms at CRCE. You only need a spot for bench and even then, you probably won't because you can just swing the bar down and put it on your legs if you fail. You would look ridiculous but nobody gives a shit. Everybody starts somewhere and we've all been there. Although I'm self conscious if I'm not doing 135. People deadlift in the CRCE squat rack all the time. Just dont be like Joebrah and slam your weight down after every rep (unless, like Joebrah, you're doing 4+ plates).  Lol, gotta love Joebrah! I actually lifted with him one summer. It was a lot of fun. HAHA People know him by Joebrah?  I thought only a few people called him that :P.  I should ask him if he's a redditor, he'd love this :P.      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16fgq1/arc_vs_crce/"
  }, {
    "id" : 46,
    "title" : "Help a UIUC startup and make some cash at the same time!",
    "snippet" : "Hey guys. So I'm working on a student startup called Studycloud and we are looking for some extra help this coming week for our launch. We're building a platform to connect you to the students in your course and our vision is to forge meaningful and lasting connections between you and your classmates. Beyond helping to create academic connections that might otherwise not exist, we also want to provide an awesome place for collaboration and questions. We are really excited with what we have so far and think it can help a lot of students here at UIUC and beyond. As school is starting up again, we want to give as many people as possible a chance to try Studycloud. \n\nThat said, we're looking for some help posting posters and flyers around the school. We need about 10 people to post things in specific areas of campus. In exchange, you'll get $15/hour, an awesome Studycloud T-shirt, and our eternal gratitude. PM me or leave a comment if you can help and I'll try and meet up with on campus for a few minutes next week to hand off flyers and details. \n\nSorry for the long post, but we could really use your help!  What does it actually do? Is it just a place for students to chat online? yah it kinda sounds like Piazza. Or Facebook? yah it kinda sounds like Piazza. What does it actually do? Is it just a place for students to chat online? It creates networks for courses. This is a network for learning together with your classmates, unlike your social network or your professional network. So take CS 225 for example. Once you join the CS 225 StudyCloud, a social graph is created showing how you're connected to the people in your course. You continue connecting with students as you meet them or interact with them. You can ask questions, share study materials, lecture notes, chat, discuss - collaborate amongst your network to learn better together.       Were you a finalist in Cozad last year? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16erps/help_a_uiuc_startup_and_make_some_cash_at_the/"
  }, {
    "id" : 47,
    "title" : "Good tailors close to campus?",
    "snippet" : "Gotta suit up properly for interviews  May's Alterations. I'm too lazy to pull my response from similar threads, but she does fabulous work and she is awesome. Go to her.\n\nEDIT: For the record, I've been there at least a dozen times. Had her do pants, sweaters, suits, shirts, etc. May's Alterations. I'm too lazy to pull my response from similar threads, but she does fabulous work and she is awesome. Go to her.\n\nEDIT: For the record, I've been there at least a dozen times. Had her do pants, sweaters, suits, shirts, etc. May's Alterations. I'm too lazy to pull my response from similar threads, but she does fabulous work and she is awesome. Go to her.\n\nEDIT: For the record, I've been there at least a dozen times. Had her do pants, sweaters, suits, shirts, etc. May's Alterations. I'm too lazy to pull my response from similar threads, but she does fabulous work and she is awesome. Go to her.\n\nEDIT: For the record, I've been there at least a dozen times. Had her do pants, sweaters, suits, shirts, etc.  I had a really good experience at The Magic Needle on University, but only went once so can't attest to whether they're that good all the time. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16eqt0/good_tailors_close_to_campus/"
  }, {
    "id" : 48,
    "title" : "Is it strict seating for Illini Basketball games?",
    "snippet" : "I bought a ticket for this Thursday's game and since you can only buy one ticket per student (for the discount) my boyfriend and I wound up getting two different sections but the same row and seat. I was just wondering if anyone knows if the seating at the games is super strict or not. Thanks!  Since the last two games have been a sellout, there is a good chance that a seat won't be available next to either of you.  They don't check your ticket when you are sitting down in the upper sections, but you may have issues if you are sitting in someone else's seat and they show up.  You might have better luck sitting up toward the top of the C section. Oh good! We both got the C section because we didn't know any better but hopefully it'll work out! Thanks a ton! &gt; We both got the C section because we didn't know any better \n\nI read this in the comments view mode and didn't at first realize that you were referring to a basketball game.  /r/nocontext worthy? Oh good! We both got the C section because we didn't know any better but hopefully it'll work out! Thanks a ton! the nosebleeds are never full, just go up there   If there aren't seats available, you can always ask the people next to you if they are willing to move.  It never hurts to ask.   Unless you're in the Orange Krush sections, it's pretty strict. Unless you're in the Orange Krush sections, it's pretty strict. Unless you're in the Orange Krush sections, it's pretty strict. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16ehlk/is_it_strict_seating_for_illini_basketball_games/"
  }, {
    "id" : 49,
    "title" : "Textbooks on Reserve?",
    "snippet" : "I'm in a ~15 person class for 6 weeks, requiring upwards of $60 worth of textbooks. I emailed the TA asking if the books will be on reserve, to which they replied no. Is there any way to make a formal request to avoid unnecessary costs?  Have you tried searching the I-Share catalog to see if they are available through one of the partner libraries for checkout?  If so, you could always try to check them out that way.  Undergrads can't check things out for the same length of time as grad students or staff/faculty, so you might need to wait until you get the syllabus to see when you'll need each book during the semester.\n\nThis has worked for many of my wife's graduate level Education courses. This is fantastic advice; thank you. I've tried creating an VuFind account for the I-Share catalog, however, and I'm not sure how to tie the account to my U of I library account. Any tips? [The Login FAQ](http://www.carli.illinois.edu/mem-prod/I-Share/opac/vf-login-faq.html#difference)\n\nBe sure to fill in all of the information listed in the section below that about how to create an account. Thanks again for the advice. However, I'm still unable to figure out how to create an account after reading the FAQ because I don't have a borrower ID. I assumed the borrower ID was our UIN number, but it's seemingly not. Do you know how to figure out the borrower ID number? Thanks again for the advice. However, I'm still unable to figure out how to create an account after reading the FAQ because I don't have a borrower ID. I assumed the borrower ID was our UIN number, but it's seemingly not. Do you know how to figure out the borrower ID number? Did you use the UIN or the Library number on your I-Card?  I think the borrower ID is the Library number. Have you tried searching the I-Share catalog to see if they are available through one of the partner libraries for checkout?  If so, you could always try to check them out that way.  Undergrads can't check things out for the same length of time as grad students or staff/faculty, so you might need to wait until you get the syllabus to see when you'll need each book during the semester.\n\nThis has worked for many of my wife's graduate level Education courses.   Ask the instructor, see what they say. You could then try to find someone in the department to help you, but I'm not sure what kind of department employee would be looking out for this kind of thing. Your best bet is to convince the instructor. Thanks for the advice. I have no idea what the process of putting books in the UGL is like; would you think it would be bothersome/over-the-top for the instructor to put books in the UGL? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/16ehyb/textbooks_on_reserve/"
  } ],
  "processing-time-source" : 60,
  "processing-result.title" : "uiuc8_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc8_reddit.xml"
  }
}