{
  "processing-time-total" : 1185,
  "clusters" : [ {
    "id" : 0,
    "size" : 9,
    "score" : 60.38728450258216,
    "phrases" : [ "UIUC" ],
    "documents" : [ 0, 3, 9, 12, 19, 20, 21, 35, 42 ],
    "attributes" : {
      "score" : 60.38728450258216
    }
  }, {
    "id" : 1,
    "size" : 7,
    "score" : 28.073987685907174,
    "phrases" : [ "Housing" ],
    "documents" : [ 7, 9, 13, 15, 19, 21, 26 ],
    "attributes" : {
      "score" : 28.073987685907174
    }
  }, {
    "id" : 2,
    "size" : 7,
    "score" : 42.71589422003226,
    "phrases" : [ "Ticket" ],
    "documents" : [ 0, 10, 25, 29, 35, 41, 43 ],
    "attributes" : {
      "score" : 42.71589422003226
    }
  }, {
    "id" : 3,
    "size" : 7,
    "score" : 65.71708478319488,
    "phrases" : [ "Unofficial" ],
    "documents" : [ 4, 5, 10, 15, 16, 18, 36 ],
    "attributes" : {
      "score" : 65.71708478319488
    }
  }, {
    "id" : 4,
    "size" : 6,
    "score" : 58.6348849245653,
    "phrases" : [ "People Think" ],
    "documents" : [ 0, 3, 11, 13, 22, 35 ],
    "attributes" : {
      "score" : 58.6348849245653
    }
  }, {
    "id" : 5,
    "size" : 6,
    "score" : 45.025693154186065,
    "phrases" : [ "Snow" ],
    "documents" : [ 30, 32, 37, 40, 44, 48 ],
    "attributes" : {
      "score" : 45.025693154186065
    }
  }, {
    "id" : 6,
    "size" : 5,
    "score" : 44.57603088664963,
    "phrases" : [ "Night" ],
    "documents" : [ 12, 27, 28, 32, 39 ],
    "attributes" : {
      "score" : 44.57603088664963
    }
  }, {
    "id" : 7,
    "size" : 5,
    "score" : 24.400147016351557,
    "phrases" : [ "Years and it's Changed" ],
    "documents" : [ 1, 3, 12, 14, 22 ],
    "attributes" : {
      "score" : 24.400147016351557
    }
  }, {
    "id" : 8,
    "size" : 4,
    "score" : 60.35581890079133,
    "phrases" : [ "Movie" ],
    "documents" : [ 1, 3, 25, 47 ],
    "attributes" : {
      "score" : 60.35581890079133
    }
  }, {
    "id" : 9,
    "size" : 4,
    "score" : 56.495826794712514,
    "phrases" : [ "Places to Live" ],
    "documents" : [ 9, 12, 13, 19 ],
    "attributes" : {
      "score" : 56.495826794712514
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 44.542389793040144,
    "phrases" : [ "Message" ],
    "documents" : [ 7, 20, 38 ],
    "attributes" : {
      "score" : 44.542389793040144
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 45.180737659859744,
    "phrases" : [ "Snowman" ],
    "documents" : [ 44, 46, 49 ],
    "attributes" : {
      "score" : 45.180737659859744
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 35.90557117349285,
    "phrases" : [ "Bedroom" ],
    "documents" : [ 7, 26 ],
    "attributes" : {
      "score" : 35.90557117349285
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 34.800171773383255,
    "phrases" : [ "Coding" ],
    "documents" : [ 11, 38 ],
    "attributes" : {
      "score" : 34.800171773383255
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 58.4407112687921,
    "phrases" : [ "Emergency Dean" ],
    "documents" : [ 2, 35 ],
    "attributes" : {
      "score" : 58.4407112687921
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 43.28243657920203,
    "phrases" : [ "Gave" ],
    "documents" : [ 22, 23 ],
    "attributes" : {
      "score" : 43.28243657920203
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 73.47891698539352,
    "phrases" : [ "Illinois Student Senate" ],
    "documents" : [ 17, 34 ],
    "attributes" : {
      "score" : 73.47891698539352
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 62.99657028377674,
    "phrases" : [ "Really the best Part of Engineering" ],
    "documents" : [ 8, 24 ],
    "attributes" : {
      "score" : 62.99657028377674
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 32.49353673364367,
    "phrases" : [ "Recommend" ],
    "documents" : [ 14, 45 ],
    "attributes" : {
      "score" : 32.49353673364367
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 46.00513540445702,
    "phrases" : [ "Say whether the Officer States" ],
    "documents" : [ 13, 15 ],
    "attributes" : {
      "score" : 46.00513540445702
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 37.567948996631316,
    "phrases" : [ "West Champaign" ],
    "documents" : [ 13, 19 ],
    "attributes" : {
      "score" : 37.567948996631316
    }
  }, {
    "id" : 21,
    "size" : 3,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 6, 31, 33 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1101,
  "documents" : [ {
    "id" : 0,
    "title" : "Interest in a r/UIUC Speed Dating Event?",
    "snippet" : "It seems like the [last reddit dating match-up](http://www.reddit.com/r/UIUC/comments/o1xh6/ruiuc_singles_date_matchup_oh_yeah_its_happening/) went pretty well, and it's been almost exactly a year since the last one, so maybe you guys would be interested in trying something like that again.\n\nThis time though, instead of a match with only 1-2 people, perhaps a speed-dating type event would be a cool twist.\n\nEverything is still in the planning phases right now though. To get a sense of what the turnout would be, if you're reading this and think you would be interested in taking part, would you fill out this quick survey?\n\n[https://docs.google.com/forms/d/1R-6s1ELLPlQBI_jaXIcy1R54YrdxiWOx4vyLS_PXOGQ/viewform](https://docs.google.com/forms/d/1R-6s1ELLPlQBI_jaXIcy1R54YrdxiWOx4vyLS_PXOGQ/viewform)\n\nIdeally, it would happen in about a month from now (March 30th?), which should be enough time to book a room and get all of the materials made.\n\nIf you have any suggestions, feel free to leave a comment.\n  We could just hold a raffle for who gets to date me for 20 minutes. Why do you hate Moruitelda?\n\nAll I know is that he hates smokers. We could just hold a raffle for who gets to date me for 20 minutes. In that case I suspect /u/Moruitelda will buy all the raffle tickets.  \"So, do you reddit?\"\n\n\"Yup.\"\n\n\"Well, uh, would you rather fight 100 duck sized horses or 1 horse sized duck?\"\n\n\"*Cough*\"  Probably really need to work on the gender disparity.  I'm guessing the last one's girl:guy ratio was a little low? From what I read in the other thread it was 5:2.  From what I read in the other thread it was 5:2.  I like those odds From what I read in the other thread it was 5:2.  5 girls for every 2 guys? Or was it the other way? take a wild guess  This sounds fun, but I have a few questions about how the last dating match-up worked. Were there many LBGT persons involved? I am a bisexual female, and I would love it if there were other lesbian and bisexual women participating. I've been finding it incredibly difficult to find women to date.",
    "url" : "http://www.reddit.com/r/UIUC/comments/198lcj/interest_in_a_ruiuc_speed_dating_event/"
  }, {
    "id" : 1,
    "title" : "Old video of Green St./Campus",
    "snippet" : "I remember seeing an old video (probably shot in like the 70's) of Green St and campus. It was on youtube, but i cant find it anymore. Anyone know where I can find it?  I believe it was 1994. but it might as well have been the 70's because of all the development in the late 00's.\n\nEdit: [1994 Vid](http://www.youtube.com/watch?v=pAYMNmmc3N8)\n Wow, is it just me or did there used to be a lot more trees on campus? And a Burger King??? Just so you know. It was the worst BK ever.  Just so you know. It was the worst BK ever.  Wow, is it just me or did there used to be a lot more trees on campus? Wow, is it just me or did there used to be a lot more trees on campus? Sure looked like it. Was there no north quad? I didn't even see engineering hall. I believe it was 1994. but it might as well have been the 70's because of all the development in the late 00's.\n\nEdit: [1994 Vid](http://www.youtube.com/watch?v=pAYMNmmc3N8)\n I believe it was 1994. but it might as well have been the 70's because of all the development in the late 00's.\n\nEdit: [1994 Vid](http://www.youtube.com/watch?v=pAYMNmmc3N8)\n I believe it was 1994. but it might as well have been the 70's because of all the development in the late 00's.\n\nEdit: [1994 Vid](http://www.youtube.com/watch?v=pAYMNmmc3N8)\n That's awesome! Only ten years and it's changed so much. &gt;Only ten years and it's changed so much.\n\nThat feel when you realize 1994 was nearly twenty years ago. For me, it's all about movies. I was born 8 years after Star Wars came out, and it was my favorite movie for a long, long time. I watched it hundreds of times. \n\nThat feel when I realize that The Lord of the Rings trilogy will be to my child what the Star Wars trilogy was to me. Except older. And that, to my child, Star Wars will be as old as It's A Wonderful Life is to me. \n\nThat Jurassic Park and Independence Day will be the equivalents of Hondo or the Great Escape. \n\nThe Lion King will be 19 years old when my child is born. That's older than The Jungle Book was when I was born. \n\nLife just slips away, and there's nothing you can do about it. fuck, that's heavy stuff man. as if I weren't feeling enough feelings already. &gt;Only ten years and it's changed so much.\n\nThat feel when you realize 1994 was nearly twenty years ago. &gt;Only ten years and it's changed so much.\n\nThat feel when you realize 1994 was nearly twenty years ago. That's awesome! Only ten years and it's changed so much. Almost 20 years at this point... That's awesome! Only ten years and it's changed so much. Yeah that's not 10 years ago.  Yeah that's not 10 years ago.  Nice flair. I believe it was 1994. but it might as well have been the 70's because of all the development in the late 00's.\n\nEdit: [1994 Vid](http://www.youtube.com/watch?v=pAYMNmmc3N8)\n    Does anyone know of good sites for older photos of campus?  Green Street looks awesome then. So much character. Now it's just a strip mall.  Green Street looks awesome then. So much character. Now it's just a strip mall.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/197utg/old_video_of_green_stcampus/"
  }, {
    "id" : 2,
    "title" : "HELP! EMERGENCY DEAN?",
    "snippet" : "hey so i need to contact the emergency dean about missing classes due to my grandfather passing away. what do i do? what happens? what sort of documentation do i give them if i need to give them anything?   I was in the hospital a few years ago and the emergency dean came and visited me.  She took down my professors' and my boss' email addresses and took it from there.  I guess just told them that I would be absent for a while, but I didn't have to do anything.  Once I got out, it was my responsibility to talk to my teachers and figure out any missed work.   okay that does help a little but does anyone have any experience with a family death? i'm not sure what i need to give her or if i just email her? They really just want proof that you were actually missing classes due to a family death and not just ditching. An obituary from the paper (if you share a last name or if it mentioned you by name), a memorial/prayer booklet, something from the hospital/cemetery, or any other document that shows you were dealing with the death of your grandfather should be sufficient. The Emergency Dean will work with you to get that all sorted out.  When my buddy passed away a few years ago I just brought them the prayer card and they took that as proof. They were always super understanding with me. thanks. think the obituary would work? the prayer card i left at home and getting a death certificate might take weeks :\\ ",
    "url" : "http://www.reddit.com/r/UIUC/comments/198e5l/help_emergency_dean/"
  }, {
    "id" : 3,
    "title" : "University of Illinois alumnus Ang Lee wins Academy Award for Best Director for \"Life of Pi\"!",
    "snippet" : "  he is definitely an Illini.\nWithout his wife's support, he won't be a director.\nWithout UIUC, he won't met his wife.\nSo, in conclusion, without UIUC, he won't win Oscar. Why? He met his wife in an international student banquet in UIUC. For about 7 years, he didn't have a job and need his wife's support. He used that 7 years did lots of research and study.\n\nIf you are interested, here is an article about how his wife support him, and you should also know his wife finished her graduate school in UIUC.\n\n\n\nhttp://www.nytimes.com/2001/01/28/nyregion/families-far-from-the-spotlight-winning-director-s-wife.html  Related: Am I the only one that liked his Incredible Hulk movie? Related: Am I the only one that liked his Incredible Hulk movie? Nope, it even showed at Ebertfest in 2008 because Ebert felt it had been underappreciated.\nedit : [link](http://www.ebertfest.com/ten/hulk.html)\nWoah, no asterisk showed up. Does reddit not mark a post as edited if you change it within a minute of posting? Related: Am I the only one that liked his Incredible Hulk movie? Maybe. I don't think it's as dreadful as a lot of people make it out to be, but I definitely would say it's a mediocre movie, but not memorably bad enough to constantly bitch about. Related: Am I the only one that liked his Incredible Hulk movie? Related: Am I the only one that liked his Incredible Hulk movie?  this is the only movie i've ever enjoyed in 3d Really? I thought the 3D in avatar was awesome  I didn't see Avatar in 3d, unfortunately That's a shame. I thought the effects were pretty cool ",
    "url" : "http://www.latimes.com/entertainment/envelope/moviesnow/la-et-mn-oscars-2013-ang-lee-wins-best-director-prize-20130220,0,6165513.story"
  }, {
    "id" : 4,
    "title" : "Lets create a Unofficial play list",
    "snippet" : "What Irish tunes are you guys going to puking up green beer to?     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/198wk1/lets_create_a_unofficial_play_list/"
  }, {
    "id" : 5,
    "title" : "Another question about your rights on unofficial",
    "snippet" : "If a police officer comes to the door do I have to open it? This happened to me last year because I had \"loud\" music. I had nobody over so I opened the door. All he did was tell me to put it down while looking over my shoulder to see what was going on behind me. It was not overly loud but you could probably hear it from the hallway. Is that valid reason for a police office to have probable cause or even enough for him to request a warrant? Do I open for him or wait for him to leave?\n\nThoughts?   Keep all booze away from the door. Keep the door locked and move all of the beer / liquor out of plain sight. Walk outside and shut the door behind you. Comply with all requests  ( turn the music down, keep you hands out of your pockets etc) but do not consent to a search unless everyone is 21 and it is all legit.  If you open the door and a girl is passed out on the floor they will have probable cause to enter. &gt; do not consent to a search unless everyone is 21 and it is all legit.\n\nJust don't consent to a search in any case. It's a better idea.  With Unofficial once again upon us, it's time for EVERYONE to rewatch [this gem](http://www.youtube.com/watch?v=6wXkI4t7nuc) about your rights when interacting with the cops. \n\nIt's worth watching every minute. With Unofficial once again upon us, it's time for EVERYONE to rewatch [this gem](http://www.youtube.com/watch?v=6wXkI4t7nuc) about your rights when interacting with the cops. \n\nIt's worth watching every minute. \"This gem\"\n\nReddit. With Unofficial once again upon us, it's time for EVERYONE to rewatch [this gem](http://www.youtube.com/watch?v=6wXkI4t7nuc) about your rights when interacting with the cops. \n\nIt's worth watching every minute. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1982lc/another_question_about_your_rights_on_unofficial/"
  }, {
    "id" : 6,
    "title" : "What is there to order for delivery in C-U?",
    "snippet" : "Question says it all! I'm aware of all the places for Chinese food. I know pizza places as well and Wingin' Out, too. Also, I know Jimmy Johns.\n\nAny other places that delivers good food? I'm hungry and don't feel like cooking  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/198dm7/what_is_there_to_order_for_delivery_in_cu/"
  }, {
    "id" : 7,
    "title" : "3 bedroom house for sublet 2013-2014",
    "snippet" : "Located at the intersection of Birch and Illinois. 3 bedrooms, 2 bathrooms. Washer/dryer in house. There is a garage and 2 parking spots on their driveway. There is a bus stop within a block that the gold, silver, and green pick up at. Message me if interested!\n\nEdit: WHOOPS! Forgot price. $1200 a month total  $?",
    "url" : "http://www.reddit.com/r/UIUC/comments/198b0u/3_bedroom_house_for_sublet_20132014/"
  }, {
    "id" : 8,
    "title" : "So how hard is it to transfer to Mechanical Engineering?",
    "snippet" : "I was stupid when I put in my application and put down Engineering Mechanics instead of Mechanical Engineering. How hard will it be to switch into Mechanical when I arrive next fall?   It won't be a problem as long as you have a good gpa.  I have a friend who did this too, but he struggled with a couple classes freshman year and his gpa wasn't high enough for him to transfer into the major.  He really likes Engineering Mechanics now though, and the majors aren't too different.  Engineering Mechanics takes a lot more of the theory behind all the processes though, so be prepared for a lot of math (which is really the best part of engineering).  Also, you aren't allowed to switch until the end of freshman year.  I switched from General Engineering to Civil Engineering with no problem at all, the process isn't hard, it's just the GPA requirement for mechanical engineering that makes it difficult.\n\nEDIT: if you contact the school you may be able to switch your major before coming here.  Just send a lot of emails. It won't be a problem as long as you have a good gpa.  I have a friend who did this too, but he struggled with a couple classes freshman year and his gpa wasn't high enough for him to transfer into the major.  He really likes Engineering Mechanics now though, and the majors aren't too different.  Engineering Mechanics takes a lot more of the theory behind all the processes though, so be prepared for a lot of math (which is really the best part of engineering).  Also, you aren't allowed to switch until the end of freshman year.  I switched from General Engineering to Civil Engineering with no problem at all, the process isn't hard, it's just the GPA requirement for mechanical engineering that makes it difficult.\n\nEDIT: if you contact the school you may be able to switch your major before coming here.  Just send a lot of emails.    Mechanical Engineering is one of the hardest majors to transfer into.  Engineering Mechanics is the better major anyway (I am biased, it was my major). ...but your flair says Theoretical and Applied Mathematics?  TAM = Engineering Mechanics Did not know they were equivalent terms.  Mechanical Engineering is one of the hardest majors to transfer into.  Engineering Mechanics is the better major anyway (I am biased, it was my major). How's the degree treating you thus far? Are you doing graduate school now? Also, how's the demand for Engineering Mechanics majors compare to Mechanical Engineering majors?",
    "url" : "http://www.reddit.com/r/UIUC/comments/19832f/so_how_hard_is_it_to_transfer_to_mechanical/"
  }, {
    "id" : 9,
    "title" : "Grad Housing for newly married couple?",
    "snippet" : "Hey guys,\n\nI was recently admitted to a graduate program at UIUC. I will be getting married before the program begins. \n\nI am wondering if you all had any suggestions for places to live that are a bit nicer than some of the cheap/efficiency type housing that I saw a lot of while visiting. Looking for a 2 bed and 1.5-2 bath house, apartment, or townhome rental. \n\nAny suggestions?\n\nThank you!      I lived in Orchard Downs for a bit and I have to say it is an extremely safe starting point. I lived there for about a year with my wife when we got here, casually looking for better places. It's ridiculously cheap for its quality (you can get 2bedroom places which are fine as long as you put something up to cover the cinder block walls), and they are very nice about letting you get out of your lease early (in the summer anyway) if you find someplace you would rather be. \n\nThink about it this way: if you are in a new city and you need a hamburger, you are probably going to go to Burger King to keep your risk down until you know more about the local burger place. Orchard Downs is the same idea -- standardized, low-variance, 40th percentile housing that is a safe starting place. &gt; if you are in a new city and you need a hamburger, you are probably going to go to Burger King to keep your risk down until you know more about the local burger place.\n\nNah. I’d visit Yelp, type in “hamburger”, and immediately get a crowdsourced opinion of the best hamburger in town (Farren’s, by the way). No need to fall back on the safe choice. Likewise, OP is crowdsourcing a housing decision so he or she doesn’t have to move again soon after getting into town.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/197999/grad_housing_for_newly_married_couple/"
  }, {
    "id" : 10,
    "title" : "Surviving Police Encounters on Unofficial",
    "snippet" : "  TL;DR Cause this is really important.  When approached by a cop, the only words you should be saying, other than your name and address when asked, are:\n\n\"Officer, am I being detained or am I free to leave?\"\n\nAnd\n\n\"Officer, I respectfully decline consent to a search.\"\n\nAnything, ANYTHING else you say will be twisted against you til Officer Friendly gets to tally off another ticket/arrest quota in his little notepad.\n\nThat being said, much love and respect to those officers who actually respect the Bill of Rights.\n\n TL;DR Cause this is really important.  When approached by a cop, the only words you should be saying, other than your name and address when asked, are:\n\n\"Officer, am I being detained or am I free to leave?\"\n\nAnd\n\n\"Officer, I respectfully decline consent to a search.\"\n\nAnything, ANYTHING else you say will be twisted against you til Officer Friendly gets to tally off another ticket/arrest quota in his little notepad.\n\nThat being said, much love and respect to those officers who actually respect the Bill of Rights.\n\n",
    "url" : "https://www.facebook.com/events/308954109227643/"
  }, {
    "id" : 11,
    "title" : "Question for people who have taken CS 241.",
    "snippet" : "I went into this class thinking it would be a hardcore programming class like 225. Although the MPs do require a lot of coding, the inclass stuff is more conceptual. My question is, does the midterm require coding? I want to start studying for it but I'm not sure if I should expect coding or short answer on the midterm.   The multiple choice tends to be more conceptual but does have coding problems. The actual writing part tends to be more coding based but has some conceptual stuff like figuring out the order in which a process would execute. It also changes a bit from semester to semester. Your best bet would be to look at the past midterms, the layout will be quite similar to what you will be taking.\n\nThe coding part for the writing also is more based on MPs so make sure you understand those well. The multiple choice tends to be more conceptual but does have coding problems. The actual writing part tends to be more coding based but has some conceptual stuff like figuring out the order in which a process would execute. It also changes a bit from semester to semester. Your best bet would be to look at the past midterms, the layout will be quite similar to what you will be taking.\n\nThe coding part for the writing also is more based on MPs so make sure you understand those well. Will do. Are the solutions for previous midterms released? I can only find the spring 2012 practice midterm, but without solutions.  Will do. Are the solutions for previous midterms released? I can only find the spring 2012 practice midterm, but without solutions.  I don't know which professor you have for this semester but when I had Robyn, she scoffed at the idea of handing out solutions for the midterm saying that we should be grateful for even having past midterms to look at &gt;.&gt;  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/197jl9/question_for_people_who_have_taken_cs_241/"
  }, {
    "id" : 12,
    "title" : "Murphy's Pub",
    "snippet" : "I'm writing a couple of papers on Murphy's Pub and it's atmosphere and such.  I was wondering if anyone knew of any documents/interviews/photographs or any primary sources like that which would show the history of Murphy's (it was established here in 1969 so I know there has to be something). Or if you know someone who know's the history of it that I could interview. Thanks reddit!  I would suggest just asking a bartender there if any management might be willing to spend 10 minutes of their time answering a few questions. Worst that can happen is they say no.\n\nBack during my time at UIUC (1996-2000 and lived in the area a few years after), Murphy's was still smaller - basically just one long room. It expanded into whatever was next door (memory escapes me now) sometime while I was down there.\n\nIn the early days, they were most known for their awesome burgers and fresh cut fries -- the entire wall near the entrance was lined with boxes of fresh potatoes stacked several feet high, etc.  It was a divey / dumpy place with awesome bars and a laid back atmosphere.\n\nAfter it expanded, it changed a bit, but although it sort of \"yuppified\" a little bit, it was still more a chill out and have conversation w/friends over beers kind of place, not a get smashed and dance kind of place.  I hope/suppose that's still the case today.\n\nNot sure if it's still the case, but they used to give away souvenir glasses of whatever beer(s) was/were on special on Wednesday nights, which was pretty cool.\n\nMan, I miss their burgers and fries... \n &gt; Back during my time at UIUC (1996-2000 and lived in the area a few years after), Murphy's was still smaller - basically just one long room. It expanded into whatever was next door (memory escapes me now) sometime while I was down there.\n\nBar Giuliani [which was a fucking awesome coffee shop] I would suggest just asking a bartender there if any management might be willing to spend 10 minutes of their time answering a few questions. Worst that can happen is they say no.\n\nBack during my time at UIUC (1996-2000 and lived in the area a few years after), Murphy's was still smaller - basically just one long room. It expanded into whatever was next door (memory escapes me now) sometime while I was down there.\n\nIn the early days, they were most known for their awesome burgers and fresh cut fries -- the entire wall near the entrance was lined with boxes of fresh potatoes stacked several feet high, etc.  It was a divey / dumpy place with awesome bars and a laid back atmosphere.\n\nAfter it expanded, it changed a bit, but although it sort of \"yuppified\" a little bit, it was still more a chill out and have conversation w/friends over beers kind of place, not a get smashed and dance kind of place.  I hope/suppose that's still the case today.\n\nNot sure if it's still the case, but they used to give away souvenir glasses of whatever beer(s) was/were on special on Wednesday nights, which was pretty cool.\n\nMan, I miss their burgers and fries... \n My father (Class of 1984) liked it because they were one of the few bars that served Guinness at the time. He was ticked off when he came back and it was served chilled and not on cask. It is served on tap currently. I would suggest just asking a bartender there if any management might be willing to spend 10 minutes of their time answering a few questions. Worst that can happen is they say no.\n\nBack during my time at UIUC (1996-2000 and lived in the area a few years after), Murphy's was still smaller - basically just one long room. It expanded into whatever was next door (memory escapes me now) sometime while I was down there.\n\nIn the early days, they were most known for their awesome burgers and fresh cut fries -- the entire wall near the entrance was lined with boxes of fresh potatoes stacked several feet high, etc.  It was a divey / dumpy place with awesome bars and a laid back atmosphere.\n\nAfter it expanded, it changed a bit, but although it sort of \"yuppified\" a little bit, it was still more a chill out and have conversation w/friends over beers kind of place, not a get smashed and dance kind of place.  I hope/suppose that's still the case today.\n\nNot sure if it's still the case, but they used to give away souvenir glasses of whatever beer(s) was/were on special on Wednesday nights, which was pretty cool.\n\nMan, I miss their burgers and fries... \n  Just walk into Siebel and ask around\n\nEdit: I'm not kidding, CS kids love Murphy's, and one of the older grad students is bound to be perfect for you to interview 7.5 / 10 3/10 3/10 3/10   I worked there for a few years (2009 to 2011) and was an assistant manager, if you have any specific question you can PM me. I do know that about ~2 years ago, me and some other guys I worked with cleaned out the old office in the alley that they had used for the previous 15 years. They didn't keep a lot of the documents or other things hanging around but some of us that helped got a few posters, neons, old tshirts, and such. You could try to talk to management but they aren't always the nicest people when it comes to certain things so I'm not sure if they would be willing to help with this or not.\n\nI do know among the old photographs I have seen were some ones of the Budweiser clydesdales drinking beer out of a bucket back in the 70s, so there is a lot of history there. do you know where these photographs are at? are they hanging in Murphy's or are they in storage?    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1969sc/murphys_pub/"
  }, {
    "id" : 13,
    "title" : "Champaign IL State Rep. Adam Brown says, \"99% of my constituency, those who have contacted me, is against gay marriage\". Maybe he needs to hear from a more representative sample of his constituents: staterepbrown@gmail.com",
    "snippet" : "  Most people living in Champaign and Urbana are represented by Naomi Jakobsson, not Adam Brown. Jakobsson is a co-sponsor of the marriage equality bill: http://www.ilga.gov/legislation/BillStatus.asp?DocNum=5170&amp;GAID=11&amp;DocTypeID=HB&amp;LegId=65291&amp;SessionID=84\n\nPlease check which district you are in before writing to ensure that you are writing to your representative. This map shows districts: http://gis.elections.il.gov/map_viewer_update/default.aspx\n\nBrown represents the 102nd district. Jakobsson represents the 103rd. \"To view this content, please install Silverlight\" :(\n\nIs it possible to give a high level summary? i.e. East/West or North/South? This website has the redistricting. You have to scroll down pretty far to see it, but almost all of Chambana is 103rd district. Far east Urbana is 104th, far south and west Champaign are 102nd.\n\nhttp://willcountynewspolitics.blogspot.com/2011/12/realigned-illinois-state-legislative.html?m=1 Thanks for the summary. When accessed from Android the page is nothing but a Silverlight screen. Most people living in Champaign and Urbana are represented by Naomi Jakobsson, not Adam Brown. Jakobsson is a co-sponsor of the marriage equality bill: http://www.ilga.gov/legislation/BillStatus.asp?DocNum=5170&amp;GAID=11&amp;DocTypeID=HB&amp;LegId=65291&amp;SessionID=84\n\nPlease check which district you are in before writing to ensure that you are writing to your representative. This map shows districts: http://gis.elections.il.gov/map_viewer_update/default.aspx\n\nBrown represents the 102nd district. Jakobsson represents the 103rd. Leave it to people from the Chicago area to believe they represent the rest of the state. Geographically, this is a red state.  this is a pretty blue town except for the 102nd district though But isn't that only because of the large student population? It's like importing votes into the town from Chicago lol Leave it to people from the Chicago area to believe they represent the rest of the state. Geographically, this is a red state.   Sent this:\n\nRepresentative Brown-\nI'm not going to try to change your mind on gay marriage; rather, I have several issues with how you recently defended your position in the press and how you perceive the issue in general. You are quoted as saying: \"“I would say 99 percent of my constituency, those who have contacted me, is against gay marriage...My job is to represent my constituents and uphold what they believe.”\n\nFirst, exaggeration fools nobody. It is statistically impossible that so many of your constituents agree with you, especially in county that voted heavily Democrat in the previous Presidential election. You know this. I realize you qualified the statement with \"those who have contacted me\"--you should expect a lot of dissenting contacts in the near future. \n\nSecond, you shouldn't be allowed to hide behind you constituency's imagined wished in this instance because people's rights should never be put to a vote in the first place. Morality, misguided or otherwise, has no place as the basis for deciding a person's worth as a citizen and a human being; otherwise, what are we left with besides tyranny of the (incredibly slim yet vocal) majority? When gay marriage is legalized it will not be because it is a right grudgingly given, but rather a long-standing oppression finally removed. There is a difference.\n\nWhat consoles me and, I suspect, gay people across the state and around the country, is that despite your obstruction, it simply doesn't matter very much in the long run. Gay marriage will be legal nationwide, and soon. Those who oppose it are simply on the wrong side of history, and every day of delay may be disappointing, insulting, painful...but nothing more than that: a delay. Human dignity and love will win out, and you'll be left to explain your support of intolerance to your grandchildren.\n\nAs I said before, expect many more emails along these lines. If you're an honest man, and I have no reason to believe otherwise, I'd expect you to stand up and defend your position without hiding behind what you've chosen to pretend that your constituents believe.  Sent this:\n\nRepresentative Brown-\nI'm not going to try to change your mind on gay marriage; rather, I have several issues with how you recently defended your position in the press and how you perceive the issue in general. You are quoted as saying: \"“I would say 99 percent of my constituency, those who have contacted me, is against gay marriage...My job is to represent my constituents and uphold what they believe.”\n\nFirst, exaggeration fools nobody. It is statistically impossible that so many of your constituents agree with you, especially in county that voted heavily Democrat in the previous Presidential election. You know this. I realize you qualified the statement with \"those who have contacted me\"--you should expect a lot of dissenting contacts in the near future. \n\nSecond, you shouldn't be allowed to hide behind you constituency's imagined wished in this instance because people's rights should never be put to a vote in the first place. Morality, misguided or otherwise, has no place as the basis for deciding a person's worth as a citizen and a human being; otherwise, what are we left with besides tyranny of the (incredibly slim yet vocal) majority? When gay marriage is legalized it will not be because it is a right grudgingly given, but rather a long-standing oppression finally removed. There is a difference.\n\nWhat consoles me and, I suspect, gay people across the state and around the country, is that despite your obstruction, it simply doesn't matter very much in the long run. Gay marriage will be legal nationwide, and soon. Those who oppose it are simply on the wrong side of history, and every day of delay may be disappointing, insulting, painful...but nothing more than that: a delay. Human dignity and love will win out, and you'll be left to explain your support of intolerance to your grandchildren.\n\nAs I said before, expect many more emails along these lines. If you're an honest man, and I have no reason to believe otherwise, I'd expect you to stand up and defend your position without hiding behind what you've chosen to pretend that your constituents believe.  This is a great letter but have you checked that he is actually your representative? If he isn't, even the best letters will make no real difference.\n\nAdam Brown represents the 102nd district which is far west Champaign (west of Duncan). Most of Champaign-Urbana is the 103rd district and our representative is Naomi Jakobsson, who is a democrat and in my opinion a pretty neat lady overall. Sent this:\n\nRepresentative Brown-\nI'm not going to try to change your mind on gay marriage; rather, I have several issues with how you recently defended your position in the press and how you perceive the issue in general. You are quoted as saying: \"“I would say 99 percent of my constituency, those who have contacted me, is against gay marriage...My job is to represent my constituents and uphold what they believe.”\n\nFirst, exaggeration fools nobody. It is statistically impossible that so many of your constituents agree with you, especially in county that voted heavily Democrat in the previous Presidential election. You know this. I realize you qualified the statement with \"those who have contacted me\"--you should expect a lot of dissenting contacts in the near future. \n\nSecond, you shouldn't be allowed to hide behind you constituency's imagined wished in this instance because people's rights should never be put to a vote in the first place. Morality, misguided or otherwise, has no place as the basis for deciding a person's worth as a citizen and a human being; otherwise, what are we left with besides tyranny of the (incredibly slim yet vocal) majority? When gay marriage is legalized it will not be because it is a right grudgingly given, but rather a long-standing oppression finally removed. There is a difference.\n\nWhat consoles me and, I suspect, gay people across the state and around the country, is that despite your obstruction, it simply doesn't matter very much in the long run. Gay marriage will be legal nationwide, and soon. Those who oppose it are simply on the wrong side of history, and every day of delay may be disappointing, insulting, painful...but nothing more than that: a delay. Human dignity and love will win out, and you'll be left to explain your support of intolerance to your grandchildren.\n\nAs I said before, expect many more emails along these lines. If you're an honest man, and I have no reason to believe otherwise, I'd expect you to stand up and defend your position without hiding behind what you've chosen to pretend that your constituents believe.   Yeah...so I started to fire off an e-mail to the guy, but then I read this thread and kinda double checked the district boundaries... [this is the 102nd district](http://i.imgur.com/86RHf5m.jpg) according to the State Board of Elections interactive map (which requires Silverlight for ridiculous reasons). Almost none of it is in CU. These towns are REALLY in the boonies. \n\nSending off a deluge of e-mails might have good intentions, but he'll be able to easily brush it off as meddling from college liberals from Champaign. To be honest, considering the area I think his \"99% of constituents\" claim is more credible than not.  This is a noble effort, but misguided. His statement could be accurate, as he may represent more rural members of the community. Odds are, you aren't his constituents because \n\na: most of you are only temporary residents of Champaign-Urbana for school.\n\nb: if you want to make the argument that state representatives should represent even temporary residents, most of you are probably covered by Naomi Jakobsson - who has already agreed to sign it. \n\nHer page is here, if you'd like to show your support - http://www.facebook.com/pages/Representative-Naomi-Jakobsson/109442605763187?ref=ts&amp;fref=ts &gt;This is a noble effort, but misguided.\n\nNo, it's not. Even if he's not your representative (he is mine), it's never misguided to tell someone that they need to stop being a homophobe or creating an institutionalized religious law in violation of the First Amendment. Well, you're sorta changing the argument here. You're talking about how we should send an email to Representative Brown on personal moral reasons. Got no problem with that.  \n\nThis post is about Representative Brown allegedly not knowing about his constituents' values, and that's what I was responding to. Most of the commenters here are likely NOT his constituents. While the 99% is most likely an exaggeration, he was re-elected by his constituents, suggesting there's more of a conservative streak among them.\n\nAlso, wouldn't it make more sense for out-of-town students to send letters to home/family representatives who don't support the bill?   I wrote him to advise him that I do not look kindly on commingling of religion and government, or institutionalized discrimination. I also advised him that if he votes this way, I will devote considerable amounts of time and money to defeating him in the next election. I finally reminded him that it's his job to represent all of his constituents, not just those organized by their churches in letter writing campaigns of ignorance and bigotry. \n\nIt's unacceptable to be represented by a bigot or an ignoramus. We saw what happened to Jerry Schweighart when he came out as a birther. That's what we should do to Adam Brown. \n\nIn the 1970's, the \"Silent Majority\" was conservative. Now it's liberal or moderate. At least in Illinois, it is.          Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt. Based on the map scientific_derp posted the 102nd district starts west of Duncan, which happens to be where I'm from. A significant population lives in that part of town right outside of the city limits. \n\nedit: wrong number! I think you mean 102nd. Brown represents the 102nd district which is the area west of Duncan and very southern Champaign (possibly Savoy). Almost all of Chambana is within the 103rd district which is represented by Naomi Jakobsson. Very east sections of Urbana are 104th but I'm not positive who their rep is. Based on the map scientific_derp posted the 102nd district starts west of Duncan, which happens to be where I'm from. A significant population lives in that part of town right outside of the city limits. \n\nedit: wrong number! Ya that area tends to be fairly well off. Ironwood, Brittney Trails, Lincolnshire, Abbey Fields(crazy houses, relics from the Housing Boom). They tend to lean Republican. Although many professors live out there as well.  Based on the map scientific_derp posted the 102nd district starts west of Duncan, which happens to be where I'm from. A significant population lives in that part of town right outside of the city limits. \n\nedit: wrong number! Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt. Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt. Full disclosure: After posting this I tried to figure out how Brown, a Republican, could have ever been elected from CU. I'm not totally sure what the boundaries of his district are (I know Rep. Naomi Jakobsson is also a representative from Champaign).\n\nThe article doesn't do a good job specifying what Brown's actual district is either. He does have his district office in Champaign though for whatever reason: http://www.ilga.gov/house/Rep.asp?GA=98&amp;MemberID=1978\n\nIn any case, him hearing from more marriage equality supporting people can't hurt.",
    "url" : "http://www.pantagraph.com/news/state-and-regional/illinois/government-and-politics/same-sex-marriage-might-be-harder-to-clear-in-house/article_9bcc9092-7e1c-11e2-8075-0019bb2963f4.html"
  }, {
    "id" : 14,
    "title" : "Very Important: Student Insurance Town Hall Meeting - Today, Monday, February 25th, at 4:00pm in Illini Room A at the Illini Union",
    "snippet" : "On behalf of the Student Insurance Advisory Committee, I'd like to invite you all to come and participate in this meeting to voice your opinions and concerns regarding your student insurance.\n\nAs most of you are probably aware, the PPACA has substantial implications for insurance and it will substantially impact our student insurance coverage. As for how, exactly, it will do so: We are still figuring that out.\n\nThese meetings are generally not well-attended, but this year  for reasons already stated, it is especially important for us to have your input, whether you are an undergraduate or graduate student, whether you are domestic or international.\n\nSo I urge you to please come this afternoon, make your voices heard, and help us make the appropriate recommendations, because your healthcare coverage and insurance costs might very well be changing.  Could you give some more detail?\n\nWould this affect McKinley services and student health insurance?",
    "url" : "http://www.reddit.com/r/UIUC/comments/196h8c/very_important_student_insurance_town_hall/"
  }, {
    "id" : 15,
    "title" : "Unofficial 2013 is this week. Stay safe and know your rights. (re-posting tips from last year's post)",
    "snippet" : "From [last year's post](http://www.reddit.com/r/UIUC/comments/qbya6/lets_get_everyones_unofficial_tips_and_tricks_in/) (by /u/Dalimey100):\n\n1. Safety first and don't be a dumbass, I don't want to see any of you awesome dudes in hospital or handcuffs.\n\n2. If you are under 21, stay away from Green street, its crawling with cops and you can't get into bars now.\n\n3. If you can, buy alcohol off campus. Its significantly cheaper. If you're &lt; 21 and looking for someone to buy for you, ask someone to buy today or early tomorrow, nobody is going to want to buy stuff for other people on Friday.\n\n4. Walk in groups. Crime happens, and there's no easier target than a lone drunkard. Know the numbers of the campus PD and saferides/walks \n\n5. [this](http://i.imgur.com/rdIBH.jpg) gives some great help for dealing with cops and general safety (thanks /u/Helpful_guy).\n\n***\n\n&gt; Being drunk doesn't mean your behavior gets excused by everyone.\n\n\n&gt; Pace yourself. Eat lots. Don't forget about drinking water every once in a while to stay hydrated.\n\n\n&gt; Dont do simple dumb things, remember the age old rule \"Do one illegal thing at a time\" aka dont j-walk, climb shit, litter, etc.\n\n\n&gt; Another big thing is if you have a party to make sure no randoms are coming in. I was at a house party that was busted at Polar Bear (SIUC) this winter and the undercover cop was a woman posing as a sorostitute (minding she was a solid 8.5) so don't assume that kind of trickery does not happen here.\n\n\n&gt; I don't have any tips but the people who really lick their chops over unofficial are the tow truck drivers. If a sign says that you have to meet a certain criteria to be able to park (eg resident) don't risk it. You'll get towed.\n\n***\n\n[Laws to be aware of on Unofficial](http://www.reddit.com/r/UIUC/comments/185pax/any_laws_we_should_be_aware_of_on_unofficial/)  Here is some very good advice:\n\nhttp://www.youtube.com/watch?v=eDJrQBwJpqk\n\nhttp://www.youtube.com/watch?v=VyoDWeDwYRE\n\nhttp://www.youtube.com/watch?v=6wXkI4t7nuc\n\nDon't be afraid to ask, \"Am I under arrest?\" and follow that with \"I have nothing to say\" whether the officer states you are under arrest or not. Don't be fooled by police lying, ie \"If you don't tell me what's in that glass, I'm going to throw you in jail\". And don't lie to police.\n\nMany Champaign and County cops are complete douchebag losers. Don't let them get the upper hand by allowing yourself to be intimidated. 1000x this, never talk to cops. Here is some very good advice:\n\nhttp://www.youtube.com/watch?v=eDJrQBwJpqk\n\nhttp://www.youtube.com/watch?v=VyoDWeDwYRE\n\nhttp://www.youtube.com/watch?v=6wXkI4t7nuc\n\nDon't be afraid to ask, \"Am I under arrest?\" and follow that with \"I have nothing to say\" whether the officer states you are under arrest or not. Don't be fooled by police lying, ie \"If you don't tell me what's in that glass, I'm going to throw you in jail\". And don't lie to police.\n\nMany Champaign and County cops are complete douchebag losers. Don't let them get the upper hand by allowing yourself to be intimidated. Here is some very good advice:\n\nhttp://www.youtube.com/watch?v=eDJrQBwJpqk\n\nhttp://www.youtube.com/watch?v=VyoDWeDwYRE\n\nhttp://www.youtube.com/watch?v=6wXkI4t7nuc\n\nDon't be afraid to ask, \"Am I under arrest?\" and follow that with \"I have nothing to say\" whether the officer states you are under arrest or not. Don't be fooled by police lying, ie \"If you don't tell me what's in that glass, I'm going to throw you in jail\". And don't lie to police.\n\nMany Champaign and County cops are complete douchebag losers. Don't let them get the upper hand by allowing yourself to be intimidated. You know I have found that if I didn't do anything, cops are pretty nice to me.      anyone have the link to that police scanner webstream? that was enjoyable last year",
    "url" : "http://www.reddit.com/r/UIUC/comments/1953kg/unofficial_2013_is_this_week_stay_safe_and_know/"
  }, {
    "id" : 16,
    "title" : "Regular Show Unofficial Style shirts.",
    "snippet" : "  ",
    "url" : "http://www.facebook.com/events/553551991335537/"
  }, {
    "id" : 17,
    "title" : "Student Trustee Debates this Tuesday, 7PM in the Union's Pine Lounge",
    "snippet" : "From the SORF Board Chairman:\n\n\"The Illinois Student Senate and the SORF Board will be hosting a debate between the Student Trustee candidates this upcoming Tuesday, February 26th at 7pm in the Pine Lounge of the Illini Union.  The debate will be moderated by CSEC Chairman Joines, and will be attended by students from across campus - we encourage you to attend in order to hear what the Trustee candidates thoughts are on the most pressing issues facing the Student Body and the University.\"",
    "url" : "http://www.reddit.com/r/UIUC/comments/196k58/student_trustee_debates_this_tuesday_7pm_in_the/"
  }, {
    "id" : 18,
    "title" : "Volunteer at Read Across America this Saturday",
    "snippet" : "If you aren't too hungover from Unofficial, volunteers are needed at Read Across America this Saturday. It's a great, fun event aimed at young kids (pre-school through elementary, mostly) to encourage an early love of reading. Please consider helping out. If you're a member of a campus group that needs service hours, you can get verification for your time. I've helped with the event probably 5 out of the last 6 years, and it's great.\n\nAs shown in the facebook event page, please contact the volunteer coordinator, Carolee DeArmon (not me, I'm just trying to get the info out there) if you're interested.  Ok apparently I am not tech savvy enough to figure out how to properly post a link on my phone. Apologies. Here's the [link to the facebook page](https://www.facebook.com/events/334785689966431/?ref=25). Is this a weekly thing? Or just this Saturday?  What exactly would the volunteers be doing?",
    "url" : "http://www.reddit.com/r/UIUC/comments/195m74/volunteer_at_read_across_america_this_saturday/"
  }, {
    "id" : 19,
    "title" : "I just got accepted to the University of Illinois MFA Studio Art Program!",
    "snippet" : "I don't know if I'm going to go yet or not, but before I do I'm wondering what UIUC is like for graduate students... Socially? Places to live? Eat? Study? Art program? Art scene?\n\nIdeally I would be able to visit the campus before making my decision but since I am unable to make the trip from Florida I'm relying on you kind people of UIUC subreddit to tell me about your school!\n   Congratulations! \n\nThe arts scene is pretty great. I have some good connections in the art community, and if you want to talk privately, feel free to PM me. There are a lot of things to do, and many ways that you can get involved. There are some pretty great restaurants for such a small town. Lots of study places, depending on what you like. \n\nI'm originally from New York, but moved out here and am staying permanently. I like the town a lot. \n\nAs far as places to live, it depends on your budget and what kind of experience you want. As a grad student, I was happier visiting campus than living on it. But a lot of my friends wanted to live on campus, and stayed there. In general, Urbana is slightly \"artsier,\" and Champaign is more \"businesslike,\" but there are great places in each town to live. There are a ton of rentals available in houses a mile or so west of campus. \n\nFeel free to ask any questions. Thanks! I'm pretty excited! I know I definitely want to live off campus but close by and ideally in the artsy-fartsiest part of town. In my current city I live in the historical/art district and I really love that sense of community that comes with the location. Is there an area of Urbana that is specifically central to the art scene? Also, how is parking on Campus? If it isn't ridiculously competitive perhaps I could live a little further away from campus than I originally thought and commute. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1965iw/i_just_got_accepted_to_the_university_of_illinois/"
  }, {
    "id" : 20,
    "title" : "Found Wallet Sunday West of Bookstore",
    "snippet" : "Hello uiuc reddit, I have found a wallet on campus that belongs to a girl named, Shannon Parish. I tried Facebook to find her with no luck, the internet also turns up no results except for Deans List of some kind of academic excellence. I would love to return this to the owner as soon as possible because I'm sure she is looking for it. If you can give me any information please message me.\n\nTL;DR : Found and want to return a wallet belonging to a, Shannon Parish.  If you search on illinois directory on illinois.edu, it shows up an email address for that user. I don't know if personal information can be listed here so I'll pm you the address as well.  She went to my high school. I don't know her personally but I have friends who do so if you can't reach her by email like you're trying let me know. Why don't you contact her anyway?  That would be a good idea I just sent her a message on facebook so hopefully she'll get ahold of you soon. Still no contact from her. Do you think you would be able to get me a phone number?  I pm'd you. Thanks, but it wasn't the correct number. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/195le5/found_wallet_sunday_west_of_bookstore/"
  }, {
    "id" : 21,
    "title" : "Any redditors looking for roommate/s '13-'14?",
    "snippet" : "Hey r/uiuc! I'm a female going into senior year and I still haven't signed a lease yet for next school year. I'm looking for roommate/s for a house or apartment on/near campus for &lt;$400 rent. Pretty clean and quiet. Non-smoker. Figured redditors would make interesting roommates. So if you're looking, have a room to fill, or know of anyone, please let me know! :)  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1959ep/any_redditors_looking_for_roommates_1314/"
  }, {
    "id" : 22,
    "title" : "How is Pearlstein a professor?",
    "snippet" : "I'm using a throwaway because his ability to do calculations to 4 decimal places in his head downright scares me.\n\nBut seriously, this dude is batshit insane, his office looks like a tornado has gone through it (daily, for the past 10 years), and his lectures consist of incoherent rambling and him yelling at people. \n\nAm I getting my first taste of a terrible tenured professor?\n\nEdit: I almost feel bad because he just offered to set up a phone conversation with someone who might have a question that may not be suited for email.   What room and time is this class? I'm tempted to sit in just for the experience. MWF, 11 am, MSEB 100. Try not to look him in the eye.   I had him for fluids and he once went off on a kid for asking a question while chewing gum. The man is a genius, and batshit insane is a great way to put it.  Pearlstein is an interesting character.\n\nHad him for ME 300. He changed the problems in the book so that we would have to interpolate every value we got out of the charts for homework. He knew every ones name, and will hand your exam packets to you individually. For exams he will leave the room at the end of class and not accept any more tests after he has left (so get done early, it becomes the hunger games of people trying to put exams in his hands). I would feel like I learned something from each final (that I wished I had known when I was taking it). \n\nBut I did shit on the first exams(thinking back i guess it was average just the grades as a whole were low), managed aced the final and he gave me a good grade in the class so it appears that if he sees you improve/try he can be lenient. I am fairly sure he sets the average to a C- or a C so have fun with that.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/194duh/how_is_pearlstein_a_professor/"
  }, {
    "id" : 23,
    "title" : "Gave him a popchip outside the Union, and well, once he popped, he couldn't stop",
    "snippet" : "  Don't feed the god damn squirrels...\n\nNext time pop him a molly This is why they attack people... Don't feed the god damn squirrels...\n\nNext time pop him a molly Once I gave one a fruit from my fruitbowl, next thing I had been attacked and the fruit bowl was on the ground being devoured by the devil.    ",
    "url" : "http://i.imgur.com/XWtzFoV.jpg"
  }, {
    "id" : 24,
    "title" : "For those who studied abroad, how did you fund it?",
    "snippet" : "I'm wanting to go abroad over winter break, but am trying to figure out how to get the money for it. I was planning on doing the whole 'backpacking through Europe after graduation' deal but don't have the money for that, and this looks like a cheaper option. I currently don't have any loans/financial aid and don't want to jump on that boat first off. Any suggestions or tips?   potatoes    I did a 6-week summer program in Hiroshima, Japan, back in 2010. Apart from my own money and some help from my parents, I was actually able to snag a few scholarships. \n\n* The honors program awarded me $1,000 for the trip. Thanks, CHP.\n* I don't know which office you'll go through, but I studied through IPENG and thus was able to do a fellowship. I got half my airfare covered in exchange for a few volunteer hours and making a tri-fold poster for them to use at study abroad fairs. Things like that may not be available for short programs like what you want to do, but check with whichever office you use to see if they have anything like that.\n* The I4I scholarships are great. I got one for $500 for having a \"unique destination,\" but there are a whole bunch others. Check those out! Apply for them all!\n\nGood luck! kinda a tangent, but how did you like the program? That's actually one of the programs I'm looking at, but I'm trying to gauge if it's worth a couple thousand in addition to a normal tuition year. i'm pretty apathetic about credits, i'm just looking to have a good experience over a summer (or semester) because I've never left the US. It was absolutely fantastic! None of us really knew any Japanese before we went there except a few phrases we'd picked up from anime, but we had a phenomenal Japanese teacher at HIT (the Japanese university), and immersion did wonders for us. (I came back knowing more than enough to test out of JAPN 201 here.) We also took a culture class and a few small engineering seminars that would meet anywhere from once the whole trip or twice a week. We were also able to shadow some of HIT's clubs -- we got to try out kendo, tea ceremony, taiko, and tons more.\n\nThey also took us on weekend outings . We took a day trip to Miyajima where we saw SO MANY DEER and got to climb (for many of us) our first mountain. Another weekend, we went to the city and saw the atomic bomb memorial and museum at the Peace Park. And yet another time we got to visit an okonomiyaki sauce factory and try our hand at making our own okonomiyaki. \n\n[Here's a photo of me climbing that mountain.](http://sphotos-b.xx.fbcdn.net/hphotos-prn1/29322_401086946285_931246_n.jpg)\n\nWe also spent a ton of time shopping, going to karaoke, taking over arcades (seriously, 10 floors of games -- it was heaven), and drinking. We're still close with lots of the kids we met over there, and some of the Japanese kids have studied abroad here to get their own experience. \n\n**tl;dr** Program was AMAZING and I wish I had time and money to go back. Any more questions, ask away. :)  My sister is in Europe now. She worked. She also got scholarships but for the most part she used several years of her savings because it's a once in a lifetime thing. Pretty sure she's been to near twenty countries in her time there. How much money did she save up for it?   Gilman Scholarship. It's a 1 in 3 shot at up to 5,000 if you qualify.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/194cj4/for_those_who_studied_abroad_how_did_you_fund_it/"
  }, {
    "id" : 25,
    "title" : "Carmike Movie Theater?",
    "snippet" : "When did Carmike close? Does anyone know what happened? I bought a 2013 popcorn bucket!!!!!!  It shut down last week. I went and saw a movie there the week before so I know it was open then. I have an annual bucket too and was disappointed when i went to go try and catch a movie. What piqued my interest was how the theater was removed from everywhere online: Imdb, fandango, even carmike's own site don't list the theater as even existing :(\n \nMaybe there will be some opening specials to make up for our lost \"popcorn time\"   May have to do with the construction of the IMAX(I guess BIGD) portion of the theater. Maybe the phase they are in is not suitable to do business. It's supposed to be a major rebuild.  May have to do with the construction of the IMAX(I guess BIGD) portion of the theater. Maybe the phase they are in is not suitable to do business. It's supposed to be a major rebuild.  Isn't the theater in Savoy the one building IMAX? Or are they both? I can't believe we'd get two IMAX theaters in this area... Savoy is getting an IMAX, but they're still open. The one on north prospect is doing a total reconstruction, the whole thing will probably be torn down in a couple of weeks. Also, they're not getting an IMAX, they're getting whatever is one size smaller than an IMAX. I heard the whole thing wont be done until early-mid summer.\n\nI got some buddies that work(ed) at the beverley theater that told me about this stuff. &gt; they're not getting an IMAX, they're getting whatever is one size smaller than an IMAX. \n\nIMAX is about size? I always thought it had something to do with 3D, but now that I think of it, all IMAX theaters I have been to are huge. It's not really about \"size\", especially screen size. Yes, IMAX screens are larger, but can vary from theater to theater. What makes IMAX different is that they use larger film, with different cameras and projectors that lead to larger screen images and higher resolutions. So, the Beverly isn't getting a \"smaller IMAX\", but going with a different film format for their HD movies. &gt; they're not getting an IMAX, they're getting whatever is one size smaller than an IMAX. \n\nIMAX is about size? I always thought it had something to do with 3D, but now that I think of it, all IMAX theaters I have been to are huge. Isn't the theater in Savoy the one building IMAX? Or are they both? I can't believe we'd get two IMAX theaters in this area... Both are. The Savoy theater was open while they were doing the construction, but Beverly will be closed till summer. Open but limited screens. The whole left side is closed. So with no Carmike and limited play times if anyone is planning on seeing a movie they may want to get tickets in advance or show up early. May have to do with the construction of the IMAX(I guess BIGD) portion of the theater. Maybe the phase they are in is not suitable to do business. It's supposed to be a major rebuild.    On the bright side, now that it's closed, no one will get shot there! Beverly is notoriously shady. \nSource: I'm a townie On the bright side, now that it's closed, no one will get shot there! Beverly is notoriously shady. \nSource: I'm a townie On the bright side, now that it's closed, no one will get shot there! Beverly is notoriously shady. \nSource: I'm a townie What is shady about the beverly? I've lived here for over a decade, and I think North prospect is one of the least shady parts of town. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/193458/carmike_movie_theater/"
  }, {
    "id" : 26,
    "title" : "housing and furniture",
    "snippet" : "Is anyone graduating this semester and planning on selling their furniture?\nAlso. is anyone planning on moving out of a furnished studio/one bedroom and can you tell me what the average rent is per month including all utilities?\nThanks!!!\n    [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/193oe4/housing_and_furniture/"
  }, {
    "id" : 27,
    "title" : "Good Place to eat tonight?",
    "snippet" : "What's a good/interesting place to eat near campus?   If you like barbecue, Black Dog in Urbana is really good. They also have a nice late night menu on the weekends from 10:30pm-2am. What this guy said. The Black Dog is my favorite restaurant. It is seriously good (real) barbecue. The only drawback is it is frequently packed.  And yet we continue to tell EVERYONE we can about it (I do so myself too). We should be smart and try to keep it secret. Haha If you like barbecue, Black Dog in Urbana is really good. They also have a nice late night menu on the weekends from 10:30pm-2am.  Farren's in downtown Champaign. It's easy to take the bus there. Seaboat on Kirby. Crane Alley in Urbana. Also easy to take the bus there.    You can never go wrong with Dos Reales.      I had Rainbow Garden and it was the best chinese food I have had near campus. Cravings has on and off days and is too much of a risk for me.   Chopstix for Chinese. Cravings! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/193tuv/good_place_to_eat_tonight/"
  }, {
    "id" : 28,
    "title" : "Free Trap and Bass Show Tonight at Cowboy Monkey",
    "snippet" : "Noticed a bunch of people getting in to trap music lately with the explosion of the harlem shake videos. If you like that sound or just want to throw some trap bows it should be a good night of music. \n\nDoors open at 9\nFree before 11pm and $3 After. \n\nMusic from: \n\n* [###](https://www.facebook.com/poundpoundpound/app_108468622525037)\n* [Footwork](https://soundcloud.com/FOOTWORKMUSIK)\n* [Dj Belly](http://djbelly.com/feature/2010/12/07/promo_ep)\n* [The Interns](https://soundcloud.com/the-interns-music)\n* [epilep[c] ](https://soundcloud.com/epilepc)\n\n[Facebook Event](https://www.facebook.com/events/343737649074903/)",
    "url" : "http://www.reddit.com/r/UIUC/comments/1937sp/free_trap_and_bass_show_tonight_at_cowboy_monkey/"
  }, {
    "id" : 29,
    "title" : "Suburban Express at Northbrook Court",
    "snippet" : "Anyone know where the pickup location for Suburban Express at Northbrook Court is? Taking a bus from there and my ticket just says \"Northbrook Court\" for the \"Depart:\" section. No parking lot information or anything.\n\nPlanning to call them tomorrow morning as there office is closed at the moment - not sure if it's open on Sundays.",
    "url" : "http://www.reddit.com/r/UIUC/comments/1942qd/suburban_express_at_northbrook_court/"
  }, {
    "id" : 30,
    "title" : "My friends made a snow Pikachu!",
    "snippet" : "  I'm so glad it wasn't yellow.  Nice! Now where is this work of art On the quad, by Davenport    ",
    "url" : "http://i.imgur.com/P6jIBNq.jpg"
  }, {
    "id" : 31,
    "title" : "I am an employee of the U of I. Can I score a free (or cheap) copy of office 2013 anywhere?",
    "snippet" : "    Did you log in to the Webstore? Not sure if staff get any discounts.   in case you haven't considered, open office is a good alternative. (recently renamed to LibreOffice) Apache OpenOffice is still there. but I use LibreOffice. either is a good free alternative. (recently renamed to LibreOffice)  Here's the webstore link others have mentioned: https://webstore.illinois.edu/Shop/product.aspx?zpid=752  you should be able to get it for $10 using your illinois.edu email here: http://www.microsofthup.com/hupus/home.aspx?dialect_id=en-US&amp;country_id=US\n\nThis goes for anyone with an illinois.edu email.  Even if you no longer go to the school but have a permanent email that ends in illinois.edu like law.illinois.edu you should be able to get it for $10 using your illinois.edu email here: http://www.microsofthup.com/hupus/home.aspx?dialect_id=en-US&amp;country_id=US\n\nThis goes for anyone with an illinois.edu email.  Even if you no longer go to the school but have a permanent email that ends in illinois.edu like law.illinois.edu    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/19362y/i_am_an_employee_of_the_u_of_i_can_i_score_a_free/"
  }, {
    "id" : 32,
    "title" : "The Quad last night.",
    "snippet" : "  FUCK. Did anyone notice that huge, black rocket launching to the west of the Union? How about the UFO if you look straight up?  I found a rip in the space time continuum  - http://imgur.com/Z2AhiRt   Approximately what time did you take this?  I was walking through this area at about 7:30 and it seemed way worse than this.  I was walking from the Psychology Building to ISR and it was so windy that I had to either attempt to run or simply not move.  Was definitely an experience trying to get back to ISR with all of that wind walking through the snow.       ",
    "url" : "http://360.io/BbFfB7"
  }, {
    "id" : 33,
    "title" : "Why doesn't this guy wear shoes in winter?",
    "snippet" : "  Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. &gt;super cool, very chill Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Doesn't he worry about broken glass along busier streets? Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I. Haha I know him -- he's super cool, very chill. And honestly, he's very open to people who ask him about it (I've seen probably 3 people ask him about it).\n\nHe prefers to not wear shoes as he finds it more comfortable and healthier for hisfeet. I asked him once if he ever wore shoes (aside from when he's forced to, like going grocery shopping); he said he tries to go as long as he can...until he gets frostbite. Then he'll wear shoes. Braver soul than I.  probly because he's a smelly hipster from urbana probly because he's a smelly hipster from urbana probly because he's a smelly hipster from urbana probly because he's a smelly hipster from urbana  Why don't you ask him? But...it's easier to take a photo from far away and make fun of him online so that I can hide my social awkwardness!  More and more evidence has found that the shape of our bare feet, molded by centuries of evolution, have whittled it down to near perfection. Meaning we don't really need shoes.  More and more evidence has found that the shape of our bare feet, molded by centuries of evolution, have whittled it down to near perfection. Meaning we don't really need shoes. ",
    "url" : "http://imgur.com/ISb5pSz"
  }, {
    "id" : 34,
    "title" : "Holy shit the Illinois Student Senate spent $8000 to provide .7% of undergrads with I-Clickers",
    "snippet" : "  It says they used $8000 to buy 200 iClickers that are about $20 each... what the fuck happened to the other $4000? The ISS bought iClicker 2's, because some classes require the newer version. They cost $40 a piece.\n\nKeep in mind that it's a loaner program, so the iClickers get returned in May and will be reused. [deleted] [deleted] [deleted]     If you rent something for free, it's not really \"rent\" anymore, is it?\n\nI also don't know much about these stupid devices, but if every student is required to have one, wouldn't it be simpler for university to give it to students in a centralized way? You want to give a 40 (for new versions) and 20 (for old versions) to EVERY undergrad? That's far more than the money spent here. They could just rent them out for each class that requires them and make buying one optional. Put down a $20 deposit, return it at the end of the semester. You want to give a 40 (for new versions) and 20 (for old versions) to EVERY undergrad? That's far more than the money spent here. Maybe if the university has to pay for them instead of students, they will think twice about whether the clickers are actually useful? Why would the University agree to ever do that?  If you rent something for free, it's not really \"rent\" anymore, is it?\n\nI also don't know much about these stupid devices, but if every student is required to have one, wouldn't it be simpler for university to give it to students in a centralized way?  Of course maybe the school shouldn't allow courses to use a glorified paperweight. iClickers are a good idea... if they're used properly.\n\nUsing them just to take attendance isn't that great of an idea (instead of forcing students to come to class, just ensure that lecture is a good use of their time), but using them to quickly assess if the class is understanding certain material is really nice. \n\nBut this is a bit off the point of what the article is about anyway. Of course maybe the school shouldn't allow courses to use a glorified paperweight. Of course maybe the school shouldn't allow courses to use a glorified paperweight. And mandatory software packs, don't forget that wonderful innovation. Yeah... I bought the required courseware for a Mathematica class I'm in this semester. Haven't used it once. $25 wasted. You know you can use Mathematica for free via EWS computers, right? Yeah, this isn't the Mathematica program. It's just a bunch of lousy Mathematica files that are supposed to teach you how to use Mathematica.",
    "url" : "http://www.dailyillini.com/news/campus/article_7be6f3ac-7cb0-11e2-b09d-0019bb30f31a.html"
  }, {
    "id" : 35,
    "title" : "Racial Intolerance on Campus",
    "snippet" : "I was walking on green and fourth and a couple of guys in a minivan started to yell out their window and say things like \"Nice ass slumdog\" or \"Go back to your shitty country\" etc. This didn't happen just once - they drove back and yelled more racially charged stuff. At this point, It seemed like it was way more than just a \"joke\" or a harmless prank because they actually turned around to come back and say more stuff.\n\nHow many of you guys have been subject to people talking to you like this? This isn't the first time this has happened to me so I'm curious about you others on here.  If you remember any identifying information, you might want to consider reporting it. Policies and procedures are listed in the [Campus Administrative Manual](http://cam.illinois.edu/ix/ix-b/ix-b-3.htm), with these excerpts about reporting procedures being relevant:\n\n1. \"Individuals alleging violation of the policies herein are encouraged to report the alleged violation immediately upon experiencing the alleged misconduct or learning of the alleged misconduct. Individuals reporting alleged or suspected violations of this policy during non-business hours or University designated holidays should contact the Office of Diversity, Equity, and Access at (217) 333-0085 or diversity@illinois.edu, or the Emergency Dean at (217) 333-0050 for student-related matters.\" \n\n1. \"Students alleging discrimination or harassment allegedly committed by a student in their capacity as a student may submit a report as specified in this policy or by contacting the Office for Student Conflict Resolution. Such complaints should be referred to the Office for Student Conflict Resolution at (217) 333-3680 or conflictresolution@illinois.edu for investigation and resolution under the student disciplinary system procedures.\"\n\nNot sure what will be the procedure if the offender is not a UIUC student/employee or if you don't know the person and can't identify them.  I'm asian and it's happened to me several times before. Sometimes they yell out of windows of cars or out of balconies. Idk why some idiots do this.   I'm asian, and I've never been treated like this. Next time this happens, I guess you can call the cops. But if you call the cops, how would it work? You call them and say some people shouted racial slurs from a moving vehicle? Are the cops going to try to find them and chase them in a police car? If they catch them, what will they do? Give them a warning or a ticket? Will they be charged with a crime? What crime? Will it be a misdemeanor? It's probably not worth your time to deal with people like that. But if you really wanted, calling the cops is one thing you can do. If victims started doing that, at least people would be more careful before they bully someone in public.\n\nI'm not sure what the legal consequences would be if they get caught. But I'm guessing it will at least be treated like a verbal abuse or harassment. But if you call the cops, how would it work? You call them and say some people shouted racial slurs from a moving vehicle? Are the cops going to try to find them and chase them in a police car? If they catch them, what will they do? Give them a warning or a ticket? Will they be charged with a crime? What crime? Will it be a misdemeanor? I'm asian, and I've never been treated like this. Next time this happens, I guess you can call the cops. i don't know so many minorities are so sensitive about racial issues. if someone said some bullshit to you, just ignore. \n\nthe fact is, white people are the biggest victims of racists. because people think: \"racist towards white people do not count as racist.\"  so even in public, minority people can tell racist jokes toward white people but white people can not do the opposite.\n i don't know so many minorities are so sensitive about racial issues. if someone said some bullshit to you, just ignore. \n\nthe fact is, white people are the biggest victims of racists. because people think: \"racist towards white people do not count as racist.\"  so even in public, minority people can tell racist jokes toward white people but white people can not do the opposite.\n   By no means am I condoning their actions, or saying that you do this, but often you will see groups of people that are all of the same ethnicity. The most common is probably your pack of about 10 Korean girls all walking in a line, blocking the entire sidewalk and not speaking a word of English. This type of activity is just a target for people like the ones you mentioned.\n\nFor anyone who only hangs out with people with the same skin color as you - go out and meet everyone! By no means am I condoning their actions, or saying that you do this, but often you will see groups of people that are all of the same ethnicity. The most common is probably your pack of about 10 Korean girls all walking in a line, blocking the entire sidewalk and not speaking a word of English. This type of activity is just a target for people like the ones you mentioned.\n\nFor anyone who only hangs out with people with the same skin color as you - go out and meet everyone!  Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. The farm boy from Fithian, IL who [attacked a Sri Lankan professor at Illinois Terminal](http://www.news-gazette.com/news/courts-police-and-fire/2011-12-08/bond-500000-attack-ui-professor.html) a year back was not all that harmless. You never know what they will do when they are [on meth](http://commercial-news.com/local/x1940557927/County-man-arrested-in-Champaign). Anyone on meth can be dangerous.  Now you're just being racially intolerant of farm boys. Racism + meth = Hate crime Anyone on meth can be dangerous.  Now you're just being racially intolerant of farm boys. It's not the same thing. Yes, anyone on meth is dangerous. However, when that person attacks you because of your race it means you are exposed to danger for your appearance not because you are anybody. What does any of this have to do with farms? There's a stereotype that people from rural areas are racially intolerant. I.e, farm boys will shout racial slurs at you from truck windows.  That's my point, lets stop racial intolerance by perpetuating other racial stereotypes, great plan! 'farm boys' is not a 'racial' stereotype\n If we're getting that specific,  \"Go back to your shitty country\" isn't racist either. 'farm boys' is not a 'racial' stereotype\n Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. As generalizing as this comment is; there is some truth to it.  I went to high school with a ton of people in a small town near here who would just consider it entertainment to drive down Green Street and yell at people who weren't white.  I would always hear about it in school on Monday.  It was disgusting. Nearly all the people I know who grew up in small rural towns have confirmed this whenever asked about it. Nearly all the people I know who grew up in small rural towns have confirmed this whenever asked about it. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless. Farm boys. Get out once in awhile. Nothing to do in the winter. Harmless.  are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? are you indian? i am chinese. i have never been treated like this. people are really nice here.\ni guess it may because chinese always hang out with chinese. lots of time, chinese students walk together, study together, eat together --- kind like a gang... ( by \"gang\" i mean a group of people, not the mafia... ) chinese here are united...\n\nif this thing happened to me, i, together with my friend will yelled back. take picture, and my super smart friend will use photoshop humiliated him , and distribute the picture all over internet. we will also use the google image search to find his identity and then find his facebook, find his twitter, or even his address, then we will post those dirty pictures on his wall, or go to his room, ring the bell, fake we are UPS guy, and sing this song  (http://www.youtube.com/watch?v=G9PnNW56bp0  adapted version) at the door \n\nbut but but this is just my imagination, in real life what will happen is i just ignore him because\ni am richer than him, i am smarter than him, my parents will pay my tuition... from all perspective, i will be even richer and even more successful in my bright future, why do i even care this bullshit? Don't understand why you're being down voted. Perfect response. For me it's that it sounds just as racially intolerant as the Op is talking about if not even more immature.  this one time in bandcamp, i had my feelings hurt",
    "url" : "http://www.reddit.com/r/UIUC/comments/191hv7/racial_intolerance_on_campus/"
  }, {
    "id" : 36,
    "title" : "Official Plans for Unofficial",
    "snippet" : "  ",
    "url" : "http://imgur.com/EWw08Tw"
  }, {
    "id" : 37,
    "title" : "Overheard some girl say this on the bus today...",
    "snippet" : "  I'm from the Bay Area, CA so I kind of feel that way actually.. I kind of feel that way too. I'm from southern california, and it will be a normal February day there tomorrow - 76 degrees and partly cloudy. &gt;a normal February day there tomorrow - 76 degrees and partly cloudy.\n\nWeather. I'm from the Bay Area, CA so I kind of feel that way actually.. I'm from the Bay Area, CA so I kind of feel that way actually..  she also said she was from Chicago, so literally no defense. Yeah she wins the dumb ass of the week awkward.  This is probably the most snow I have seen, I am from California though  Well, I'll play devil's advocate.  In high school, you stay in one building the whole day long.  At least, that's how most schools where I grew up were.  (Also near Chicago.)  The only times I went outside were to get to the car to go to school, and getting out.  Or riding my bike to school on good days.  I swam, which meant that I was at school from before 6 until 6 pm.  So I actually didn't go outside much at all in high school.  Therefore, its easy for me to believe that she didn't experience weather much, although the phrasing was silly on her part.     Sounds like something Perry would say.",
    "url" : "http://imgur.com/ECuAHlC"
  }, {
    "id" : 38,
    "title" : "Scumbag CUMTD",
    "snippet" : "    I swear, in the three years I've been here, not **once** have I ever seen CUMTD display that message when the weather was actually nice (or even sunny, for that matter). I swear, in the three years I've been here, not **once** have I ever seen CUMTD display that message when the weather was actually nice (or even sunny, for that matter).   Haha, I just saw this on the way home. Smartass. It did actually get me to smile, but then I just got mad.   Who controls these messages? I hope the CUMTD employee who posts here sometimes comes to tell us!  CJS7070 is on the right track. All buses are loaded with every possible route destination sign. This includes all of our fixed-routes as well as messages like \"Not In Service,\" \"Training Bus / Do Not Board,\" and the public relations messages you all are referring to. MTD Staff usually review the messages once a year and make edits as needed for a full fleet reload.\n\nOperators punch in the code for the corresponding route they are driving. Dispatchers will alert the fleet if a \"PR\" message is to be added that day. An example is during home games, as darklinggg alluded to, MTD may decide to run the message \"Beat Purdont\" for the next day's football game against Purdue.\n\nDrivers can act on their own will, and sense of humor, and in this case one chose to punch in \"Smile It's Sunny\" during yesterday's winter weather storm. Thanks for the interest and for riding MTD!  Who controls these messages? Who controls these messages? The driver. The mtd has a bunch of pre-loaded messages that the drivers can choose from using the console above their seat.        gr8 job",
    "url" : "http://imgur.com/JeaJ3iN"
  }, {
    "id" : 39,
    "title" : "What my buddy and I did last night.",
    "snippet" : "  ",
    "url" : "http://i.imgur.com/cO5VP7b.jpg"
  }, {
    "id" : 40,
    "title" : "There is a tiny snowball man congregation on the quad worshipping their larger god.",
    "snippet" : "I figured at least some of you guys would help add to it.\n\nThere's not much snow left to make the snowball men, but go check it out! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/191heo/there_is_a_tiny_snowball_man_congregation_on_the/"
  }, {
    "id" : 41,
    "title" : "Anyone from Bromley have an extra ticket to the Hawks in St Louis next Thursday?",
    "snippet" : "I'm desperately trying to find one. My friend dropped the ball on letting me know when they went on sale to the general student population. If anyone knows anyone who needs to get rid of a ticket, please pm me!  they're not sold out... I called just an hour ago, they said they were. Where do you see they're not?",
    "url" : "http://www.reddit.com/r/UIUC/comments/191syc/anyone_from_bromley_have_an_extra_ticket_to_the/"
  }, {
    "id" : 42,
    "title" : "UIUC WinterWonderland ",
    "snippet" : "   ",
    "url" : "http://www.youtube.com/watch?feature=player_embedded&amp;v=B9VVEBMgzSI"
  }, {
    "id" : 43,
    "title" : "Anyone having troubles with the Suburban Express website?",
    "snippet" : "I'm looking to buy tickets for Spring Break, but it always says that there are no trips available. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/191wrk/anyone_having_troubles_with_the_suburban_express/"
  }, {
    "id" : 44,
    "title" : "This greeted me on sixth street when I got off work",
    "snippet" : "  NSFW? Really? Yeah I was at least expecting to see some tits, total letdown.   Then some drunk guy came along and screamed \"Fuck you snowman!\" and pushed it over while his friend screamed \"NOOOOOOOOOO!!!!\"\"\"\n\nThe aftermath: http://i.imgur.com/wnUwZRs.jpg technically it's a snow woman   Did you try and take her home? She was totally askin for it ;) She would melt in his arms.   My roommates+neighbors did that =]\n\nUnfortunately I missed out due to work at a horrible men's basketball game I'm sorry their work was destroyed :/",
    "url" : "http://imgur.com/EtXxVSo"
  }, {
    "id" : 45,
    "title" : "Can anyone recommend a good physical trainer in the area?",
    "snippet" : "Particularly for running injuries.  I've tried the Sportwell Center in the past, but it ended up setting me backwards instead of forwards in terms of injuries.  Carle has a sports medicine department if you were interested in going that route.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/191856/can_anyone_recommend_a_good_physical_trainer_in/"
  }, {
    "id" : 46,
    "title" : "Saw this 6' Snowman celebrating Thirsty Thursday.",
    "url" : "http://imgur.com/zcuCxsA"
  }, {
    "id" : 47,
    "title" : "JOHN DIES AT THE END starts at The Art Co-op tonight at midnight!",
    "snippet" : "For those of you who like Cabin in The Woods and Fear and Loathing in Las Vegas, this movie will be right up your alley. Based on the cult book by John Wong, this movie is absolutely one of the weirdest horror/sci-fi movies to come out in a while. Grab a Soy Sauce from the concession stand, and join in the festivities. A live mentalist will be at Friday and Saturday's midnight shows demonstrating his craft! The Onion calls this movie \"A PUNK ROCK GHOSTBUSTERS BY WAY OF H.P. LOVECRAFT\" Hope to see you there! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/190n0t/john_dies_at_the_end_starts_at_the_art_coop/"
  }, {
    "id" : 48,
    "title" : "View outside 309 E Green Champaign (Snow)",
    "snippet" : "      I would mock your panorama skills, except mine at even worse  This is where I have confirmation that even you Yankees take pictures of snow. Judging by his post history, he's indian",
    "url" : "http://i.imgur.com/uEqvJ2O.png"
  }, {
    "id" : 49,
    "title" : "6 foot snowman by the Krannert Art Museum",
    "snippet" : " ",
    "url" : "http://imgur.com/a/1Fdbz"
  } ],
  "processing-time-source" : 84,
  "processing-result.title" : "uiuc0_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/uiuc0_reddit.xml"
  }
}