{
  "processing-time-total" : 1691,
  "clusters" : [ {
    "id" : 0,
    "size" : 7,
    "score" : 45.233598772991286,
    "phrases" : [ "Play" ],
    "documents" : [ 7, 12, 21, 24, 31, 48, 49 ],
    "attributes" : {
      "score" : 45.233598772991286
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 27.34601841715163,
    "phrases" : [ "A's for every Class" ],
    "documents" : [ 1, 4, 6, 8, 22, 27 ],
    "attributes" : {
      "score" : 27.34601841715163
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 36.68605478209613,
    "phrases" : [ "Games" ],
    "documents" : [ 6, 7, 16, 33, 46 ],
    "attributes" : {
      "score" : 36.68605478209613
    }
  }, {
    "id" : 3,
    "size" : 4,
    "score" : 37.85371968872555,
    "phrases" : [ "Company" ],
    "documents" : [ 8, 23, 26, 36 ],
    "attributes" : {
      "score" : 37.85371968872555
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 36.50181132027209,
    "phrases" : [ "Manager" ],
    "documents" : [ 8, 41, 44, 46 ],
    "attributes" : {
      "score" : 36.50181132027209
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 78.75683154815975,
    "phrases" : [ "Ticket Looks" ],
    "documents" : [ 21, 26, 30, 33 ],
    "attributes" : {
      "score" : 78.75683154815975
    }
  }, {
    "id" : 6,
    "size" : 3,
    "score" : 27.482585328724436,
    "phrases" : [ "Computer" ],
    "documents" : [ 4, 8, 19 ],
    "attributes" : {
      "score" : 27.482585328724436
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 33.33311835702345,
    "phrases" : [ "Decided" ],
    "documents" : [ 36, 42, 47 ],
    "attributes" : {
      "score" : 33.33311835702345
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 41.62517115426054,
    "phrases" : [ "Email" ],
    "documents" : [ 8, 11, 15 ],
    "attributes" : {
      "score" : 41.62517115426054
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 76.0737483838931,
    "phrases" : [ "Illinois Student Senate" ],
    "documents" : [ 32, 40, 47 ],
    "attributes" : {
      "score" : 76.0737483838931
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 70.12902943134658,
    "phrases" : [ "Meeting" ],
    "documents" : [ 8, 28, 47 ],
    "attributes" : {
      "score" : 70.12902943134658
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 48.65733277090911,
    "phrases" : [ "Selling" ],
    "documents" : [ 9, 21, 43 ],
    "attributes" : {
      "score" : 48.65733277090911
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 39.378182822429736,
    "phrases" : [ "Space" ],
    "documents" : [ 17, 36, 45 ],
    "attributes" : {
      "score" : 39.378182822429736
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 79.83688127722507,
    "phrases" : [ "Valentine's Day" ],
    "documents" : [ 14, 15, 24 ],
    "attributes" : {
      "score" : 79.83688127722507
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 40.86660190450758,
    "phrases" : [ "Coffee" ],
    "documents" : [ 5, 41 ],
    "attributes" : {
      "score" : 40.86660190450758
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 65.7006281505966,
    "phrases" : [ "Harlem Shake Video" ],
    "documents" : [ 35, 37 ],
    "attributes" : {
      "score" : 65.7006281505966
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 45.287039652904056,
    "phrases" : [ "Lincoln Hall" ],
    "documents" : [ 35, 38 ],
    "attributes" : {
      "score" : 45.287039652904056
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 55.38371528140067,
    "phrases" : [ "Physics Program" ],
    "documents" : [ 8, 10 ],
    "attributes" : {
      "score" : 55.38371528140067
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 35.41993190158561,
    "phrases" : [ "Special" ],
    "documents" : [ 20, 40 ],
    "attributes" : {
      "score" : 35.41993190158561
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 49.65180559827628,
    "phrases" : [ "Typo" ],
    "documents" : [ 13, 47 ],
    "attributes" : {
      "score" : 49.65180559827628
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 38.966687436161024,
    "phrases" : [ "Venue" ],
    "documents" : [ 21, 48 ],
    "attributes" : {
      "score" : 38.966687436161024
    }
  }, {
    "id" : 21,
    "size" : 8,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 2, 3, 18, 25, 29, 34, 39 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1636,
  "documents" : [ {
    "id" : 0,
    "title" : "New UI Dining app for Android and iOS",
    "snippet" : "  This isn't necessarily new. It's just and update. They added a feature to check your balance which is a very nice improvement.  This isn't necessarily new. It's just and update. They added a feature to check your balance which is a very nice improvement.    Do you guys still get nut encrusted pork loin every other day? ",
    "url" : "http://www.housing.illinois.edu/app"
  }, {
    "id" : 1,
    "title" : "Best Caffeine Pills?",
    "snippet" : "Vivarin or generics... need something to get me through MT season... any thoughts?    Ummm... just don't.  Get sleep.  You can do it.  I'm going to be graduating undergrad in 4 years total with a Masters in CS and I sleep 9 hours a day... you will be more productive overall and anything else is just trading your health for grades, a really bad idea in the long run. I can't stand this response. It's possible to get through any program here sleeping 12 hours a day. You just can't do anything else. If you'd actually like to push yourself and take advantage of the ridiculous tuition, *try*. It gets easier in a couple months, and you're actually doing shit. Not sure I agree.  I feel I do more than most of my peers here.  I tend to do 15 hours of all technical classes per semester, plus a 20 hour a week part time job and an EOH exhibit.  Sure I'm not really in RSO's (except a few brief ACM stints), but like I said I have a plenty active social life on top of the resume crap.  I actually get much more done sleeping 7-9 hours than I did sleeping 3.  That's not to say that I never pull the odd all-nighter when deadlines pile up, but I really think that your cognitive skills decrease with lack of sleep and though you can convince yourself you're doing more you're actually limiting academic performance and in my experience mental health (I've had some pretty intense depersonalization periods after a few months of &lt;3hrs/night). Like I said, it gets better after a couple months. And there are plenty of ways to avoid the dead end thinking that happens during severe sleep deprivation, not the least of which is doing work with classmates. I'm extremely active in a number of RSOs, while founding another. It makes it worth it. That being said, I've also been sick relatively often, and the crashes over breaks are hard. So there may be a better middle ground. Ummm... just don't.  Get sleep.  You can do it.  I'm going to be graduating undergrad in 4 years total with a Masters in CS and I sleep 9 hours a day... you will be more productive overall and anything else is just trading your health for grades, a really bad idea in the long run. [deleted] I consider my social life just fine.  Plenty of friends and a relationship that takes up quite a bit of my time. Then you are a more efficient man than I.      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18q837/best_caffeine_pills/"
  }, {
    "id" : 2,
    "title" : "Help the Student Senate create a more efficient/accountable student government (referenda petition)",
    "url" : "https://illinois.edu/fb/sec/632204"
  }, {
    "id" : 3,
    "title" : "NPRE 402 Midterm advice?",
    "snippet" : "So the first midterm for NPRE 402 is tomorrow, and I'm wondering what it'll be like. Obviously this class gets recommended as an easy tech elective for engineers and I've been doing fine on the homework so far. However, I have no clue what the exam will actually be like, because Ragheb doesn't mention anything about the format and the TAs only say that its mostly calculations. \nI've gone over the past homework and made sure I can do them, but still concerned as to what's expected from us. Will studying the homework cut it? I feel like I haven't done enough to prepare but I don't know what else I could do other than go over the homework and the notes again.\n\nAnyone else take this class recently? Any help on what to expect in terms of format? Any help is much appreciated.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18qcs6/npre_402_midterm_advice/"
  }, {
    "id" : 4,
    "title" : "Has anyone taken Math 416 with Dutta?",
    "snippet" : "The first midterm is coming up this week and I was wondering if any of you would be able to comment on his exam difficulty and grading. Thank you!  i took 415 with him. So this isn't exactly the same but I\"ll make some comments anyway. His tests weren't too bad. Since it was 415 there was a lot of computational questions which if you practiced did not take long at all. The proofs were also a breeze having taken 347 I was used to those kinds of things. So all in all I think he was a fair grader. But of course this is a completely different class. So YMMV.\n\nDoes he still do that thing were he says \"isn't it?\" a lot? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18pabr/has_anyone_taken_math_416_with_dutta/"
  }, {
    "id" : 5,
    "title" : "Where can I get late night coffee on campus?",
    "snippet" : "Studying late sometimes, need coffee to function. Anyone know where I can get some late nights?  Merry-Ann's diner is probably your best bet. Or IHOP.  But both will have lots of drunk people. Or IHOP.  But both will have lots of drunk people. Merry-Ann's diner is probably your best bet. I guess they didn't specify that they wanted *good* coffee you aren't going to find that anywhere on campus that isn't paradiso  I wish I knew about this when I was still in school - http://www.amazon.com/Aerobie-AeroPress-Coffee-Espresso-Maker/dp/B0047BIWSK/ref=sr_1_1?ie=UTF8&amp;qid=1361116153&amp;sr=8-1&amp;keywords=aeropress Looks like a glorified syringe. It makes a fantastic cup of coffee and is cheap and portable. Even most of the snobs at r/coffee agree. It makes a fantastic cup of coffee and is cheap and portable. Even most of the snobs at r/coffee agree.     [deleted]  If you've got a meal plan, the Caffeinator is open till 1. Not super conveniently located, but it's an option. cafe credits can be used there?   Define 'late'. Are you talking past midnight, or just at like 11 at night? Im talking 1:30 am   caffeine pills, yo caffeine pills, yo",
    "url" : "http://www.reddit.com/r/UIUC/comments/18oju7/where_can_i_get_late_night_coffee_on_campus/"
  }, {
    "id" : 6,
    "title" : "Does anyone have experience with being readmitted after being dropped?",
    "snippet" : "Basically I was just wondering if anyone had personal experiences with this situation. I myself was dropped from EE after Spring '12 and have found that I really don't have a lot of people to go to to talk about the situation. I'm starting to put together my petition to return now and I just get nervous thinking about whether or not I'll be readmitted to EE. Any stories or experiences welcome!  Returning students definitely happen! Be very forthright about what you changed in the last year that makes it more likely that you will make it this time. Any changes you've made that make you sound more like an \"adult\" are very good. Did you make any changes like this?\n\nGood luck! Yes, I am doing my best to make positive lasting changes. I took up a volunteer opportunity at the Champaign library, found employment, and I am taking relevant classes at Parkland (Calc3,Phys 212,213,214,CS125). Although I am running out of classes to take since I transferred to UIUC as a sophomore having already been an undergraduate engineer at another big University. My biggest worry is that making the required changes in how I approach class, homework, studying has been a bumpy road. Prior to the '11-'12 school year most things had come very easily to me and thus I really didn't see education as a challenge but more of an obstacle to a job. I actively cut corners and rarely did work outside of class. It has been battle but I am making great strides in how I approach work for class and also how to overcome difficult parts in the material. Most importantly for me though was the overall change in how I view education. My time away from the University has been humbling. The only problem has been that initially I thought I would give them a perfect transcript from Parkland (full loads, straight A's- something that couldn't be questioned), and now there is a B or two sitting in there along with an online class I dropped with a W and it worries me. I'm pretty settled in Champaign now and I would not like to move again (having already transferred once). \n\nedit: Thank you for the response by the way. It really is nice to talk to someone about this stuff in a relaxed way. It is kind of a taboo thing to talk about with fellow students and the faculty(folks at Everitt and Engineering Hall) can vary on their degree of helpfulness. Dude, this sounds exactly like my story, except for the transferring part. I'm at community college right now too, and I expected to get straight As but I ended up doing just as bad as I had been doing at U of I, two Ds and a B last semester, not even a full time student. I had such a good work ethic in high school too, mainly because it was just so much easier. I'm getting my associates degree at the end of this semester. Yes, I am doing my best to make positive lasting changes. I took up a volunteer opportunity at the Champaign library, found employment, and I am taking relevant classes at Parkland (Calc3,Phys 212,213,214,CS125). Although I am running out of classes to take since I transferred to UIUC as a sophomore having already been an undergraduate engineer at another big University. My biggest worry is that making the required changes in how I approach class, homework, studying has been a bumpy road. Prior to the '11-'12 school year most things had come very easily to me and thus I really didn't see education as a challenge but more of an obstacle to a job. I actively cut corners and rarely did work outside of class. It has been battle but I am making great strides in how I approach work for class and also how to overcome difficult parts in the material. Most importantly for me though was the overall change in how I view education. My time away from the University has been humbling. The only problem has been that initially I thought I would give them a perfect transcript from Parkland (full loads, straight A's- something that couldn't be questioned), and now there is a B or two sitting in there along with an online class I dropped with a W and it worries me. I'm pretty settled in Champaign now and I would not like to move again (having already transferred once). \n\nedit: Thank you for the response by the way. It really is nice to talk to someone about this stuff in a relaxed way. It is kind of a taboo thing to talk about with fellow students and the faculty(folks at Everitt and Engineering Hall) can vary on their degree of helpfulness. If I was the readmission person in charge of reviewing your application, and you said exactly what you just said, I would have no problem with bringing you back in. Further, you admit that there were some classes you had difficulty with. That's no biggie. I did community college for a few semesters and not everything was As. As long as you're upfront about it, and explain what was difficult, I bet you'll be good (I had problems with discrete math, it just wasn't my forte). I do hope to write something similar in my petition although in the actual directions for the petition it warns against superficial claims. This makes me worry that some of the stuff won't be taken seriously when it's actually huge change/improvement for me. Either way your post made me feel good and a little more optimistic! Thank you!  Yes.  I made an appointment to talk to the department's Dean personally, so I could talk over the circumstances that had led to my awful semester, the game plan for improving my performance and keeping myself on track, and generally just try to make the best impression possible.  It worked.  I was dropped in spring 12 also, and I'm trying to transfer to UIC because I think it might be easier to get into. Am I wrong? Is it still the same process since it is within the University of Illinois system? I never looked into UIC.\n\nedit: By same process I mean; do you fill out a petition or is it like applying to any other University? I think it's like applying to another University. They do ask if you've been in the U of I system to provide your UIN, so it's different in that aspect. Hopefully since I've been in the system they'll accept me.  I was dropped and readmitted in 2004. I had some time to show that I had become more responsible and was ready to make the appropriate commitment. Before reapplying I spoke with a counselor who reminded me that I was let into the university originally because they thought I was capable. Focusing on your growth and changes you've made, as Hippity suggested, is really sound advise. Remember your previous success and don't doubt you can do it. I was nervous reapplying but when I got back in, it was like a new lease on life. Good luck! Numerous counselors have given me the exact same advice. Whenever I get down on myself I think about that and it gives me hope. They let me in this University once, it shouldn't be unreasonable to think that I could make it back. It's nice to hear from someone who made it back! Thanks!  Yep. I did just that and an in my 1st full year back after doin a year at a CC. I spoke to my counselor during the reapplication period to make sure all my T's were crossed and I's dotted, and I heard back within around 2 weeks. If you can give them some solid and legitimate reasoning behind why you were dropped and how you plan to change that I've heard the odds are typically good for readmittance.  Just wondering. What do you mean by crossing T's and dotting I's? I've spoken with the secretary for the deans at engineering hall about getting the actual petition form and then again to clear up some questions I had, but I've never actually sat down and talked my situation through with someone.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18nbvy/does_anyone_have_experience_with_being_readmitted/"
  }, {
    "id" : 7,
    "title" : "Anyone play poker?",
    "snippet" : "I'm looking for a regular (weekly?) NLHE game.  Not super fussy about the stakes, just looking to get out of the house an have some fun with a good group.  I prefer cash games to tourneys, but am open to whatever.  Anyone know of a game that might have a seat available?   you missed a huge boat back in '04-07, our school produced a lot of top cash players and some even joined those \"instructor\" sites.\ni still remember daily cash games in carr hall with the RA. every thursday friday the asians had cash games in both lounges in FAR. there was a game everywhere, all student orgs would host poker tourneys as charity events, there were .50/1 &amp; 1/2 games every 3 blocks. \n\ni don't know what happened by towards the end of my tenure, the school started cracking down everywhere, dorm games were done, all orgs were reprimanded if they hosted and there were obviously fewer cash games.\n\nfor those that are in school now, how is the current popularity?  you missed a huge boat back in '04-07, our school produced a lot of top cash players and some even joined those \"instructor\" sites.\ni still remember daily cash games in carr hall with the RA. every thursday friday the asians had cash games in both lounges in FAR. there was a game everywhere, all student orgs would host poker tourneys as charity events, there were .50/1 &amp; 1/2 games every 3 blocks. \n\ni don't know what happened by towards the end of my tenure, the school started cracking down everywhere, dorm games were done, all orgs were reprimanded if they hosted and there were obviously fewer cash games.\n\nfor those that are in school now, how is the current popularity?    I'm interested, and I have cards and chips. pm if you want to play  I'm interested, and I have cards and chips. pm if you want to play                     Put me on the list too 8472718539. \n\nI think the first thing to do would be to find someone willing to host? Anyone here have an apartment with a decent sized table with chairs?\n\nA couple friends and I play bi weekly but there isn't enough chairs to have more people over.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18m7ti/anyone_play_poker/"
  }, {
    "id" : 8,
    "title" : "Just got admitted, but not into the program I wanted. ",
    "snippet" : "Hello! I applied for the Computer Science program in the college of engineering, and while I did get into the University, I didn't get into the program I wanted so I selected the Undeclared option\n\nHow hard is it to transfer into Computer Science in the College of Engineering?\n\nThanks!  dont assume anything, it is getting harder and harder to get into cs, talk to the department and get a clear list of requirements and cutoffs before making a final decision.  Whom specifically should I contact in the department? the engineering department website isn't really leading me to anywhere useful right now... steve herzog, he is the go to undergraduate advisor for CS. I dont have his email on me right now but Im sure it can be easily found. Thanks! You are fantastic! Just talked to steve today for a class change. Amazing guy Haha, I've heard that you can go in there, have a really friendly chat with him, but not actually get an answer to your question.  This exact story has led to most of the really really sad endings that I have witnessed for UIUC students. If you ever get a C+ or lower in a math, chem, or CS class, the Engineering college will tell you to keep retaking courses until you have a high enough GPA to transfer. This causes a ridiculously high amount of denial and retakes among undeclared students. When you fail Chem 102 and retake it, getting a C, your GPA is terrible. The kicker: if you don't have at least a 2.0 overall GPA after 2 years, *it is impossible to transfer to any major*. \n\n* If you get a C+ or lower in a math or chem or CS class, abandon your plan.\n\nDisclaimer: This is my personal opinion and like I said this is not the official stance of the Engineering college or the Engineering advisers. I'm not even sure it is the official stance of the undeclared advisers. \n\nThe lesson that OP should take from this is that if you got rejected from the major you wanted, you should think seriously about coming here. There is absolutely no guarantee that you will transfer, and you should not come unless there are multiple majors that you would be happy completing. A student without a backup plan is in a very risky situation. A student with a backup plan is totally ok! There's a lot of realistic advice here, but I had a different story. I ended up getting a C- in math 241, with D's and F's in my other classes. I actually got placed on academic probation cause my gpa was so low but I still went to see one of the assistant deans about transferring into MechE. He literally told me that I had no chance of transferring in and even if I got A's for every class from there on out, I still wouldn't get in. It was heart-breaking at the time but I'm pretty stubborn. Long story short, I worked my ass off for a year, and without getting all A's or anywhere close to the \"required\" 3.8, still managed to transfer successfully. My roommate just transferred into CS as well, and while it wasn't pretty, since I don't think he even had a 3.0, he still ended up getting in. So I guess everyone's story is different.  There's a lot of realistic advice here, but I had a different story. I ended up getting a C- in math 241, with D's and F's in my other classes. I actually got placed on academic probation cause my gpa was so low but I still went to see one of the assistant deans about transferring into MechE. He literally told me that I had no chance of transferring in and even if I got A's for every class from there on out, I still wouldn't get in. It was heart-breaking at the time but I'm pretty stubborn. Long story short, I worked my ass off for a year, and without getting all A's or anywhere close to the \"required\" 3.8, still managed to transfer successfully. My roommate just transferred into CS as well, and while it wasn't pretty, since I don't think he even had a 3.0, he still ended up getting in. So I guess everyone's story is different.  This exact story has led to most of the really really sad endings that I have witnessed for UIUC students. If you ever get a C+ or lower in a math, chem, or CS class, the Engineering college will tell you to keep retaking courses until you have a high enough GPA to transfer. This causes a ridiculously high amount of denial and retakes among undeclared students. When you fail Chem 102 and retake it, getting a C, your GPA is terrible. The kicker: if you don't have at least a 2.0 overall GPA after 2 years, *it is impossible to transfer to any major*. \n\n* If you get a C+ or lower in a math or chem or CS class, abandon your plan.\n\nDisclaimer: This is my personal opinion and like I said this is not the official stance of the Engineering college or the Engineering advisers. I'm not even sure it is the official stance of the undeclared advisers. \n\nThe lesson that OP should take from this is that if you got rejected from the major you wanted, you should think seriously about coming here. There is absolutely no guarantee that you will transfer, and you should not come unless there are multiple majors that you would be happy completing. A student without a backup plan is in a very risky situation. A student with a backup plan is totally ok! Mr academic advisor sir, what GPA's do you normally see getting accepted into engineering CS and LAS CS + math? I don't know about engineering CS, because I'm not a CS adviser. Sorry! I do know that they would love to take people and they aren't being jerks, but they refuse to take so many people that CS 225 will overfill. It makes sense, really.\n\nLAS math/cs has a straight-up transfer criterion but it is 3.20 GPA in specific difficult courses, which is really hard. I like guaranteed transfer criteria. But they cause problems for high-demand courses. See http://www.las.illinois.edu/students/programs/declaring/ for LAS's transfer criteria. Just as an advisor, how do you really feel about DGS here? Mr academic advisor sir, what GPA's do you normally see getting accepted into engineering CS and LAS CS + math? This exact story has led to most of the really really sad endings that I have witnessed for UIUC students. If you ever get a C+ or lower in a math, chem, or CS class, the Engineering college will tell you to keep retaking courses until you have a high enough GPA to transfer. This causes a ridiculously high amount of denial and retakes among undeclared students. When you fail Chem 102 and retake it, getting a C, your GPA is terrible. The kicker: if you don't have at least a 2.0 overall GPA after 2 years, *it is impossible to transfer to any major*. \n\n* If you get a C+ or lower in a math or chem or CS class, abandon your plan.\n\nDisclaimer: This is my personal opinion and like I said this is not the official stance of the Engineering college or the Engineering advisers. I'm not even sure it is the official stance of the undeclared advisers. \n\nThe lesson that OP should take from this is that if you got rejected from the major you wanted, you should think seriously about coming here. There is absolutely no guarantee that you will transfer, and you should not come unless there are multiple majors that you would be happy completing. A student without a backup plan is in a very risky situation. A student with a backup plan is totally ok! [deleted]  You might also consider the CS minor. Like others have said, transferring to CS from undeclared will be very, very difficult.\n\nAs someone who hires people for IT positions, I would likely put someone with a CS degree or a CS minor for many positions. If on the other hand, you are really wanting to be a programmer's programmer, CS is almost certainly where you want to end up. In my experience, being a programmer and having a CS degree from UofI are two very separate things.  Almost every class tells you that they are teaching you concepts, not how to program.  If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc. In my experience, being a programmer and having a CS degree from UofI are two very separate things.  Almost every class tells you that they are teaching you concepts, not how to program.  If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc. In my experience, being a programmer and having a CS degree from UofI are two very separate things.  Almost every class tells you that they are teaching you concepts, not how to program.  If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc. &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post? &gt; If you want to be a programmer, your best course of action is to work on your own stuff, work freelance, spend time on StackOverflow, etc.\n\nCan you elaborate a little more on this? How do you teach yourself high-level programming skills? I hear learning from a book or course doesn't count for much, it is the experience that counts. How do you get experience if you aren't in a programming job? If you were to teach yourself, how would you select projects? Isn't StackOverflow a forum to get programming questions answered? If so, what do you mean by spending time there unless you have a question to post?  I transferred into engineering after attending Parkland for 2 years, no one I knew who applied to transfer to an engineering program got denied (granted everyone I knew who was applying at a 3.0 or higher).  From what I have heard, it is actually easier to transfer from another school than to transfer from another college at UIUC.  If I had to do it over again, I would start at Parkland again, the quality of teaching for the basic calculus and physics is worlds better than what I saw at UIUC.   I transferred into Computer Engineering after 3 semesters at a community college. I've been told the same thing, outside transfers are easier (as long as you're an Illinois resident). [deleted] Are you sure you want to transfer that late? Why not apply to transfer for this coming fall? I see no benefit in waiting another 1.5 years. I'm getting a full ride at UIC right now (grants cover everything) and by the time I transfer for Junior year I'll have $15k+ saved from my job, which would put me on track for graduating with zero debt. So there's that.  The CS department has an increasing enrollment, and is trying to prevent hordes of students from transferring in, and in particular, it is going to be harder to do it in the future. This said, if you have high GPA - you are always going to be able to transfer in. After all - why would CS not want to accept *good* students?\n\nThis said, if you got accepted to CE in ECE then it is very similar to CS. It is a good program in a good department, and you should completely go for it.\n  Are you Undeclared as in you are in DGS or in Undeclared as in the new Undeclared option for Engineering?   I am in the same boat. \n\nhttp://provost.illinois.edu/programs/advising/ICT%20Engineering.html\n\n\nThis should help. Notice that there is **no GPA that guarantees transfer** to engineering, please. And a 3.0 is not a trivial task when your schedule is calculus, physics, chemistry, and rhetoric. So what is the relevance of my link? Is it a guideline or...? It's a minimum. If you read it closely, you'll note that it says if you meet those requirements they \"will consider\" you for transfer.  So what are more realistic requirements? If a person can maintain an A/B/B+ average while completing all of the Junior year transfer requirements, and demonstrate that they taught themselves the basics of a programming language in their free time by then - that's a pretty good indication of probable success completing the degree. It is a difficult program, but it's worth it and very doable with dedication.  I know people who have done it, but I'm sure it's hard. Also you contribute to the overscheduling of classes (as in there are too many people who sign up for classes and there aren't enough seats.) But good luck, the CS program is awesome. It's not too bad. Did it fall of last year, and all Herzog wanted was to see if I did well in CS 173, CS 225, and ECE 190.  What was your GPA?    also consider the Math and Computer Science and Statistics and Computer Science programs, as both are LAS. No offense but this does not hold nearly the same value, which is why a lot of people don't see that as a option It doesn't hold the same value, or students don't perceive it to hold the same value. Nobody ever asked me what department I got my degree in. Just what I got.  They don't have to ask if it's on your resume \"BS in Mathematics and Computer Science\" doesn't sound any worse than \"BS in Computer Science.\" No one is going to pay attention to whether your degree comes from LAS/Engineering.  No offense but this does not hold nearly the same value, which is why a lot of people don't see that as a option No offense but this does not hold nearly the same value, which is why a lot of people don't see that as a option  Me too :/ Except civil engineering, is it any different for me than OP?  Undecided student here. CS is hard as hell to transfer into. The GPA requirement doesn't seem like it's that hard, but it is much harder than it looks. A B- is actually weighed as a 2.67, not a 3, so be wary of that as well. Also, the GPA requirement is more like a 3.2 for CS, not 3.0 So I guess getting that 3.2 GPA is pretty difficult? Is that because of the classes needed in order to transfer in? So I guess getting that 3.2 GPA is pretty difficult? Is that because of the classes needed in order to transfer in? So I guess getting that 3.2 GPA is pretty difficult? Is that because of the classes needed in order to transfer in?   Can anyone explain the differences between the Mathematics and Computer Science program in the College of Liberal Arts and Sciences as opposed to the one in the College of Engineering? Applied for EE but didn't get into the program and am considering either majors to submit. As the majors state, the LAS one takes more advanced Math classes as opposed to even more advanced CS classes in Engineering. Engineering's CS program only requires all the Calc courses, Linear Algebra, and I believe a Probability Theory class.\n\nEngineering also requires you to take the Physics track (PHYS 211/212 and your choice of 213 or 214) and CHEM 102/103 for their college requirement. \n\nIn the end, they're about equal. Graduates from both programs should show success and proficiency in their future careers.\n\nI dug up some flowcharts. Here they are:\n\n[Math &amp; CS](https://wiki.engr.illinois.edu/download/attachments/161021976/Math+and+CS+requirements+flowchart+revised.pdf?version=1&amp;modificationDate=1332540462000)\n\n[CS in Engineering](https://wiki.engr.illinois.edu/download/attachments/161021976/CS+requirements+flowchart+CS+track+2012+revised.pdf?version=1&amp;modificationDate=1332542016000)  I don't know how hard it is to switch to CS major, but I do know it is definitely worth to transfer!!!\n\nI was an ECE major, but I switched to CS. Recruiters seeking CS students (Facebook, Twitter, Reddit...) are way much cooler than recruiters seeking ECE students (National Instruments and a bunch of companies you have never heard of...) . \n\nDon't ever consider ECE major, even computer engineering!!! You will be forced to learn a bunch of stuffs you will never used in rest of your life, like Nanotech or Electronic Wave. It is just waste of time.... Knowing these won't really help you to get a job in Facebook....\n\nObviously, there are too many smart chinese or indian kids in ECE department that makes its really competitive...  I would say it is at least two times harder to get an A in ECE classes than in CS classes....\n\nOverall, CS rocks, ECE sucks  (Assume you are not interested in Eletrical of Physic stuffs..). CS is cool. ECE is lame.  Successful CS alumni are usually billionaire or entrepreneurs.  Successful ECE alumni are usually scientists...\n\nI can say this because from my personnel experience and lots of my friends' experiences... I had a bad time in ECE department and almost give up programming after ECE190 but I will say I rebuild the confidence after CS225....Faculties in CS department are nicer!!! They sometimes bring cookies to classes! They are funny and experienced unlike the serious ECE professors who has no verbal skills and always get you bored!\n\nNever ever never switch your major to ECE, if you are already, switch to CS instead!If you can't, at least do a CS minor for getting a job... I don't know how hard it is to switch to CS major, but I do know it is definitely worth to transfer!!!\n\nI was an ECE major, but I switched to CS. Recruiters seeking CS students (Facebook, Twitter, Reddit...) are way much cooler than recruiters seeking ECE students (National Instruments and a bunch of companies you have never heard of...) . \n\nDon't ever consider ECE major, even computer engineering!!! You will be forced to learn a bunch of stuffs you will never used in rest of your life, like Nanotech or Electronic Wave. It is just waste of time.... Knowing these won't really help you to get a job in Facebook....\n\nObviously, there are too many smart chinese or indian kids in ECE department that makes its really competitive...  I would say it is at least two times harder to get an A in ECE classes than in CS classes....\n\nOverall, CS rocks, ECE sucks  (Assume you are not interested in Eletrical of Physic stuffs..). CS is cool. ECE is lame.  Successful CS alumni are usually billionaire or entrepreneurs.  Successful ECE alumni are usually scientists...\n\nI can say this because from my personnel experience and lots of my friends' experiences... I had a bad time in ECE department and almost give up programming after ECE190 but I will say I rebuild the confidence after CS225....Faculties in CS department are nicer!!! They sometimes bring cookies to classes! They are funny and experienced unlike the serious ECE professors who has no verbal skills and always get you bored!\n\nNever ever never switch your major to ECE, if you are already, switch to CS instead!If you can't, at least do a CS minor for getting a job... Cinda heeren is super sweat! She is the best professor I met in UIUC.\nHu Yih-Chun, on the other hand is a smug jerk!!!\n\nI can share my experience, I get a shit in my ECE classes, but after getting an A in CS173 and CS225, I got admitted and became a CS student!\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/18lruw/just_got_admitted_but_not_into_the_program_i/"
  }, {
    "id" : 9,
    "title" : "[IMPORTANT] Girl Scouts selling cookies outside Follett's!",
    "snippet" : "  THANKS FOR THE ALL CAPS TAG I DIDN'T KNOW IF IT WAS IMPORTANT OR NOT THANKS FOR THE ALL CAPS TAG I DIDN'T KNOW IF IT WAS IMPORTANT OR NOT   They're also being sold at a barber shop on Green. Right across the street from Chipotle. Dave is a good guy.  If I had hair, I would be going there.   My spear and magic helmet!\n\nMagic helmet?\n\nMagic helmet!\n\n**MA** **GIC** **HEL** **MET**   My friend's daughter sells 'em to me. I got a source &gt;.&gt; ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18l8f0/important_girl_scouts_selling_cookies_outside/"
  }, {
    "id" : 10,
    "title" : "UIUC Physics?",
    "snippet" : "Hello, \n\nI just got admitted to UIUC! I applied to Engineering, but got offered the alternate program option, and I had physics as my alternate choice. Any physics majors? I'm OOS from Massachusetts, I don't know any UIUC alumni, so I'd love to get an idea of the school, and it's physics program.\n\nThanks!    I am not a physics major, but I am a fellow out of state student (engineering) and I couldn't be happier.  While I won't know much about the physics program, I only took 4 courses in it, I would be happy to answer any questions you have about the University. How's being OOS at UIUC? I take it that most students who do engineering are OOS considering the programs strength. How's the social life, and Urbana Champaign. I live near Boston, so I guess it's a much more different environment. Do you feel that OOS cost is worth it? I really don't think most engineers are OOS. Pretty much regardless of major it seems like 90% of the students here are either from the Chicago Suburbs or Korea.  Not specifically Korea, but let's check your claim.\n\n* http://dmi.illinois.edu/\n\n* Campus Profile\n\n* Department: Physics\n\n* Jump to: Student Data\n\nTells us that the physics department has 177 undergrads.\n\n23% nonresident, which is apparently 13% international and 10% out of state.\n\nSo the \"90% are illinois or [international]\" was actually dead-on for Physics.\n\nAlso notice the %women, which is 21.5% (a HUGE increase over past years)\n\nYou can see more statistics about the 177 physics undergrads [here](http://www.dmi.illinois.edu/cp/listprograms.asp?row=3660&amp;org=1B1-KP-KP0-244&amp;year1=2012&amp;year2=2013). How's being OOS at UIUC? I take it that most students who do engineering are OOS considering the programs strength. How's the social life, and Urbana Champaign. I live near Boston, so I guess it's a much more different environment. Do you feel that OOS cost is worth it? How's being OOS at UIUC? I take it that most students who do engineering are OOS considering the programs strength. How's the social life, and Urbana Champaign. I live near Boston, so I guess it's a much more different environment. Do you feel that OOS cost is worth it?     Don't do engineering-physics Can I ask why? Dealing with different offices in different colleges was a nightmare. They kept claiming it was the other college's responsibility Fair enough. I am looking to major in physics and am not really sure which track to go for. Good information.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18lwh2/uiuc_physics/"
  }, {
    "id" : 11,
    "title" : "School email not working?",
    "snippet" : "It's been \"moved temporarily\" apparently but the redirection link brings me to the same page. Anyone else having this problem?   This seems to be an issue with all of Google Mail and Google Apps. Incognito in Chrome or using Firefox worked for me - Safari didn't.  I was having a similar problem. Try opening up your email in incognito mode that worked for me.  Clear cookies and cache and try again ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18l9vp/school_email_not_working/"
  }, {
    "id" : 12,
    "title" : "Where can local musician's play?",
    "snippet" : "I play guitar and sing, and am looking for somewhere (other than the quad in the spring/potbellies) to perform. Are there any local bars or establishments/talent shows, etc that give local musicians a shot at playing a one or two hour gig?     The Iron Post in downtown Urbana is a pretty good place to start.  I love the Post! But it's sort of a jazz bar   &gt;musicians\n\nFTFY      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18kxs6/where_can_local_musicians_play/"
  }, {
    "id" : 13,
    "title" : "Get it while it's fresh!",
    "snippet" : "    Not to be a dick but isn't this just a typo?",
    "url" : "http://imgur.com/WuKUzRL,E8J4oQF"
  }, {
    "id" : 14,
    "title" : "UIUC's Very Own Chai-Town Does a Beautiful Rendition of an Indian Song for Valentine's Day",
    "snippet" : "     [deleted]  Do the needful. And what is that?",
    "url" : "http://www.youtube.com/watch?v=LG77APl4g3c"
  }, {
    "id" : 15,
    "title" : "Welcoming Penn State with arms wide open...",
    "snippet" : "   &lt;Sarcasm&gt; I don't get it. &lt;/Sarcasm&gt;\n\nA) Valentine's Day is today, fitting for the day the email was sent out\nB) Who cares if his son is shirtless? It's his son. It was a heat of the moment picture after an amazing win over Indiana\nC) ???\nD) People need to stop being little sensitive babies looking for a reason to be offended. I guarantee you I wouldn't have thought of that connection if it weren't for this article.  \n\nI'm more offended by the unappealing color scheme than anything\n\nEdit: I forgot sarcasm doesn't transmit over the Interwebs Trust me, I'm not getting all up in arms over this - its from deadspin, it not to taken seriously anyway. \n\nOffended? No. But can I unsee it? Not really.\n\n**Edit:** Isla_de_tortugas, I indeed understand sarcasm does not transfer over the Interwebs. I thought everyone would find this article funny. According to the sidebar, this is not the case. I'm not berating you by any means. I just have a family that loves doing this sort of thing and it just pisses me off &lt;Sarcasm&gt; I don't get it. &lt;/Sarcasm&gt;\n\nA) Valentine's Day is today, fitting for the day the email was sent out\nB) Who cares if his son is shirtless? It's his son. It was a heat of the moment picture after an amazing win over Indiana\nC) ???\nD) People need to stop being little sensitive babies looking for a reason to be offended. I guarantee you I wouldn't have thought of that connection if it weren't for this article.  \n\nI'm more offended by the unappealing color scheme than anything\n\nEdit: I forgot sarcasm doesn't transmit over the Interwebs ...you don't get it? \n\nPenn State is a school in State College, Pennsylvania. They recently had a scandal where the former Assistant Coach of their football team, Jerry Sandusky, was charged with the systematic rape of dozens of young boys. \n\nThere's a double entendre here, even if it's immature to say so. It's one thing to say, \"That's not really funny,\" or, \"It's offensive that they're saying that about Groce and his son,\" but you *have* to at least *understand* it. \n\nAnd really, getting uptight and saying that the joke is not funny is the \"little sensitive baby thing\" that you're whining about.  Oh right, that whole Sandusky thing. I TOTALLY forgot about that.. &lt;/sarcasm&gt;\n\nEdit: sarcasm Okay, so it wasn't that you didn't get it. It's that you didn't think it was funny. Probably because you were being a little sensitive baby looking for a reason to be offended.",
    "url" : "http://deadspin.com/5984254/the-fighting-illini-ticket-office-chose-an-unfortunate-picture-to-advertise-the-penn-state-game"
  }, {
    "id" : 16,
    "title" : "WET HOT AMERICAN SUMMER this weekend at The Art Co-op!",
    "snippet" : "Another great comedy for the midnight show this weekend! A small budget camp comedy, this movie is truly hysterical. IMDB page here http://www.imdb.com/title/tt0243655/?ref_=sr_1 \nCome on out and participate in some fun, summer camp themed games before the show! Midnight shows Friday and Saturday, 10PM shows next Wednesday and Thursday. Only 7 bucks!! Hope to see you there!   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18j0lf/wet_hot_american_summer_this_weekend_at_the_art/"
  }, {
    "id" : 17,
    "title" : "ESPN's John Brenkus, host of Sport Science, coming to UIUC on Friday at 8PM",
    "snippet" : "John Brenkus, the host of the ESPN show Sports Science, is coming down to Champaign as the E-Week Keynote Speaker this Friday! He will be speaking at the Illini Union Ballroom at 8PM.\n\nIf you have a Facebook, you can check out the event here:\n\nhttps://www.facebook.com/events/274250009368747/\n\nAnyone and everyone is welcome! Space is limited so make sure you get there early. If you are on an E-Week team, you will get points for attending.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18ik7t/espns_john_brenkus_host_of_sport_science_coming/"
  }, {
    "id" : 18,
    "title" : "Where can i get something faxed and notarized on campus?",
    "snippet" : "This is for stupid ameren.   Urbana public library has a notary if I recall. It's possible the Champaign library might too.        TCF: they'll both notarized and fax the thing for you (I assume this is for Ameren?)",
    "url" : "http://www.reddit.com/r/UIUC/comments/18jvgy/where_can_i_get_something_faxed_and_notarized_on/"
  }, {
    "id" : 19,
    "title" : "Local computer repair?",
    "snippet" : "I was wondering if you guys had any opinions on local computer repair places.  I've got an external hard drive that won't power up.  I'm pretty sure I want to avoid Illini Tech Center, right?  I've heard good things about simplified computers.  Not sure they'll have the cable you're looking for, I suppose it's worth a shot though.\n\nYou could always dissect the enclosure and hook the drive up to a desktop.  If it spins up and works you just need to buy a new enclosure which can be found for pretty cheap on the internet. I've heard good things about simplified computers.  Not sure they'll have the cable you're looking for, I suppose it's worth a shot though.\n\nYou could always dissect the enclosure and hook the drive up to a desktop.  If it spins up and works you just need to buy a new enclosure which can be found for pretty cheap on the internet.  Is the hard drive still under warranty? The manufacturer should be able to help you out and save you some money. You *might* have to pay for shipping.  What brand is it, how old is it, and is it powering on or click,ing? If its a newer WD Passport, you're fucked since they use a proprietary ZIF connector inside. It's a Seagate FreeAgent.  It's about 3.5 years old.  And it's not powering up: no spinning disk noises, no light, not showing up on my computer.  It may just be a bad cable, but I'd like to just take it to an expert. wouldn't it make more sense to just replace the cable first? Sure, if I could find one that fits.  I bet a computer repair store might have one that they could test that with.  And if that's the problem, I bet I could buy it from them, too. If its three years old, its either USB-B, miniUSB, or microUSB. Post a pic and I can tell you which it is. All are very common.  It's not even powering up.  It's the power cable that may be bad.  [Computer Deli](http://www.computerdeli.com/) should be able to help you diagnose this problem\n\nIf they are unable to fix it and you REALLY need the data you can try [Drive Savers](http://www.drivesaversdatarecovery.com/) but this is a pretty expensive service I think. I noticed Computer Deli with a Google search, but they didn't have any reviews.  You recommend them?\n\nDisk Savers seems like a pretty neat service.  I especially liked their Museum of Bizzare Disk-astours.  More the likely just a desktop SATA drive in there, I would try replacing the case: http://www.newegg.com/Product/Product.aspx?Item=N82E16817182155\n\nLess then $20.\n\nOr take the drive out of the enclosure and bring it by one of the campus departmental IT offices. They should have an adapter like the one sold with this adapter: http://www.newegg.com/Product/Product.aspx?Item=N82E16812232002\n\nThat way you know if the drive is bad or the case. It will take them less then two minutes to plug it in and see if the drive powers up.  You can go to the Tech Zone at the Union, I used to work there. Theres a group of good techs there and they'll see what can be done! They do hourly work for less than all of the other computer places around. Is that the same place that used to be called The Flash Drive?",
    "url" : "http://www.reddit.com/r/UIUC/comments/18jhc8/local_computer_repair/"
  }, {
    "id" : 20,
    "title" : "X-Files creator Chris Carter is the special guest for this year's Insect Fear Film Festival 2/23",
    "snippet" : "If you've never been, the [Insect Fear Film Festival](http://www.life.illinois.edu/entomology/egsa/ifff.html) is a tradition of the Entomology Department on campus. This is our 30th year and I'm really excited about our special guest this year so I hope we get a good crowd! \n\n\n**Date:** February 23, 2013\n\n**Time:** Doors open at 6pm, see the schedule below for more info\n\n**Theme:** The InsX-Files: The Truth (About Insects) Is Out There, with special guest [Chris Carter](http://www.imdb.com/name/nm0004810/), creator of the X-Files. \n\n**Location:** [Foellinger Auditorium](https://maps.google.com/maps?q=foellinger+auditorium&amp;hl=en&amp;safe=off&amp;fb=1&amp;gl=us&amp;hq=foellinger+auditorium)\n\n\nWe'll be showing the episode [The X-Files: \"The War of the Coprophages,\"](http://www.imdb.com/title/tt0751259/) about a wave of deaths linked to what may be alien robotic cockroaches, followed by the 1998 feature [The X-Files: Fight the Future](http://www.imdb.com/title/tt0120902/), about killer bees that transmit a deadly alien virus by stinging. Fun fact: the character Bambi Berenbaum in \"The War of the Coprophages\" is named after UIUC Entomology faculty member [May Berenbaum](http://en.wikipedia.org/wiki/May_Berenbaum).\n\n\nExhibits and activities include exotic insect displays from around the world, the **insect petting zoo**, face painting, and entries from the annual insect art contest (some of them end up being super cute!). \n\n\n**Admission is free!**\n\n\n6:00 pm - 7:00 pm - Exhibits, displays, &amp; activities\n\n7:00 pm - 7:30 pm - Opening remarks\n\n7:30 pm - 8:15 pm - \"War of the Coprophages\"\n\n8:15 pm - 8:45 pm - Q&amp;A Chris Carter\n\n8:45 pm - 10:45 pm - \"X Files\"\n\n10:45 pm - 11:15 pm - Q&amp;A Chris Carter ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18i3cd/xfiles_creator_chris_carter_is_the_special_guest/"
  }, {
    "id" : 21,
    "title" : "Juciy J at Foellinger this Friday???",
    "snippet" : "   It was for the cotton club. Its a annual black frat event on campus. Its not supposed to be a huge show. That's why it was in Foellinger. Regardless they either didn't make enough to pay him because they sold out and he was charging more or they didn't think they sell out in order to pay.\n\nSupposedly they're offering refunds if you bought one but who knows. Everything is related with the university. If you don't get a refund contact the RSO office because fraternities are involved. But really, try and get the money first before going to the university.  I don't think Juicy J will actually be there..for some reason, I'm getting the feeling that this is a huge scam.   Yeah it seems really shady. You have to call a chicago number to buy tickets?  That and it says nothing on the Juicy J ticketmaster or official websites.  and the website for that ticket is sketch as f &gt;For more information, please text 773-678-7133 or 312-450-9806.\n\nYeah that sounds legit. I don't think Juicy J will actually be there..for some reason, I'm getting the feeling that this is a huge scam.    http://livemusic7.com/  Got my tickets this weekend. Don't understand why someone that big is playing such a small venue. Got my tickets this weekend. Don't understand why someone that big is playing such a small venue.  So...according to his [twitter](https://twitter.com/therealjuicyj) the show was cancelled due to \"lack of funds\".  WTF?!?\n\nI thought foellinger would be a weird place for juicy anyway but srsly wtf...anyone know anything?  This is what the ticket looks like. No barcode or anything. Guess I'm out $20. \n\nhttp://imgur.com/cPyVmpY This is what the ticket looks like. No barcode or anything. Guess I'm out $20. \n\nhttp://imgur.com/cPyVmpY This is what the ticket looks like. No barcode or anything. Guess I'm out $20. \n\nhttp://imgur.com/cPyVmpY   ",
    "url" : "http://www.youtube.com/watch?v=woLTqW7HqqE"
  }, {
    "id" : 22,
    "title" : "Any easy half semester courses to take?",
    "snippet" : "I might need to drop out of a course soon and it will put me at 11 hours, so suggestions would be GREAT\n\nEdit: The course catalog search function was a pleasant surprise. Very well done and my compliments to the devs who worked on that.  If you're looking for an easy A, Phys 213. Super easy course, ask anyone.  If you're looking for an easy A, Phys 213. Super easy course, ask anyone.  Is 213 way harder than 214? Because I'm failing the shit out of 214 right now  If you're looking for an easy A, Phys 213. Super easy course, ask anyone.  How much calc-3 do we need for that class?  RST110. I took it last semester and it was super easy. It has a different teacher this time so keep that in mind but the course material was easy.   I hope you've already looked this up but theres been quite a few people that have already asked this:\n[One year ago](http://www.reddit.com/r/UIUC/comments/pdcre/anyone_know_of_any_good_secondhalf_geneds_i_could/)\n\n[4 months ago](http://www.reddit.com/r/UIUC/comments/10jo0t/are_there_any_8_week_courses_worth_taking_my/)\n\n[Also a year ago](http://www.reddit.com/r/UIUC/comments/pvgju/suggestion_for_a_second_half_the_the_semester/)\n\n[3 months ago](http://www.reddit.com/r/UIUC/comments/11qa58/need_help_picking_an_8week_course_self/)\n\n[Also 4 months ago](http://www.reddit.com/r/UIUC/comments/10r5ul/suggestions_for_an_8week_course/)  I signed up for NRES 102 or 103 or something like that. It's the only 8 week one. I can only assume it will be really easy. I mean, it's a 100 level earth sciences course that is made for non majors. I signed up for NRES 102 or 103 or something like that. It's the only 8 week one. I can only assume it will be really easy. I mean, it's a 100 level earth sciences course that is made for non majors.     Ok, I found a course called TSM 311. Any thoughts on that? And what about courses that the course catalog says are \"closed\". I have heard people that can get into these courses somehow?  TSM 311 is a full-semester course. They just do the discussions differently in the first half and second half, so the discussions look like second-half courses. They are not. You can't do TSM 311. (I know because I called them to ask about it last week)\n\nTSM should fix the course schedule so that this course does not display as a second-eight-week course, but that definitely won't happen for this semester. This is helpful, thanks.\nThey really should somehow group the discussion sections with lecture sections so this doesn't happen  Any QI or QII ones out there? Atms 120 is a quant II. And it is very easy.  phys 214 phys 214 phys 214 I knew that this or phys 213 would be the first answer I would get.\nNow, if we can move on to the real suggestions... ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18hyrk/any_easy_half_semester_courses_to_take/"
  }, {
    "id" : 23,
    "title" : "How long do companies take to contact you after the application?",
    "snippet" : "I went to the engineering career fair on the 29th and still haven't heard back from any of the companies I applied to. Does it usually take this long to hear back or is it safe to say none of them were interested?        ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18irj4/how_long_do_companies_take_to_contact_you_after/"
  }, {
    "id" : 24,
    "title" : "Where can we find puppies near campus?",
    "snippet" : "It's already that time in the semester that I'm starting to get stressed out.\n\nWhere is a good place near campus that visitors may play with puppies? Is there such a magical land?   I'm not sure about the rest of the year, but the ARC is hosting snuggle time with Illini Service Dogs from 3-6 today as part of their Valentine's Day celebration! =)      ????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????\nYou don't know how to relax? You should probably add some more question marks. I don't think you've adequately expressed your confusion yet.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18i409/where_can_we_find_puppies_near_campus/"
  }, {
    "id" : 25,
    "title" : "My friend's cat is missing. It's a long shot but maybe someone has seen it?",
    "snippet" : "  He needs to call the Humane Society and report this ASAP.  They'll take some information and let him know if someone brings the cat in.  Good luck!  :'(   Yesterday (Tuesday) I saw a stray cat near Siebel Center on like springfield and goodwin. Can't exactly remember if it looked like your cat or not but just thought I'd let you know  I saw a cat that looks similar to the cat in those pictures around my house on First and Gregory   Pic? I see a lot of cats. all four pictures on that page are of the same cat.",
    "url" : "http://chambana.craigslist.org/laf/3613489973.html"
  }, {
    "id" : 26,
    "title" : "LEX Express/Suburban Express Customer Experience Survey -- Vent to me about your Bus-fueled frustrations!",
    "snippet" : "Howdy ya'll! I'm working on a story about LEX Express's closure in December and could use some input from students on their experiences riding with LEX before they were shut down. I'm also looking into Suburban Express' use of the charter buses for another story, and could use individual feedback on their services as well. \n\nWill post final stories on /r/UIUC in return. Thank you for your time!   I was recently banned by Suburban Express.  Having lost my ticket at the last minute, I had to go print out another one and arrived at the bus three minutes late -- I checked.  As I neared ISR, I saw that they still had a couple people boarding the bus.  When the guy in charge of directing the passengers to the appropriate bus saw me approaching, he yelled, \"If you want to catch this bus, you'd better start running!\"  He then proceeded to berate and me and two other guys for arriving late, yelling at us while we stowed our luggage, \"Who the hell do you think you are?  You're holding up a whole bus load of people!\"  After our luggage was stowed, he continued to yell at us about how inconsiderate we were and how we were banned from every using the service again.  Once we were on the bus, turned to the driver and said, \"Can you believe these fucking people?\"\n\nHonestly, I know I was late -- I'm not excusing myself.  In fact, I expected that the bus would have already left or that I would not be allowed on.  I would have understood and been okay with either of those outcomes.  However, I found it extremely unprofessional to be yelled and cursed at for being late.  The bus driver, though, was really nice about the whole thing.  Seeing how shaken I was after the whole thing, he offered me a bottle of water and tried to comfort me, saying that he \"didn't believe in taking pleasure in the misfortune of others.\"\n\nFor what it's worth, when I asked the bus driver who the guy was, he said that he didn't know.  Given that he was wearing a Suburban Express shirt, I assumed that he was an employee of Suburban Express and unconnected with the charter company driving the bus.  \n\nOn a completely different note, another time that I rode Suburban Express, the driver missed the exit to the Northbrook Court stop.  Despite the GPS repeatedly telling him to exit, he also missed the next several exits and didn't turn around until a passenger went to tell him that he missed the exit.\n\nOn the other hand, I almost never ride LEX due to the mechanical failures of their buses.  Once, one of the tires on the bus blew out on the freeway and another time, the hood of the van started smoking during the trip.  Also, my roommate almost missed her flight due to a bus breaking down on the freeway. I was recently banned by Suburban Express.  Having lost my ticket at the last minute, I had to go print out another one and arrived at the bus three minutes late -- I checked.  As I neared ISR, I saw that they still had a couple people boarding the bus.  When the guy in charge of directing the passengers to the appropriate bus saw me approaching, he yelled, \"If you want to catch this bus, you'd better start running!\"  He then proceeded to berate and me and two other guys for arriving late, yelling at us while we stowed our luggage, \"Who the hell do you think you are?  You're holding up a whole bus load of people!\"  After our luggage was stowed, he continued to yell at us about how inconsiderate we were and how we were banned from every using the service again.  Once we were on the bus, turned to the driver and said, \"Can you believe these fucking people?\"\n\nHonestly, I know I was late -- I'm not excusing myself.  In fact, I expected that the bus would have already left or that I would not be allowed on.  I would have understood and been okay with either of those outcomes.  However, I found it extremely unprofessional to be yelled and cursed at for being late.  The bus driver, though, was really nice about the whole thing.  Seeing how shaken I was after the whole thing, he offered me a bottle of water and tried to comfort me, saying that he \"didn't believe in taking pleasure in the misfortune of others.\"\n\nFor what it's worth, when I asked the bus driver who the guy was, he said that he didn't know.  Given that he was wearing a Suburban Express shirt, I assumed that he was an employee of Suburban Express and unconnected with the charter company driving the bus.  \n\nOn a completely different note, another time that I rode Suburban Express, the driver missed the exit to the Northbrook Court stop.  Despite the GPS repeatedly telling him to exit, he also missed the next several exits and didn't turn around until a passenger went to tell him that he missed the exit.\n\nOn the other hand, I almost never ride LEX due to the mechanical failures of their buses.  Once, one of the tires on the bus blew out on the freeway and another time, the hood of the van started smoking during the trip.  Also, my roommate almost missed her flight due to a bus breaking down on the freeway. I was recently banned by Suburban Express.  Having lost my ticket at the last minute, I had to go print out another one and arrived at the bus three minutes late -- I checked.  As I neared ISR, I saw that they still had a couple people boarding the bus.  When the guy in charge of directing the passengers to the appropriate bus saw me approaching, he yelled, \"If you want to catch this bus, you'd better start running!\"  He then proceeded to berate and me and two other guys for arriving late, yelling at us while we stowed our luggage, \"Who the hell do you think you are?  You're holding up a whole bus load of people!\"  After our luggage was stowed, he continued to yell at us about how inconsiderate we were and how we were banned from every using the service again.  Once we were on the bus, turned to the driver and said, \"Can you believe these fucking people?\"\n\nHonestly, I know I was late -- I'm not excusing myself.  In fact, I expected that the bus would have already left or that I would not be allowed on.  I would have understood and been okay with either of those outcomes.  However, I found it extremely unprofessional to be yelled and cursed at for being late.  The bus driver, though, was really nice about the whole thing.  Seeing how shaken I was after the whole thing, he offered me a bottle of water and tried to comfort me, saying that he \"didn't believe in taking pleasure in the misfortune of others.\"\n\nFor what it's worth, when I asked the bus driver who the guy was, he said that he didn't know.  Given that he was wearing a Suburban Express shirt, I assumed that he was an employee of Suburban Express and unconnected with the charter company driving the bus.  \n\nOn a completely different note, another time that I rode Suburban Express, the driver missed the exit to the Northbrook Court stop.  Despite the GPS repeatedly telling him to exit, he also missed the next several exits and didn't turn around until a passenger went to tell him that he missed the exit.\n\nOn the other hand, I almost never ride LEX due to the mechanical failures of their buses.  Once, one of the tires on the bus blew out on the freeway and another time, the hood of the van started smoking during the trip.  Also, my roommate almost missed her flight due to a bus breaking down on the freeway. Why were you banned? Apparently, being late gets you banned. [deleted] I was recently banned by Suburban Express.  Having lost my ticket at the last minute, I had to go print out another one and arrived at the bus three minutes late -- I checked.  As I neared ISR, I saw that they still had a couple people boarding the bus.  When the guy in charge of directing the passengers to the appropriate bus saw me approaching, he yelled, \"If you want to catch this bus, you'd better start running!\"  He then proceeded to berate and me and two other guys for arriving late, yelling at us while we stowed our luggage, \"Who the hell do you think you are?  You're holding up a whole bus load of people!\"  After our luggage was stowed, he continued to yell at us about how inconsiderate we were and how we were banned from every using the service again.  Once we were on the bus, turned to the driver and said, \"Can you believe these fucking people?\"\n\nHonestly, I know I was late -- I'm not excusing myself.  In fact, I expected that the bus would have already left or that I would not be allowed on.  I would have understood and been okay with either of those outcomes.  However, I found it extremely unprofessional to be yelled and cursed at for being late.  The bus driver, though, was really nice about the whole thing.  Seeing how shaken I was after the whole thing, he offered me a bottle of water and tried to comfort me, saying that he \"didn't believe in taking pleasure in the misfortune of others.\"\n\nFor what it's worth, when I asked the bus driver who the guy was, he said that he didn't know.  Given that he was wearing a Suburban Express shirt, I assumed that he was an employee of Suburban Express and unconnected with the charter company driving the bus.  \n\nOn a completely different note, another time that I rode Suburban Express, the driver missed the exit to the Northbrook Court stop.  Despite the GPS repeatedly telling him to exit, he also missed the next several exits and didn't turn around until a passenger went to tell him that he missed the exit.\n\nOn the other hand, I almost never ride LEX due to the mechanical failures of their buses.  Once, one of the tires on the bus blew out on the freeway and another time, the hood of the van started smoking during the trip.  Also, my roommate almost missed her flight due to a bus breaking down on the freeway.       I'm surprised the Suburban Express account hasn't shown up to harass the people in this thread yet. What makes you think so? Any account which posts almost exclusively about Suburban Express is probably yet another Suburban Express account, like the OP and many others in this thread. You won't see posts on any other topics from many people who have posted in this thread. LEx is gone and Suburban Express is literally flogging a dead horse. They were obsessed with LEx when it was there, and they cannot let go of it even when it is gone. What makes you think so? Any account which posts almost exclusively about Suburban Express is probably yet another Suburban Express account, like the OP and many others in this thread. You won't see posts on any other topics from many people who have posted in this thread. LEx is gone and Suburban Express is literally flogging a dead horse. They were obsessed with LEx when it was there, and they cannot let go of it even when it is gone.     As much as I hate Suburban because they're assholes, I swore I would never take Lex after last year. They were almost always late, sometimes by more than an hour, which was annoying. But not too awful. But the thing that finally made me say enough was the time I took a bus back to Champaign at night, and the headlights of the bus weren't working. At all. And yet we drove all the way back to Champaign in the pitch dark. Driving at night without headlights is illegal in Illinois. I'm quite surprised they weren't pulled over by state police, because they're mainly in charge of enforcing imminent mechanical vehicle regulations, just like anyone else can get pulled over and written up for a traffic violation for driving without headlights.\n\nThanks for the response, please get in touch! Since you've researched the matter, which states allow one to drive at night without headlights? I'm curious. I didn't mean to imply there were any states that do allow driving without headlights at night. But if you're that curious, you could probably start [here](http://www.dmv.org/il-illinois/safety-laws.php). It really depends on the vehicle code of the state you're in. It may not be specifically illegal depending on the cop/lawyer you're dealing with, but it's an easy way to be cited for reckless and dangerous driving and grant probable cause for a traffic stop anyways.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18h2jo/lex_expresssuburban_express_customer_experience/"
  }, {
    "id" : 27,
    "title" : "UIUC sees decline in Asian applicants primarily due to the announcement that this is a smoke free campus",
    "snippet" : "Somebody in class claimed this but he had no factual evidence to back it up? Any truth to this?\n\nPersonally I think as long we have a top tier engineering and business program nobody will care but who knows.  [Correlation does not imply causation.](http://i.imgur.com/CMyJQTo.jpg)        [deleted] How someone can be a \"science\" major and vomit such unsubstantiated, intolerant bullshit is beyond me. [deleted] Sure. [deleted] How someone can be a \"science\" major and vomit such unsubstantiated, intolerant bullshit is beyond me.  [deleted] They don't get a free education you know. They pay alot more for tuition and other costs. They are honestly the reason U of I is where its at. Its what keeps us from being ISU, NIU, or SIU. They're usually filthy rich and what they can offer the school is unmatched. They also give the school alot of international exposure. So yea they're kinda important [deleted] American students cheat as well. Cheating is not relevant to this conversation and neither are grading curves. You sound a bit bitter? These students are what make U of I relevant as an academic institution. If you don't like it you can go to ISU [deleted] [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/18h3kg/uiuc_sees_decline_in_asian_applicants_primarily/"
  }, {
    "id" : 28,
    "title" : "New Python Users Group (Py-CU) first meeting",
    "snippet" : " ",
    "url" : "http://py-cu.org/events.html"
  }, {
    "id" : 29,
    "title" : "\"I don't do Eeyores. I do Tiggers.\" --Coach Groce",
    "snippet" : "   Watched this 3 times. Still don't know what he is talking about. People on the team need to have a good attitude like tigger, not be pessimistic like eeyore. He said he only had to send someone to the locker room once for being an eeyore.  Indeed. Someone asked him what Tyler Griffey's attitude had been like when he was struggling from 3. Said that he always has a great attitude. Griff sounds like a great kid - really glad to see him turn it around in such a huge way.  It's probably a reference to [Randy Pausch's Last Lecture](http://www.youtube.com/watch?feature=player_detailpage&amp;v=ji5_MqicxSo#t=3719s)  ",
    "url" : "http://www.youtube.com/watch?v=fGNBX2xEVSg&amp;t=8m27s"
  }, {
    "id" : 30,
    "title" : "Looking for 1 Umphrey's @ Canopy Ticket!",
    "snippet" : "Waited too long to buy tickets but would love to make it to the show on Sunday.  Any help would be much appreciated.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/18gwbt/looking_for_1_umphreys_canopy_ticket/"
  }, {
    "id" : 31,
    "title" : "Anyone here play Heroes of Newerth? ",
    "snippet" : "I know alot of people play LOL and dota 2 here. I just started playing hon and was looking for any uiuc people that played that wanted to queue up!  You don't like LoL? LoL master race checking in. AHAHHAHAHAHAH LoL master race that's a good one. LoL: for the gamer who doesn't really want to think too hard abotu his MOBA. Seriously, DOTA was the most infuriating experience of my life. Speak for yourself; I think very hard about my LoL. :) Academic Adviser... one of us?!? Speak for yourself; I think very hard about my LoL. :) LoL: for the gamer who doesn't really want to think too hard abotu his MOBA. Seriously, DOTA was the most infuriating experience of my life. LoL: for the gamer who doesn't really want to think too hard abotu his MOBA. Seriously, DOTA was the most infuriating experience of my life.    whats your mmr? I sit around 1500. Still learning I haven't played in a while but are there still a significant amount of smurfs in that MMR range?  (I am a pre-compression 1900, right now sitting at 1750)    Cmon man y dont u play dota 2 it so god cuz its beter han lol and its hardr so ir a hety rt in man aojbuy http://i.imgur.com/VIFvW.gif I don't understand why that doesn't hurt. Cmon man y dont u play dota 2 it so god cuz its beter han lol and its hardr so ir a hety rt in man aojbuy",
    "url" : "http://www.reddit.com/r/UIUC/comments/18gocl/anyone_here_play_heroes_of_newerth/"
  }, {
    "id" : 32,
    "title" : "In response to the thread yesterday, here's all the documents for the Illinois Student Senate referenda questions",
    "snippet" : "The documents associated with the proposed constitutional changes are provided here: http://iss.illinois.edu/documents.asp",
    "url" : "http://www.reddit.com/r/UIUC/comments/18g2sm/in_response_to_the_thread_yesterday_heres_all_the/"
  }, {
    "id" : 33,
    "title" : "Anybody have basketball tickets to tonight's game? I'm looking for 2.",
    "url" : "http://www.reddit.com/r/UIUC/comments/18h6ui/anybody_have_basketball_tickets_to_tonights_game/"
  }, {
    "id" : 34,
    "title" : "my friend snapped this picture outside of the union the other day.  I'm not sure how to feel about this.",
    "snippet" : "  I can't think of anything but how terrible Tobias in animorphs felt about himself when he finally accepted that he had to kill to live as the red-tailed hawk he had been trapped as.\n\nBut then he accepted himself for who he was. I think we can accept this hawk for who it is:\nan awesome hawk. I can't think of anything but how terrible Tobias in animorphs felt about himself when he finally accepted that he had to kill to live as the red-tailed hawk he had been trapped as.\n\nBut then he accepted himself for who he was. I think we can accept this hawk for who it is:\nan awesome hawk. Thank you, just spent 5 minutes reliving that wonderful series in my head instead of studying. \n\nJake - The Tiger\nMarco - The Gorilla\nAx - himself\nRachel - the Bear\n...can't remember anymore I can't think of anything but how terrible Tobias in animorphs felt about himself when he finally accepted that he had to kill to live as the red-tailed hawk he had been trapped as.\n\nBut then he accepted himself for who he was. I think we can accept this hawk for who it is:\nan awesome hawk.     Nobody treats our future mascot like that! Our future mascot is the Kraken!      It took me a couple minutes to realize this, but the squirrel's head is hanging about six inches below its body.   Eww. Could've warned about the contents... You're at least 18 years old and you're on the internet,\nseriously? Eww. Could've warned about the contents...  Majestic bird of prey eating a rodent that over populates our campus? Why dont know you know to feel? Its nature. This is an awesome picture. the squirrels are all little bastards anyway Fun fact: the squirrels were actually introduced to campus in the early 1900s to give a little more character to the quad. And now one lives in my ceiling.  Thanks early 1900s UofI! You're lucky you only have one. I'm pretty sure there's a whole family of the fuckers living in ours... If time travel is invented, I'm stopping the introduction of squirrels to uiuc.  Those things running around on a drop ceiling is unnerving.  Especially once you know they'll eat meat. Forget Hitler, we're gonna go fight squirrel introduction   Put this on R/WTF I freaked out a bit when I saw the squirrel head hanging there...    And marking it NSFW though really it's not that bad. I don't know why at least 18 year old college students on the internet are complaining about this picture being too graphic\n  NSFW NSFL NSFLOL NSFLOL NSFL  [deleted] [deleted] [deleted] ASSHAT! Once again, no names, kids. thank you murph :) See, now I know who I am.\n\nAnd now I'm off to PM myself very creepy things.               [deleted] How do you find a vegetarian on reddit? oh, **all** my posts are about vegetarianism. How do you find a vegetarian on reddit? How do you find a vegetarian on reddit?  This is awkward. The original photographer is my room mate and showed me this picture a couple days ago. I could of posted it and received an abundant load of karma. :( Rats.  are you ben",
    "url" : "http://i.imgur.com/OCfWWuC.jpg"
  }, {
    "id" : 35,
    "title" : "Yet another Harlem Shake video - this time in Grainger (study room)! Give us some likes for E-Week!",
    "snippet" : "  Would I get points for dancing naked in the Lincoln Hall auditorium, with my wiener flopping everywhere, and a paper bag on my head?  Huge fan of the alien headed guy wearing an American flag cape. Huge fan of the alien headed guy wearing an American flag cape.   Why?  Combines everything I love. EWeek, Harlem shake, and grainger. What team? Theta-Taurus Rex!   Have you submitted to /r/Harlemshake ? This one is definitely better than the ugl one, probably because this lacks dude ass.   stop  Why is it that every E-Week video has been a Harlem Shake? Coincidence and timing\n Coincidence and timing\n Sup kief Why is it that every E-Week video has been a Harlem Shake? Yeah, it's just too perfect timing. We had the idea this weekend, but SHPE got theirs posted a day before ours. Is there a third one? there's a few general ones from the university as well. SHPE had the idea this weekend too.\n\nSource: I'm in SHPE Is SHPE's Harlem Shake video their submission for their E-Week video? Our president said it was. Tell him he still has to tweet it at E-Week and post it on the facebook page for it to count.  Was right outside the door when you guys did this. Took me a while to figure out what was going on in the room.    Is this in the legendary Theta Tau study room? Haha I didn't know the Theta Tau study room was \"legendary\". I mean, it is now I guess. 100 LIKES ON YOUTUBE :) *watermelon* **kate**... \ngee I wonder who this is.     [deleted]",
    "url" : "http://www.youtube.com/watch?v=j5bCRDbue-M&amp;feature=youtu.be"
  }, {
    "id" : 36,
    "title" : "Launch an Illinois alum into space!! - In 54th place right now...",
    "snippet" : "  Short Description: Vote for me to go up into space. You can only vote once but you can invite others to vote! My goal is to get 1000 votes by 2/18/13. I should be in the top 20 that way and convincing strangers on the street should be much easier then. Thank you! :D\n\nhttps://www2.axeapollo.com/en_US/28525/kamil-stelmach\n\nLong Description:\n\nHi everyone,\n\nSo I kind of dreamed of going up to space ever since I was a youngling (pictures to be released in March when I return to la casa de mi padres). My interests in space have only grown since then: I interned at NASA twice, once each at NASA Ames and at the Jet Propulsion Laboratory; I flew (a hastily constructed) experiment in zero gravity; and am now a Master's graduate student at George Mason University studying planetary ice chemistry.\n\nNever for a second I would have thought that I could go up to space in my 20s, but recent developments have changed that. AXE - the deodorant company and not the chemistry fraternity - is hosting a competition to send a few people into a space through the developing Lynx Mark I suborbital spacecraft. Naturally, I decided to enter this competition: if I am in the top two portion in the US leaderboard then I will move on to the next level of selection. \n\nHow can you help? By voting for me by April 30th! Also, I guess it would help if you shared this event with your friends...but then you'd be going above and beyond my request so I would have to enter into your servitude forever.\n\nThanks everyone! And sorry for inviting you if you voted already &gt;.&lt;\n\n-Kamil \n\nHere is a video of some cats in zero gravity:\n\nhttp://www.youtube.com/watch?v=O9XtK6R1QAkShort Description: Vote for me to go up into space. You can only vote once but you can invite others to vote! My goal is to get 1000 votes by 2/18/13. I should be in the top 20 that way and convincing strangers on the street should be much easier then. Thank you! :D\n\nhttps://www2.axeapollo.com/en_US/28525/kamil-stelmach\n\nLong Description:\n\nHi everyone,\n\nSo I kind of dreamed of going up to space ever since I was a youngling (pictures to be released in March when I return to la casa de mi padres). My interests in space have only grown since then: I interned at NASA twice, once each at NASA Ames and at the Jet Propulsion Laboratory; I flew (a hastily constructed) experiment in zero gravity; and am now a Master's graduate student at George Mason University studying planetary ice chemistry.\n\nNever for a second I would have thought that I could go up to space in my 20s, but recent developments have changed that. AXE - the deodorant company and not the chemistry fraternity - is hosting a competition to send a few people into a space through the developing Lynx Mark I suborbital spacecraft. Naturally, I decided to enter this competition: if I am in the top two portion in the US leaderboard then I will move on to the next level of selection. \n\nHow can you help? By voting for me by April 30th! Also, I guess it would help if you shared this event with your friends...but then you'd be going above and beyond my request so I would have to enter into your servitude forever.\n\nThanks everyone! And sorry for inviting you if you voted already &gt;.&lt;\n\n-Kamil \n\nHere is a video of some cats in zero gravity:\n\nhttp://www.youtube.com/watch?v=O9XtK6R1QAk  http://en.wikipedia.org/wiki/List_of_University_of_Illinois_at_Urbana%E2%80%93Champaign_people#Astronauts  Alumnus, damnit!\n\nPedantry done now...",
    "url" : "https://www.facebook.com/pages/Send-an-Illini-Alum-to-Space/206329999509183"
  }, {
    "id" : 37,
    "title" : "Why..UIUC..? Why?",
    "snippet" : "  wellllllllllll.... that was weird    Literally and figuratively the ballsiest one I've seen so far. There are several of these? There are several of these?    I've never been to UGL. After seeing this video, I don't think I'll ever go. Grainger is closer to where I live anyways. The bottom floor is better. It's quiet. I prefer Grainger, though. Grainger has gotten busy as fuck this year though.   This video describes the UGL perfectly.     [deleted] [deleted]    ...Might as well capitalize off of this for some attention to our university. [Crossposted to r/harlemshake](http://www.reddit.com/r/harlemshake/comments/18e2bq/harlem_shake_university_of_illinois_edition/)!      This why UGL is UGL. Never happening in Grainger.   [deleted]  Harlem Shake Protip: If you don't have cool costumes, it's best to just not make a video at all rather than wearing nothing.       this is literally ...literally what? \n\nI think you accidentally a word.  [deleted] [deleted]",
    "url" : "https://www.youtube.com/watch?feature=player_embedded&amp;v=6HqaYYrCfKs"
  }, {
    "id" : 38,
    "title" : "Lincoln Hall will be rededicated today at 4, catch the livestream of the event here. Governor Quinn, among others, will be speaking. ",
    "url" : "http://www.lincolnhall.illinois.edu/events/"
  }, {
    "id" : 39,
    "title" : "Coach Beckman handing out vouchers for free food at Union 2/12 from 12-1",
    "snippet" : "      Coach Beckman really cares about the students and wants to get them and the community involved, lot more active with the student body than Zook was. He seems like a great guy and I really hope that he can turn this program around. He's a great guy in public and to the fans/students... Unfortunately, that's about all I can say for his character.   Really? Thats a shame, Everyone I know that has interacted with him said he was really nice. So you're saying he's a jerk otherwise?\n     [deleted]",
    "url" : "https://twitter.com/coachbeckman/status/301360487503892482"
  }, {
    "id" : 40,
    "title" : "Petition to Add Referenda Questions (Current Students Only)",
    "snippet" : "   &gt;  Do you approve of the Student Government as the Official Voice of the Student Body (Illinois Student Senate) through a new Constitution and Transition Document as proposed by the Commission on Constitutional Reform and adopted by the Illinois Student Senate?\n\nWhat does that even mean?\n\n&gt; Should each student contribute $1.00 per semester to the Student Government to keep the Student Government financially independent from the University and Campus Administrations?\n\nI thought we did already. Are you asking for more? 1. The Illinois Student Senate created a special commission in the Fall to look into ways of improving the ISS Constitution (e.g. to make the student government more effective and representative). This question asks the Student Body to approve the commission's draft as adopted by ISS - as a referendum vote is the only way to change the student government Constitution. (I agree that the wording is terrible, but a number of senators were dead set that it appear this way.)\n2. The ISS is currently funded by the University's Office of Student Affairs, from general student fee money. The second question aims to replace this money with a direct student fee. This is intended to make the student government directly accountable to students and open up it's funding to review by the Student Fee Advisory Committee in the same way fees for McKinley, Krannert, and Assembly Hall are reviewed and require renewal periodically by referenda vote. At $1.00/semester, this would account for slightly less than a doubling of the ISS's funding, iirc. While this seems a bit extreme, the fee would require approval by SFAC, who have a history of severely cutting fees post-referendum. For example, Illini Media was granted $3.00/semester in last Spring's vote, but SFAC cut that to $1.85/semester.\n\nTLDR; 1) Approve the new, reformed Constitution for the student government, 2) move the student government to a funding system subject to review and periodic renewal by the students. a number of senators are idiots then. The original amendment was going to be \"Do you approve of the reorganization and existence of the student government through...\".  They wanted a direct mandate from the students (Since the current form of ISS sucks...)  One senator was worried that if it was rejected it would mean a dismantling of the senate and gutted the language.   I stand by my statement. Nothing personal against them though; they are probably good at other things. The original amendment was going to be \"Do you approve of the reorganization and existence of the student government through...\".  They wanted a direct mandate from the students (Since the current form of ISS sucks...)  One senator was worried that if it was rejected it would mean a dismantling of the senate and gutted the language.   For reference, the original question was:\n\n\"Should the Constitution and Transition Document of the Student Government of the University of Illinois at Urbana-Champaign be ratified  as unanimously recommended by Commission on Constitutional Reform and as approved by two-thirds vote of the Illinois Student Senate?\" The ORIGINAL question doesn't matter, burntglass. The only thing that matters is the final version of the referendum question. Why are you confusing people?  1. The Illinois Student Senate created a special commission in the Fall to look into ways of improving the ISS Constitution (e.g. to make the student government more effective and representative). This question asks the Student Body to approve the commission's draft as adopted by ISS - as a referendum vote is the only way to change the student government Constitution. (I agree that the wording is terrible, but a number of senators were dead set that it appear this way.)\n2. The ISS is currently funded by the University's Office of Student Affairs, from general student fee money. The second question aims to replace this money with a direct student fee. This is intended to make the student government directly accountable to students and open up it's funding to review by the Student Fee Advisory Committee in the same way fees for McKinley, Krannert, and Assembly Hall are reviewed and require renewal periodically by referenda vote. At $1.00/semester, this would account for slightly less than a doubling of the ISS's funding, iirc. While this seems a bit extreme, the fee would require approval by SFAC, who have a history of severely cutting fees post-referendum. For example, Illini Media was granted $3.00/semester in last Spring's vote, but SFAC cut that to $1.85/semester.\n\nTLDR; 1) Approve the new, reformed Constitution for the student government, 2) move the student government to a funding system subject to review and periodic renewal by the students. This still doesn't answer NV's question on item 1: \"What does that even mean?\"\nHow ~~do~~ will we know what's in that new constitution? ",
    "url" : "https://illinois.edu/fb/sec/632204"
  }, {
    "id" : 41,
    "title" : "Wendy's Is Open!",
    "snippet" : "  Okay, Wendy's is a pretty good fast food restaurant. Much better than McDonald's or Burger King. But I don't understand. It's not a place that I'd wait in line out the door for.  Seriously, Mor, I don't understand it either. It's my go-to when I'm running low on the budget at the end of the month, but otherwise... what's the big deal? Most students on campus are constantly in that \"low budget at the end of the month\" range Seriously, Mor, I don't understand it either. It's my go-to when I'm running low on the budget at the end of the month, but otherwise... what's the big deal? Its more the fact that we finally have a good fast food place within walking distance. That and Wendys is fucking delicious. I went for the experience and my first fast food in over 2 months. \n\nAlso, due to some cashier error, they gave me my meal for free so it was worth it (yes, I did tell them I didn't pay yet and they told me to just go ahead anyway, I didn't just steal food.)   Any free food for opening day/week? Any free food for opening day/week? for those standing in line the manager was doing a guess a number between 1-100. the first person to guess won whatever she was holding. mostly frosties and those ice coffee things  Can anyone explain what's the big deal? Never tried it. Can anyone explain what's the big deal? Never tried it. Can anyone explain what's the big deal? Never tried it. For me at least, it's b/c this one is the first wendys/mcdonalds/burger king/five guys/steak and shake to open in campustown Oh wow. Back in my dad we had McDonald's, Burger King, and Wendy's. Can anyone explain what's the big deal? Never tried it. [deleted]   Got a frosty and a double stack x crispy chicken (\"McGangBang\"), waited in line from about 11:10 to 11:25, once I orded I got my food pretty quick.\n\nAsked for dine in, but they gave me a takeout bag with no napkins in it. God damn burger got mustard and ketchup all over my hands and frosty.\nPretty nice wendys, itll be better in a week once the staff is more used to the work. Theyve also got one of those Coke machines that let you choose from 100s of different flavor combinations which is pretty  cool Yup, I had the same problem, no napkins. The manager was looking over the shoulder of some of the ordering staff, so I guess most of them are still being trained. Definitely potential though.  Yup, I had the same problem, no napkins. The manager was looking over the shoulder of some of the ordering staff, so I guess most of them are still being trained. Definitely potential though.  You guys realize there were napkin dispensers right by the straws and drink covers, right? Yup, I had the same problem, no napkins. The manager was looking over the shoulder of some of the ordering staff, so I guess most of them are still being trained. Definitely potential though.  &gt; I guess most of them are still being trained. \n\nConsidering the restaurant just opened, that's a fairly safe bet.  I thought fast food chains were banned from campus/campustown? You're getting downvoted, but maybe the younger posters here don't remember when there used to be two McDonalds, a Wendys, and a Burger King on campus until the University forced them out during that anti-fast food craze in the late 90s/early 2000s. You're getting downvoted, but maybe the younger posters here don't remember when there used to be two McDonalds, a Wendys, and a Burger King on campus until the University forced them out during that anti-fast food craze in the late 90s/early 2000s. seriously we just got rid of the fast food and now it came back You're getting downvoted, but maybe the younger posters here don't remember when there used to be two McDonalds, a Wendys, and a Burger King on campus until the University forced them out during that anti-fast food craze in the late 90s/early 2000s. &gt;Reports that McDonald's Corp. is planning to open two restaurant outlets on the University of Illinois campus in Chicago, Illinois.\n\n Oops. Well, regardless, there was one in the Union basement and one on Green Street. Oops. Well, regardless, there was one in the Union basement and one on Green Street. &gt;Reports that McDonald's Corp. is planning to open two restaurant outlets on the University of Illinois campus in Chicago, Illinois.\n\n I thought fast food chains were banned from campus/campustown? subway, jummy john's, chipotle... In combo with thatoneguy's post, they certainly have a different menu and far less locations(well JJ and Chipotle) then the burger joints. Subway is currently ranked with the most locations in the world. subway, jummy john's, chipotle...     I might get down voted for this but I don't care... Wendy's.",
    "url" : "http://www.facebook.com/events/108287612686395/"
  }, {
    "id" : 42,
    "title" : "Saddened by the loss of the Guiness toucan in the Murphys basement, my friend decided to improvise.",
    "url" : "http://imgur.com/a/kfeW9"
  }, {
    "id" : 43,
    "title" : "Anyone selling or know of anyone selling a Loaded Vanguard longboard on campus?",
    "snippet" : "I need a longboard (preferably a Vanguard) for a project I'll be doing soon, and wanted to see what my options were for buying.  Thanks all!",
    "url" : "http://www.reddit.com/r/UIUC/comments/18dbqc/anyone_selling_or_know_of_anyone_selling_a_loaded/"
  }, {
    "id" : 44,
    "title" : "After a good week, we managed to get a few Top 25 votes, and are 26th in the RPI",
    "snippet" : "   Our RPI is helped by the [5th hardest schedule](http://espn.go.com/mens-college-basketball/rpi/_/sort/sos).",
    "url" : "http://espn.go.com/mens-college-basketball/rankings"
  }, {
    "id" : 45,
    "title" : "Quick question: If anyone is in ECE 206 could you please help me out because I'm an idiot?",
    "snippet" : "I forgot to write down the correct answers for pre-lab 2 that were given in lab after we turned the pre-lab in. I need those answers to do the post-lab and want to make sure I use the correct values. If you have the answers for Pre-Lab 2 (the one we turned in last week involving the thevenin and norton circuits) could you please share?  Va0  7.5\nVb0  4.44\nVc0 4.59\nVd0 .417\ni1 .0756\ni33 .882\ni3 -.465\ni8 .541\ni11 .417\n Cleaned it up for clarity's sake (space twice then enter to create a new line):  \nVa0  7.5  \nVb0  4.44  \nVc0 4.59  \nVd0 .417  \ni1 .0756  \ni33 .882  \ni3 -.465  \ni8 .541  \ni11 .417   Cleaned it up for clarity's sake (space twice then enter to create a new line):  \nVa0  7.5  \nVb0  4.44  \nVc0 4.59  \nVd0 .417  \ni1 .0756  \ni33 .882  \ni3 -.465  \ni8 .541  \ni11 .417   I'm looking at my lab data right now, and shouldn't all those current values be in some SI form of amps, milli or micro? I'm looking at my data now, and it looks like all of the voltages are in Volts (V), and all of the currents are in milliAmps (mA). Va0  7.5\nVb0  4.44\nVc0 4.59\nVd0 .417\ni1 .0756\ni33 .882\ni3 -.465\ni8 .541\ni11 .417\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/18busf/quick_question_if_anyone_is_in_ece_206_could_you/"
  }, {
    "id" : 46,
    "title" : "Illinois men's basketball beats Minnesota (ranked 18th) 57-54, and improves to 4-7 in the Big 10!",
    "snippet" : "  Abrams 3 at the end was so nasty I felt defiled all the way in Champaign  \"ugh why did you shoot that\"  \"OMG YES!\"  \"I still cant believe you shot that\"  We now have the most wins against ranked teams in the country. Whered you figure that from?    Next 3 games are pretty manageable too.  Hopefully there won't be a letdown. We'd better beat Purdue -.- Or Notherwestern.  Tyler and Tracy are my new favorite people ever.   ",
    "url" : "http://scores.espn.go.com/ncb/boxscore?gameId=330410135"
  }, {
    "id" : 47,
    "title" : "Should the ISS Consider the Nuclear-Capable Iran Resolution? ",
    "snippet" : "The Illinois Student Senate decided not to take up a resolution at its meeting on a nuclear-capable Iran because it felt it was not a pertinent student/campus issue. Others feel that the Senate should field any topic brought to them by students. What should the Senate do?\n\n[daily illini](http://www.dailyillini.com/opinion/letters_to_editor/article_4838626e-7401-11e2-a010-0019bb30f31a.html)  It isn't a pertinent student/campus issue. They should ignore this crap and focus on relevant issues. It isn't a pertinent student/campus issue. They should ignore this crap and focus on relevant issues. It isn't a pertinent student/campus issue. They should ignore this crap and focus on relevant issues. Well obviously it's not an issue relating to the University of Illinois specifically. But there are Israeli students on campus along with students who have Israeli relatives (such as myself) who consider this to be a serious issue. If the ISS passes a resolution against a nuclear Iran, it WILL be brought to the Illinois State Senate, because we are the flagship university in this state. So, you admit it has nothing to do with the University and it's students, and in reality, is just a PR stunt to get the attention of the Illinois Senate.  :) Well obviously it's not an issue relating to the University of Illinois specifically. But there are Israeli students on campus along with students who have Israeli relatives (such as myself) who consider this to be a serious issue. If the ISS passes a resolution against a nuclear Iran, it WILL be brought to the Illinois State Senate, because we are the flagship university in this state. Well obviously it's not an issue relating to the University of Illinois specifically. But there are Israeli students on campus along with students who have Israeli relatives (such as myself) who consider this to be a serious issue. If the ISS passes a resolution against a nuclear Iran, it WILL be brought to the Illinois State Senate, because we are the flagship university in this state.  We have United States senators we elect to concern themselves with these issues. We have the ISS to deal with campus issues.  That depends, how many hundreds of dollars worth of cupcakes will this cost us all?    ~~What confuses me is how the sponsors chose to introduce this resolution. Had they submitted it the Sunday before the meeting, it would have been placed on the agenda **automatically** and would have been referred to a committee like any other resolution. Instead they decided to amend the agenda after the meeting began, forcing this awkward confrontation and the failed vote. I don't understand their thinking...~~\n\nThat being said, I have to side with the Treasurer on this one. If a student group wants the ISS's help to lobby their Congressional representatives, then that's fine - that's part of why ISS exists. But ISS shouldn't act as a means to condemn things \"as the Official Voice of the Student Body\", especially on issues where they lack the perspective to make a truly informed choice.\n\n**Update:** I was contacted by a source close to the matter shortly after posting. According to this source, the resolution was submitted prior to the Sunday deadline, but was not added to the agenda. After contacting another source close to the agenda setting process, I was informed that the submitted resolution lacked a sponsor, precluding its consideration and thus addition to the agenda. I'm not really sure what to conclude from all this, but that's the update. I've stricken the first paragraph of this post to mark the error, but I think it's still worth reading if you're interested in submitting a resolution to ISS at some future date. [deleted]   This is crap. Disband them immediately. CBoidy, I agree with you! How can the ISS exist if their constituents dont WANT them to exist? To be fair this comment was sarcastic. It would be by and large a waste of time to cover the topic.\n\nThat said, I still think they should be disbanded in favor of a more representative system. Though I cannot speak to the mechanism that would be at work in such a system. In order to be more representative, people have to care. How many students even know that ISS exists, let alone what it does?    There are Israeli students whose homes and families are affected by a nuclear Iran.  There are Iranian students who are affected by the Iranian regime and its human rights record.  Why shouldn't the ISS tackle this issue? By that logic, we should be condemning numerous countries because of their human rights issues, including Israel. We can't just pick and choose which countries to publicly condemn, especially if the whole student body does not agree with it.  ISS is a representative government, not a direct democracy.  In a representative government, the leaders decide what is best.   There are Israeli students whose homes and families are affected by a nuclear Iran.  There are Iranian students who are affected by the Iranian regime and its human rights record.  Why shouldn't the ISS tackle this issue? There are Israeli students whose homes and families are affected by a nuclear Iran.  There are Iranian students who are affected by the Iranian regime and its human rights record.  Why shouldn't the ISS tackle this issue? There are Israeli students whose homes and families are affected by a nuclear Iran.  There are Iranian students who are affected by the Iranian regime and its human rights record.  Why shouldn't the ISS tackle this issue? There are Israeli students whose homes and families are affected by a nuclear Iran.  There are Iranian students who are affected by the Iranian regime and its human rights record.  Why shouldn't the ISS tackle this issue? There are Israeli students whose homes and families are affected by a nuclear Iran.  There are Iranian students who are affected by the Iranian regime and its human rights record.  Why shouldn't the ISS tackle this issue? I don't understand you. You seem to care a lot about the [Civic Leadership Program](http://www.reddit.com/r/UIUC/comments/1479pj/the_unfortunate_restructuring_of_the_civic/), but don't say anything positive about the Senate even though they are trying to tackle this issue. Instead you try to convince people that the [Senate is wasting time and money](http://www.reddit.com/r/UIUC/comments/182ely/iss_last_night_300_for_cupcakes_1775_for/) on other things without giving any details. After complaining about the Senate wasting time and money, you then insist that they should go through with a meaningless gesture that could not ever possibly result in meaningful policy change. Your priorities don't make any sense and all you seem to do is hate on the Senate no matter what they are trying to do.\n\nWho do you work for? This post currently has *four* reports.\n\nSomeone's mad.\n\n(And no, I'm not going to remove a well reasoned post by an active member of the community that's not violating any rules. Even if you click that report button a million times.) I don't understand you. You seem to care a lot about the [Civic Leadership Program](http://www.reddit.com/r/UIUC/comments/1479pj/the_unfortunate_restructuring_of_the_civic/), but don't say anything positive about the Senate even though they are trying to tackle this issue. Instead you try to convince people that the [Senate is wasting time and money](http://www.reddit.com/r/UIUC/comments/182ely/iss_last_night_300_for_cupcakes_1775_for/) on other things without giving any details. After complaining about the Senate wasting time and money, you then insist that they should go through with a meaningless gesture that could not ever possibly result in meaningful policy change. Your priorities don't make any sense and all you seem to do is hate on the Senate no matter what they are trying to do.\n\nWho do you work for? I'm not surprised that ChairYeoman is defending the Student Senate as the ISS is paying him $1000+ to be the \"webmaster\" according to his flair.\n\nIt is important to understand what the original intent was of the ISS as we discuss its relevance today...10+ years ago the only purpose of the ISS was to lobby the academic/faculty senate on issues relating to the academic/university issues. There USED to be a \"Illinois Student Government\" which pretended they were government officials. The ISS of today is acting more like the ISG of yesterday, squandering thousands of dollars of senate dollars acquired through mandatory student fees and tuition.\n\nWe need to go back to the basics. The civic leadership situation is a prime example on how the ISS can genuinely serve a purpose... Unless of course if you'd rather aspire to keep the ISS around that is spending thousands on cupcakes, toys, and typos... There are Israeli students whose homes and families are affected by a nuclear Iran.  There are Iranian students who are affected by the Iranian regime and its human rights record.  Why shouldn't the ISS tackle this issue?",
    "url" : "http://www.reddit.com/r/UIUC/comments/18b7ye/should_the_iss_consider_the_nuclearcapable_iran/"
  }, {
    "id" : 48,
    "title" : "Help Support a New All-Ages Venue &amp; Record Shop",
    "snippet" : "  this town is desperately lacking a steady AA venue since the courtyard cafe stopped having shows. I urge people to contribute to this if they have an interest in fostering young people's interest in music [and ultimately, they start making it on their own] It also looks like it will be a nice practice venue. It'll be nice to have an all ages venue that isn't someone's basement.  Although, when Error was a basement show place, it was also fantastic. the house that was later Aykroyd's / Terror?? the first house shows I ever went to and played at were in that basement. fucking love that place.   I know I probably won't go to the shows, but the Record Shop portion has me very interested.  we got plenty of hipsters on campus im sure you could raise 3 grand if you publicize this more campus hipsters generally don't really give a fuck about stuff like this",
    "url" : "http://www.indiegogo.com/projects/error-records-all-ages-music-venue?c=home"
  }, {
    "id" : 49,
    "title" : "TIL that in 1996 students at UIUC played a pivotal role in bringing South Park to life by sharing the creators' short film \"Jesus vs. Santa\" with the internet (audio, skip to ~5:30)",
    "snippet" : "  Bah, beat me by 19 seconds lol.  The whole thing is a great listen! WBEZ listener as well? I am indeed! WBEZ listener as well? What's the station for WBEZ down here?  It used to be at www.killfile.org/soxmas, but looks like Skirv recently updated his site... he mentions it here: http://wiki.killfile.org/projects/soxmas/   It's probably still on the servers there.  Look for \"soxmas.mpg\"  i myself forwarded that video probably 15 or 20 times.....\n\nedit....looks like I've forgotten the timeline for video formats... it was \"soxmas.mov\" Hahaha - it is still here!!  \n\n**[Wrong One - see the comment below by never-rong!]**\n\nhttp://www.ks.uiuc.edu/~tskirvin/soxmas/so-frosty.mov\n\nThe account belongs to Tim Skirvin who I believe used to run the local usenet-server after the UIUC shut down the local uiuc.edu newsserver.  :)  It's about 4 minutes long and really bad video quality, unfortunately.  But still funny.\n\nEdit- UH.. it appears that Tim Skirvin was the first to put it online at UIUC!  ha! :)  I think someone should get some sort of compensation... maybe 10% finders fee from comedy central?  ;) You linked the wrong one......the **ORIGINAL**, however is in that directory as well....\n\nhttp://www.ks.uiuc.edu/~tskirvin/soxmas/soxmas.mov\n\nAt the time 50mb was *HUGE* file to move around.  Lots of people outside the dorms had *dialup*, so that took a long time to download and a lot of effort to keep your housemates off the phone long enough. Hahaha - it is still here!!  \n\n**[Wrong One - see the comment below by never-rong!]**\n\nhttp://www.ks.uiuc.edu/~tskirvin/soxmas/so-frosty.mov\n\nThe account belongs to Tim Skirvin who I believe used to run the local usenet-server after the UIUC shut down the local uiuc.edu newsserver.  :)  It's about 4 minutes long and really bad video quality, unfortunately.  But still funny.\n\nEdit- UH.. it appears that Tim Skirvin was the first to put it online at UIUC!  ha! :)  I think someone should get some sort of compensation... maybe 10% finders fee from comedy central?  ;) Yep!  I've got a friend who was in the room when Tim did it.  I was one of the first to download the file, and still have it on an old Mac in my basement. :) ",
    "url" : "http://www.onthemedia.org/2013/feb/08/viral-videos-patient-zero/"
  } ],
  "processing-time-source" : 55,
  "processing-result.title" : "uiuc2_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/home/ciara/Documents/programming/cs467/rtopics/r-topics/carrot2-cli-3.6.2/../data/uiuc2_reddit.xml"
  }
}