{
  "processing-time-total" : 1492,
  "clusters" : [ {
    "id" : 0,
    "size" : 6,
    "score" : 33.686638559670115,
    "phrases" : [ "Bar" ],
    "documents" : [ 3, 11, 17, 30, 31, 47 ],
    "attributes" : {
      "score" : 33.686638559670115
    }
  }, {
    "id" : 1,
    "size" : 6,
    "score" : 54.91416961927417,
    "phrases" : [ "Picture" ],
    "documents" : [ 5, 7, 11, 31, 43, 48 ],
    "attributes" : {
      "score" : 54.91416961927417
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 70.1555828393057,
    "phrases" : [ "Transfer" ],
    "documents" : [ 26, 37, 42, 47, 49 ],
    "attributes" : {
      "score" : 70.1555828393057
    }
  }, {
    "id" : 3,
    "size" : 4,
    "score" : 47.747533468031214,
    "phrases" : [ "Able to Help" ],
    "documents" : [ 10, 47, 48, 49 ],
    "attributes" : {
      "score" : 47.747533468031214
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 53.29863720945901,
    "phrases" : [ "Considering where to Live" ],
    "documents" : [ 3, 30, 47, 49 ],
    "attributes" : {
      "score" : 53.29863720945901
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 35.29562123377718,
    "phrases" : [ "Eye" ],
    "documents" : [ 3, 28, 35, 38 ],
    "attributes" : {
      "score" : 35.29562123377718
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 52.09089634853303,
    "phrases" : [ "Study Abroad" ],
    "documents" : [ 2, 10, 13, 47 ],
    "attributes" : {
      "score" : 52.09089634853303
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 117.12169918771076,
    "phrases" : [ "CS Math" ],
    "documents" : [ 14, 28, 40 ],
    "attributes" : {
      "score" : 117.12169918771076
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 47.35543213917149,
    "phrases" : [ "Link for Easy" ],
    "documents" : [ 9, 47, 49 ],
    "attributes" : {
      "score" : 47.35543213917149
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 46.387770028856835,
    "phrases" : [ "Ride" ],
    "documents" : [ 11, 15, 33 ],
    "attributes" : {
      "score" : 46.387770028856835
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 54.68016931276661,
    "phrases" : [ "Sports" ],
    "documents" : [ 30, 32, 47 ],
    "attributes" : {
      "score" : 54.68016931276661
    }
  }, {
    "id" : 11,
    "size" : 2,
    "score" : 112.35974258261,
    "phrases" : [ "ECE 391" ],
    "documents" : [ 13, 28 ],
    "attributes" : {
      "score" : 112.35974258261
    }
  }, {
    "id" : 12,
    "size" : 2,
    "score" : 94.73110717842624,
    "phrases" : [ "John Groce" ],
    "documents" : [ 6, 43 ],
    "attributes" : {
      "score" : 94.73110717842624
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 61.611011140953515,
    "phrases" : [ "Print" ],
    "documents" : [ 14, 36 ],
    "attributes" : {
      "score" : 61.611011140953515
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 48.711246208808426,
    "phrases" : [ "Ranking" ],
    "documents" : [ 4, 49 ],
    "attributes" : {
      "score" : 48.711246208808426
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 50.643119862213815,
    "phrases" : [ "Sell Books" ],
    "documents" : [ 8, 47 ],
    "attributes" : {
      "score" : 50.643119862213815
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 93.54060633897114,
    "phrases" : [ "Spring 2013" ],
    "documents" : [ 44, 47 ],
    "attributes" : {
      "score" : 93.54060633897114
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 99.90902307565207,
    "phrases" : [ "Steam Tunnels" ],
    "documents" : [ 11, 12 ],
    "attributes" : {
      "score" : 99.90902307565207
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 63.817855328522796,
    "phrases" : [ "Suburban Express" ],
    "documents" : [ 21, 25 ],
    "attributes" : {
      "score" : 63.817855328522796
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 48.391470400660296,
    "phrases" : [ "Turned in my Test and Walked" ],
    "documents" : [ 11, 49 ],
    "attributes" : {
      "score" : 48.391470400660296
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 42.05293641227769,
    "phrases" : [ "Win" ],
    "documents" : [ 5, 49 ],
    "attributes" : {
      "score" : 42.05293641227769
    }
  }, {
    "id" : 21,
    "size" : 16,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 1, 16, 18, 19, 20, 22, 23, 24, 27, 29, 34, 39, 41, 45, 46 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1431,
  "documents" : [ {
    "id" : 0,
    "title" : "Does anyone need a place to live next year, im looking for a roomate",
    "snippet" : "Me and my friend are planning on getting an apartment on second and Springfield. It is a three bedroom for 300 a month per person. If you are interested email me at lemieszrobert@gmail.com\n\nEdit: I dont really care about gender as long as you are comfortable living with two other males. \nThe lease is for one year, and the apartment is furnished. Dont care if you smoke. Utility fees \nmost likely will be around 50-65 a person (not 100% sure).\n\nThis is the place http://www.cpm-apts.com/properties/view/36   [deleted] [deleted]  Im looking for a single right now but if that falls through/is too expensive I may hit you up. I'm graduating this summer but will be staying here all next year to work so Ill let you know when I hear anything.",
    "url" : "http://www.reddit.com/r/UIUC/comments/163xny/does_anyone_need_a_place_to_live_next_year_im/"
  }, {
    "id" : 1,
    "title" : "Downtown Champaign Building History Blog",
    "snippet" : "  Ran across this on the news gazette site this morning, thought people might find it interesting.  Hopefully the author keeps it going, it is very interesting.  Reminds me of the photos of campustown throughout history that were posted from a uiuc site last year.\n\nEnjoy! I met TJ at a party, he was saying he has years worth of material to keep this blog going.",
    "url" : "http://champaignhistory.blogspot.com/"
  }, {
    "id" : 2,
    "title" : "Study abroad application process: how are you supposed to go about this?",
    "snippet" : "Hi reddit,\n\nI'm starting to apply for Summer 2013 study abroad trips, and I'm not sure how competitive these are. Is it common practice to apply to multiple to make sure you'll be accepted by at least one, or is acceptance generally a guarantee given a good gpa, or whatever relevant parameters?\n\nThanks!\n\nedit: thanks for the comments. I called the IPENG office to confirm, so it looks like I'll be applying for just one.      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1632n3/study_abroad_application_process_how_are_you/"
  }, {
    "id" : 3,
    "title" : "AMA Request:  Someone who has been in a bar while it's been raided.",
    "snippet" : "Pretty self-explanatory.  Plenty of times. It isn't a huge scene either. A few UCs come in and look for no wristband and a drink. Then they approach you and tell you. At least that's what happened to a friend I saw. \n\nOn the contrary, my buddy and I were at Firehaus and a cop came up and put him in a chokehold before saying anything. That was pretty scary to see since it was the first time I saw someone get taken out of a bar. \n\nOverall, your best bet is to keep your eyes moving and stay away from entrances. Kams has a big red light they turn on when the cops come in. Brothers has nothing and it is harder to tell since there is a wider age range. I've seen a few cops upstairs just sipping a beer and observing the crowd. Stay towards the dance floor, dining room, picnic tables and you should be good at Joes. Cops know that the upstairs usually has underage kids often. Stay away from that. For Cly's, stay as high as you can. Just follow that logic everywhere. Raids are just a few guys walking around. Stay near windows and look for the paddy-wagon if you want to be alerted the quickest way.  A cop came in and put someone in a chokehold without saying anything at all?  Really?    Murphys - first week of school. Should've known to wait a bit longer, bar was practically empty  [deleted] [deleted]    rock paper scissors?  Even though I'm interested in the homecoming incident.  No need for an AMA really. Not a lot goes on. The cops come in, the staff are all alerted quickly and secretively. They begin taking drinks from those who look underage (or in the case of Kam's, slapping them out of their hands). When the cops see people who look underage, they ask them for their IDs. If they're under 21, they'll pull them outside and write them a ticket, sometimes on the sidewalk, other times you get to sit in the paddy wagon. This might be a dumb question, but how does the staff know when the cops come in (since they are undercover and are in plain clothes)?  No need for an AMA really. Not a lot goes on. The cops come in, the staff are all alerted quickly and secretively. They begin taking drinks from those who look underage (or in the case of Kam's, slapping them out of their hands). When the cops see people who look underage, they ask them for their IDs. If they're under 21, they'll pull them outside and write them a ticket, sometimes on the sidewalk, other times you get to sit in the paddy wagon. I heard about the wagon.  Apparently it was used at White Horse this semester.   The paddy wagon goes everywhere. I live right next to Red Lion and its usually in the alley behind the bar on nights that their raiding (Around 10-10:30). Again, common sense and dont go out to the bars on nights they traditionally raid (first couple weeks of school and moms/dads day). They walk in announced and quietly. If you dont see the paddy wagon chances are your SOL unless someone alerts you.  Don't forget right before finals, Halloween, and Unofficial.  Basically any major weekend if you're under 21 don't have a drink in your hand there.  Honestly, as someone under 21 I never try to drink at a bar unless I have a friend 21+ willing to buy me a drink, and usually I stay clear of the entrance.   Just rip cups of shots if you know people that work at the bar. They're quick and you can take them every few minutes while looking out for cops and still getting intoxicated.\n\nYou can do this if you don't know someone there, but it's going to cost you more money to the point its not worth it. This too. Either way I try to avoid walking around a bar holding drinks as much as possible.   Can anyone explain the arms length rule. Also if you're in a bar and look intoxicated but are not near alcohol can you still get in trouble? I don't know what it is *exactly*, but the gist of it is that any unclaimed drink within an arm's length can be considered to be in your possession    Can anyone find me the law (if it exists) that says you must show an ID to a cop when asked in a bar?\n\nOtherwise I would assume you do not have to show it due to 4th Ammendment, as it falls under 'papers'.  When they ask for IDs -- \n\nDo they scan the ids or do they just look at them?   When they ask for IDs -- \n\nDo they scan the ids or do they just look at them?   Im pretty sure they just look at them but youd be in a hell of a lot more trouble if you give them a fake and they call your bluff. The bar gets in a shit ton of trouble though if you're 18. The bar gets in a shit ton of trouble though if you're 18. And shut down if you're 15 and the bar is CO's. Is that really how it shut down? Did it happen multiple times or just once?",
    "url" : "http://www.reddit.com/r/UIUC/comments/161yp2/ama_request_someone_who_has_been_in_a_bar_while/"
  }, {
    "id" : 4,
    "title" : "Our men's basketball team just crushed Ohio State 74-55!",
    "snippet" : "  My favorite part about this is the fact that Ohio State was never in the lead, and the only tie was at 0-0.  Awesome to see the team bounce back in such a great way after losing to Purdue. Shows how crazy the B1G is gonna be this year though!   Anybody want to take a guess at where our ranking and OSU's ranking will be come Monday? Anybody want to take a guess at where our ranking and OSU's ranking will be come Monday? Sadly, I believe OSU will be ranked 1 spot above us. The purdue loss is a decently bad loss, and as an example Gonzaga is ranked higher than us even though we beat them (and were ranked higher than us BEFORE we lost to Mizzou.)  ",
    "url" : "http://scores.espn.go.com/ncb/boxscore?gameId=330050356"
  }, {
    "id" : 5,
    "title" : "ESPN had an excellent picture of D.J. Richardson following the win over Ohio",
    "snippet" : "  He's chargin' his lazer.",
    "url" : "http://imgur.com/qZa84"
  }, {
    "id" : 6,
    "title" : "YOU SHALL NOT PASS [John Groce at his finest]",
    "snippet" : "     [I'll just leave this here](http://i.imgur.com/pvlzw.jpg) Swap those two heads and you've nailed it.",
    "url" : "http://i.imgur.com/bvQ3t.jpg"
  }, {
    "id" : 7,
    "title" : "They could have used a better picture",
    "snippet" : " ",
    "url" : "http://i.imgur.com/TUqY7.jpg"
  }, {
    "id" : 8,
    "title" : "Does anyone know a good place to buy and sell books online?",
    "snippet" : "I've been looking for a good place to sell my books and buy some used ones. Buying at the union bookstore, TIS, or Folettes is usually outrageously expensive, any suggestions?  To sell: [bookscouter.com](http://bookscouter.com)\nfor buying: [http://www.illinibookexchange.com](http://www.illinibookexchange.com)  amazon.com? I get most of my books from Amazon.  It's particularly safe to buy used books there; they have well-defined criteria for what constitutes new/like new/good/acceptable/etc condition, and they enforce it.  I know firsthand that if you can prove that your book did not arrive in the condition advertised by the seller, Amazon steps in and fixes the problem, one way or another.  I like to use half.com run by the same people that own ebay and pretty reliable. Also usually easy to sell books and get cash. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1616b1/does_anyone_know_a_good_place_to_buy_and_sell/"
  }, {
    "id" : 9,
    "title" : "Have you ever been frustrated by not knowing when that section you want is going to open?",
    "snippet" : "They say that every good program is written to scratch an itch. Well I can say that I've been itching about this problem the last few weeks. I really want to make a section switch, but that requires it to be open, and checking that gets tedious and boring. In other words, 1) it's repetitive! 2) it's easy! That sounds like it should be automated, right? So I did that! I've made a program that will do it for me, and hopefully for you too.    \n    \nSpecifically, it's a program that checks the information for a specified course and section, available at courses.illinois.edu; if the section is marked as Open, then the program will email you the happy news! And of course, since this changes constantly, it will wait a certain amount of time (default 6 hours) and then check all the courses again! So you'll know exactly when that section is open.\n\n[Here](http://pastebin.com/GYykRhpL)'s a pastebin link for easy reading; and [here](http://filesmelt.com/dl/courses1.py)'s a link for easy downloading.\n\nThe problem is that it's written in Python 3, so you need to have that installed to run the script. You can download it [here](http://www.python.org/download/) (though if you're using GNU/Linux it's probably already installed). (Direct Windows 64 bit [link](http://www.python.org/ftp/python/3.3.0/python-3.3.0.amd64.msi))\n\nFor Windows: once you've downloaded and installed Python 3, [download the script](http://filesmelt.com/dl/courses1.py) into the folder where Python was installed; right click on the script and click \"Open in IDLE\" (or something like that) to edit it with your NetID (for email) and courses; then double left click it to run (you might need to mark it as an executable file).\n\n[Here](http://imgur.com/j9zpZ) is a pic of an email I got while testing it :) If you're confused about what it does, please feel free to ask me here.\n\nAnd if anyone actually cares, I will of course try and help with any problems.\n\nBest of luck getting your desired section!\n\nEdit: In light of ensuing discussion, please read the following clarifications (if you haven't already): The information retrieved is taken from courses.illinois.edu; no UIUC credentials are necessary or used to retrieve the information. This is also not a browser refresher or anything; every time it checks, it starts from scratch. Furthermore, I recommend you use it *no more than 4 times per day*. Even that might be a bit excessive by UIUC standards. No registration is done by the program, only availability checking.\n\nYou *do* need credentials to have it email you, however this does not have to be an Illinois address and can be any other email service (such as Gmail). (I set up it to use the Illinois address by default, since everyone has one.) Setting up other emails should be essentially the same as setting up Thunderbird or Outlook Express for that address; Google is your friend in this case.  So, this seems amazing, and I am going to save a copy for myself, but I would recommend taking this down, since I remember from another thread that others have tried this and were caught, and as a result could no longer sign up for classes as normal. So, this seems amazing, and I am going to save a copy for myself, but I would recommend taking this down, since I remember from another thread that others have tried this and were caught, and as a result could no longer sign up for classes as normal. I think the problem was that they were trying to **register** for the class every few seconds. That caused a bunch of attempted write operations to the database.\n\nAs long as you are just using the class schedule, and not refreshing it often (the \"open\" status doesn't update more than every 15 minutes anyway), I can't imagine it would cause any problems.  I had a student that ran a program to register themselves which caused them to be restricted by the registrars office. Since this program is just notifying the student that a section is open, I am personally not concerned. Just don't try to register hundreds of times in a minute... How often do you think that happens? A friend of mine did that and had a hold on his account and I wonder if that's who you're talking about. I had a student that ran a program to register themselves which caused them to be restricted by the registrars office. Since this program is just notifying the student that a section is open, I am personally not concerned. Just don't try to register hundreds of times in a minute...  Watch out if you do this, I remember a post about checking class availability on this subreddit\n\nPermalink: http://www.reddit.com/r/UIUC/comments/13q6gv/is_this_possible_or_even_legal/c76bopy     I didn't feel comfortable using my univ account information and password for this so I used a trash gmail account and the test e-mail didn't send, how could I set that up? Nvm, i'm dumb and didn't realize that it would need to login with my credentials to check and send me an e-mail. But still, due to my complete lack of knowledge of anything about programming i'm wary. For a Gmail acct, use the following:\n\nemail_domain = 'smtp.gmail.com'\n\nemail_port = 587\n\nemail_acct = 'email@gmail.com'\n\nemail_addr = 'email@gmail.com'\n\nemail_pswd = 'password'\n\n(Yes, acct and addr are the same for Gmail.)\n\nPS No login is required or used to get course information; the login is only used for sending email.",
    "url" : "http://www.reddit.com/r/UIUC/comments/1604is/have_you_ever_been_frustrated_by_not_knowing_when/"
  }, {
    "id" : 10,
    "title" : "Hey guys, I could REALLY use some help. Would anyone be able to help me drive some stuff down from Chicago around the 10th-12th?? At most it would be about the size of a large person in your back seat",
    "snippet" : "As the title says I REALLY need to find someone who can help me transport some stuff from Chicago back down to Champaign. I was studying abroad last semester and stored some of my things with a brother in Chicago. I'm back this semester and will be moving into my apartment this week, but I have absolutely no idea how i'm getting down yet. \n\nI was planning at first to be going with my roommate, but he ended up moving in much earlier and since i'm out of state, I wasn't able to throw some of my things into his car.\n\nIf anyone is going to be driving back down to campus later this week, and would have some extra space for me and/or at least my extra things, I would gladly compensate you for gas and your time!!\n\nPlease, if your able PM me! Thanks so much!!\n\n*Edit\n\nAhh yea, but seriously would anyone be able to help me out?? :(..  Would this \"large person\" luggage be in a black bag with a zipper all the way down?   We prefer the term \"husky\"",
    "url" : "http://www.reddit.com/r/UIUC/comments/160brg/hey_guys_i_could_really_use_some_help_would/"
  }, {
    "id" : 11,
    "title" : "What is your greatest UIUC story?",
    "snippet" : "Tell us about your craziest, funniest, awesome college story  I am filled with regret and am afraid to find out if the person I did this to is a redditor...\n\nSo, freshman year, I'm taking the final exam for Chem102 in the Noyes lecture hall. Sitting far enough up in the nosebleed section (where you're literally sitting atop the person in front of you). I'm finished with my test about 30 minutes before the end of the final, so I start checking over answers. I wasn't doing too well in this class so I was getting pretty nervous. I start flipping my pencil around in my fingers (a sort of helicopter of anxiety, if you will). Suddenly, I lost control of the pencil and it flew straight up, at least 2 feet above my desk. Then. Fell tip down into the pants of the guy sitting in front of me. Not only that, he was wearing loose sweatpants and was leaning far over his desk. I swear, the pencil dropped right into his crack.\n\nOf course, he freaks out and the pencil goes rolling down the steps and almost out of sight. It looked like he was going to stand up and get it, but actually just turned around and gave me a look that told me that my friends, family and the police would never find my body. I packed up my stuff, turned in my test and walked out. Nothing else to do. I had never once felt like a moment had gone into slow motion like this, but I can still see that pencil slowly spinning and falling down right into that dark abyss.\n\n**Tl;dr: I threw a sharp pencil into a someone's butt crack during my first final exam here** So...how'd you do on the final? I am filled with regret and am afraid to find out if the person I did this to is a redditor...\n\nSo, freshman year, I'm taking the final exam for Chem102 in the Noyes lecture hall. Sitting far enough up in the nosebleed section (where you're literally sitting atop the person in front of you). I'm finished with my test about 30 minutes before the end of the final, so I start checking over answers. I wasn't doing too well in this class so I was getting pretty nervous. I start flipping my pencil around in my fingers (a sort of helicopter of anxiety, if you will). Suddenly, I lost control of the pencil and it flew straight up, at least 2 feet above my desk. Then. Fell tip down into the pants of the guy sitting in front of me. Not only that, he was wearing loose sweatpants and was leaning far over his desk. I swear, the pencil dropped right into his crack.\n\nOf course, he freaks out and the pencil goes rolling down the steps and almost out of sight. It looked like he was going to stand up and get it, but actually just turned around and gave me a look that told me that my friends, family and the police would never find my body. I packed up my stuff, turned in my test and walked out. Nothing else to do. I had never once felt like a moment had gone into slow motion like this, but I can still see that pencil slowly spinning and falling down right into that dark abyss.\n\n**Tl;dr: I threw a sharp pencil into a someone's butt crack during my first final exam here** Congratulations, your RES tag is now \"Ass-crack Bulls-eye\".   I shit myself outside of the Red Lion :( I shit myself outside of the Red Lion :(  We constructed an igloo in the the six pack quad and smoked a whole lot of weed in it. Lasted for weeks and no one ever got caught. Haha fuck yes this is the work of the 3hop stoners from 2 years ago. I didnt smoke back then, but that was a fucking beautiful igloo and the idea was genius. We constructed an igloo in the the six pack quad and smoked a whole lot of weed in it. Lasted for weeks and no one ever got caught. [deleted]  Alright, this may not be my best story but it's probably the one that's stuck with me the best that doesn't involve me horrendously embarrassing myself in some way or another.\n\nMy Freshman year (2007) I lived in Hendrick House, room 302.  My room looked out over Green Street and the ISR parking lot.  It was the middle of winter and there was a ton of snow on the ground (it snowed a LOT that winter, one of the snowiest winters in my memory).  Anyways, it was decently late at night, and around the end of Finals week so the ISR parking lot was mostly empty as most people had already finished their finals and gone home.  I glanced out my window and saw some people in the ISR parking lot driving a pickup truck, towing a dude on an inner tube around behind them as they drove around in circles and shit.  Now, anyone who has walked by the ISR parking lot a bunch knows that there's almost always an ambulance sitting in it with a couple paramedics standing by.  The ambulance started up and suddenly started driving over towards the guys dicking around in the pickup truck.  I thought for sure they were going to get a safety lecture, and it seemed like they thought so too because they stopped and sat still as soon as they noticed.  The ambulance continued approaching them until suddenly, out of nowhere, they flipped its emergency lights on (no siren though), gunned the engine, and started doing motherfucking donuts in the snow.  Continued for a good solid 15-20 seconds spinning around in circles before coming to a complete stop, turning off its lights, and returning to its previous position as if nothing had happened.  The inner tubers didn't seem to know how to react, they just sort of hung out there for a few minutes, presumably laughing about the whole thing, and then got in their car and left.  I wish I had had a camera phone at that point to record the incident.\n\nTL;DR: Ambulance did donuts in the snow, it was badass. There's a [video](http://www.collegehumor.com/video/3290101/ambulance-doing-donuts-in-parking-lot) of the ambulance doing donuts. Alright, this may not be my best story but it's probably the one that's stuck with me the best that doesn't involve me horrendously embarrassing myself in some way or another.\n\nMy Freshman year (2007) I lived in Hendrick House, room 302.  My room looked out over Green Street and the ISR parking lot.  It was the middle of winter and there was a ton of snow on the ground (it snowed a LOT that winter, one of the snowiest winters in my memory).  Anyways, it was decently late at night, and around the end of Finals week so the ISR parking lot was mostly empty as most people had already finished their finals and gone home.  I glanced out my window and saw some people in the ISR parking lot driving a pickup truck, towing a dude on an inner tube around behind them as they drove around in circles and shit.  Now, anyone who has walked by the ISR parking lot a bunch knows that there's almost always an ambulance sitting in it with a couple paramedics standing by.  The ambulance started up and suddenly started driving over towards the guys dicking around in the pickup truck.  I thought for sure they were going to get a safety lecture, and it seemed like they thought so too because they stopped and sat still as soon as they noticed.  The ambulance continued approaching them until suddenly, out of nowhere, they flipped its emergency lights on (no siren though), gunned the engine, and started doing motherfucking donuts in the snow.  Continued for a good solid 15-20 seconds spinning around in circles before coming to a complete stop, turning off its lights, and returning to its previous position as if nothing had happened.  The inner tubers didn't seem to know how to react, they just sort of hung out there for a few minutes, presumably laughing about the whole thing, and then got in their car and left.  I wish I had had a camera phone at that point to record the incident.\n\nTL;DR: Ambulance did donuts in the snow, it was badass. Alright, this may not be my best story but it's probably the one that's stuck with me the best that doesn't involve me horrendously embarrassing myself in some way or another.\n\nMy Freshman year (2007) I lived in Hendrick House, room 302.  My room looked out over Green Street and the ISR parking lot.  It was the middle of winter and there was a ton of snow on the ground (it snowed a LOT that winter, one of the snowiest winters in my memory).  Anyways, it was decently late at night, and around the end of Finals week so the ISR parking lot was mostly empty as most people had already finished their finals and gone home.  I glanced out my window and saw some people in the ISR parking lot driving a pickup truck, towing a dude on an inner tube around behind them as they drove around in circles and shit.  Now, anyone who has walked by the ISR parking lot a bunch knows that there's almost always an ambulance sitting in it with a couple paramedics standing by.  The ambulance started up and suddenly started driving over towards the guys dicking around in the pickup truck.  I thought for sure they were going to get a safety lecture, and it seemed like they thought so too because they stopped and sat still as soon as they noticed.  The ambulance continued approaching them until suddenly, out of nowhere, they flipped its emergency lights on (no siren though), gunned the engine, and started doing motherfucking donuts in the snow.  Continued for a good solid 15-20 seconds spinning around in circles before coming to a complete stop, turning off its lights, and returning to its previous position as if nothing had happened.  The inner tubers didn't seem to know how to react, they just sort of hung out there for a few minutes, presumably laughing about the whole thing, and then got in their car and left.  I wish I had had a camera phone at that point to record the incident.\n\nTL;DR: Ambulance did donuts in the snow, it was badass.  You know the really obnoxious old man who preaches on the quad sometimes?  about 13-14 years ago some of my friends bought a 6' tall inflatable penis, blew it up, drew a face on it and put a baseball cap on top, then chased him around the quad with it. Oh, I love it when Brother Jed comes around. Last time he was here this club I'm in made a Bingo card out of all the dumb shit I knew he was gonna say and everyone made a nice game out of it. [Here are some pictures.](http://imgur.com/a/FJfQV#0) You know the really obnoxious old man who preaches on the quad sometimes?  about 13-14 years ago some of my friends bought a 6' tall inflatable penis, blew it up, drew a face on it and put a baseball cap on top, then chased him around the quad with it. [deleted] There's more than one preacher who goes around to a bunch of different universities.  I don't remember this particular guy's name, but he was pretty old.  I know he was still coming here 4-5 years ago, but I don't make it over to the quad much anymore. [deleted] You know the really obnoxious old man who preaches on the quad sometimes?  about 13-14 years ago some of my friends bought a 6' tall inflatable penis, blew it up, drew a face on it and put a baseball cap on top, then chased him around the quad with it.  Chem 102 professor in 2005 (Tom Hummel) was doing a demo with a two-liter pop bottle reinforced with duct tape near a Bunsen burner. Instead of blowing a flame out the front, the back of the bottle exploded and nearly split his hand in half, there was blood. This was in the big lecture hall in Noyes. He simply said \"class dismissed\", and left in a hurry. A week later his entire arm was in a sling. Chem 102 professor in 2005 (Tom Hummel) was doing a demo with a two-liter pop bottle reinforced with duct tape near a Bunsen burner. Instead of blowing a flame out the front, the back of the bottle exploded and nearly split his hand in half, there was blood. This was in the big lecture hall in Noyes. He simply said \"class dismissed\", and left in a hurry. A week later his entire arm was in a sling. Chem 102 professor in 2005 (Tom Hummel) was doing a demo with a two-liter pop bottle reinforced with duct tape near a Bunsen burner. Instead of blowing a flame out the front, the back of the bottle exploded and nearly split his hand in half, there was blood. This was in the big lecture hall in Noyes. He simply said \"class dismissed\", and left in a hurry. A week later his entire arm was in a sling. Chem 102 professor in 2005 (Tom Hummel) was doing a demo with a two-liter pop bottle reinforced with duct tape near a Bunsen burner. Instead of blowing a flame out the front, the back of the bottle exploded and nearly split his hand in half, there was blood. This was in the big lecture hall in Noyes. He simply said \"class dismissed\", and left in a hurry. A week later his entire arm was in a sling. Chem 102 professor in 2005 (Tom Hummel) was doing a demo with a two-liter pop bottle reinforced with duct tape near a Bunsen burner. Instead of blowing a flame out the front, the back of the bottle exploded and nearly split his hand in half, there was blood. This was in the big lecture hall in Noyes. He simply said \"class dismissed\", and left in a hurry. A week later his entire arm was in a sling.  I made out with a girl in a wheelchair at Joe's up on the stage near the stripper poles.  Best/worst part is I blacked out and my friends told me I was grinding on her face for awhile...\n\nAlso steam tunnels. I made out with a girl in a wheelchair at Joe's up on the stage near the stripper poles.  Best/worst part is I blacked out and my friends told me I was grinding on her face for awhile...\n\nAlso steam tunnels. I was there and can vouch for this You guys explored the steam tunnels? You guys explored the steam tunnels? I made out with a girl in a wheelchair at Joe's up on the stage near the stripper poles.  Best/worst part is I blacked out and my friends told me I was grinding on her face for awhile...\n\nAlso steam tunnels.  Set the apartment on fire and put it out with a couch Absolutely no meth involved  Using a throwaway and purposely leaving some details out to not identify myself.\n\nSo, once upon a time, it was my birthday, around 5pm, and I ran into a police officer I didn't know while I was pregaming.  He hung around for around 20 minutes while my roommates and I were drinking and we chatted and it turned out we knew some of the same people.  He eventually left and went about his shift.\n\nFast forward to about 10pm and my friends are walking to the bar and run into the same cop at Domino's.  We start chatting and one of my roommates just blurts out \"hey, can you give us a ride to the bar?!\".  The cop looks at my friends, then me, and then back at my friends and says, \"You don't have any drugs on you do you?\"\nWe answer \"Of course not!\"\nThe cop interrupts us saying, \"Well, if you do, don't drop it in my fucking car\".\n\nMy friends and I pile into the cop car, 3 in the back and one riding shotgun.  The cop floors it out of the Domino's parking lot and doing 45-50MPH down Green St while swerving and saying \"BREAKING THE LAW, BRA BRA BREAKING THE LAW\".  Since we were only going to Joe's it took all of 30 seconds to get there, but when we pulled up, we might as well have pulled up in a fucking limo.  We were able to cut right to the front of the line and got right into the bar because we were dropped off to the bar in a cop car.  \n\nTL;DR.  I had a Superbad moment on my birthday and got a ride to the bar in a cop car.  \n This... didn't happen I've either been playing this off since my birthday in 2010 or it happened:  http://imgur.com/a0rdi OP Delivered?  My world no longer makes sense. Using a throwaway and purposely leaving some details out to not identify myself.\n\nSo, once upon a time, it was my birthday, around 5pm, and I ran into a police officer I didn't know while I was pregaming.  He hung around for around 20 minutes while my roommates and I were drinking and we chatted and it turned out we knew some of the same people.  He eventually left and went about his shift.\n\nFast forward to about 10pm and my friends are walking to the bar and run into the same cop at Domino's.  We start chatting and one of my roommates just blurts out \"hey, can you give us a ride to the bar?!\".  The cop looks at my friends, then me, and then back at my friends and says, \"You don't have any drugs on you do you?\"\nWe answer \"Of course not!\"\nThe cop interrupts us saying, \"Well, if you do, don't drop it in my fucking car\".\n\nMy friends and I pile into the cop car, 3 in the back and one riding shotgun.  The cop floors it out of the Domino's parking lot and doing 45-50MPH down Green St while swerving and saying \"BREAKING THE LAW, BRA BRA BREAKING THE LAW\".  Since we were only going to Joe's it took all of 30 seconds to get there, but when we pulled up, we might as well have pulled up in a fucking limo.  We were able to cut right to the front of the line and got right into the bar because we were dropped off to the bar in a cop car.  \n\nTL;DR.  I had a Superbad moment on my birthday and got a ride to the bar in a cop car.  \n Using a throwaway and purposely leaving some details out to not identify myself.\n\nSo, once upon a time, it was my birthday, around 5pm, and I ran into a police officer I didn't know while I was pregaming.  He hung around for around 20 minutes while my roommates and I were drinking and we chatted and it turned out we knew some of the same people.  He eventually left and went about his shift.\n\nFast forward to about 10pm and my friends are walking to the bar and run into the same cop at Domino's.  We start chatting and one of my roommates just blurts out \"hey, can you give us a ride to the bar?!\".  The cop looks at my friends, then me, and then back at my friends and says, \"You don't have any drugs on you do you?\"\nWe answer \"Of course not!\"\nThe cop interrupts us saying, \"Well, if you do, don't drop it in my fucking car\".\n\nMy friends and I pile into the cop car, 3 in the back and one riding shotgun.  The cop floors it out of the Domino's parking lot and doing 45-50MPH down Green St while swerving and saying \"BREAKING THE LAW, BRA BRA BREAKING THE LAW\".  Since we were only going to Joe's it took all of 30 seconds to get there, but when we pulled up, we might as well have pulled up in a fucking limo.  We were able to cut right to the front of the line and got right into the bar because we were dropped off to the bar in a cop car.  \n\nTL;DR.  I had a Superbad moment on my birthday and got a ride to the bar in a cop car.  \n     Went to ece391 lab to work on final mp. Group members told me \"swizzyk, you're too drunk to program. Go home.\" Woke up next morning extremely hungover, found out my drunken pre-programming pump up routine involved punching a hole in the wall at my apartment.     Had an F going into my Accy201 final. Started dating my TA got A-. \n\nBut I now live with her so I guess we both won.  Except she makes 100k+ and I make 55k. Not sure why downtote.  Not sure why downtote.      I ate magic mushrooms and walked around campus one day during the summer. Then I wrote a [short story](http://rhughes0.wordpress.com/2012/12/07/a-day-in-the-sun/) about it for my Creative Writing class.  alcohol alcohol      Went to ece391 lab to work on final mp. Group members told me \"swizzyk, you're too drunk to program. Go home.\" Woke up next morning extremely hungover, found out my drunken pre-programming pump up routine involved punching a hole in the wall at my apartment.  I can vouch for this.  Puked red Hawaiian punch at IHOP onto my white shorts. Looked like I got shot in the thigh. Left my phone and wallet at IHOP. Didn't have my ID for my dorm when they were checking people in so I just walked in panicking saying \"SOME DUDE PUKED ON ME\" and they just let me in. My roommates went back to IHOP to get my phone and wallet (they were still there!) AND my one roommate washed my $80 shorts at 4 in the morning. \n\ntl;dr I have good roommates.\n\nAlso I tried to clean my backpack that night (there was puke in it) by putting it in the shower. Didn't take my iClicker out. It did not survive  I wish I could tell mine but it would probably lead to expulsion if anyone from the university ever found out.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15znv4/what_is_your_greatest_uiuc_story/"
  }, {
    "id" : 12,
    "title" : "Updated steam tunnel info?",
    "snippet" : "I found a thread from 3 or so years ago about the tunnels during the 60's-80's, so obviously the info was quite outdated and not too vivid. I'm looking for more current info on tunnels around campus. I've explored the noyes/chem annex/adams tunnel but I'd like to discover some new ones before break is over. Let me know what info you guys have/what you've found! Thx  This probably isn't the best subject to post about in a public place.  I would highly suggest not going into the steam tunnels until summertime when they are inactive. You could die, jus' sayin'. I've never been, but I'm pretty sure they're \"active\" year-round.  They're doing the same with cooling/chilled water - so both steam and chilled water are available on a campus-wide basis all year.  It's more efficient that way than doing it on a per-building level.  There is a pedestrian tunnel complex that starts at Bevier that connects through as far south as the greenhouses on the south side of Turner Hall. **CAUTION:** They are heavily trafficked by building occupants and F&amp;S personnel; they may also require a registered I-Card and/or keys to access.  People are actually allowed to go there, as far as I know.  I used to work for IT Services on campus, and my boss frequently told us to use them when we were carrying large computers, printers, etc and didn't want to be awkward on streets. Something on campus that makes sense? Wow! Maybe the coded IDs and keys were for after hours access?    What, exactly do you want to know? I doubt anybody has maps to post. I left the area quite time time ago but could, most likely, reconstruct much of the steam tunnel network given a current UIUC map. When you see those large concrete \"benches\" with the grates on the sides; those are steam tunnel entrance/exits [they only open from the inside, normally]. Knowing where those are you can make some pretty good guesses about where the tunnels underneath go. The Quad is circled on the inside [of the buildings] on the East side and they run between the street and the buildings on the West side. That is the 'primary' steam tunnel ring and is fed directly from the power plant (a *long* walk from the Quad ring). You can get about anywhere South of Green Street from there. To get North of Green you have to pass through 'Hell' [It's marked]. If you are at all claustrophobic: DO NOT GO THROUGH. The 'Hell' tunnel is filled with pipes and has very little clearance to crawl. Also the North tunnels are much newer and less interesting than the South tunnel complex. If you have more specific queries: please feel free to ask. [Note: All information will be maybe 10 years out of date]. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15zy4x/updated_steam_tunnel_info/"
  }, {
    "id" : 13,
    "title" : "ECE student looking to study abroad for a year...",
    "snippet" : "Will the ECE department approve core classes (313, 391, 340, etc) given they are offered at the host school?? The policy on the ECE website is pretty vague.     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1602zg/ece_student_looking_to_study_abroad_for_a_year/"
  }, {
    "id" : 14,
    "title" : "Good News",
    "snippet" : "  Where's *our* fucking congratulatory card? here - http://imgur.com/ttbLC Actually, I posted it a while ago and brought it to two meetups :)\n\nI'm off on a ski trip right now (Montana! \\o/) but I can dig it back out when in IL.  I like how the OP says \"good news\" while the linked article says \"bad news.\"  YEAH LET'S DOWNVOTE EVERYTHING ON THEIR FRONTPAGE TO SHOW THEM WHO THE BIG BOY IN TOWN IS NOW YEAH LET'S DOWNVOTE EVERYTHING ON THEIR FRONTPAGE TO SHOW THEM WHO THE BIG BOY IN TOWN IS NOW YEAH LET'S DOWNVOTE EVERYTHING ON THEIR FRONTPAGE TO SHOW THEM WHO THE BIG BOY IN TOWN IS NOW Hey, lets not. It's rude, and causing them troubles (They had some modposts get trashed for example).\n\nMaybe go upvote some things, instead?\n\nAnyways, I thought we passed them months ago. Maybe they passed us again in the meanwhile?\n I wasn't aware people were taking my post literally...? Yeah, it surprised me too. Rude! I wasn't aware people were taking my post literally...? Why complain? Look at them upvotes! Caps and boldface seem to garner more upvotes for you on /r/uiuc than more polite comments. YEAH LET'S DOWNVOTE EVERYTHING ON THEIR FRONTPAGE TO SHOW THEM WHO THE BIG BOY IN TOWN IS NOW [deleted] Nobody likes a sore rectum either. YEAH LET'S DOWNVOTE EVERYTHING ON THEIR FRONTPAGE TO SHOW THEM WHO THE BIG BOY IN TOWN IS NOW   It took me so long to realize that the link was to /r/rit. I was so confused.  same!  What is an RIT?  Is it nerds?  We should steal their lunch money. You don't get into the north side of campus much do you? As far as nerds go, ours aren't THAT bad. As far as nerds go, ours aren't THAT bad. This is true.  We like math AND beer. If you had any idea how much time the nerds at RIT spend at the tap room...\n Be gone, heathen! What is an RIT?  Is it nerds?  We should steal their lunch money.   From the /r/rit  post:\n\n&gt; Also, if someone wants to print and plaster campus with posters like we did before, let me know. \n\nThey put in this much effort to get subscribers. I think putting up posters to recruit redditors is a bit extreme, but it would be a good idea to make this subreddit (and reddit itself, for that matter) more well-known on our campus. Maybe Facebook posts? Advertising /r/uiuc can't be worse than those \"This is what I had for dinner tonight\" and \"I can't believe the weather is so dreary\" Facebook posts. \n\nI believe most of /r/uiuc subscribers are from the core demographic of CS/ECE undergrads. Outside of them, many people don't know about this subreddit or reddit at all. I only know because someone from the core demographic told me about it. /r/rit only had about 20 subscribers and 5 posts when I stumbled across it. Myself and one other person plastered the CS/IT building with posters (and a few elsewhere on campus), posted links on facebook, and spread by word of mouth... subscriptions grew incredibly rapidly. Hundreds of people in ~2 weeks or so. \n\nThey may be extreme, but if you do it right, it can be quite effective.  That's pretty impressive. Frankly, I'm amazed that a college of your size ever managed to gain the most subscribers of any college subreddit. /r/rit only had about 20 subscribers and 5 posts when I stumbled across it. Myself and one other person plastered the CS/IT building with posters (and a few elsewhere on campus), posted links on facebook, and spread by word of mouth... subscriptions grew incredibly rapidly. Hundreds of people in ~2 weeks or so. \n\nThey may be extreme, but if you do it right, it can be quite effective.  From the /r/rit  post:\n\n&gt; Also, if someone wants to print and plaster campus with posters like we did before, let me know. \n\nThey put in this much effort to get subscribers. I think putting up posters to recruit redditors is a bit extreme, but it would be a good idea to make this subreddit (and reddit itself, for that matter) more well-known on our campus. Maybe Facebook posts? Advertising /r/uiuc can't be worse than those \"This is what I had for dinner tonight\" and \"I can't believe the weather is so dreary\" Facebook posts. \n\nI believe most of /r/uiuc subscribers are from the core demographic of CS/ECE undergrads. Outside of them, many people don't know about this subreddit or reddit at all. I only know because someone from the core demographic told me about it. I remember seeing the flyers around Siebel at one point.  That's actually how I found out about it. From the /r/rit  post:\n\n&gt; Also, if someone wants to print and plaster campus with posters like we did before, let me know. \n\nThey put in this much effort to get subscribers. I think putting up posters to recruit redditors is a bit extreme, but it would be a good idea to make this subreddit (and reddit itself, for that matter) more well-known on our campus. Maybe Facebook posts? Advertising /r/uiuc can't be worse than those \"This is what I had for dinner tonight\" and \"I can't believe the weather is so dreary\" Facebook posts. \n\nI believe most of /r/uiuc subscribers are from the core demographic of CS/ECE undergrads. Outside of them, many people don't know about this subreddit or reddit at all. I only know because someone from the core demographic told me about it. Is the core demographic really CS/ECE undergrads? As a female undergrad who hasn't taken a math class more advanced than STAT 100 since high school, that's a bit alienating. Given the popularity of reddit, are there that many people outside of CS/ECE who haven't at least heard of reddit? I'd be very interested in an /r/uiuc demographics survey. That is my impression. Maybe someone among those who post those RHET surveys could create a demographics survey on surveymonkey.  If you ain't first, you're last.     ILL ILL IMATIC  ",
    "url" : "http://www.reddit.com/r/rit/comments/15xtfh/bad_news/"
  }, {
    "id" : 15,
    "title" : "Ride to campus",
    "snippet" : "Anyone riding from Chicago area back to campus this weekend?\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/15zmxp/ride_to_campus/"
  }, {
    "id" : 16,
    "title" : "French Proficiency Test",
    "snippet" : "Does anybody have any experience with the French Proficiency Test. I am trying to get out of  3rd level language requirements.\n\nHow would one go about studying for it? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15z0q3/french_proficiency_test/"
  }, {
    "id" : 17,
    "title" : "Anyone wanna do something? In town the rest of beak, bored.",
    "snippet" : "I'm sitting around watching TV/Netflix.\n\nI'd be happy to host a get-together or something. I've got a Wii and Brawl (but only 2 controllers, if someone wanted to bring more).\n\nI'd also like to just get out and do something, haha.\n\nAny ideas?  ARC climbing wall will be open next week! $2 covers gear for campus rec members! ARC climbing wall will be open next week! $2 covers gear for campus rec members! I'll be there every day I'm in town until school starts (and most days after that).  I'm here too. I've just been watching anime and playing LoL all day long. I'm up for getting together, playing a game and having a drink. Sounds good! Though I'd hate for my apartment to reek of smelly_socks. :/   I hear you. Same with me I'm in town and pretty bored. Was thinking of going out but the bars will probably be as boring considering people aren't back either ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15zmhj/anyone_wanna_do_something_in_town_the_rest_of/"
  }, {
    "id" : 18,
    "title" : "FNM Reminder! [1/4]",
    "snippet" : "Good morning /r/UIUC!\n\n**Disclaimer:** *I am in no way affiliated with AGG and am not submitting this as a link, so no Karma.*\n\nIf anyone plays Magic The Gathering, and is looking for some fun times this evening, check out the [RtR Booster Draft](http://armored-gopher.com/events/card-games/collectable/magic-gathering/2013-01-04/mtg-fnm-rtr-draft) or [Modern](http://armored-gopher.com/events/card-games/collectable/magic-gathering/2013-01-04/mtg-fnm-modern) tonight at Armored Gopher Games!\n\nI'll be playing the RtR draft, slot #2 :)\n\nAgain, since I just found out that this place existed in mid December, I figured I'd share it with some others who may not have known of the MTG presence in C/U.\n  Why is this getting downvoted? It's a social activity in the area. Does it really detract from the discussion? Not sure, maybe because it is too \"nerdy\"? I just want to hit the 8 people needed to play tonight, it's a bit harder with the college kids out of town.  If it's a more low-key event, I'm tempted to come. I'm still pretty bad, though, and I've never done a booster draft. Very low key, very casual. Friday before last was the first Booster Draft I ever did, and the first time I played in 3 years. It was great, got tons of free \"new guy\" loot! \n\nIf you decide to go, let me know :) How much to get into the draft? $7? Edit: I RTFA and it is $14. What? Why?\n\nDrafts at Dragon's Table are $7, Tuesday Wednesday and Saturday. Well, RtR packs are ~$4 each, so 3 * $4 = $12, store gets $2? Everyone who goes gets a door prize, out of the store's pocket, which range from pack(s) to rare stacks, etc. Last (and the first) time I went they gave away a Chinese pack too. \n\nI doubt that they are making too much bank here, if any. \n\nPlus you keep what you draft, not sure about DT policy RE: Keeping &amp; Prizes. I see, I see. \n\nMaybe DT has similar prices for FNM, I'm not sure.\n\nAlso I think maybe that $7 price kind of spoils me.. that's really cheap now that I think about it even though there are no prizes (the rares and foils from the draft go back on the table at the end, and we draft from those in tournament place order, as the prize).  Gotcha. That sounds pretty lame then :(\n\nYou keep everything you draft at AG, and it is Multiround Swiss, so you play a guaranteed 3 matches.\n\nThe prize payout is pack(s) for the top 3ish slots (we had 3 tables of 6 players last time), and then random door prizes (pick a number, you get corresponding prize), with better record getting first (random) pick. \n\nI got dead last last time, and got a stack of like 50 tokens as my door prize :'(\n\nSo yeah, I think the price point is quite worth it, but that is just my opinion.  My problem is finding a way back to campus after FNM. There are no buses heading back towards campus that late. Where on campus are you? Near Springfield and Wright. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15y9rr/fnm_reminder_14/"
  }, {
    "id" : 19,
    "title" : "Best computer repair business?",
    "snippet" : "I'm looking for your recommendations for computer/laptop repair services in the CU area.\n\nLet me know if you've been to any and whether it was worth it!\n\nThanks   The guys over at Computer Deli sure seem to keep up to date on new hardware specs.  Anytime I have a question that I can't find a definitive answer to, I'll go in there and pick their brain.  They are pretty genuine people and they sell some pretty low-cost cables should you need one immediately.  \n\nIf you just need a simple hard drive swap/windows re-install, most redditors here can handle that for you(myself included).        ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15yoo6/best_computer_repair_business/"
  }, {
    "id" : 20,
    "title" : "Looking for an easy 1-2 credit hour elective for the spring semester",
    "snippet" : "I'm considering ice skating or bowling (terrible at both), but I'm open to any suggestions.    Chem 494, its lab safety. Super easy, no chemistry knowledge really needed. Meets 5 times total. Correct me if I'm wrong, but this is only a pass/fail class correct? That is correct, pass/fail class.     Phys 214. It's only half a semester long!",
    "url" : "http://www.reddit.com/r/UIUC/comments/15z0fe/looking_for_an_easy_12_credit_hour_elective_for/"
  }, {
    "id" : 21,
    "title" : "WIFI available places and passwords",
    "snippet" : "Anybody wanna give me list of places that has wifi? If it requires password?\n\n\ni.e.) \nSushi Ichiban - pw: verygood\n\n\n\nPanera - no pw\n\n\nPot Belly - no pw (Thanks Jayers)\n\n\n\n\n\n**Updated:** \n\n\nFire House - pw : 9NewForFall708 (seems to change by semester)\n\nMerry Ann's - no pw (thanks rhinowing)\n\nZa's - no pw (thanks MaximKat)\n\nLegends - pw: legendsbar (thanks spudty and mexi1010)\n\nNewman hall - no pw (thanks The_Planet_Saturn)\n\nMurphy's - pw: Murphy's (thanks s3gFault and MagusGenji)\n\nCounty Market - no pw (thanks rorrito)\n\nBlind Pig Brewery - no pw (thanks awhitesuit)\n\nPerkins - no pw\n\nPekara Bakery (downtown by Blindpig). - No pw. (thanks iphonephotog)\n\nCaffe Paradiso: the password is always written on the chalkboard (thanks Anticlogcap)\n\nCream and Flutter - pw: redvelvet (thanks kashifr)\n\nAroma Cafe - pw : sexytoast (thanks DrinkingAndDeriving)\n\nSuburban Express - pw: bigbus.com\n\nPeoria Charter - no pw\n\n**Thanks everyone! Keep them coming!**\n\nLet me know other places with wifi availability and their pw; i ll try to go around and figure out the rest    Za's has open wifi, I think  What is Legends Pw? I had it at one point but lost it.  legendsbar   Newman hall has a public wifi with no password. However, it blocks some things- like porn and torrents.  &gt; it blocks some things- like porn\n\nTHOSE MONSTERS I know very little about networking but wouldn't a VPN fix that? Newman hall has a public wifi with no password. However, it blocks some things- like porn and torrents.  [deleted]  Pretty sure Murphy's is just murphys (could have a capital M and/or an apostrophe)         ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15wvus/wifi_available_places_and_passwords/"
  }, {
    "id" : 22,
    "title" : "Anyone changed majors....from Art?",
    "snippet" : "Is there anyone here at who changed their majors from Art Foundation (or any of the art concentrations) to any other major that is not in the college of FAA. I was wondering if you've had any success stories along with difficulties, obstacles, and whether you've overcome them (or not.) \n\n\nI started out as Art Foundations as a freshman, now I am sophomore interested in pre-health in DGS for now.\n\n\nQuite the big jump, I know. Just wondering whether I'm alone in this..or not. :)   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15xz3z/anyone_changed_majorsfrom_art/"
  }, {
    "id" : 23,
    "title" : "looking for musicians...Heavy Grunge/Rock band ",
    "snippet" : "Anybody here interested in playing some hard rock/grungy music? My name is Bill Turner and i guess I am a singer/songwriter type. I play guitar/keys/vocals in a chicago based band called Secret Science (www.secretscience.bandcamp.com). My songwriting style is different than that band and tends towards heavier, more atmospheric styling. If you're interested holler back at me and i can send you some mp3's of songs that I have written recently.\n\n    Bassist here.  Out of curiosity, who are your influences? looks like were gonna have to have a bass battle. btw i reddit stalked you and pretty sure I know you, this is nico \n\n\n:-)  Thanks for the response guys. we should try and schedule a jam once school is back in session. I should note that I have some pretty solid recording capabilities on my laptop. One song I recorded yesterday sounds super thick and even with fake drums it sounds fairly professional. If you are interested send me your email and i can shoot the mp3 over to you.\n\nMatmann- i have tons of influences. The music that I actively listen to leans towards hard alternative (been on a big QOTSA kick lately). I'm influenced by radiohead a lot. I also have some heavier influences like poison the well (later stuff, you come before you and versions).\n\nOther bands i've been digging recently\n-Dirty Projectors\n-Tame Impala                  \n\n  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15x6ym/looking_for_musiciansheavy_grungerock_band/"
  }, {
    "id" : 24,
    "title" : "Daniels availability? ",
    "snippet" : "I will be a fourth year ChemE for Fall 2013, and want to live in Daniels.  I wouldn't be happy with other university housing.\n\nI'm worried about the contract terms. If I get an assignment that isn't Daniels hall, I would want to cancel the contract and try to find private certified. Apparently this isn't an option.\n\nHow crowded is Daniels? Would I easily be able to get a single with private/shared bathroom if I wanted?  You should be able to see the availability for Daniels via MyHousing, I would think. So you would actually pick a room before signing a contract, just like the normal dorms.   I don't think you will have any problem getting a room in Daniels Hall. I have never heard of anyone being desperate to live there. But I believe it is only for grad students. *Sophomores and higher can live there. I didn't know that. I thought Daniels and Sherman were the graduate residence halls. I didn't know that. I thought Daniels and Sherman were the graduate residence halls. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15wiba/daniels_availability/"
  }, {
    "id" : 25,
    "title" : "Suburban Express, I really think you're missing the core concept of what 'Available' means...",
    "snippet" : "  With how Suburban Express works you'll probably be banned for \"bad mouthing\" them because of this post. That's where the anonymity provided by reddit is useful. Though I wonder how they definitively identified the people who wrote [bad reviews on Yelp](http://www.yelp.com/filtered_reviews/u02xse4VO7lkyF4r7ARNdw?fsid=8v2daCZ5PLbsz3SEJsLqzA&amp;filtered_start=0) - many of them gave only their first names.  Now that they more or less have a monopoly they can do whatever they want.  ",
    "url" : "http://imgur.com/a/J6L6J"
  }, {
    "id" : 26,
    "title" : "Online Spanish 4 Transfer Class",
    "snippet" : "Anyone know of a university that offers the equivalent of SPAN 142 or 141 online over the summer that will transfer to uiuc.  I plan on taking one of these next summer, but would rather do it online so I don't have to stay on campus.  A friend of mine did this a few semesters ago but that university no longer offers the course online.  Any help/advice would be appreciated.  [There's a website that will tell you if the credit will transfer to UIUC.](https://www.transfer.org/uselect/login.htm)\n\nClick \"Quick Equivalencies\", \"Equivalencies by School\", or \"Equivalencies by Course\" and follow the steps to find a Spanish class that will transfer.   I don't think so, I was in a similar place. Take 142, or whatever the career one is. It's pretty easy Elaborate please? There is a Spanish class (I believe 142) called Spanish for the Professions. It is mainly vocab, where the other class is a lot of grammar. I should have had an A, but I forgot to do two compass postings worth 10% of my grade. Other than that, the class is pretty damn easy.\n\nI took Span 103 OL on CoD and it was a JOKE! But I couldn't find any online course that covered Spanish 4, so I took it at UIUC.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15uxqw/online_spanish_4_transfer_class/"
  }, {
    "id" : 27,
    "title" : "Is Engineering Hall open for advising?",
    "snippet" : "Does anyone know if Deans/advisers are back on campus ?    yes they are back though I don't think they are available until Friday for advising This is incorrect, which you can find out by calling 2173332280. They opened \"right away\" in their words. I called yesterday and was told the deans have probation meeting Wednesday and Thursday so can only see people on Friday. That's why I said yes they are around but deans are busy Weird. I just called. \n\nOP should probably call the number and ask for clarification including your details. Is the math department having some problems with reporting grades? One of my math classes is still listed as NR on my online transcript. Honestly it's not a big deal because I already know how I did but I need to get an updated transcript for a lot of the REU's and SURF's I'm applying for. Well, grades were due at 12 noon on December 26, so there were about 7000 NR grades this semester. Tell your instructor to get his butt in gear, he has a lot of forms to fill out. :)  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15v94y/is_engineering_hall_open_for_advising/"
  }, {
    "id" : 28,
    "title" : "What is an easy tech elective to go along with this hard ECE schedule?",
    "snippet" : "phys 212\nece 391\nmath 286\ncs 173\n\nAlso, how hard exactly is the above schedule? I have heard from extremely hard to \"do-able if you work enough\"    [GE 361: Emotional Intelligence Skills](https://my.illinois.edu/uPortal/render.userLayoutRootNode.target.u41998l1n6.uP?pltc_target=210253.u41998l1n6&amp;pltc_type=RENDER&amp;pltp_course=GE&amp;pltp_term=spring&amp;pltp_classNumber=361&amp;pltp_sessionId=default&amp;pltp_action=classView&amp;pltp_year=2013#u41998l1n6). The textbook is a [self-help book](http://www.amazon.com/Habits-Highly-Effective-People-Miniature/dp/0762408332). I haven't taken the class, but it sounds easy. Don't know if it counts as a tech elective or whether it counts towards any requirements. Do you know why a class on emotional intelligence skills is in the general engineering department? It sounds like a psychology class, expect for the fact that the textbook is a self-help book.  I hear ECE 391 is a bitch, but the rest of those classes aren't that bad. MSE 280 is supposed to be an easy tech elective and a good intro to ECE 340. This sort of topic comes up a lot in the ECE facebook group too, so you may want to keep an eye on it also. I just finished MSE 280.  It's not easy, nor is it exceedingly difficult.  It is, however, mind-numbingly boring, and test questions are either exact copies of homework problems or something weird that you've never seen before.\n\nThat said, there's a wicked curve.  I got a B- with a 67%. I hear ECE 391 is a bitch, but the rest of those classes aren't that bad. MSE 280 is supposed to be an easy tech elective and a good intro to ECE 340. This sort of topic comes up a lot in the ECE facebook group too, so you may want to keep an eye on it also. I hear ECE 391 is a bitch, but the rest of those classes aren't that bad. MSE 280 is supposed to be an easy tech elective and a good intro to ECE 340. This sort of topic comes up a lot in the ECE facebook group too, so you may want to keep an eye on it also.    Having taken them... \nTake math 286, math 213 instead of cs 173 (213 is easier imo and better prepares for ECE 313), ece 391, phys 212, and cs 411 (very easy class)         ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15u13n/what_is_an_easy_tech_elective_to_go_along_with/"
  }, {
    "id" : 29,
    "title" : "Easy Advanced LAS courses?",
    "snippet" : "So I need 3 more advanced LAS credit hours in order to qualify for latin honors for graduation.  Does anyone know of an interesting and preferably easy classes that fulfill this requirement.  I am an MCB major with a pretty heavy background in chemistry as well.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15v5ub/easy_advanced_las_courses/"
  }, {
    "id" : 30,
    "title" : "Housing for exchange student! ",
    "snippet" : "Hey all. I'm looking at coming over on exchange from Australia either this year or next. I was just wondering what you think the best housing options are? I'm a 20 year old female if that makes any difference. Any input would be great appreciated :)    If you're looking for partying and lots of school spirits (sports games, unofficial, other school activities) Six Pack is a good place to start, especially the newer buildings, they seem really nice from the outside. However, Six Pack is known for being quite loud at times. If you are for quieter but still a friendly environment, ISR and FAR/PAR are popular choices. Sherman Hall is a dedicated international student dormitory, so I would advise against it if you want to meet more so-called \"Americans.\" As for apartments, I don't think it's a good idea for a first time exchange student because you're not familiar with the area yet, and you'll have less of a chance to meet people. I don't think Sherman is a strictly international dorm. Rather, it's a grad student dorm that ends up consisting largely of international students.  Also, it's worth noting that the grad dorms will give you more freedom than the undergrad dorms will. So I would recommend looking into Sherman and Daniels if you're considering a single room as an option. I don't think Sherman is a strictly international dorm. Rather, it's a grad student dorm that ends up consisting largely of international students.  Also, it's worth noting that the grad dorms will give you more freedom than the undergrad dorms will. So I would recommend looking into Sherman and Daniels if you're considering a single room as an option. If you're looking for partying and lots of school spirits (sports games, unofficial, other school activities) Six Pack is a good place to start, especially the newer buildings, they seem really nice from the outside. However, Six Pack is known for being quite loud at times. If you are for quieter but still a friendly environment, ISR and FAR/PAR are popular choices. Sherman Hall is a dedicated international student dormitory, so I would advise against it if you want to meet more so-called \"Americans.\" As for apartments, I don't think it's a good idea for a first time exchange student because you're not familiar with the area yet, and you'll have less of a chance to meet people. If you're looking for partying and lots of school spirits (sports games, unofficial, other school activities) Six Pack is a good place to start, especially the newer buildings, they seem really nice from the outside. However, Six Pack is known for being quite loud at times. If you are for quieter but still a friendly environment, ISR and FAR/PAR are popular choices. Sherman Hall is a dedicated international student dormitory, so I would advise against it if you want to meet more so-called \"Americans.\" As for apartments, I don't think it's a good idea for a first time exchange student because you're not familiar with the area yet, and you'll have less of a chance to meet people. For the love of all that is good in the world, DO NOT ADVISE SOMEONE TO LIVE IN ISR/FAR/PAR.\n\nThose places are significantly worse than just about any living solution on campus. \n\nIf you're considering where to live, then I'd recommend either the six pack where you will get a fun, classic american college dorm room  experience OR subleasing in an apartment that you can afford comfortably so that you have some money for extra expenses. For the love of all that is good in the world, DO NOT ADVISE SOMEONE TO LIVE IN ISR/FAR/PAR.\n\nThose places are significantly worse than just about any living solution on campus. \n\nIf you're considering where to live, then I'd recommend either the six pack where you will get a fun, classic american college dorm room  experience OR subleasing in an apartment that you can afford comfortably so that you have some money for extra expenses.  Depends on how long you're staying. If it's a semester or two, go for the dorm. If it's an entire year, you might want to sublease. I am also a 20 year old female currently living in Allen Hall with another 20 yo female. If you feel like living in a quad, we're looking for cool roommates before we get stuck with someone awful again. =P If you are being serious that would be absolutely awesome! At this point I will only be there for a semester, not sure if that affects anything. Which semester? This upcoming semester, Jan-May? Then we do have two open spots. It is possible that they fill up, we have no control over who gets them, unfortunately. If it's next year we have an apartment, which might not work out as well for one semester, but maybe.  Sorry but this may be a stupid question. Your new UIUC year starts in August? If that's the case then that is when I would be over! It would be awesome if things worked out but it's all cool if they don't! :)    Live in Allen Hall! Allen tends to get more foreign exchange students than other dorms, and is more social/welcoming in general. I spent a year in the Six Pack and a year in Allen Hall, and Allen Hall is definitely better if you want to meet (quality) people. However, there is a Living Learning Community in the Six Pack called Global Crossroads which attracts international folk, but it was located in one of the buildings that was recently torn down so I'm unsure of it's current location/existence. Oh also, there was an Australian girl on my floor when I lived in Allen Hall :)   I have no idea what you are like as a person. If you plan on going to the bars and partying a lot, then avoid living in Urbana. Presby is nice, but you may have a harder time meeting people. I think people have mentioned Sherman. They have a lot of older students (non-freshman) and it is in a great location. \n\nIf you don't mind me asking, what is your major? I do like to go out but not every night! And I think our degree structure is a bit different here, I'm studying two degrees. One is International Studies and the other is Arts, with a major in either History or Indonesian. I was going to use the courses I take to make up my free electives! :) It sounds like you have a tough decision, but you will have a good experience regardless. Granted, they may be totally different, but good. I live in Champaign and love it! I also have cousins in Urbana and they love it!",
    "url" : "http://www.reddit.com/r/UIUC/comments/15trri/housing_for_exchange_student/"
  }, {
    "id" : 31,
    "title" : "Best public toilets to poop in.",
    "snippet" : "  Lincoln Hall... so marbley. Every time I went into Lincoln Hall to piss, it smelled terrible. So I went into the fourth floor once and had the most glorious shit of all time.\n\nThat's my advice-never go on the first floor of anything. And for fuck's sake, not the Union. Ever. I once went to the first floor bathroom at loomis.\n\nEntire floor covered in water and cute little nuggets of butt chocolate scattered everywhere.\n\nI was about to piss myself so I had to duck out of the bathroom, inhale, and fucking parkour to the urinal.\n\nI've never pissed faster in my life. \"cute little nuggets of butt chocolate\" \n\nI was happily eating Hershey's kisses when I read that comment. After reading that comment, I now feel like barfing. Fuck you.  Every time I went into Lincoln Hall to piss, it smelled terrible. So I went into the fourth floor once and had the most glorious shit of all time.\n\nThat's my advice-never go on the first floor of anything. And for fuck's sake, not the Union. Ever.   Second floor of the Illini Union...great wi-fi access, so bring out your laptop and do some redditing. Second floor of the Illini Union...great wi-fi access, so bring out your laptop and do some redditing.  https://twitter.com/IlliniDumps\n\nhttps://www.facebook.com/pages/IlliniDumps/189290074511151\n\nLooks like their website is down right now, but it's\n\nhttp://illinidumps.com/\n  When it's open, the Alice Campbell Alumni Center. The bathrooms are specifically designed to make distinguished alumni and faculty feel like kings and queens. When it's open, the Alice Campbell Alumni Center. The bathrooms are specifically designed to make distinguished alumni and faculty feel like kings and queens.  As other people have mentioned, this is what [IlliniDumps](http://www.illinidumps.com) was made for. Sorry about the server issues from before. I didn't expect people to be looking for bathrooms over Winter break.\n\nAs for the best bathroom, it is definitely the [Alice Campbell Alumni Center](http://www.illinidumps.com/index.php?sort=best&amp;id=120). Nice granite countertops and individual stalls. [Here is a picture](http://i.imgur.com/XMu2q.jpg).\n\nIf you don't feel like going so far away (Alice Campbell is on Illinois and Lincoln), there are some good alternatives. If you are by the south quad, check out the Gregory Drive facing bathrooms in the [Khan Annex of Huff Hall](http://www.illinidumps.com/index.php?id=57). If you don't mind some older bathrooms, the [Armory](http://www.illinidumps.com/index.php?id=12) can be a pretty peaceful stop, granted, they can smell a bit musky. If you are on the Quad, the [Illini Union](http://www.illinidumps.com/index.php?id=61) has some good bathrooms if you know where to look. I personally enjoy using the restrooms right off the stairs on the northwest side of the second floor. On the north end of campus, second to ACAC, I think the [DCL](http://www.illinidumps.com/index.php?id=39) is the best. If it's after 5, you are bound to be the only person in one of those second floor bathrooms (perfect for the post-exam dump). The 3rd and 4th floor of [MSEB](http://www.illinidumps.com/index.php?id=74) are also ideal bathrooms.\n\nSome bathrooms to stay away from:\n\n[UGL](http://www.illinidumps.com/index.php?id=114): People have very little respect for these bathrooms. There is a comment by Travis that sums it up pretty well.\n\n[KAM's](http://www.illinidumps.com/index.php?id=129): If you can believe it, the floors in the bathrooms of KAM's are stickier than the floors in the bar.\n\n[Altgeld](http://www.illinidumps.com/index.php?id=9): Just don't go there. Illini Inn has the worst bathrooms I have *ever* seen.  DCL basement.  There's a toilet in the basement of the MechE Building that is next to the steam room so if you feel like having a sauna while pooping it can be quite nice. I'm going to have to make a special trip to check this out. It's tucked away halfway down the hallway on the south side.  I like the women's restroom on the ground floor in Siebel. If it's in Siebel I'm guessing it's fairly unused.  I like the women's restroom on the ground floor in Siebel. All the girls' bathrooms in Siebel are really very nice. I mean it's a new building and all.  It's almost a decade old. It's almost a decade old.   Wasn't there a website with reviews and stuff a year or so ago? I remember seeing flyers.       Unions 3rd and 4th floors    Let X = building age and Y = pooping comfort\n\n(X,Y) = -1 How do you type Greek letters? I can't see any such option in RES.  Cut and paste using Character Map in Windows, maybe?  Yeah, copy-paste seems to work:   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15svoi/best_public_toilets_to_poop_in/"
  }, {
    "id" : 32,
    "title" : "I think we should make this a club sport (Ultimate Tazer Ball)",
    "snippet" : "    ",
    "url" : "http://www.youtube.com/watch?v=MxBcXDJS5Go"
  }, {
    "id" : 33,
    "title" : "Are there any good ways to get in/out of Champaign at odd hours?",
    "snippet" : "I hate to admit it but LEX had the most bus schedules--offering busses at odd hours (which I need to match with international flights).\n\nMy flight lands in Chicago at 10pm next Wednesday but I can't find any transportation until after 8am the next morning. Anyone have any ideas other than waiting for 10 hours at the airport?  Cuts it insanely close but there's a Megabus from Chicago to Champaign at 10:15pm on Wednesday the 9th. Cuts it insanely close but there's a Megabus from Chicago to Champaign at 10:15pm on Wednesday the 9th.    have you looked at the amtrak times? i dont know where the stations are in chicago but i know they go to champaign have you looked at the amtrak times? i dont know where the stations are in chicago but i know they go to champaign have you looked at the amtrak times? i dont know where the stations are in chicago but i know they go to champaign  Rent a car?  This is a good option based on your times. I don't think it should cost much to rent for just a day, probably cheaper than a hotel in chicago... You may be able to return it to the champaign airport and then just take the Air Bus from CUMTD back to campus. Or, some other rental place to drop it off. One way is usually above $100.  Most likely $150+gas.  Recruiting a couple of Illini to share the cost could work though. Not true, I rented an economy car one way from Hertz at Champaign Airport to O'Hare for $40ish plus whatever the cost of gas + tolls was so I could make a 6am flight from ORD.  Hertz at ORD is open 24/7 though the one at Champaign Airport has limited hours. ORD-&gt;CMI is much more expensive than CMI-&gt;ORD.  You can check the prices, if you don't believe me. I believe it, the travel industry just various widely from day to day.  I'm assuming I got lucky and scored a sale.   You can join zipcars. Not sure if other car-sharing services exist in Champaign but you can look.\n\nPrice is a little steep and there is a membership fee, but if this is a recurring problem this is a great solution. Could always offer rides to friends to offset price I'm pretty sure you have to return the car back to its parking spot after the reservation is over.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15t2gb/are_there_any_good_ways_to_get_inout_of_champaign/"
  }, {
    "id" : 34,
    "title" : "Kenney Gym in Engineering Campus",
    "snippet" : "So I know about ARC and CRCE, but I hate how crowded those places get after 6pm. I've tried showing up at later hours (10pm), but that also mucks around with my personal schedule. Showing up earlier in the day can be as challenging. \n\nI'm wondering: is Kenney Gym open to students? All I'd want to do is run on the track and do some light weight-lifting.\n\nOf course, this post gets posted on New Year's Day... no relation to a resolution, though! Just finally asking a long-standing question of mine.   As a Uni High Alum, I can tell you that no students with just a normal Campus Rec Membership, beyond those involved with the gymnastics teams and the handful of clubs that also use the gymnastics practice facility (which is inside Kenney Gym), can use Kenney Gym. A while back, it was open to the public, but now it is only open for a couple of hours midday and requires an additional fee as it is not connected with Campus Rec memberships, I'm not sure of the details of this club, but it may be limited to faculty and staff. The weight room is nothing special, and I highly suggest staying away from that track as someone who, now two years later, is still feeling the effects of running 4-6 miles a week up there for all of eighth grade and High School. WHY THE FUCK IS 15 LAPS A MILE?! HOW DOES 15 LAPS EVER MAKE SENSE AS A FUCKING MILE?! GAHHHHHHHH!!!!!!!! 15 laps to a mile is what we were told to adhere to in class (workouts were still given in laps, not miles, so it didn't matter). It's rough, doing sprints is more of a challenge in how tight of a turn your body can make without crashing into anything or falling over.  No, no, see, I'm saying that I hate that that is the way that it is, because I have to deal with it. Like, now. Because I go to Uni. (On a side note, did you know the track is supposed to be green? They just cleaned it recently and it was sticky. As in, your shoes would actually stick to the track. And not come off very easily. It took less effort to just run the long way on the wood. God, I hate that track.) All five years that I was there my shoes stuck to that track. I was at Uni when we had the MRSA case in the locker room from one of the people who used the track at lunch time (non-Uni student). Never gone barefoot in that locker room since. Then there was the day when the urinal failed and the whole building smelled like stale urine. Oh the stories I have of that place. Oh the marks the class of 2011 (my class) left on that place. As an '09er, christ I'm old. ...'05. Guess that means I've got one foot in the grave then.\n\nDo they still make you wear those heart rate monitor straps?   Let me know if you try and are able to, I live across the street and would totally be more motivated to work out if I didn't have to go to CRCE or the ARC.  I'd suggest e-mailing them but i think it's open to students. You hear about professors going there all the time. It's managed by the university as well. I think it may be the home for the gymnastics portion of DIA.  It's used by Uni High for PE and basketball so the open hours are going to be pretty limited compared to CRCE and ARC but they do exist (or at least they use to). There's is a gymnastics floor but I think the gymnastics team may have relocated to another facility in recent years.\n\nThe track is a pretty short one (something 15-16 laps to a mile) but the weight room is fairly complete. Hi Yang. Go back to your Seattle subreddit or whatever.  The gym is mostly used by club gymnastics teams, and related things like tricking and parkour. I can't say anything for their basketball court or weight room (I'm not even sure they have a weight room), but I do use the gymnastics gym there pretty frequently. There's a small track, some weights, a few excercise bikes, and tons of gymnastics equipment. \n\nThe gymnastics gym has open gyms from 6:30-9:30 on Tuesdays and Thursdays. I'm pretty sure they do on Mondays and Wednesdays, but I've never been on those days. It costs 5 dollars each time you go and the first time you go you have to sign a waiver. They lock the doors shortly after 6:30. If you arrive after the door is locked, you have to pound on the door until someone sees/hears you and lets you in.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15scth/kenney_gym_in_engineering_campus/"
  }, {
    "id" : 35,
    "title" : "Lasik eye surgery in the area?",
    "snippet" : "Just wondering if anyone here has had vision correction surgery from a doctor in the champaign area and your thoughts on how it went?  Thanks!  I don't know that there are any places that actually perform the surgery in town. I just recently had mine done by [Eye Surgical Associates](http://www.eye-surgical.com). They do all the in initial and followup visits in town, but the actual surgery is done in Bloomington. \n\nI initially had my eyes done 6 months ago and they were VERY bad (approx -9.0). I could see great the next day. My right eye was perfect but they slightly overshot my left eye so it was slightly farsighted, I recently went back for a 'correction' on the left eye and it seems pretty good so far. Everything is included in one price including any followups like I had. \n\nI'm glad I did it. It's a bit painful for the first few hrs after surgery but otherwise it's a really quick procedure and recovery is easy... just lots of drops. Its amazing being able to see without glasses. Thanks for your story!  What was it like getting approved for it?  Did you have to have X amount of eye exams from the past year saying you were unchanged, or anything like that?\n\nI'm 25 and havn't had one in a couple years, so I'm thinking they'd make me get some before I had it done correct? I don't really know. I got referred from my eye doctor that I'd been seeing annually for years. I don't think there was any formal reporting of being unchanged or anything. I believe they just asked me. They do a free test/consultation to check to see if you're a candidate. If you decide to do it then there's a few exams over a period of a month or so before surgery.  Awesome!  Do you mind me asking how much it cost you total?  It quotes $4700 complete on the site, so was just wondering if that was your experience.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15sfxb/lasik_eye_surgery_in_the_area/"
  }, {
    "id" : 36,
    "title" : "Good card stock printing places?",
    "snippet" : "Sooooo I want to print out Cards Against Humanity somewhere locally. Any good places for printing out nice sets of cards like these?   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15t1em/good_card_stock_printing_places/"
  }, {
    "id" : 37,
    "title" : "Has anyone taken (online) gen-eds at Parkland and transferred them for credit?",
    "snippet" : "        ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15s94v/has_anyone_taken_online_geneds_at_parkland_and/"
  }, {
    "id" : 38,
    "title" : "Can you recognize a stroke when you see it?",
    "snippet" : "In a discussion over on r/windows, someone mentioned in passing that they couldn't recognize the signs of a stroke.  It got me thinking that in a big lecture, someone might have a stroke and, thanks to the way everyone just blends into the crowd in Foellinger/Lincoln/Noyes 100/etc, it might not be recognized until the class ends.  Treating a stroke is all about restoring bloodflow to the affected area of the brain as rapidly as possible - even ten minutes can make a difference, so having it go unnoticed for an entire class could be deadly.\n\n* Sudden numbness or weakness of face, arm or leg - especially on one side of the body.\n\n* Sudden trouble walking, dizziness, loss of balance or coordination. \n\n* Sudden severe headache with no known cause.\n\n* Aaphasia: sudden and extreme language impairment. Often (but not always) involves a mixing-up of words: a person trying to say, \"I feel weird\" might speak the words \"Red lick spaceship.\" It works the other way, too - they might speak clearly but suddenly lose their ability to understand speech.\n\n* Sudden slurring of speech\n\n* Sudden and severe nausea\n\n* Sudden loss of vision in one or both eyes\n\nIf someone around you starts exhibiting any of these symptoms, **CALL 911,** clear a path to the door for the EMTs, ~~and if possible, give the victim aspirin and get them to chew it.  Make sure that you tell the EMTs that you did so.~~\n\nI know this post may seem random, but you literally might save someone's life by knowing how to react.\n    Is someone in a large freshman class (~18 years old) likely to suffer a stroke? I thought it usually happens to older people (50+).    What causes a stroke and how can you avoid getting one?  I wouldn't have the victim take aspirin.  I'm an EMT and that isn't in our protocols for a stroke, there are other, better drugs that Paramedics and the docs in the ER can give.  But if they've taken aspirin then they might not be able to get those meds due to certain contraindications or adverse reactions.  Also, those symptoms could be indicating a LOT of different things, including bleeding in the brain.  If you give someone with those symptoms aspirin and they have a brain bleed and not a stroke, you just killed them.  Just call 911 and get the person to the ER ASAP.  Even if you aren't sure, go to the ER immediately. Dad had a previous major stroke so I knew what to look for. Saw his face drooping and asked him to smile. He said he felt weird but kept trying to convince me to not take him to the hospital. Ended up making him go and I was (unfortunately) right that it was happening again. Also- my little cousin had one around age 8 so it can happen to anyone, not just older people. Is it the same as a seizure? I have heard of kids and young adults having seizures.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15rgf2/can_you_recognize_a_stroke_when_you_see_it/"
  }, {
    "id" : 39,
    "title" : "RIP Carl Woese, the UIUC microbiologist who discovered archea and redefined the tree of life. ",
    "snippet" : "    This man might have done more than any other biologist in recent history for our understanding of life. Between discovering the difference between archea and bacteria, and first putting forth the RNA world theory he is the closet thing to Darwin we have had recently. Its a damn shame to see him go and to lose such a fantastic scientist. RIP.   ",
    "url" : "http://www.news-gazette.com/news/university-illinois/2012-12-30/visionary-ui-biologist-carl-woese-84-dies.html"
  }, {
    "id" : 40,
    "title" : "Anybody got any info on CS +X?",
    "snippet" : "Heard about CS +X at the beginning of the semester. For those that don't know, I guess its like CS/Math or CS/Stats but you can combine CS with other disciplines. Anybody else know anything? Like what fields you will be able to combine CS with, when it will be available? CS +Physics would be great  The CS department is a bit odd, because it has majors in both the College of Liberal Arts &amp; Sciences and the College of Engineering.\n\nIn LAS, there are two CS majors: CS/Math and CS/Stats. In Engineering, there is only CS, but there are three technical tracks:\n\n * [CS](https://wiki.engr.illinois.edu/display/undergradProg/CS+Track+Requirements) - Focus is almost entirely on computer science\n * [Math](https://wiki.engr.illinois.edu/display/undergradProg/Math+Track+Requirements) - I assume this is similar to the LAS CS/Math program\n * [CSE](https://wiki.engr.illinois.edu/display/undergradProg/CSE+Track+Requirements) (Computational Science and Engineering) - In addition to CS, you also study another STEM discipline\n\nUntil recently, those in the CS track were also required to choose a concentration, but one of the options was basically \"take whatever CS technical electives you want\", so the fact that the requirement has been eliminated has basically no effect; the previously-existing concentrations still exist as suggestions for technical electives, but taking all the classes within a concentration is at your own educational discretion. Besides interest, is there any other benefit in choosing a concentration for the CS track? Like for jobs, etc. The CS department is a bit odd, because it has majors in both the College of Liberal Arts &amp; Sciences and the College of Engineering.\n\nIn LAS, there are two CS majors: CS/Math and CS/Stats. In Engineering, there is only CS, but there are three technical tracks:\n\n * [CS](https://wiki.engr.illinois.edu/display/undergradProg/CS+Track+Requirements) - Focus is almost entirely on computer science\n * [Math](https://wiki.engr.illinois.edu/display/undergradProg/Math+Track+Requirements) - I assume this is similar to the LAS CS/Math program\n * [CSE](https://wiki.engr.illinois.edu/display/undergradProg/CSE+Track+Requirements) (Computational Science and Engineering) - In addition to CS, you also study another STEM discipline\n\nUntil recently, those in the CS track were also required to choose a concentration, but one of the options was basically \"take whatever CS technical electives you want\", so the fact that the requirement has been eliminated has basically no effect; the previously-existing concentrations still exist as suggestions for technical electives, but taking all the classes within a concentration is at your own educational discretion.   I've heard about this too; it's one of the curriculum reform ideas that's been floating around. It sounded to me like it was a long term plan and dependent on other things happening before it - e.g. the merging of the linear algebra requirement and CS 357 into a single CS course, the introduction of a CS stats and probability course (which was trialled this semester), and the change from CS 373 and 473 into 300-level theory and 400-level theory - so I wouldn't count on it happening too soon. Steve Herzog might be able to give you a better timeframe. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15rb6q/anybody_got_any_info_on_cs_x/"
  }, {
    "id" : 41,
    "title" : "In the UC area for NYE with no plans.",
    "snippet" : "Any big things happening that I should know about?  I'm here with no plans as well. Wanna meet a new person? I'm here with no plans as well. Wanna meet a new person?  frat lion What in the fucking hell is a frat lion?  so how'd it go?  so how'd it go?   Ugh.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15r09c/in_the_uc_area_for_nye_with_no_plans/"
  }, {
    "id" : 42,
    "title" : "Are there restrictions to transferring into CEE?",
    "snippet" : "Im a LAS student in junior standing right now. I am done with first year and second year engineering courses covered (like phys chem math etc).  I transferred to CEE, you need to get A's and B's in those classes you mentioned. Then you need to talk to someone in 206 Engineering Hall to get the forms needed to transfer and they'll tell you what to do/who to talk to. Usually you need to write some small essay about why you want to transfer and show it to the advisor in CEE, then go back to Engineering Hall and show them the signature, maybe talk to a Dean and then you're in, assuming grades are ok. That's how it worked for me at least Doesnt matter if im a junior?",
    "url" : "http://www.reddit.com/r/UIUC/comments/15qfr6/are_there_restrictions_to_transferring_into_cee/"
  }, {
    "id" : 43,
    "title" : "John Groce loses in rock, paper, scissors again. ",
    "snippet" : "  That's hilarious. You should try tweeting the picture at some sportscasters (Bill Simmons, SC anchors, etc.). They like stuff like this. With Illinois in the spot light, you might get the picture some exposure.",
    "url" : "http://imgur.com/sO0PM"
  }, {
    "id" : 44,
    "title" : "Looking For a Roommate Spring 2013",
    "snippet" : "Im looking for a roommate for spring 2013. The apartment is in urbana, I have two cats, so must be cat friendly. Email me at mcdanie5 at illinois.edu for more information.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15pcqi/looking_for_a_roommate_spring_2013/"
  }, {
    "id" : 45,
    "title" : "Language Proficiency Tests",
    "snippet" : "Title. Has anyone here ever taken one here? I have to take one for Chinese (Mandarin) in two weeks and was wondering what to expect.  I had to take it four years ago, so I'm not sure if things are any different now. My memory is also a bit hazy, so I apologize if this won't be helpful for you. The written portion started off with a listening exercise. They would play a recording twice, then you would have to answer a question based off what you heard. Then there were just short reading passages, and more questions to answer, or sometimes you would have to summarize what you just read. I remember the exam getting progressively harder, but I don't think that's something to be concerned about, since it's just testing for your level of proficiency. Also, at various points during the exam, people were pulled out for a speaking test. It only lasted a couple minutes, and was fairly basic. I was asked about what I did over the summer, if I been to China before, and everyday-type of questions.\n\nJust do your best and you'll be fine. Best of luck!  I'm an ABC and I took mine in august. There's a listening section and a reading section. First, they play some tapes to test for listening comprehension (you fill in blanks in english). Then there's a page of radicals and basic characters for you to translate. Then, there are some paragraphs. As far as I'm aware, they don't do the speaking part anymore.\n\nI think I did decently well on the listening part, and I didn't even try the longer text translations since I'm basically illiterate. I got put in CHIN 241, if that's any help for you. I decided not to take Chinese this semester, but next fall I'll start with either 241 or just chinese 1. I'm an ABC and I took mine in august. There's a listening section and a reading section. First, they play some tapes to test for listening comprehension (you fill in blanks in english). Then there's a page of radicals and basic characters for you to translate. Then, there are some paragraphs. As far as I'm aware, they don't do the speaking part anymore.\n\nI think I did decently well on the listening part, and I didn't even try the longer text translations since I'm basically illiterate. I got put in CHIN 241, if that's any help for you. I decided not to take Chinese this semester, but next fall I'll start with either 241 or just chinese 1. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15ouzb/language_proficiency_tests/"
  }, {
    "id" : 46,
    "title" : "ACE 210: Environmental Economics",
    "snippet" : "I was wondering if anyone has taken this class and could tell me anything about it. How difficult are the exams, are there writing assignments, etc?   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15ojsn/ace_210_environmental_economics/"
  }, {
    "id" : 47,
    "title" : "I'm applying for an exchange from the UK and I've got some questions about UIUC",
    "snippet" : "Hello r/UIUC !\n\nIm a student at the University of York in the UK and Im working on an application for an exchange to UIUC in the next academic year. Im a history/philosophy undergrad and the program Im applying for is a history specific single semester exchange. Ive done an awful lot of googling about UIUC to try and make my application sound clever and informed but itd really help if I could get a bit of input from a current or past student, particularly someone who has taken history/philosophy/medieval studies courses or similar. Idk  I really dont just want to be quoting the website if I get an interview.\n\nIf you guys dont mind I have a couple of massively general questions:\n1.\tIs there anything particularly special about liberal arts teaching at UIUC?\n2.\t Whats awesome/interesting about the departments of history/philosophy/medieval studies? (i.e. range of courses, particular professors, whatever)\n3.\tIf you were trying to sell UIUC (in a general sense) to a prospective student what sort of stuff would you say?\n\nId really appreciate any help I can get. Also, Im sure Ill have a load more specific questions if I get accepted so if anyone is interested in corresponding (or youve got a friend who likes answering dumb questions) Id be much obliged.\n\nWould say Id buy helpful redditors a beer if I get a place but Im not legal in the US so Ill buy you a non-alcoholic beverage of your choice.\n\nThanks loads.\n\nEDIT: Thanks so much for the replies guys - will reply properly when I've done some stuff   Reply/PM me if you have any general questions about coming to America! I grew up in the UK but my family live in the US now. \n\nI met some British students last year who were studying history as well. Are you particularly interested in taking American history courses here? Thank's so much - there's so many things I've had to look up even at this stage in the process. It's such a different system. I'll be taking you up on that offer when I think of some stupid questions to ask!\n\nAmerican history is something I know very little about - as you probably know schools in the UK are very keen on British history. I would be interested in taking some courses but I worry that without the grounding in the basics that most students get at school I'd be a bit lost, especially since I'm required to take 200 and 300 courses to get the right credits so I can get them transferred properly. Thank's so much - there's so many things I've had to look up even at this stage in the process. It's such a different system. I'll be taking you up on that offer when I think of some stupid questions to ask!\n\nAmerican history is something I know very little about - as you probably know schools in the UK are very keen on British history. I would be interested in taking some courses but I worry that without the grounding in the basics that most students get at school I'd be a bit lost, especially since I'm required to take 200 and 300 courses to get the right credits so I can get them transferred properly. Thank's so much - there's so many things I've had to look up even at this stage in the process. It's such a different system. I'll be taking you up on that offer when I think of some stupid questions to ask!\n\nAmerican history is something I know very little about - as you probably know schools in the UK are very keen on British history. I would be interested in taking some courses but I worry that without the grounding in the basics that most students get at school I'd be a bit lost, especially since I'm required to take 200 and 300 courses to get the right credits so I can get them transferred properly. Sure thing! I don't really know how history courses are structured here besides being a lot of reading &amp; writing, but a lot of the 200-level history courses are open to all majors, so you probably won't be overwhelmed. You'll be a whiz in Euro. history though - American schools don't spend very much time on that at all, haha.  Hey! \n\nI'm a history major, will graduate this summer. The program is pretty awesome here, classes are reading and discussion heavy, not a lot of homework aside from readings and a few papers a semester. The professors know their stuff really well, as expected. UIUC is awesome, definitely would recommend going here, the ladies will love your accent (Unless youre a girl, then the dudes will be after you. Unless youre gay then whatever gender you are will love you. You get my point.)\n\nOh, when registering for history classes, avoid David Prochaska, the worst professor of any students life ever. You will hate that class no matter the content.\n\nIf you want to send me a message for more info I'd be happy to help. &gt; the ladies will love your accent (Unless youre a girl, then the dudes will be after you. Unless youre gay then whatever gender you are will love you. You get my point.)\n\nThis. Being a history major, OP, you could talk about British history, the Queen, the Royal Baby, all in your British accent. Girls will be swooning around you in no time. \n They could talk about anything and they would be swooning over them.  Over here my accent is just embarrassingly posh so I think I'm going to really like your country! Over here my accent is just embarrassingly posh so I think I'm going to really like your country! Hey! \n\nI'm a history major, will graduate this summer. The program is pretty awesome here, classes are reading and discussion heavy, not a lot of homework aside from readings and a few papers a semester. The professors know their stuff really well, as expected. UIUC is awesome, definitely would recommend going here, the ladies will love your accent (Unless youre a girl, then the dudes will be after you. Unless youre gay then whatever gender you are will love you. You get my point.)\n\nOh, when registering for history classes, avoid David Prochaska, the worst professor of any students life ever. You will hate that class no matter the content.\n\nIf you want to send me a message for more info I'd be happy to help. That sounds like the ideal workload!\n\nIt's good to hear from a History student - what are you writing your thesis on if you don't mind me asking?\n\nAwesome! I'm a girl and I can really drag out the stereotype of a posh English accent if the need arrises. I think I'm going to like America.\n\nHa! It's great to get such specific advice - I'll remember that name. Apparently I'll have less choice of courses than the average student though so I bet I'll end up stuck with the guy. I'm actually not sure on my thesis yet, I'll be taking History 498 this coming semester and the topic is Wealth and Poverty in the History of Christianity...so something on that topic! I'd prefer to write on the American Colonies and the 16th-18th century but there isn't a thesis class offered on that subject. \n\nI'm so sorry if you get stuck with that professor. Also, try not to take more than three history classes a semester, I took four once and the reading was around 250 pages a night, just got way too overwhelming to keep up.\n\nMorrassy and Koslofsky are really good professors, really enjoyed their classes. (Names might be spelled wrong)\n\nOh! Many have \"Participation\" grades (Which I hate). The best way to guarantee the full percent to that is just to go to their office hours a few times and theyll remember you. I never participate, aside from showing up (most days) and always get that credit.  Ah, it works a bit differently in the UK I think - you can do whatever the hell you want really. That topic sounds great though.\n\nThats good advice. It will be pretty good if I can mention specific professors and suggest an interest in their work - I'll do some more research.\n\nI'm that asshole who asks loads of stupid questions and argues about anything. Doesn't necessarily make you super popular but I just got some performance reviews back and the professors loooooooove it. You can also do that in the History department at UIUC, but it's a two year process so unfortunately it wouldn't be open to you as a one semester exchange student.\n\nIf you get into the program I highly recommend taking any courses offered by either Mark Micale or Bruce Levine. Kristin Hoganson's course on the history of American foreign policy is also excellent and would probably be of interest to you as a Brit. \n\n Hey! \n\nI'm a history major, will graduate this summer. The program is pretty awesome here, classes are reading and discussion heavy, not a lot of homework aside from readings and a few papers a semester. The professors know their stuff really well, as expected. UIUC is awesome, definitely would recommend going here, the ladies will love your accent (Unless youre a girl, then the dudes will be after you. Unless youre gay then whatever gender you are will love you. You get my point.)\n\nOh, when registering for history classes, avoid David Prochaska, the worst professor of any students life ever. You will hate that class no matter the content.\n\nIf you want to send me a message for more info I'd be happy to help. Hey! \n\nI'm a history major, will graduate this summer. The program is pretty awesome here, classes are reading and discussion heavy, not a lot of homework aside from readings and a few papers a semester. The professors know their stuff really well, as expected. UIUC is awesome, definitely would recommend going here, the ladies will love your accent (Unless youre a girl, then the dudes will be after you. Unless youre gay then whatever gender you are will love you. You get my point.)\n\nOh, when registering for history classes, avoid David Prochaska, the worst professor of any students life ever. You will hate that class no matter the content.\n\nIf you want to send me a message for more info I'd be happy to help.  As an engineer, I can't answer 1 or 2, but I can try for 3.\n\nTo me, UIUC is a cool place because of the size and diversity that we have here. You have probably seen that we are quite a large school - about 32,000, and that's undergrads alone - and a lot of us are from different walks of life. Because I'm a student at this school, I've met with many people from other countries - we have one of the most, if not the most international students at this school - and I became friends with them. Being from the US midwest isn't the most diverse experience that a child can have, but working and hanging out with people from other cultures is just expands the paradigms about people and how we relate. I'm sure that's why you're coming here, and I commend you for that. You'll get to meet Americans and non-Americans alike, so I guess its a bit of a bonus.\n\nWe have more fraternities and sororities than any other school (this is a different discussion all its own because I'm sure you don't know much about those) and you'll interact with many people in these organizations too because of the sheer amount of people that are in them. I am not a part of a fraternity, but my experience here really made me lose the stereotypes of frat people partying and drinking all the time. Don't get me wrong, that happens - a lot - but some of the most intelligent people that I've been in school with were in fraternities.\n\nI would say that you could learn about US sports such as American football, but were not the best in that. By any means. However, if you enjoy basketball, you'll get a glimpse into big time college sports culture (which is unique to the US), and its a discussion all its own too.\n\nNow is this place the only place in the world where you can find this stuff? No its not. You can find professors that are the cutting edge of their field in many schools. You can find those special students that do things that just don't seem possible to an average college student, those people that are in commercials for what they achieved - they may be rare, but you can find them almost anywhere. But what you can find here, and I can almost guarantee this, is a place that is your own. That's why people love college so much - with the amount of people and diversity of cultures and interests, you'll find people that you like, people that make your experience special. And I'm sure that you'll do the same for them. Oh, and by the way, we have some pretty good academics too. But Im sure you saw that on the university website. \n\n*We work hard, and we play hard.* Hopefully you get to be a part of it for 16 weeks.\n\nGood luck getting in here. I hope this helps. Wow! Thanks so much for such a detailed reply - I really appreciate it.\n\nMy University is great but pretty small for Universities in the UK and certainly not as diverse as UIUC seems to be. The website is very keen on reminding you that the student population is pretty international but to hear about it from a student and in the context of how it really does enhance your educational experience is very helpful. I think I'll be focussing on this idea if I get an interview.\n\nFrats and the like are a complete enigma to me and I think most people outside of the US. I think it shows just how different the university experience is and I hope thats an idea I can weave into my application. The same with college sports - not that they're not a big deal in the UK but it just seems to be on a whole different level.\n\nThe idea that UIUC is a very good school but, in a lot of ways, not much different to plenty of other schools in terms of student experience/teaching etc. might actually be a really good angle for me to work from. I might not get another opportunity to study abroad again and to get a chance to get involved in something that is so ordinary in terms of your experience but actually so completely alien to me would be fantastic.\n\nThanks again  Ill PM you about that drink if I manage to get a place. Dont worry about the drink - in college, they're not that hard to come by. Good luck!  Champaign-Urbana is considered micro-urban, which means it has a small population (&lt;250,000) yet it has characteristics of an urban city.  We have a bus system that takes you to classes and off campus, which is handy if you want to go to shopping, see a movie, etc.\n\nWith over 1200 registered student organizations (RSOs), you're bound to find something that interests you that you can join.  They can be related to your major or completely random, ie the skydiving club called the Falling Illini.\n\nDiversity is also a huge part of UIUC.  I've learned a lot about other cultures just casually from my friends that a class couldn't teach me.\n\nIn short, I've met some of my best friends here, I'm going to take away many amazing memories that I get to keep for a lifetime, and I've learned a lot about myself and others in addition to getting my degree from a great institution.    I can answer your 1st and 3rd questions.\n\n1. I'm not sure if there's really anything \"special\" in the way that LAS is taught here, especially since I can't compare it to anywhere else, but I know that I've felt like my education and the professors are all extremely knowledgeable and helpful. I've never had a weak link in LAS.\n\n3. I would sell Champaign-Urbana. I'm sure you've heard all the typical \"diversity, RSOs, greek system, etc.\" but outside of campus, there are a lot of cool things to do in C-U. It's a cool town with a bumpin' music scene (if you're into that sort of thing). If you do come here, I definitely would suggest stepping out of the campus bubble. The idea that LAS is really solid is actually great to know. I'd sort of hoped I could just say something easy in my application like \"oh yeah, x department is really exceptionally well regarded blah blah blah\" but now I think about it a more interesting angle would be that teaching in general is well regarded and I can be sure that I would be well supported in every regard during my time there.\n\nAwesome - I might have to post again later in the year if I get in to see about hiring a tour guide! It sounds like a really great place to be.  The library system is fantastic.  That is so good to know because the system here at York is. slowly. killing. me. We have ~53 separate libraries (they operate relatively autonomously, though resources are linked) and the staff is knowledgable. You'll like the philosophy and history libraires, if you choose to come here. \n\nTaken together, we're the second largest university library in America, just after Harvard. Third largest library, if we tack on the Library of Congress. \n\nEdit: Oh, and the Rare Books and Manuscripts library is run by a person who actually believes people should be able to touch books. You'll have full access to a very large and substantial rare book collection. Holy shit that's amazing! We have ~53 separate libraries (they operate relatively autonomously, though resources are linked) and the staff is knowledgable. You'll like the philosophy and history libraires, if you choose to come here. \n\nTaken together, we're the second largest university library in America, just after Harvard. Third largest library, if we tack on the Library of Congress. \n\nEdit: Oh, and the Rare Books and Manuscripts library is run by a person who actually believes people should be able to touch books. You'll have full access to a very large and substantial rare book collection. I agree, our libraries are pretty awesome.  I believe we have the LARGEST collection available to public checkout in the WORLD!  The staff will go out of there way to get you a resource that they currently don't own.  \n\nThis semester I read a preview of a book on Amazon that was published in 2005 and was great resource but wasn't sold anymore on Amazon and UIUC didn't own it, or any I-Share Library (If UIUC dosen't own a book, you can request it from almost any library in Illinois!)  \n\nI told this to the staff and they were able to get a copy from Wisconsin-Madison, I thought that is just awesome! We have ~53 separate libraries (they operate relatively autonomously, though resources are linked) and the staff is knowledgable. You'll like the philosophy and history libraires, if you choose to come here. \n\nTaken together, we're the second largest university library in America, just after Harvard. Third largest library, if we tack on the Library of Congress. \n\nEdit: Oh, and the Rare Books and Manuscripts library is run by a person who actually believes people should be able to touch books. You'll have full access to a very large and substantial rare book collection.  I really can't sell you on UIUC except to say that if you come here you'll most certainly love it! It's such an interesting and diverse place where I always felt like there was so much to learn if only I had enough time. \n\nI was a history minor and spent all of my time within the college of LAS. It's the largest college within the university although it tends to get overshadowed by flashier colleges such as engineering and business. However, within LAS if you choose your professors wisely you will get some of the best instruction available. I'm not sure how lecture/discussion goes in the UK but here the key to getting the most out of your courses is going up to your professors and getting to know them, showing them your own interest in their subject and they will certainly reciprocate. In fact I had a student from the UK in one of my last history courses and on more than one occasion I witnessed the prof having a really in depth discussion with him about where he was from, what he was interested in academically, etc. I always found professor Micale's classes for 200-300 level HST courses to be really well done. I'm not sure his classes correspond with your interests but he is a fantastic lecturer and great professor. \n\nYou can also search faculty on the history department website to get a feel for different prof's areas of research and instruction. \nhttp://www.history.illinois.edu/people/\n\nAnd finally, not sure if there is something like this in the UK but in the US you're a fool if you don't check ratemyprofessors before selecting courses and profs. \nhttp://www.ratemyprofessors.com/SelectTeacher.jsp?sid=1112\n\nGood luck! And if it's not UIUC I'm sure you'll have more than enough fun within the states :) Thanks so much - it's reat to hear from people who know the department and can recommend particular professors etc. It's also good to know that the \"get to know the professor\" tactic works everywhere!\n\nI'll probaby have less options course wise than a regular student but I reckon it'll be good to be able to talk about specific professors whose classes I woud like to take, even if I don't have the opportunity to actually take them.\n\nI really wish ratemyprofessor was more popular in the UK - it should be such a great resource. I guess I can make good use of it now, thanks for the link!  [deleted]  If I were to sell uiuc to a prospective student, i'd mention a couple things: a diverse student body, relatively inexpensive tuition/cost of living, partying culture (if that's your thing), and good engineering departments.\nI'm a computer science major, so i can't think of anything particularly special about liberal arts program here, so someone else can help out. i wouldn't be too stressed about what to put on the application. what's your actual reason for choosing uiuc? Thanks!\n\nThere's a pretty limited range of exchange programs I can apply for where I'm from and UIUC appealed most. It would make it easier if it was renown for it's history department or something but as it doesn't seem to be I need to be quite clever about the way I present my interest in studying at your shool in particular rather than anywhere else that was on offer. The diversity thing will probably go down well with my board of studies - I'll work that in.\n\nAlso, I'm a first year undergrad currently. If I get in the exchange would occur in the winter term of my second year. The literature I've got from my University says I can sign up for 200 and 300 courses. I should probably have mentioned that before. :) If you're interested in medieval church history, we do have a unique resource: The [largest Newman Center in the US](http://en.wikipedia.org/wiki/St._John%27s_Catholic_Newman_Center) and its Institute of Catholic Thought.  I wouldn't gush over them inordinately in the application, since they successfully sued the College of LAS recently, but when you get here or even before you get here, they can point you to the local heavyweights in medieval church history.  1. UofI has a good teaching program. Certainly nothing were really renown for, but one of the best in the area\n2. Can't really speak for it sorry\n3. Anecdotally I know 3 students who came from the UK to study abroad here at UofI. One studied for a year last year and is now back in the UK, and the other two are here now. They have all said on more than a few occasions how glad they are for deciding to come here. \n\nas an important side note (and addition to question 3), you won't have to worry so much about not being legal here in the US if you come to Illinois as you might have to elsewhere. While the drinking age is technically still 21, bars legally allow 19+ to come in and in general people are pretty accommodating of such things ;) i'm really glad to hear that it worked out for other UK students. I've been trying to get in contact with other students who went on the same exchange as me but the Global Study office here won't pass along details.\n\nHa, that's interesting. In the UK just about everything becomes legal to buy when you're 18 so I've been enjoying buying weird liqueur and knives and stuff just because I can without any worry if I get carded. I don't know how university life would function without easy access to terrible booze.  The people you will want to mention:\n- Ralph Mathisen (ecclesiastical history - late antique &amp; early medieval). He's really really eccentric, but if you can put up with his weirdness, you'll benefit. He does a lot of smaller seminars, mixed grads &amp; undergrads. I can say more privately if you want.\n- Anne Hedeman - medieval art historian. (If she's not on sabbatical or something.) You can easily google her to find out her strengths. She's a very nice person &amp; a good scholar.\n- Charlie Wright (yep, Charlie) - Old English, medieval chronicles. Also very kind and a star in his field.\n- Richard Layton - religious studies.   [deleted]  Junior here. Any general things or oddly specific things you'd like to know. I'm up for emailing or what have you. I didn't read all the comments but when are you trying to study here? If it is in the next three semesters I'll be around still. UIUC is a very friendly place and it is impossible to come here without meeting someone - unless you hide under a rock. Thanks so much - I can't think of any questions right now but is it alright if I message you with stuff that comes up? I won't bombard you or anything but its just great to have someone that I can ask stupid questions if I need to.\n\nIf I get a place I'll be there for the winter semester of 2013 (idk the proper terminology). :) Of course! From august to december? We just call it fall here. No worries :) Yeah, August to December. We have a three term system here with ten week terms so the comparisons are a bit awkward. If I get on the program I miss pretty much my entire summer holiday which sucks a bit. Thanks so much - I can't think of any questions right now but is it alright if I message you with stuff that comes up? I won't bombard you or anything but its just great to have someone that I can ask stupid questions if I need to.\n\nIf I get a place I'll be there for the winter semester of 2013 (idk the proper terminology). :) Yeah, I'm not too sure about what semester you mean. We have a 16 week fall semester (Aug-Dec, like samdilla said), 3-4 weeks winter break, 16 week spring semester (Jan-May) then summer break. (52-(2*16+4) = 16, so I guess around 3-4 months of summer break.) Yeah, August to December I think.\n\nI think I got confused - we have a three term system and essentially I miss a big chunk of summer holiday time and the entirety of what I would refer to as my winter term which runs from September/October to December to take part in the exchange. Me and my flat mates were trying to figure this out but it becomes so awkward with the terminology being so similar on both ends. Or maybe we're all idiots, idk.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15n27g/im_applying_for_an_exchange_from_the_uk_and_ive/"
  }, {
    "id" : 48,
    "title" : "Can some of you help me with driving lessons",
    "snippet" : "I have a drivers license back in my country (got it 3 years ago and regularly drove when i went back during summer/winter) but want to get it in America. I just need to get touched up on few things before the test, and need a vehicle for the road test. if anyone's interested, PM me, I am willing to pay (and we will negotiate the price) let me know, thanks  Just as a heads up, the DMV will require you to have a working vehicle with liability insurance in your name.  I worked at a local car rental place and had to tell this to countless people in your shoes.  Unfortunately they won't let you use a rental car. I am not trying to get a rental car and I know that you can't  use rental car for the driver's license test. I am just hoping some of you here would let me use their car (with their permission and bit of payment from me of course) for getting touched up on my driving skill a little (haven't been back to Korea since last year) and use it when I take the test. I am willing to pay about $20-30 per hour.  I am not trying to get a rental car and I know that you can't  use rental car for the driver's license test. I am just hoping some of you here would let me use their car (with their permission and bit of payment from me of course) for getting touched up on my driving skill a little (haven't been back to Korea since last year) and use it when I take the test. I am willing to pay about $20-30 per hour.  You have to have insurance with the car you'll be taking the test with, so you cant use anyones car but your own. I'd recommend just buying a beater car, getting insurance and using it. That's your easiest option. you can't really register a car without license. so... Do you count as a resident of the state? Or do you count as foreign? Only residents must register (I believe), so if you're able to go about it quickly that could be something.\n\nHonestly, you probably should call the DMV and figure it out. ahhhh, im a foreigner. ill check it out, but champaign DMV is not known for their kindness The Caucasian woman at Champaign DMV is reputed to be not very kind to Asians (there is a Caucasian man, a Caucasian woman, and an African-American woman there, or at least, used to be). \n\nFor obtaining a car for the driving test, you could post an ad on Craigslist. I understand your hesitation, but you could do a background check on the people who respond (Google, Facebook, the circuit court webpage if you want to be really sure) and make sure they are reliable. If I see they are affiliated with the university I assume they are likely to be okay. When you practice with the car, you will be the one driving, so it isn't like they can drive you off and kidnap you. At this time there aren't many students on campus, which is probably why you aren't getting many responses on reddit. You will reach a larger audience on Craigslist than on reddit. ..I guess I should try that. Now, what category would that fall in? Any idea? (NOT INTERESTED IN MEN SEEKING MEN) Since you are going to meet them at most a few times, I believe it would be more of the casual encounters kind. \n\n[Lessons](http://chambana.craigslist.org/lss/), [etc jobs](http://chambana.craigslist.org/etc/), [part-time jobs](http://chambana.craigslist.org/search/jjj?addFour=part-time) might be good places to post. Someone with a $1200, 1990 model car might be willing to risk lending it to you if you offer enough renumeration. Be careful though, if they sound desperate don't respond. UIUC student, being a woman, etc. are good indicators of them being safe, though nothing is guaranteed on craigslist or the internet. Do your background checks. I've had people with criminal histories, who are driving with suspended licenses, or have a DUI, respond to my moving help ads in the gigs section. ahhhh, im a foreigner. ill check it out, but champaign DMV is not known for their kindness Definitely not...if I were you I'd ask a friend for a drive to the Monticello DMV. It's 30 minutes away but theyre super nice and Ive never had a line to wait in. I am not trying to get a rental car and I know that you can't  use rental car for the driver's license test. I am just hoping some of you here would let me use their car (with their permission and bit of payment from me of course) for getting touched up on my driving skill a little (haven't been back to Korea since last year) and use it when I take the test. I am willing to pay about $20-30 per hour.  [deleted] Yes, Korean, I think that 1/3 should be a \"girl\" criteria. Imma dude. The Queen of England might be [quite fond](http://en.wikipedia.org/wiki/Queen_Elizabeth%27s_corgis) of you, too. Yes, Korean, I think that 1/3 should be a \"girl\" criteria. Imma dude. 18/M/Urbana: 160 lb brown haired, 5ft tall South American male seeks female. Very gentle and submissive. Works out daily, is a lifelong vegan. Is looking to get a herding dog, preferably Pembroke Welsh Corgi, to help out with farm duties. Hobbies include humming and producing clothing. Send a picture for a reply! [holy shit, it is you](http://www.youtube.com/watch?v=wEG4qkD20aQ) Didn't realize your username till now I'm this badass alpaca http://www.youtube.com/watch?v=1rlCysv4pzk  \n(nobody likes my semi-novelty account joke) [what the heck??](http://i.imgur.com/gIxq7.gif) [Do you even surf bro?](http://i.imgur.com/jjRMs.jpg) Just as a heads up, the DMV will require you to have a working vehicle with liability insurance in your name.  I worked at a local car rental place and had to tell this to countless people in your shoes.  Unfortunately they won't let you use a rental car.  http://www.cyberdriveillinois.com/departments/drivers/drivers_license/drlicid.html#tvdl\n\nNot sure if you can practice driving with your foreign license, or if you need some kind of permit but http://www.cyberdriveillinois.com/ also has study guides for the written tests. From the exemptions section of Chapter 1 of the [Illinois Rules of the Road](http://www.cyberdriveillinois.com/publications/pdf_publications/dsd_a112.pdf):\n\n\"If you are an out-of-state student attending an Illinois college/university, you, your spouse and children may drive with a valid license from your home state or country.\"\n\nSo he should be okay practicing on his foreign license, unless I'm misunderstanding that clause. there's specialized license that I need to apply to in my country, but those things expire in 6 month or so upon entering country... [deleted] http://www.cyberdriveillinois.com/departments/drivers/drivers_license/drlicid.html#tvdl\n\nNot sure if you can practice driving with your foreign license, or if you need some kind of permit but http://www.cyberdriveillinois.com/ also has study guides for the written tests.    Do you have any friends with cars? No offense, but I'm sure most folks would be a bit wary of loaning their car out to someone they met via the internet.",
    "url" : "http://www.reddit.com/r/UIUC/comments/15o5ge/can_some_of_you_help_me_with_driving_lessons/"
  }, {
    "id" : 49,
    "title" : "Possible attendance to UIUC",
    "snippet" : "I've been apart of this sub-reddit for a while. I was wondering are there any negatives that UIUC may hold, because from reading the threads and comments it seems as if this college would make a perfect match. I was also wondering what mistakes should I avoid freshman year. Lastly; I'm planning to pursue a degree in international affairs and probably a minor in poli-sci and I was wondering do you guys/gals have any tips for me to make sure I keep my grades intact.(I'm looking forward to attending a top graduate school also.)\n\nBackground: African-American from South-side Chicago.  \n\nThanks in advance;)\n\nP.S. I'm kind of a book worm, and most likely I will live in the library.(This might change)  In general, I just would have a few points of advice: **College is an opportunity, no more, no less. You aren't guaranteed anything.**\n\nSince you're an adult, profs aren't going to check on you or your progress - the U of I is a research heavy institution, so they're spending their time doing world-class cutting edge research and managing their graduate students. I'm not saying that they aren't nice people, but there's only 24 hours in a day. They will not go to you to ask if you need help - you have to go to them.\n\nThe bill for the U of I is a big one, and they'll charge you for it no matter what you got out of it. Might as well get as much as you can. Keep your finances in check - financial aid will help you out, but that's not a gift, its a loan. You pay all that money back, so spend wisely.\n\nAs far as grades, just do this - you have to have the paradigm to think that this isn't school, this is your job. This is the job that leads to all your other job opportunities. You'll have the resources here. Take advantage of them.\n\nLastly, as a black person myself, I just want to warn you about the one thing that I never really saw coming, but its affected me, even though it shouldn't. I felt like I didn't belong. Not because I wasn't smart enough, but because I didn't have the pedigree of the people around me. I didn't go to schools that weren't as good. No, my mom and dad aren't lawyers. No, my whole family didn't go here. I'm definitely not speaking for everyone - there are many people have had much rougher lives than me, and they made it here and they are amazing for that. However, those feelings of not belonging can have an effect, even though I've never had any negative experiences with white people or any other races at all during my time here, even if those feelings come from the illogical narrative that was inside my head. Don't ever feel like you aren't supposed to be here, or that you're here just as some affirmative action quota. I hope you don't have those attitudes, but if you do, let them go. You wont be admitted because of where you come from, but you'll be here because of where your going. \n\nGood luck to you. &gt; I felt like I didn't belong.\n\nIt's called the [impostor syndrome](http://en.wikipedia.org/wiki/Impostor_syndrome), and is a term usually applied to women in graduate school, but I suppose it can affect anyone who belongs to a minority, whether it be due to race, gender, socioeconomic background, etc.  Yes, one of the factors leading to a low self-efficacy. Not a good thing to have, especially in an environment where your performance is standardized against your peers. Its given me some trouble, but I deal with it alright. This is a good university, so I think most people struggle with some degree of self-doubt at times. &gt; I felt like I didn't belong.\n\nIt's called the [impostor syndrome](http://en.wikipedia.org/wiki/Impostor_syndrome), and is a term usually applied to women in graduate school, but I suppose it can affect anyone who belongs to a minority, whether it be due to race, gender, socioeconomic background, etc.  In general, I just would have a few points of advice: **College is an opportunity, no more, no less. You aren't guaranteed anything.**\n\nSince you're an adult, profs aren't going to check on you or your progress - the U of I is a research heavy institution, so they're spending their time doing world-class cutting edge research and managing their graduate students. I'm not saying that they aren't nice people, but there's only 24 hours in a day. They will not go to you to ask if you need help - you have to go to them.\n\nThe bill for the U of I is a big one, and they'll charge you for it no matter what you got out of it. Might as well get as much as you can. Keep your finances in check - financial aid will help you out, but that's not a gift, its a loan. You pay all that money back, so spend wisely.\n\nAs far as grades, just do this - you have to have the paradigm to think that this isn't school, this is your job. This is the job that leads to all your other job opportunities. You'll have the resources here. Take advantage of them.\n\nLastly, as a black person myself, I just want to warn you about the one thing that I never really saw coming, but its affected me, even though it shouldn't. I felt like I didn't belong. Not because I wasn't smart enough, but because I didn't have the pedigree of the people around me. I didn't go to schools that weren't as good. No, my mom and dad aren't lawyers. No, my whole family didn't go here. I'm definitely not speaking for everyone - there are many people have had much rougher lives than me, and they made it here and they are amazing for that. However, those feelings of not belonging can have an effect, even though I've never had any negative experiences with white people or any other races at all during my time here, even if those feelings come from the illogical narrative that was inside my head. Don't ever feel like you aren't supposed to be here, or that you're here just as some affirmative action quota. I hope you don't have those attitudes, but if you do, let them go. You wont be admitted because of where you come from, but you'll be here because of where your going. \n\nGood luck to you. Great words of wisdom, but I care about achieving my goal and nothing else. Now if the quality of my education is my greatest fear, and it seems as if my fear is true from what i'm reading in the comments.  Great words of wisdom, but I care about achieving my goal and nothing else. Now if the quality of my education is my greatest fear, and it seems as if my fear is true from what i'm reading in the comments.  Great words of wisdom, but I care about achieving my goal and nothing else. Now if the quality of my education is my greatest fear, and it seems as if my fear is true from what i'm reading in the comments.   From one South Sider to another, welcome!!\n\nFor advice with freshman year, I'd read the sidebar because it's really helpful.  I wouldn't take too many hours the first semester (14-16 is good) because you are making a huge adjustment moving to college and the classes are not like high school.  \n\nSit up front for class because the professor will recognize you.  Also go to office hours.  I did this and got a recommendation from a professor.  You will also have a discussion section, which is taught by a TA.  TA's are usually grad students in that field. It reminds me more of a high school setting where you can ask questions and there's only about 30 students in the class.  That's another resource you can use to do well in classes.  From my own trends, lectures/discussion sections that I've sat up front for and were engaged during class had better grades than the classes I sat in back for.\n\nDefinitely join clubs.  I know some freshman are hesitant to join or they think they shouldn't join in the middle of a semester.  You meet a lot of great people, UIUC seems a bit smaller, and it's a good talking point for interviews, especially if you can get on the exec board.  \n\nIf you have more questions, post them on here or send me a message.  Thank you for the feedback.\n\nHow is the student housing set up? Do you have different options, such as the amount of people you want to dorm with and the environment you would like? Since the other guy didn't address Private Housing, I will. I live in Presby Hall this year and, while quite expensive, it is very nice. It is suite style living, where you live with 4 or 5 other people, share a furnished (except for TV) living room, full kitchen, two bathrooms, a balcony, and then individual or double bedrooms. Stay away from Illini Tower, it's overpriced and the management is awful, they had a debacle earlier this year where their RAs, cafeteria, and other staff quit in protest to treatment. Bromley is another nice option, it's slightly cheaper than Presby and has rooms for each type of set up. Hendrik House has a fantastic food service, but the company that does this food also does Presby and Armory's food service too. Armory, Europa House, Newman and Orthodox Christian are the other co-ed PCHs but I don't know much about them other than Orthodox Christian is a religious dorm and Newman is basically religious, but not officially. There are also a number of single-sex PCH's too. [Check them out here.] (http://certified.housing.uiuc.edu/) Thank you for the feedback.\n\nHow is the student housing set up? Do you have different options, such as the amount of people you want to dorm with and the environment you would like?  &gt; I was wondering are their any negatives that UIUC may hold, because from reading the threads and comments it seems as if this college would make a perfect match.\n\nUIUC is Illinois' flagship university. If you are from Chicago, this is the best place to go to. People are friendly and helpful, and the atmosphere is relaxed and laidback in general - I don't mean classes are easy, just that UIUC is not cut-throat competitive like, say, Ivy League schools, but provides you with a comparable education. \n\n&gt; I was also wondering what mistakes should I avoid freshman year.\n\nTake your studies seriously, don't party every night, don't take on too many classes or too many extracurricular activities right from your first semester, and seek help early if you find yourself unable to keep up with the pace of classes. \n\n&gt; I was wondering do you guys/gals have any tips for me to make sure I keep my grades intact.\n\nThere have been many posts about academic probation in the last few days - look those up, those threads have good advice and information. It is better to get a head start and hit the ground running with regard to GPA rather than get into a bad place and then try to recover from it.\n\n&gt; Background: African-American from South-side Chicago.\n\nThere is a LOT of diversity on campus - both in quantity and variety. There are many diverse communities, and each of these communities has a fairly large number of members. It is upto you what you want to do - if you want to hang out with people of your race, ethnicity, nationality, department, college, you will find plenty of people in each case. If you want to learn about other cultures and make friends with people from other countries, you can do that too. It is completely upto you, you can do whatever you want to do - stick to your own kind or diversify your friend circle. I think hanging out with people like yourself is natural, easy and effortless (and that is what many people do, Asians hang out with Asians, African-Americans hang out with African-Americans, etc.), and making friends with people very different from yourself might be a little difficult at first, but it is certainly possible with effort, and UIUC provides you plenty of opportunities in that regard if that interests you.  \n\nFinally, however much advice and information you collect, you *will* make mistakes. There will be missteps, errors of judgment, poor decisions - take those in stride and don't freak out. Everyone makes mistakes and learns from them, however prepared and well-informed they are to start with.  &gt; I was wondering are their any negatives that UIUC may hold, because from reading the threads and comments it seems as if this college would make a perfect match.\n\nUIUC is Illinois' flagship university. If you are from Chicago, this is the best place to go to. People are friendly and helpful, and the atmosphere is relaxed and laidback in general - I don't mean classes are easy, just that UIUC is not cut-throat competitive like, say, Ivy League schools, but provides you with a comparable education. \n\n&gt; I was also wondering what mistakes should I avoid freshman year.\n\nTake your studies seriously, don't party every night, don't take on too many classes or too many extracurricular activities right from your first semester, and seek help early if you find yourself unable to keep up with the pace of classes. \n\n&gt; I was wondering do you guys/gals have any tips for me to make sure I keep my grades intact.\n\nThere have been many posts about academic probation in the last few days - look those up, those threads have good advice and information. It is better to get a head start and hit the ground running with regard to GPA rather than get into a bad place and then try to recover from it.\n\n&gt; Background: African-American from South-side Chicago.\n\nThere is a LOT of diversity on campus - both in quantity and variety. There are many diverse communities, and each of these communities has a fairly large number of members. It is upto you what you want to do - if you want to hang out with people of your race, ethnicity, nationality, department, college, you will find plenty of people in each case. If you want to learn about other cultures and make friends with people from other countries, you can do that too. It is completely upto you, you can do whatever you want to do - stick to your own kind or diversify your friend circle. I think hanging out with people like yourself is natural, easy and effortless (and that is what many people do, Asians hang out with Asians, African-Americans hang out with African-Americans, etc.), and making friends with people very different from yourself might be a little difficult at first, but it is certainly possible with effort, and UIUC provides you plenty of opportunities in that regard if that interests you.  \n\nFinally, however much advice and information you collect, you *will* make mistakes. There will be missteps, errors of judgment, poor decisions - take those in stride and don't freak out. Everyone makes mistakes and learns from them, however prepared and well-informed they are to start with.   Hey there, thanks for considering U of I!\n\nAs far as negatives go, it's a big school so if you want that enviroment where everyone knows each other, then U of I may not be for you.\n\nBut I believe positives are ABUNDANT here, a big school means tons of opportunities. It has a lot of history and tradition so you get a real \"College town\" feel to it(at least I do). Great academics, great towns with Urbana and Champaign, and most of all it away from home!\n\nI happen to graduate from Lane Tech in 10' and am so glad I went away from Chicago for school, it has taught me so much.\n\nIf you have any questions at all, feel free to PM me! I-L-L!\n\nEdit: Wanted to add that I am a Latino Economics major. As far as Diversity, it's just like any other school in that groups tend to clump. We have the 2nd largest enrollment of students from out of the country of all US schools, so it's a pretty nice mix here. Thank you so much! I was also wondering do the professors take time out of their day to connect with students and build relationships? The reason for this question is because, I'm wondering if it's possible to obtain recommendations from professors. \n\nExtra: Will bring my bike be a plus or a negative? Professors always hole something called \"Office Hours\"  once or twice a week. It's basically about a few hours where they sit in their office and you can go to them if you have any questions on homework/exams/class or anything really. I'd use those opportunities to build relationships if you really like the professor.\n\nA bike is always a plus, just make sure you get a REALLY good lock with it. Not those crappy wire ones, those bikes usually end up getting stolen. Thank you so much! I was also wondering do the professors take time out of their day to connect with students and build relationships? The reason for this question is because, I'm wondering if it's possible to obtain recommendations from professors. \n\nExtra: Will bring my bike be a plus or a negative? It depends on the professor, but you may be pleasantly surprised. I went to a professor about an exam conflict, and the conversation ended up with him inviting me to lunch because he doesn't get to meet many students from my class (Econ 103, I highly recommend it). It's really up to you to make the first move and go to office hours.\n\nI have found that having a bike has been very helpful. &gt; I have found that having a bike has been very helpful.\n\nSo have I, a bike is very useful on this campus. Be on the lookout for cops though, don't break any bike-related rules when they're around, they could give you a ticket. You could say that you almost don't need a bike on campus. You can take the free MTD bus system. You can walk everywhere too; I can reach one end of campus from another in about 20-30 minutes. It's not that you can't get around campus without a bike - far from it, really. It's just that (at least in my experience) it is more convenient to have a bike available, even if you don't use it all the time.  What do you want to major in? I'm planning on majoring in International Affairs with a minor in political science or vice-versa. Plan B is majoring in Business Administration and minoring in political science. I'm looking to get into Law School. \n\nIs it possible to change majors before you start class as a freshman? (I might go with plan B)  You'll have to wait until you've completed two semesters to switch majors. Definitely come to UIUC though, I'm sure you'll love it here! Thanks! Thanks! I'm planning on majoring in International Affairs with a minor in political science or vice-versa. Plan B is majoring in Business Administration and minoring in political science. I'm looking to get into Law School. \n\nIs it possible to change majors before you start class as a freshman? (I might go with plan B)  Don't major in business. You will be positioned much better later on if your undergrad is in almost anything else and then you get an MBA. Poli-Sci is a very typical major for pre law, which means you'll really need to stand out in some other way if you want to get into a good school. It's a long way off, but you do: a school's rank matters a *lot* when getting a job after a JD. what major would you suggest? I was thinking of majoring in international affairs and minoring political science. Why is a business major bad  A BBA or MBA is supposed to teach you how to manage a business or a segment of one. The problem is that that's a giant task with many different things involved, so they try to teach you some econ, some finance, some marketing and some accounting, and then they add on things like management strategies. The thing is that it's mostly bullshit. Some of those things are sort of useful, but what gets you ahead in business is making connections and knowing how to deal with people in the way they need to be treated. The best way to know how to deal with a particular group is to have experience being *in* that group. That's why the best MBA programs don't accept people straight out of undergrad: they want you to go out and do things in the business world, *then* come learn how to be a manager. So what do you do? You get a degree in something else which will get you a job in business and go get that experience. If you want to manage engineers you get an engineering degree. If you want to manage accountants you get an accounting degree. Marketers, sales people, technicians... it's all the same. The problem with a BBA is that you don't get any of that. You're just getting the business administration side of things without anything to back it up. You'll be able to get a job from there, but you'll be missing an advantage that someone who went the other way has.\n\nWhat you *should* do if you're thinking about business school is take a bunch of classes in that direction. Take all the econ, finance, marketing, etc that you can fit in along the way. It will look great, and help you be a more rounded candidate for jobs or graduate school later on.\n\nAs far as what major I suggest, it depends what you want to do. One thing I don't understand is your combination of IA or poli-sci with the business degree. Those majors are more suited to an M*P*A program, or to a JD. They are particularly good for public policy law (same reason they'd be good for an MPA program). If that's what you want to do, then go for it. They're not bad majors, but there will be tons of people applying to law school with one or the other of those backgrounds. You'll just need to make sure you stand out. Make absolutely certain that your grades are high (3.7+ minimum) and get involved in social or political activism when you're an undergrad. Show that you aren't just another good student doing the minimum work and you'll be fine.\n\nSorry about the novel. I don't mean to overwhelm you before you've even graduated high school! This was great and my plan is to work in public policy, and try to work my way up. Now, I was thinking of business due to the sheer number of people that are applying to law school. If law school wasn't going to work out I figured I could fall back on my business degree to find a job, because international affairs or political science I hear it's hard to find jobs that accept those majors.\n\n I'm planning on majoring in International Affairs with a minor in political science or vice-versa. Plan B is majoring in Business Administration and minoring in political science. I'm looking to get into Law School. \n\nIs it possible to change majors before you start class as a freshman? (I might go with plan B)   If you want a superficial negative, it's a big school for farming so the campus smells like cow shit sometimes. And its really windy, and because of that, extra cold.  There's no influence of Lake Michigan, so the temps fluctuate wildly in the spring and fall too. If the only complaints people can think of are weather and odors, then I think this is a pretty good university. :)  [deleted]  [deleted] [deleted] [deleted]  one negative i can think of is armed robberies.  [deleted] Classes in the political science department can be hit or miss, but your mileage *will* vary depending on the amount of effort that you put in.\n\nThe professors  are trying to bridge the gap between \"traditional\" undergraduate PS (This is a government, this is a first past the post voting system and it's different from an alternative vote system, etc) with what is actually done at the graduate level (how does democratization affect economic development in XYZ ways?). Unfortunately, how well that connection comes across depends on 1. the organization of the course 2. how much prior knowledge the student comes in with and 3. how much effort the student is willing to put in to understanding the material. I rate 1 and 3 as being the primary determinants of your experience *and* performance.\n\nMy advice, if you are \"stuck\" in the political science department, is as follows:\n\n1. During registration and during the first part of the semester, ask the undergraduate advisors about classes that can best expand your knowledge base and are suited to your interests. \n\n2. When it comes out, check the \"Incomplete list of teachers and TAs rated as excellent\" for an idea of instructors that you may want to learn from.\n\nWhen in class:\n\n3. **COME TO CLASS.** Don't slack off just because the professor posts slides. His lecture should provide linking material to help you understand how the concepts hang together. It's an hour out of your day, three times a week. Hey, if the professor and the TAs can do it (and keep in mind that they also have other classes, research and LIFE, which often includes spouses/children/pets, on top of teaching you), you can too.\n\n4. **GO TO OFFICE HOURS.** Visit, email, whatever. The TAs and the Professor want to help. They will be much more understanding *if you have expressed your concerns and have demonstrably tried to work on them beforehand*.\n\n5. Take it all seriously. Don't only take tests seriously, blow off homeworks, then be enraged when you get a B-. The same thing goes for discussion section. \n\n6. Put some effort into class. It's not hard to tell if you're on Facebook/Tumblr/Twitter. \n\n7. Be prepared to think critically. The surface may consist of definitions and formulae to be learned, but the deeper level evaluates your ability to apply what you have learned to formulate arguments. These cannot be memorized or looked for on Wikipedia the night before.\n\n8. Be prepared to step out of your comfort zone. This is a continuation of the point above. Thinking critically may mean that others in turn will take apart your argument to evaluate its assumptions, its internal logic, etc. Arguing via political slogans without clear justification for your position is not going to win you any points in class.\n\nI'll stop here for now. Good luck.\n\nSource: I'm a Political Science TA. [deleted] :( I think it's to late to transfer over to business as my main major.  [deleted] :( I think it's to late to transfer over to business as my main major.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/15npvc/possible_attendance_to_uiuc/"
  } ],
  "processing-time-source" : 61,
  "processing-result.title" : "uiuc10_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/uiuc10_reddit.xml"
  }
}