{
  "processing-time-total" : 1644,
  "clusters" : [ {
    "id" : 0,
    "size" : 7,
    "score" : 54.99528328418213,
    "phrases" : [ "Indiana" ],
    "documents" : [ 5, 8, 12, 13, 14, 16, 48 ],
    "attributes" : {
      "score" : 54.99528328418213
    }
  }, {
    "id" : 1,
    "size" : 5,
    "score" : 71.56743456404962,
    "phrases" : [ "Class is Starting" ],
    "documents" : [ 20, 32, 36, 46, 48 ],
    "attributes" : {
      "score" : 71.56743456404962
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 46.62609244879308,
    "phrases" : [ "Recommend that Place" ],
    "documents" : [ 0, 8, 15, 32, 45 ],
    "attributes" : {
      "score" : 46.62609244879308
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 45.963848423353184,
    "phrases" : [ "Room" ],
    "documents" : [ 3, 11, 16, 31, 40 ],
    "attributes" : {
      "score" : 45.963848423353184
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 38.22575834176658,
    "phrases" : [ "Serious Question" ],
    "documents" : [ 20, 33, 36, 47 ],
    "attributes" : {
      "score" : 38.22575834176658
    }
  }, {
    "id" : 5,
    "size" : 3,
    "score" : 56.975442333266365,
    "phrases" : [ "Coach" ],
    "documents" : [ 13, 16, 20 ],
    "attributes" : {
      "score" : 56.975442333266365
    }
  }, {
    "id" : 6,
    "size" : 3,
    "score" : 41.95640004091106,
    "phrases" : [ "Feed" ],
    "documents" : [ 11, 35, 47 ],
    "attributes" : {
      "score" : 41.95640004091106
    }
  }, {
    "id" : 7,
    "size" : 3,
    "score" : 50.71146985360204,
    "phrases" : [ "Internet" ],
    "documents" : [ 7, 31, 47 ],
    "attributes" : {
      "score" : 50.71146985360204
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 65.16082970262553,
    "phrases" : [ "Living with CPM does that the Company" ],
    "documents" : [ 29, 32, 46 ],
    "attributes" : {
      "score" : 65.16082970262553
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 40.046058920997794,
    "phrases" : [ "Student Government" ],
    "documents" : [ 28, 47, 48 ],
    "attributes" : {
      "score" : 40.046058920997794
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 32.02456958728827,
    "phrases" : [ "Student Senate" ],
    "documents" : [ 28, 40, 48 ],
    "attributes" : {
      "score" : 32.02456958728827
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 40.492705306491246,
    "phrases" : [ "Sun" ],
    "documents" : [ 8, 42, 48 ],
    "attributes" : {
      "score" : 40.492705306491246
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 62.54242566214472,
    "phrases" : [ "Told the Person" ],
    "documents" : [ 7, 15, 46 ],
    "attributes" : {
      "score" : 62.54242566214472
    }
  }, {
    "id" : 13,
    "size" : 2,
    "score" : 71.33475747315686,
    "phrases" : [ "Chocolates" ],
    "documents" : [ 1, 44 ],
    "attributes" : {
      "score" : 71.33475747315686
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 43.85421224959411,
    "phrases" : [ "Computer" ],
    "documents" : [ 41, 45 ],
    "attributes" : {
      "score" : 43.85421224959411
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 35.51785939006455,
    "phrases" : [ "Document" ],
    "documents" : [ 19, 22 ],
    "attributes" : {
      "score" : 35.51785939006455
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 37.20089945735143,
    "phrases" : [ "Fan" ],
    "documents" : [ 12, 26 ],
    "attributes" : {
      "score" : 37.20089945735143
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 64.39748419083138,
    "phrases" : [ "File" ],
    "documents" : [ 21, 41 ],
    "attributes" : {
      "score" : 64.39748419083138
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 39.23946620843791,
    "phrases" : [ "Turkey Run" ],
    "documents" : [ 8, 10 ],
    "attributes" : {
      "score" : 39.23946620843791
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 104.33041080071317,
    "phrases" : [ "Tyler Griffey" ],
    "documents" : [ 16, 23 ],
    "attributes" : {
      "score" : 104.33041080071317
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 50.19356683011093,
    "phrases" : [ "Video Game" ],
    "documents" : [ 12, 17 ],
    "attributes" : {
      "score" : 50.19356683011093
    }
  }, {
    "id" : 21,
    "size" : 15,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 2, 4, 6, 9, 18, 24, 25, 27, 30, 34, 37, 38, 39, 43, 49 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1565,
  "documents" : [ {
    "id" : 0,
    "title" : "Valentines day restaurants",
    "snippet" : "Does anyone know any nice restaurant around the area?   Fat sandwich is a very warm and hospitable place (Especially around 1-2 am), and the food is extremely wellmade and healthy. r/uiuc does not like sarcasm. Please go home.\n\nEdit: At the time I posted this, he had a negative score. So this was more directed at the people downvoting him for using humor, and not because I was angry with him or anything. I chuckled at the suggestion of Fat Sandwich on V-Day.  The Bread Company is wonderful restaurant with a nice atmosphere. It's in between Canopy Club and Espresso Royal on Goodwin.  Do they take reservations?  bacaro, Big Grove Tavern, Destihl...I would say luna but I think they closed...there are more that I'm sure I'm forgetting, though! Luna closed?? Nooooooo It is according to Yelp! Which is disappointing considering I never got to go there... They had such good food, and such a cool atmosphere... sigh. I guess 'tis better to have loved and lost, than never to have loved at all.   [Escobar's](http://www.escobarsrestaurant.com/Welcome.html) is really nice and high quality stuff. I always recommend that place.  [Escobar's](http://www.escobarsrestaurant.com/Welcome.html) is really nice and high quality stuff. I always recommend that place.  [Escobar's](http://www.escobarsrestaurant.com/Welcome.html) is really nice and high quality stuff. I always recommend that place.  The place is ok, definitely nothing to write home about.  I had the roasted duck breast with a fig glaze that was mediocre at best.  I hear this place has better lunch options, but I would honestly recommend somewhere like The Great Impasta if you are looking to take your girl to dinner. What's so special about The Great Impasta? It's just pasta. The place is ok, definitely nothing to write home about.  I had the roasted duck breast with a fig glaze that was mediocre at best.  I hear this place has better lunch options, but I would honestly recommend somewhere like The Great Impasta if you are looking to take your girl to dinner.  Also: Milo's, the Great Impasta. But mostly Bacaro.   Bacaro is insanely expensive though.       ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1895gq/valentines_day_restaurants/"
  }, {
    "id" : 1,
    "title" : "Where can I find a good box of chocolates for valentine's day on campus?",
    "snippet" : "  There's a Fannie Mays on neil and green.  Springfield and Neil*\nI'm in my car at Neil and green right now.   Best chocolates are off campus. There is two places at Lincoln Square Mall that sell chocolates right now (If you take the Silver or the Gold, they end up at Lincoln Square.) Look for Art Mart. Art Mart has amazing truffles that are made locally (I think). Quite expensive though They used to sell locally made ones. I'm not sure they do anymore. The other place in the mall is now the reseller of the local ones, but I can't remember what it is called... Art Mart has amazing truffles that are made locally (I think). Quite expensive though Yes, I was there this weekend. $54/lb. Best chocolates are off campus. There is two places at Lincoln Square Mall that sell chocolates right now (If you take the Silver or the Gold, they end up at Lincoln Square.) Look for Art Mart.   World Harvest on university and sixth has a really good selection of exotic chocolate bars. You could get a few different favors to try together :)   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/189kxa/where_can_i_find_a_good_box_of_chocolates_for/"
  }, {
    "id" : 2,
    "title" : "owl city tickets at canopy",
    "snippet" : "Hi r/UIUC, I am looking to sell 2 owl city tickets for tonight, had some last minute emergency. Honestly I just don't them to go to waste, tickets were $25 when I bought it, prices negotiable. Please PM me. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/189gkh/owl_city_tickets_at_canopy/"
  }, {
    "id" : 3,
    "title" : "Good places to hold small meetings?",
    "snippet" : "What are some good places around campus to hold meetings with say 6-7 people? Specifically the southern end of campus or near the Ike. \n\nHow do I go about getting a room with a TV or monitor or projector on reserve or do I need to? \n\nThanks!  You can actually reserve rooms in SDRP (ie conference rooms, seminar rooms, etc.). http://space.housing.illinois.edu/virtualems/ You can actually reserve rooms in SDRP (ie conference rooms, seminar rooms, etc.). http://space.housing.illinois.edu/virtualems/     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/189b4z/good_places_to_hold_small_meetings/"
  }, {
    "id" : 4,
    "title" : "Saw this on the front page of nbcnews.com, any more info about what they're talking about",
    "snippet" : "    The topics covered in there is mutually exclusive with people on Reddit. If you're reading this, your sexual release tonight is only possible because you aren't an amputee missing hands.     I guess this isn't as hardcore as the weather underground dude that was in residence there   Here's part one of two of an interview with [Annie Sprinkle](http://www.youtube.com/watch?v=N16fxWQNNKk). She sounds like an interesting woman.     I wonder how much money Allen wasted on that.  Seems like the ISS isn't the only group pissing away our tuition dollars. Allen isn't spending tuition money on this. When you apply to live in Unit One, you pay extra and that money goes into things like this. And I'm pretty sure the Guests-in-Residence aren't paid to come speak, so really what you're paying for is their food, because they live in the dorm. Maybe you end up paying for their travel too.  Allen isn't spending tuition money on this. When you apply to live in Unit One, you pay extra and that money goes into things like this. And I'm pretty sure the Guests-in-Residence aren't paid to come speak, so really what you're paying for is their food, because they live in the dorm. Maybe you end up paying for their travel too.  I wonder how much money Allen wasted on that.  Seems like the ISS isn't the only group pissing away our tuition dollars. It wasn't paid for with general campus tuition money. And even if it was, I would consider it a worth while expenditure. Her talks were interesting and educational and anyone was invited to join. Learning in college doesn't have to be strictly academic.  Promoting sex-positivity is one thing, but inviting her seems to glorify pornography and prostitution.",
    "url" : "http://usnews.nbcnews.com/_news/2013/02/09/16913843-porn-star-teaches-sex-seminar-at-the-university-of-illinois?lite"
  }, {
    "id" : 5,
    "title" : "The radio call of the win against #1 Indiana!",
    "snippet" : " ",
    "url" : "https://soundcloud.com/airchecked/illini-win"
  }, {
    "id" : 6,
    "title" : "Need something fun to do tomorrow? Check out the local flea market!",
    "snippet" : "  I went today, it was awesome! Let me know if anyone has questions about what was there, etc.  Baseball cards or memorabilia by any chance? Yeah, definitely saw a few people with some baseball cards, but it was mainly some old packs still wrapped...  Where is it exactly? The link isn't working. What kind of items were they selling? I went today, it was awesome! Let me know if anyone has questions about what was there, etc.  Any watches or clocks? \n\n ",
    "url" : "http://www.gordyvilleusa.com/flea-market/"
  }, {
    "id" : 7,
    "title" : "What are you all paying for internet &amp; TV?",
    "snippet" : "Anybody want to compare prices? You can negotiate better with Comcast if you know someone with a better deal. I have Comcast TV (digital preferred package) and \"Performance\" internet. At first I paid $80/month but now the bill is up to $110 (just called and that's the best they can do). \n\nMy last resort is to cancel and have roommate sign up as a new customer again.\n\nI considered U-Verse but they don't offer TV.  I get ATT U-Verse 18Mbps for $40 a month, split with the neighbors, so $20, split with the roommates, so $6.67.\n\nAnd unlimited TV and movies b/c piracy. Yup.   Uc2b Internet for 40/mo for 40mbps up and down. Then directv with dvr for 50/mo My house is already set up for directv (or so they keep telling me with their junk mail) but I hesitate to sign a 2 yr contract...  I've loved it so far. I only lose service in heavy storms and it happens less often than you would think. There's maybe only 3 or 4 times in the past year it has happened. If you sign up, lemme know, I'll send you my account number and we can save 10/mo each for 10 months. My first year was only like 30/mo because of referrals!  Hey, I'd be interested, but my main concern is the heavy load that I'd probably pull.  Do they have any limits on usage that they don't exactly advertise?  Or maybe not very torrent friendly?  I've uploaded over a TB to Bitcasa in the last week and it's still running.  I typically use newsgroups instead of torrents so I have no idea how they are with torrents.    $40/month for [limited basic cable](http://customer.comcast.com/help-and-support/cable-tv/difference-between-limited-basic-and-expanded-basic-cable) and [internet](http://www.speedtest.net/result/2497949925.png). We got in on this deal when we moved in to our apartment last year, and Comcast let us transfer it to our new house. It's pretty great, since most of our TV-watching is via torrents &amp; Netflix/Hulu/Crackle. Whoa... I'm on limited basic tv + the \"Performance\" Internet package (~20mbps) on Comcast and pay $73/mo! It started at $50/mo when I moved here in 2010, but it's steadily increased each year. I called last year to try and lower it, but the most they'd offer was $5 off for 6 months. How did you get such a great deal? Whoa... I'm on limited basic tv + the \"Performance\" Internet package (~20mbps) on Comcast and pay $73/mo! It started at $50/mo when I moved here in 2010, but it's steadily increased each year. I called last year to try and lower it, but the most they'd offer was $5 off for 6 months. How did you get such a great deal? I have a similar deal;  My bill is something like 34 dollars a month.  Try going into the Comcast office in Urbana.  I went in specifically and told them I wanted to add basic cable to lower my bill, and the woman said she would help me out.  My first bill after was $7, then $15, then up to $34.  Her name is Felicia, I believe.  Felicia is the shit. I have a similar deal;  My bill is something like 34 dollars a month.  Try going into the Comcast office in Urbana.  I went in specifically and told them I wanted to add basic cable to lower my bill, and the woman said she would help me out.  My first bill after was $7, then $15, then up to $34.  Her name is Felicia, I believe.  Felicia is the shit. So you're paying $34 for internet + expanded basic? What did you tell them when you went in to their office? $40/month for [limited basic cable](http://customer.comcast.com/help-and-support/cable-tv/difference-between-limited-basic-and-expanded-basic-cable) and [internet](http://www.speedtest.net/result/2497949925.png). We got in on this deal when we moved in to our apartment last year, and Comcast let us transfer it to our new house. It's pretty great, since most of our TV-watching is via torrents &amp; Netflix/Hulu/Crackle. If I wanted to go as low as basic cable I'd probably just buy an HD antenna and cancel cable altogether. I believe AT&amp;T U-Verse internet is $20/month but not sure about the speed. $40/month for [limited basic cable](http://customer.comcast.com/help-and-support/cable-tv/difference-between-limited-basic-and-expanded-basic-cable) and [internet](http://www.speedtest.net/result/2497949925.png). We got in on this deal when we moved in to our apartment last year, and Comcast let us transfer it to our new house. It's pretty great, since most of our TV-watching is via torrents &amp; Netflix/Hulu/Crackle. May I ask which area you live in? I'm going to try to talk to the sales rep but it's be more convincing in saying \"I know someone who lives in this area and got this deal. Gimme!\" :)  If you search the internet a bit, you would discover that comcast loves, just loves charging random amounts of money for the same service. The trick is to find the lowest number in the below answers, then go the comcast office physicially (it is located near Urbana high school on race street). Wait in line, talk to the Comcast person [be extremely polite]: \"I am a very poor student/unemployed/etc and I really like comcast services because they wonderful, but they cost too much. It turns out I can pay only $&lt;insert amount&gt; for similar services from X. Could you please reduce my bill somehow? Otherwise, I would have to change service provider.\"\n\nAnd thats it - they would be happy to give you a better \"limited time\" deal. I know because I did it recently, and I am neither a student nor poor. You might have to repeat it after a year or so - their deals are always limited. Also, if you connected somebody else for a year, and reconnect to them, they would consider your a new customer, and give you a good deal. \n\nAlso, if you are in the right area, uc2b is probably the future. I am sure going to dance with happiness when they are able to connect to my neighberhood/home. http://uc2b.net/ Thanks, I know Comcast is super random with their pricing. I even gave them a factual example of what my friend is paying, but they were pretty firm saying that's \"as low as they can go.\" \n\nI had even less luck over the chat service, and so I had to call retentions on the phone.  $93/month for Comcast Digital Starter w/ HBO &amp; Showtime, Performance Internet, HD service fee, and modem rental Nice! Are you a new customer? Or how did you get that deal?    I got on the 69$ internet, TV, free HBO and Showtime for 1 year deal at the beginning of the school year from Comcast. Ive got my own modem, no hd box though. \n\nI would split internet with my neighbors but I have none.... Did you go to Best Buy or something? Or just walked in to the Comcast office?  As always when the conversation turns to entertainment on reddit, I want to reap downvotes by pointing out that I kind of hope all of the freeloading torrenters get caught and sued. \n\nI have AT&amp;T U-Verse Internet and TV. I think we pay around $125, but we have higher speed internet and a bigger channel subscription with HBO.    I really dont understand why cable TV is still a thing. Why do you need it if you have the internet? I want to watch my favorite shows the same time as everyone else to avoid spoilers. And live streams online suck... unless you know some secret I don't. &gt; And live streams online suck... unless you know some secret I don't.\n\nit's called torrents But then I can't watch it when it's really \"on\" :( Typically all the shows i want to watch are online 30mins to an hour after they air. Full HD if I torrent, and decent streams. Also, ive gotten so used to not being bombarded by ads that watching TV just makes me feel really dumb.  I really dont understand why cable TV is still a thing. Why do you need it if you have the internet?  I'm at One South, so [I pay $0.](http://i238.photobucket.com/albums/ff200/stevedinsd/frog.gif) But then again you live at One South. \nhttp://i.imgur.com/q4jwscn.gif But then again you live at One South. \nhttp://i.imgur.com/q4jwscn.gif  I'm paying fuck you, that's what.",
    "url" : "http://www.reddit.com/r/UIUC/comments/187k42/what_are_you_all_paying_for_internet_tv/"
  }, {
    "id" : 8,
    "title" : "Hiking spots?",
    "snippet" : "I've been thinking about going hiking in the spring time, and I looked up some hiking spots online but the pics all seem to be blurry/from the 1800's so I was wondering if any of you could recommend a hiking spot for the spring! Thanks!  If you want to drive an hour Turkey Run over the Indiana border is great.  For places closer, Allerton is my favorite.   We do live in quite the shitty area for outdoor activities, but all is not lost. Could you give a better idea of what you're looking for? Day hikes (so 3 to 10 miles) or more backpacking (multiple days with camping)? Do you have a car to travel in? How far are you willing to drive? Have a car, willing to travel up to 2 hours, looking for a day hike spot since my camping gear is nonexistent.  Let me throw out a couple locations for you to try out.\n\nThe best area close by is [Kickapoo State Park](http://dnr.state.il.us/lands/Landmgt/PARKS/R3/kickapoo.htm), [Kennekuk County Park](http://www.vccd.org/gikennekuk.html), and Middle Fork State Fish and Wildlife Area. They are all part of a river system that was bought up in the 1960s with the intention of flooding it all to turn into a lake. There was a ton of push back from environmental groups, so it just ended up getting split up into these three parks, as no one agency could afford to run the whole thing. \n\nKickapoo - This is a cool area that is a reclamed strip mining site from the early 20th century. There are tons of small lakes that you can rent canoes on and paddles through some really clear water. They also can drop you up a few miles with canoes and tubes on a river that runs the length of all the parks. It's a nice park, but the busiest of the three. There are lots of small hiking trails here and it' worth checking out. There is also a frisbee golf course here.\n\nKennekuk County Park - This one has one big lake that has about a 7 mile loop that goes around it. It's a really nice hike that goes up and down through forests and parries, and with it being that long without many entrances, it's a good opportunity to get away and not have to see many people for a couple hourse. There are a few picnic tables and benches along the way so take a lunch. There are also mile markers so you know exactly how far you have to go.\n\nMiddle Fork Fish and Wildlife Area - This place has 35 miles of hiking trails looping through forests and grassland. Tons of day hikes available here, it's the farthest from CU at about 35 minute drive. You can get to Kickapoo in 25 minutes.\n\n\nThere are other things around, Lake Shelbyville is a little over and hour south. Clinton Lake has a nuclear reactor on it, and if you're looking for something really cool to do right now, get there in the early morning when the sun is just coming up. The lake is heated by the reactor, so there are fish flying all over catching insects that can still survive through winter, they dive through the steam rising off the water, it's a beautiful sight. There's also Turkey Run State Park over in Indiana, and Shades State Park in Indiana also, those are about 1.5 hours. Homer lake is alright, and probably the closest, it's 10 miles east of town and has about 20 miles of hiking trails.\n\nLet me know if you have any specific questions. That kind of turned into a general natural area tour of the area. I was feeling a bit confined when I first moved here as I like being outside a lot, and while people bitch that there isn't anything to do around here, you just have to look a little harder. If you get sick of the local stuff, Shawnee National Forest and Hoosier National Forest are each 3 hour drive in different directions. Both are amazing and you should definitely see before leaving the area. Have a car, willing to travel up to 2 hours, looking for a day hike spot since my camping gear is nonexistent.   Any good places to hike/walk nearby  for those without cars? Any good places to hike/walk nearby  for those without cars?  Hey man i'm really into hiking and backpacking, I just transferred here and I've been looking around for places to hike.\n\nFrom what I've read, there's not too many hilly areas to hike in - although there are nice trails, some of which are dense, and lakes/rivers that are all connected to go canoeing through.\n\ncheck out kickapoo state park\nhttp://dnr.state.il.us/lands/Landmgt/PARKS/R3/kickapoo.htm\n\n\nI'm currently looking for a student organization that hosts events to go hiking/backpacking - but so far, no luck :\\.\n\nIf you come across one shoot me a PM.\n\n\nP.S. I think there could be a group at UIUC that is strictly about geocaching too, that could be fun.        You do realize where you live right?  Somewhere in this orange square, roughly. http://dnr.state.il.us/lands/landmgt/programs/hiking/region3.htm Somewhere in this orange square, roughly. http://dnr.state.il.us/lands/landmgt/programs/hiking/region3.htm oh i thought you were looking for spots in the CU area.  [Meadowbrook Park](http://www.urbanaparks.org/facilities/16.html), [Crystal Lake Park](http://www.urbanaparks.org/facilities/11.html), [The Arboretum](http://arboretum.illinois.edu/), and [Carle Park](http://www.urbanaparks.org/facilities/8.html) are all within easy walking distance of campus and served by the bus routes. You're not going to find a mountain to hike in central Illinois, but it's not as boring as people think.\n\nWithin a 40 minute drive of campus there are a bunch of state parks and nature reserves with real hiking trails.",
    "url" : "http://www.reddit.com/r/UIUC/comments/187bbl/hiking_spots/"
  }, {
    "id" : 9,
    "title" : "My phone got itself lost last night in Urbana: Reward if found!!!",
    "snippet" : "Hey r/UIUC, I lost my phone last night and am very upset about it and was hoping someone out there could please, please, please help! I'm sure it's super scared to be so far away from me...\n\nI would have lost it somewhere around W. Elm and Busey in Urbana. \n\nIt's a Samsung Galaxy S3. It's a black phone with a clear case. The lock screen is a picture of an adorable German shepherd sitting in the front seat of my car (it's a darker photograph). That sweet puppy would be so happy if you were able to get my phone back to me...\n\nIf found, please contact 815-444-1566. YOU WILL MOST DEFINITELY BE REWARDED FOR YOUR AWESOMENESS AND KINDNESS. And I will love you forever. \n  Do you know how to push apps? You could try pushing Plan B, Prey, or Lookout (free options, get you a rough estimate of where the phone is) or even Cerberus, which is $5, but comes with a pretty high powered set of tools for finding/controlling your phone.\n\nWas it on? Was data turned on? Was the GPS turned on? What carrier are you using? Good point. [Where's My Droid](https://play.google.com/store/apps/details?id=com.alienmanfc6.wheresmyandroid&amp;hl=en) might work, too. Yep, there are any number of apps you could choose from. OK, I mean, my phone is already lost, and I didn't download those apps to it before it decided to get lost... so, can I still utilize any of those options?\n\nThanks again for all the responses. My phone may still be lost, but the help is making me feel a bit more hopeful. So, it's important that you answer a couple questions. Was it powered on? Was Mobile Data turned on? Was GPS turned on?\n\nIf your phone is on, and data is on, you can *remotely* install tracker apps, such as [this one.](https://play.google.com/store/apps/details?id=com.androidlost&amp;hl=en) Just log in to the same google account you used for the phone's setup, and click install. From there, follow the app's instructions to locate your phone.\n\nLet me know if you get stuck anywhere. It was on, and I believe it's still on because when I call it, it still rings and doesn't go straight to voicemail. I think Mobile Data was turned on... and I'm not sure about GPS.\n\nI guess I don't know how to push apps. I'm trying but it doesn't seem to be working. \n\nTbh, the main problem I'm having is remembering the google account I created for the phone setup. I can't access it because I don't remember the username or password. Which is just dumb of me, I should have written it down somewhere, but didn't :( Here's a way to jolt your memory. Whenever you added a contact, it says the google account you're logged in under at the top. Do you remember what it was?\n\nAlso, do you have a gmail? Which email account did you read on your email app?\n\nHere's how pushing works. It's really simple! So, go to this page: https://play.google.com/store/apps/details?id=com.androidlost&amp;feature=nav_result#?t=W251bGwsMSwyLDNd\n\nand in the upper right corner, log in to your google account (that you definitely remember :) ), then click the little \"INSTALL\" button on the left next to the little droid guy. A \"Checkout\" dialog will pop up. Select your device from the dropdown menu (it'll be selected by default, assuming you don't have more than one android phone on this google account) then click \"INSTALL\" one more time.\n\nThe phone takes care of the rest! You'll receive emails about the phone to the email that you logged in with.\n\nAlso, for that particular app, here's a great tutorial about it: https://www.youtube.com/watch?feature=player_embedded&amp;v=gcTZbreowJM#! You are very thorough and helpful, thanks so much for trying. \n\nMy parents freaked out about the phone being lost and just deactivated it. My very old phone is now reactivated (not a smart phone). \n\nSo now I'm assuming nothing much can be done about finding it...\n\nU.S. Cellular reported it as missing in their records. \n\nI will continue trying to remember my gmail account information, just because. That's a good trick to try to trigger it. \n\nThank you again for all the help. I'm so sorry! I wish I could be more help, but I can't do much about that. I'm so sorry! I wish I could be more help, but I can't do much about that. Do you know how to push apps? You could try pushing Plan B, Prey, or Lookout (free options, get you a rough estimate of where the phone is) or even Cerberus, which is $5, but comes with a pretty high powered set of tools for finding/controlling your phone.\n\nWas it on? Was data turned on? Was the GPS turned on? What carrier are you using? I've never heard of those options, but I will most definitely look into them.\n\nIt was on, and I called it a bunch of times and it rang, so I'm assuming it wasn't dead. I believe data was turned on. A few of the apps I used on it utilized GPS tracking, but I couldn't say for sure if it was permanently turned on. And I use U.S. Cellular.  Samsung has a tracking feature like iphone has find my iphone. granted it would of been helpful if you made a Samsung account but i'm sure if you have your product number you can still track it.  If you're referring to Samsung Dive, it's actually not supported for the S3. For some odd reason that I can't comprehend. I have the s3, idk if its Samsung drive but there is a feature on the s3 which lets you track it thru your samsung account What carrier? Cause mine turned it off (Verizon), which kinda sucks. Why would they turn it off? That's just stupid.  I have t mobile I have the s3, idk if its Samsung drive but there is a feature on the s3 which lets you track it thru your samsung account Samsung has a tracking feature like iphone has find my iphone. granted it would of been helpful if you made a Samsung account but i'm sure if you have your product number you can still track it.  Samsung has a tracking feature like iphone has find my iphone. granted it would of been helpful if you made a Samsung account but i'm sure if you have your product number you can still track it.  English, motherfucker!  Haven't seen it but I live around there so I'll keep an eye out and an ear open in case of anything coming up  I'll definitely keep an eye out. I hope you get your phone back!  So you're the one who put the sign on my apartment building. Sorry you lost it Yeah, I got desperate... I've never had a nice phone, and I've never lost anything expensive. It feels terrible. \n\nThat's the building I was in last night, and if I dropped it or something, it would've been outside near that apartment complex... Thank you for your response! I lost a pair of ray bans once. I was so sad. I only had em for like 8 months too",
    "url" : "http://www.reddit.com/r/UIUC/comments/187nkf/my_phone_got_itself_lost_last_night_in_urbana/"
  }, {
    "id" : 10,
    "title" : "\"Healthy\" restaurant choices in C-U?",
    "snippet" : "I'm looking for some healthier places to go with my friend coming to town. She eats meat but prefers healthy food. I'm more of a burger and beer sort of person myself, so I'm not really sure what is available (on or off campus) with a healthier selection. Any suggestions?  probably not fat sandwhich    [Black Dog](http://www.facebook.com/BlackDogSmokeAndAleHouse) is a BBQ restaurant in Urbana that uses a lot of locally grown and raised products and prides themselves on that. It's a BBQ place so it's definitely possible to eat really unhealthy there, but you pick your own sides and the sauce comes on the side so it's also easy to eat healthy if you want to. As a bonus their beer menu is usually pretty good. Black Dog is my favorite restaurant in Champaign-Urbana, and is in the running for my favorite anywhere. But I don't see how you can call it healthy. I honestly can't think of one meal that you could put together on their menu that would be \"healthy.\"\n\nI'm going to go ahead and keep on eating there anyway. You can get a beef brisket or pull pork platter at black dog with a sweet potato and veggies as your side. They put the BBQ sauce on the side so you aren't forced to smother your food in sauce. There's nothing that unhealthy about it.\n\nOrdering a pulled pork sandwich smothered in sauce with fries and pit beans on the side would be a way to make it unhealthy. Smoked meat is fairly unhealthy. Beef is fairly unhealthy. Pulled pork (pork shoulder or pork butt) is quite fatty and generally unhealthy. \n\nAs far as BBQ goes, what you're describing is healthy. But BBQ is not healthy. \n\nI'm going to keep eating there, regardless. There's nothing unhealthy about beef or fatty meat, really. Saturated fat isn't bad for one's health. That's plain inaccurate. The exact nature of the link is somewhat unclear, but saturated fat is generally considered among medical authorities to be unhealthy. \n\nAnd, unlike the lack of clarity on saturated fat, there's absolutely no debate about the fact that beef is bad for you. And that smoked meats are bad for you. That's not even in debate. \n\nBut hell, an accountant asserts otherwise. Smoking meats is a great way to add flavor without calories. I'd like to see you come up with a healthier way to cook chicken/turkey.\n\nThe sauces don't have to be unhealthy either. A pulled chicken platter with Carolina Vinegar (It's exactly what it sounds like. Apple Vinegar with dried ground peppers in it) would be a great way to go at Black Dog if you're tying to keep your caloric intake down. Pulled Pork and Beef Brisket is pretty awesome if you're concerned about protein though.\n\nOn the other hand, Ribs are TERRIBLE for you. 400 calories a piece and not much else. Yes, but the smoking process is also infusing the meat with carcinogens. That's plain inaccurate. The exact nature of the link is somewhat unclear, but saturated fat is generally considered among medical authorities to be unhealthy. \n\nAnd, unlike the lack of clarity on saturated fat, there's absolutely no debate about the fact that beef is bad for you. And that smoked meats are bad for you. That's not even in debate. \n\nBut hell, an accountant asserts otherwise.  Big Grove Tavern (http://www.biggrovetavern.com/) could be considered \"fresh\" or \"healthy\" depending on her definition.  Their catch phrase is \"Farm-to-table\" and are located downtown Champaign.   Big Grove Tavern (http://www.biggrovetavern.com/) could be considered \"fresh\" or \"healthy\" depending on her definition.  Their catch phrase is \"Farm-to-table\" and are located downtown Champaign.     I watch what I eat, and my go-to places are Subway, Chipotle, and Ruby Tuesday's. There are usually good \"healthy\" options at most of the chain restaurants on Prospect too. Chipotle can definitely be healthy if you get the right item.\n\nhttp://chipotless.com/  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/187yc7/healthy_restaurant_choices_in_cu/"
  }, {
    "id" : 11,
    "title" : "Is the top story of Beckman Institute open to undergrad students?",
    "snippet" : "If not, is anywhere else like the top floor in CSL accessible? I'm trying to get a good view of the new ECE building for a construction class.\n\nEdit: thanks for the responses. Most people in this class are probably gonna observe this site too so I'll be taking ~50-60 mpixel panoramas to try to stand out. Will share if it looks decent.   The monitor in the main hallway of Everitt (as you go through the main doors and up the stairs, just outside room 151) has a live webcam feed of the construction of the new building. You can view this webcam from the ece website.    CEE 420? Yup.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/187p14/is_the_top_story_of_beckman_institute_open_to/"
  }, {
    "id" : 12,
    "title" : "IU fan wakes up this morning to learn about the crushing defeat Illinois dealt out last night. Reacts accordingly. ",
    "snippet" : "  Aw, it's a kid? I was hoping to rejoice at the tears of some hungover IU student.   I am a highschooler in S. Indiana planning to attend Illinois. This morning I put on my Illinois t-shirt without thinking. Bad call. A lot of people weren't very happy about that game...  I hope this is the only time I upvote a video of a young kid crying on Reddit.  Are people supposed to cry this much, if at all, because of sports? Sports are the ONLY thing worth crying this much over.   Poor kid doesn't know how to lose gracefully like an Illini fan... At least in the last couple of years, he doesn't have as much practice as we have... At least in the last couple of years, he doesn't have as much practice as we have... Poor kid doesn't know how to lose gracefully like an Illini fan...  Reminds me a lot of [a story from my own undergrad](http://imgur.com/qpV5hxl)... I love how at texas, no matter who you're playing, you do the \"OU sucks\" cheer. You mean the \"It's $TIME and OU still sucks\" one? I don't remember that really being the case, but I made a point of not going to games.         *Crushing*? http://endablog2.files.wordpress.com/2012/11/montoya.jpg Yes, as in it is emotionally crushing for Indiana fans. *Crushing*? http://endablog2.files.wordpress.com/2012/11/montoya.jpg #1 Indiana losing to unranked Illinois is crushing no matter how you look at it. 2 Point miracle or not. #1 teams should not lose to unranked teams. ",
    "url" : "https://www.youtube.com/watch?v=AFteLOCepZo"
  }, {
    "id" : 13,
    "title" : "Coach Groce celebrating with his son after last night's stomping of Indiana",
    "snippet" : "  this is a great picture, but stomping might be an overstatement       Dude should still be fired.  This has been a terrible season. It's his first year. Yup, and the only way he is going to go is down.\n\nHiring a mediocre coach from the mid majors was a massive mistake. I think you're thinking of Beckman. \n\nGroce has brought a different play style to the team, it'll take time like with any sport to adjust. \n\nIf you're going to base him being fired over a half a season, which doesn't yet include the dance/nit, well, the down votes should be enough to tell you how ridiculous your opinion is.  Yup, and the only way he is going to go is down.\n\nHiring a mediocre coach from the mid majors was a massive mistake. I don't think you know what you're talking about. Great, explain why.  Groce was an ok at best coach for U Ohio.  At best.\n\nHe has already shown he can't hack it with the big dogs.",
    "url" : "https://sphotos-a.xx.fbcdn.net/hphotos-prn1/72652_10151429023821600_2111823186_n.jpg"
  }, {
    "id" : 14,
    "title" : "Gotta love Ferrell and Watford's expressions",
    "snippet" : "  Alright I'll say it.  Who am I supposed to be looking at? Watford is #2 on Indiana, on Griffey's left.  Ferrell is #11, standing on the far right of the picture. Alright I'll say it.  Who am I supposed to be looking at?  Who's the guy in the tie?   ",
    "url" : "http://sphotos-b.xx.fbcdn.net/hphotos-ash4/395645_10151429968501600_1211630297_n.jpg"
  }, {
    "id" : 15,
    "title" : "Any laws we should be aware of on Unofficial?",
    "snippet" : "My roommates and I are looking to have a yard party on unofficial, kegs and all. We went to the CPD today but they weren't very helpful as the guy in charge was out of office.  I'll be emailing him, but I was just wondering if anyone knew of any rules/laws my roommates and I should be aware of before throwing this? We've thrown huge parties for Unofficial before but they've always been indoors.  you will get boned if you have a single under 21 in there      I noticed you said kegS. Not sure how it works for a yard/outdoor party, but I know you're not allowed to have more than 1 keg at any indoor party. Last year CPD caught us getting 2 the day before, took one away, and gave us a $320 ticket. Double check to make sure how many you can have. How did that happen? Why didnt you tell them they were not going to the same location? Or if they showed up at your place, why did you answer and let them in? I guarantee they didn't have a warrant.  I put 1 keg under my name, my roommate put 1 keg under our neighbor's name (they had given us permission but were all at work for the night, and this was the Thursday before Unofficial). Cops saw us put 2 kegs in the car, followed us, then once we started bringing the second keg up they busted us, mainly because we didn't have our neighbor's keys on us so they were being put in the same apartment right away. \n\nRecommendation: take the time to go to multiple liquor stores and get 1 keg from each. Not only will you not get caught how we did, when the cops get the records of keg purchases there won't be two at the same location from each store.  Wow I can not believe that cops followed you to your house because you had kegs. That just fires me up but I know there's really nothing you could have done. It also really bothers me that cops have records to keg purchases. Is there no privacy or explicit rights on a college campus when it comes to drinking? Yeah it was pretty shitty, especially cuz at that point we knew they would have an eye on our place for any questionable activity all day. I'm not sure if there are normally privacy laws, but I know a lot of laws are 'changed' in a sense on Unofficial because of all of the injuries/alcohol poisoning/death that has happened in recent years. i.e. you can get multiple kegs legally with a permit, but said permit is not available for Unofficial. Also, supplying minors got bumped up from a standard ticket to a criminal misdemeanor last year.  You can have 2 kegs. You just need to get a permit at city hall for $25 bucks. They don't give that permit out for the day of unofficial. At least they didn't last year, because when I was getting the ticket I asked if there was anything we could have done and he told me about that permit but that they don't allow it on unofficial.   yeah id say best bet is to invite your 21 and over friends. Also try renting fences to control the inflow and outflow. Make sure you get your kegs a day or two early.  You're uninvited you are a mean person. http://assets0.ordienetworks.com/images/GifGuide/DealWithIt/tumblr_limthcd5BD1qfyv11o1_500.gif why does this exist    I thought unoffical was started because of all the police attention people would get on St Patricks weekend. From my expereince last year, unofficial seemed much less fun than the average weekend here.  Someone always dies on Unofficial. Don't be that guy. Don't let your friends be that guy. I've been here for eight years and I can remember two deaths on Unofficial weekend. They'll be sure to pound it home that someone got drunk and tried to cross University last year though (Against the wishes of the family). I've been here for eight years and I can remember two deaths on Unofficial weekend. They'll be sure to pound it home that someone got drunk and tried to cross University last year though (Against the wishes of the family). Tried to cross university? Someone always dies on Unofficial. Don't be that guy. Don't let your friends be that guy. Go hard or go home, bitch Go home Freshman.  It's way overrated. Unofficial is as fun as you and your friends make it. If you never drink and you don't have friends who party regularly, frat style Unofficial is gonna suck. Remember, alcohol doesn't improve a party unless you're able to have fun without it.\n\nIf your favorite thing to do on a weekend is hosting a LAN party, then you probably should host a gigantic LAN party for Unofficial. A Super Smash Brothers party with 20 friends from back home, two TVs, a keg, and some drinking games going on? Probably a better party than trying to crash a beer pong tournament where you end up puking. Unofficial is as fun as you and your friends make it. If you never drink and you don't have friends who party regularly, frat style Unofficial is gonna suck. Remember, alcohol doesn't improve a party unless you're able to have fun without it.\n\nIf your favorite thing to do on a weekend is hosting a LAN party, then you probably should host a gigantic LAN party for Unofficial. A Super Smash Brothers party with 20 friends from back home, two TVs, a keg, and some drinking games going on? Probably a better party than trying to crash a beer pong tournament where you end up puking. Unofficial is as fun as you and your friends make it. If you never drink and you don't have friends who party regularly, frat style Unofficial is gonna suck. Remember, alcohol doesn't improve a party unless you're able to have fun without it.\n\nIf your favorite thing to do on a weekend is hosting a LAN party, then you probably should host a gigantic LAN party for Unofficial. A Super Smash Brothers party with 20 friends from back home, two TVs, a keg, and some drinking games going on? Probably a better party than trying to crash a beer pong tournament where you end up puking.",
    "url" : "http://www.reddit.com/r/UIUC/comments/185pax/any_laws_we_should_be_aware_of_on_unofficial/"
  }, {
    "id" : 16,
    "title" : "Illini deal fatal blow to #1 Indiana! 74-72",
    "snippet" : "  **I** **L** **L** **I** **N** **I** Go Illini, go! **I** what comes next? what comes next? O **S**   [Buzzer Beater Gif](http://assets.sbnation.com/assets/2136615/illinoisOMG.gif) He had miles of room around him. How did he get so open? ~~Tyler~~ Cody Zeller failed to communicate the switch with ~~Olodiepo~~ Oladipo. Or however you spell his name.  *Cody Zeller, *Oladipo ~~Tyler~~ Cody Zeller failed to communicate the switch with ~~Olodiepo~~ Oladipo. Or however you spell his name.  He had miles of room around him. How did he get so open? Dj sold the shit out of it.\n [Buzzer Beater Gif](http://assets.sbnation.com/assets/2136615/illinoisOMG.gif) [Buzzer Beater Gif](http://assets.sbnation.com/assets/2136615/illinoisOMG.gif) My favorite part is the kid who runs straight to Griffey.   If you're not getting fucked up tonight you're absolutely fucking up.  If you're not getting fucked up tonight you're absolutely fucking up.  If you're not getting fucked up tonight you're absolutely fucking up.   I started screaming at the top of my lungs and running around my apartment. Tyler Fucking Griffey.  I started screaming at the top of my lungs and running around my apartment. Tyler Fucking Griffey.     Illinois wins, going to see The Room, and then hittin' the bars to celebrate. As my friend said, \"If I see Tyler Griffey I will buy ALL of his drinks.\"\n\nLIFE IS GOOD TODAY \"Oh hai Mark\" \"Oh hai Mark\"   Let me just say that Indiana shot 50% from the floor, 53% from 3 and 92% on free throws. How we won that game is incredible.  Has any team with such a poor record ever had such a good record against Top 10 teams?  Guess they looked past us.  You'd think their coach would have warned them. Not sure about overall, but even this season, an unranked (or poorly ranked) NC State team beat #1 Duke. A season of upsets, for sure! Not sure about overall, but even this season, an unranked (or poorly ranked) NC State team beat #1 Duke. A season of upsets, for sure!   [Kamehamehug](http://imgur.com/ObuVLdW) Each time I watch the replay I'm amazed this guy gets out there so fast. This image explains it.    I almost turned it off when we were down 12. Almost   http://www.youtube.com/watch?v=H8hdKnr7rpE   Also, this team blows my mind. We lose to Northwestern but beat a virtually invincible Indiana team? Still amazing though.   Replay is avalible on WatchESPN\nhttp://espn.go.com/watchespn/player/_/id/758315/     Anyone have highlights? All I got to see was Griffey's shot at the end. Anyone have highlights? All I got to see was Griffey's shot at the end. There are some highlights here. Not very good but it's what I've found for now. \nhttp://scores.espn.go.com/ncb/recap?gameId=330380356 Anyone have highlights? All I got to see was Griffey's shot at the end.  anyone know if there's a way to watch the game online now? http://espn.go.com/watchespn/player/_/id/758315/size/condensed/ anyone know if there's a way to watch the game online now? If you find that, send it my way :) If you find that, send it my way :)   Here ya go\nhttp://imgflip.com/i/k7ke ",
    "url" : "http://www.reddit.com/r/UIUC/comments/183sbz/illini_deal_fatal_blow_to_1_indiana_7472/"
  }, {
    "id" : 17,
    "title" : "Voice Actors Needed for Indie Video Game!",
    "snippet" : "Hey everybody. I wanted this message to reach a large group of people at U of I so I thought this would be the appropriate place to post it. I am a University student here and am involved in a fun side project as a video game audio designer. I am currently searching for voice actors to fulfill the role of recording dialogue and voice commands for the game.\n\nThe project is called Tiberian Genesis and it will be a free to play first person shooter. We need a wide variety of voices and especially need voices that can represent the world population  which is why I am reaching out through Reddit as I know there are a diverse group of students on campus. \n\nAn important thing to know is that the Tiberian brand name belongs to EA games so we are a non-profit project and cannot afford to pay a salary  it is purely something we are doing for fun on the side. However, we will definitely credit you for all voice acting work. Here is a link to the project: https://www.facebook.com/TiberianGenesis\n\nIf you are interested, please fill out the form found here (http://bit.ly/TVl3CV) and Ill get back to you guys asap with more information.\n\nThank you!\n\nEDIT1: I forgot to mention that if any of you have any questions, please ask!\n\nEDIT2: You don't need to be a UIUC student. You simply need to be from around here so i can arrange recording on campus at the Art building.\n  [Hell March (youtube link)](http://www.youtube.com/watch?v=Tb-gI_pFog0)   I can try and help. If nothing more than my normal voice, though I like to think I've the chops for others as well.\n\nI love the pre-Wars Tiberian universe! :D  you still need a voice person?",
    "url" : "http://www.reddit.com/r/UIUC/comments/185fnm/voice_actors_needed_for_indie_video_game/"
  }, {
    "id" : 18,
    "title" : "I literally have been watching this on loop for the last 10 minutes",
    "snippet" : "  I kept watching it to see how soon everyone realized we were going to win...like when they actually jumped up.  Also to try to figure out how Griffey got so open!",
    "url" : "http://assets.sbnation.com/assets/2136615/illinoisOMG.gif"
  }, {
    "id" : 19,
    "title" : "Location to weigh a vehicle",
    "snippet" : "For moving records, I need to weigh my car before leaving Champaign.  The state DOT indicates that the closest weigh station is in Bloomington -- certainly there must be something in CU area.  Does anyone know of a place?  http://catscale.com/cat-scale-locator\n\nThey're mostly used for trucks, but for $12 you can get a weigh and a reweigh. See if they'll accept that maybe?  [deleted]  Do you need an official document indicating your vehicle weight? If not, just use google.  Unfortunately I need an official document.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/185e07/location_to_weigh_a_vehicle/"
  }, {
    "id" : 20,
    "title" : "These were being passed around in front of PAR yesterday. They have my back.",
    "snippet" : "   Really? Because while I support the people who work, and think they are incredible people who work hard, this handout seems to really blow a couple things out a proportion, and seems to be biased against the university. Now, I'm, not saying that I agree with the university on everything, but on some points I do.\n\nFor one, the part about being unable to lose this work to cheaper untrained individuals. This is basically the crux of their union; they occupy a relatively unskilled position doing manual labor, meaning that they are paid (let's face it) not so well because it is cheaper to replace someone than give them pay raises until they retire. I don't agree with it, but it makes the most sense. \n\nI don't know about the validity of the whole fourth paragraph, but that seems to reference the fact that many of these workers are only required (and therefore only paid and given hours to work) when the school is in session. Again, this comes from the fact that they work at a university. Similarly, many of the restaurants near campus see an enormous decline in profits during the summer/breaks, since their main clientele in students.  \n\nLastly, (and it appears to have been cut out of this image) but when I read mine, the also mentioned that they weren't looking for a percentage increse in pay, but a straight dollar amount increase, to (something along the lines of) help those who make the least. This is the thing that pissed me off the most, because it demonstrated (in my opinion at least) that they weren't so much looking for a cost of living increase (which is generally defined as an increase as a percentage in pay near or equal to that of inflation, which for this year would be 1.7%) and looking for a straight up raise. They garner sympathy by talking about how they are living paycheck to paycheck, etc. and that this is why they require a paycheck increase. It fails to accurately explain things like how, as minimum skilled labor, they don't create any incentive to pay them more. It also doesn't mention how, as unskilled, borderline part time workers, they are making (at minimum) twice minimum wage. \n\nHonestly, while I believe in the idea of everyone getting what they deserve, this doesn't seem like they are arguing for the \"simple things\" like a cost of living increase (which is, as I said before, a percentage increase based on inflation) but that they are trying to garner support for them to extract a raise for all their members, which would ultimately be reflected in our tuition. Really? Because while I support the people who work, and think they are incredible people who work hard, this handout seems to really blow a couple things out a proportion, and seems to be biased against the university. Now, I'm, not saying that I agree with the university on everything, but on some points I do.\n\nFor one, the part about being unable to lose this work to cheaper untrained individuals. This is basically the crux of their union; they occupy a relatively unskilled position doing manual labor, meaning that they are paid (let's face it) not so well because it is cheaper to replace someone than give them pay raises until they retire. I don't agree with it, but it makes the most sense. \n\nI don't know about the validity of the whole fourth paragraph, but that seems to reference the fact that many of these workers are only required (and therefore only paid and given hours to work) when the school is in session. Again, this comes from the fact that they work at a university. Similarly, many of the restaurants near campus see an enormous decline in profits during the summer/breaks, since their main clientele in students.  \n\nLastly, (and it appears to have been cut out of this image) but when I read mine, the also mentioned that they weren't looking for a percentage increse in pay, but a straight dollar amount increase, to (something along the lines of) help those who make the least. This is the thing that pissed me off the most, because it demonstrated (in my opinion at least) that they weren't so much looking for a cost of living increase (which is generally defined as an increase as a percentage in pay near or equal to that of inflation, which for this year would be 1.7%) and looking for a straight up raise. They garner sympathy by talking about how they are living paycheck to paycheck, etc. and that this is why they require a paycheck increase. It fails to accurately explain things like how, as minimum skilled labor, they don't create any incentive to pay them more. It also doesn't mention how, as unskilled, borderline part time workers, they are making (at minimum) twice minimum wage. \n\nHonestly, while I believe in the idea of everyone getting what they deserve, this doesn't seem like they are arguing for the \"simple things\" like a cost of living increase (which is, as I said before, a percentage increase based on inflation) but that they are trying to garner support for them to extract a raise for all their members, which would ultimately be reflected in our tuition. The only part that got cut out was \"Dear Building Occupant,\".\n\nNow why do you get pissed off at them asking for raises (regardless if it's 1.7% or something else) instead of the administrators taking bonuses 3x the amount that the 800 workers want? I never said I wasn't upset about the admins getting overpaid. But the fact that they are misleading and intentionally trying to garner sympathy in places where sympathy might not be due doesn't seem right to me.\n\nMaybe this one hasn't had things cut out, but then there was another one being handed out that had more information. I know, I got it and read it. Tangent to what you're saying, but: The admins aren't nearly as overpaid as you might think. Compare [these numbers](http://data.illinimedia.com/salaries/index) to private industry numbers for people with similar degrees and experience - you'll notice that they almost always take a cut by working at the University. For good reason probably, it's probably a much better environment to work in with far more job security. That kind of shit doesn't show up on a paycheck but are pretty invaluable.\n\nDo the figures you posted include the awesome benefits and retirement packages university employees get? Factor those in and they may not be under the private sector anymore.\n\nFurthermore, you say it's less than the private sector without offering figures. \n\nIf you wander into source territory you better be thorough. Once you stop wildly speculating and start being empirical the bar raises pretty quick. The only part that got cut out was \"Dear Building Occupant,\".\n\nNow why do you get pissed off at them asking for raises (regardless if it's 1.7% or something else) instead of the administrators taking bonuses 3x the amount that the 800 workers want? This \"evil administrators\" card gets played all the time. [They aren't paid nearly as much as you'd think](http://data.illinimedia.com/salaries/index). In fact, the vast majority of them would make far more working for private companies. Take a moment to actually look at what the deans are making - realize that they all have stacked resumes and advanced degrees. I'm sure I'll be downvoted to hell because I'm going against the grain on this one, but seriously, these people are usually making much less money than they would in private industry - because they actually DO give a shit about students and want to help them. Wow, the football coaches are paid over one million dollars a year? And we still suck this bad?!\n\nWhat the flying fuck. This is all to entertain some students? I am always surprised by the ability of this school to waste money, when it really doesn't have much. The school isn't wasting money. The salaries of the athletic department are paid for separately - by the athletic department. Your tuition does not go to them.\n\nThat being said, yeah, one million dollars to win 2 games a year? I think I might be able to win 1 game a year for 500k... This \"evil administrators\" card gets played all the time. [They aren't paid nearly as much as you'd think](http://data.illinimedia.com/salaries/index). In fact, the vast majority of them would make far more working for private companies. Take a moment to actually look at what the deans are making - realize that they all have stacked resumes and advanced degrees. I'm sure I'll be downvoted to hell because I'm going against the grain on this one, but seriously, these people are usually making much less money than they would in private industry - because they actually DO give a shit about students and want to help them. The question is, why are admin positions multiplying and tenure positions decreasing? Broadly speaking, of course, UIUC may be different in this regard, but over the entire higher education industry it is a verifiable trend.\n\nLast time I checked admins didn't teach courses. So why the fuck are there more admins and less professors, and why the fuck do we pay so much tuition just to, more or less, be taught by fucking grad students?\n\nShort answer: the administration is incompetent. That's a different discussion entirely - but I'll play along.\n\nOne: Let's assume that it's as you say - the administration is incompetent. What's your solution?\n\nIf the administration is incompetent, then we need to hire a higher caliber of employee - somebody who can competently perform their jobs. OK. To draw in higher quality administration, what do we have to do?\n\nOh, right. Pay them more.\n\n______\n\nTwo: Let's look at our current administration, and figure out what the problem is. Incompetent administrators - the problem. And, let's say that higher pay is out of the question. Where are we getting our administrators from? A few I pulled off the top of my head:\n\n[Hirschi](http://abe.illinois.edu/faculty/M_Hirschi)\n\n[Ravaioli](http://www.ece.illinois.edu/directory/profile.asp?ravaioli)\n\n[Andrejasich](http://www.arch.illinois.edu/people/faculty/andrejas/)\n\n[LAS's entire leadership, basically](http://www.las.illinois.edu/about/leadership/)\n\nWhat's the common theme? I've got one - they all came from their fields. None of them have actual degrees in administration. In fact, almost every single Dean started out as a professor. The administration is not, in fact, administrative professionals. It's a bunch of old professors.\n\nYou could see how this could be a problem.\n\nNow, here's two things I want to point out. 1) You're right, we have less tenured professors- because they keep going into administration. 2) We have established a status quo of all administrators being ex-professors.\n\nThis status quo is an issue - and here's why; when an actual professional administrator comes in, the professionals can't do their jobs right. Weird, right? The faculty is used to the administrators being other ex-professors who \"worked their way up;\" lo and behold, they don't listen to the professional administrators. And just like that, your competent professional administrators are rendered useless - and not due to any incompetence or fault of their own, but in fact because of the professors - who we try so hard to hold blameless.\n\nIt's funny, things aren't nearly so simple as they seem at first.  &gt;If the administration is incompetent, then we need to hire a higher caliber of employee - somebody who can competently perform their jobs.\n\nThis is a short-sighted answer. Sometimes incompetence exists because of the individual, but most of the time it exists because of administrative structures. Put all the UIUC administrators in an institution that is designed better and you'll get better employees most of the time.\n\nOf course, this is America, and we tend to believe individual effort is everything, but at the end of the day context is usually far more important. I suppose I should have pointed this out to begin with, but it usually doesn't occur to me to include my broader philosophy in every post.\n\n&gt;1) You're right, we have less tenured professors- because they keep going into administration. 2) We have established a status quo of all administrators being ex-professors.\n\nI'm glad ex-professors take up administrative roles. It shouldn't be any other way, but it's incorrect for you to say this phenomenon is what is causing less tenured professor positions to exist. It's a budgetary reason it's happening, it isn't happening because there aren't quality professors out there looking for a job.\n\n&gt;And just like that, your competent professional administrators are rendered useless - and not due to any incompetence or fault of their own, but in fact because of the professors - who we try so hard to hold blameless.\n\nSo, everything is the professor's fault? In that case lets fire all the professors. What do these silly professors know about education compared to somebody who has never stepped foot into a classroom?\n\nI, for one, am not interested in putting our schools into the hands of corporate suits who only know how to focus on numerical metrics. Teaching to the test and multiple-choice scantron tests are already prevalent enough in our educational institutions, we don't need to put people in charge who will only increase such things. Jesus, have we learned nothing from Leave No Child Behind?\n\n&gt;It's funny, things aren't nearly so simple as they seem at first.\n\nWhat's funny is that you bought into the bullshit lie that generic MBAs can do a great job in any industry. Every industry is different, and you want people to run things who understand those differences. You don't want some suit who only knows generic business practices to come in and be in charge.\n\nPS: You get an upvote from me because fuck Redditors who can't notice a decently constructed argument. You shouldn't have been downvoted. &gt;This is a short-sighted answer. Sometimes incompetence exists because of the individual, but most of the time it exists because of administrative structures. Put all the UIUC administrators in an institution that is designed better and you'll get better employees most of the time.\n\nAgreed. I don't believe in that argument one bit - it just bothers me that people argue that the administration is incompetent and underpaid - and then offer NO solution whatsoever. I actually am not nearly as pro-administration as these arguments might make me look - but everyone loves to beat that stupid \"The administration is incompetent\" drum, and it drives me up the bloody wall.\n\n&gt;So, everything is the professor's fault? \n\nNo. There needs to be balance. A whole bunch of professors and nobody who has been trained to administer = A clusterfuck where nobody knows how to get things done. A whole bunch of administrators and nothing else = A clusterfuck where nobody knows what needs to be done. There is an absolute need for both kinds of people. Similarly, there's no reason that the professors shouldn't take courses in how to properly work in university administration - the U of I has specific courses in how to properly administer to a university; why aren't we taking advantage of them?\n\n&gt;I, for one, am not interested in putting our schools into the hands of corporate suits who only know how to focus on numerical metrics. Teaching to the test and multiple-choice scantron tests are already prevalent enough in our educational institutions, we don't need to put people in charge who will only increase such things. Jesus, have we learned nothing from Leave No Child Behind?\n\nThat's hyperbole. There are issues - for instance, a professor recently was unhappy with the way that students were performing in his studio classes. This was one of the colleges where a professor's students' performance can affect whether or not said professor gets tenure. The professor mandated 2 extra 3 hour studios per week - on a Thursday and a Sunday - and said that if the students didn't come to these studios that were not on the syllabus, they would lose one letter grade per absence.\n\nHaving a professional administrator there to tell them \"Hey, you can't fucking do that\" is really important. In a lot of departments, those extra-curricular studios are part of the culture, and it's not a big jump to go from \"strongly encouraging\" to \"requiring;\" having that professional from an outside culture there protects against that.\n\n&gt;What's funny is that you bought into the bullshit lie that generic MBAs can do a great job in any industry. Every industry is different, and you want people to run things who understand those differences. You don't want some suit who only knows generic business practices to come in and be in charge.\n\nDidn't say generic MBA, don't buy into that lie. I said a professional administrator - someone who specializes in administration in education. Do I want a businessman in there? No. I want a guy with a degree like [this](http://education.illinois.edu/epol/programs/edadmin).  Really? Because while I support the people who work, and think they are incredible people who work hard, this handout seems to really blow a couple things out a proportion, and seems to be biased against the university. Now, I'm, not saying that I agree with the university on everything, but on some points I do.\n\nFor one, the part about being unable to lose this work to cheaper untrained individuals. This is basically the crux of their union; they occupy a relatively unskilled position doing manual labor, meaning that they are paid (let's face it) not so well because it is cheaper to replace someone than give them pay raises until they retire. I don't agree with it, but it makes the most sense. \n\nI don't know about the validity of the whole fourth paragraph, but that seems to reference the fact that many of these workers are only required (and therefore only paid and given hours to work) when the school is in session. Again, this comes from the fact that they work at a university. Similarly, many of the restaurants near campus see an enormous decline in profits during the summer/breaks, since their main clientele in students.  \n\nLastly, (and it appears to have been cut out of this image) but when I read mine, the also mentioned that they weren't looking for a percentage increse in pay, but a straight dollar amount increase, to (something along the lines of) help those who make the least. This is the thing that pissed me off the most, because it demonstrated (in my opinion at least) that they weren't so much looking for a cost of living increase (which is generally defined as an increase as a percentage in pay near or equal to that of inflation, which for this year would be 1.7%) and looking for a straight up raise. They garner sympathy by talking about how they are living paycheck to paycheck, etc. and that this is why they require a paycheck increase. It fails to accurately explain things like how, as minimum skilled labor, they don't create any incentive to pay them more. It also doesn't mention how, as unskilled, borderline part time workers, they are making (at minimum) twice minimum wage. \n\nHonestly, while I believe in the idea of everyone getting what they deserve, this doesn't seem like they are arguing for the \"simple things\" like a cost of living increase (which is, as I said before, a percentage increase based on inflation) but that they are trying to garner support for them to extract a raise for all their members, which would ultimately be reflected in our tuition.   I agree that the University administration is for the most part a group of selfish morons, but my experiences over 2 years with dining workers has not been good either. The majority of them act like it is the biggest pain in the world to prepare food for me, and when it is busy and food is out they just saunter around like they don't care one bit. So it's not like they are righteous, always hard working employees either Not all dining hall workers are like that, I know a good amount of dining and other building workers that are always doing their job, are friendly,  and always have a smile on their face as they work. I see where you're coming from though, I have also seen some that act like it's such an inconvenience to do their job, but it's not everyone. There are lots of righteous, hard working employees that do their job well and  deserve a raise.\n Not all dining hall workers are like that, I know a good amount of dining and other building workers that are always doing their job, are friendly,  and always have a smile on their face as they work. I see where you're coming from though, I have also seen some that act like it's such an inconvenience to do their job, but it's not everyone. There are lots of righteous, hard working employees that do their job well and  deserve a raise.\n I agree that the University administration is for the most part a group of selfish morons, but my experiences over 2 years with dining workers has not been good either. The majority of them act like it is the biggest pain in the world to prepare food for me, and when it is busy and food is out they just saunter around like they don't care one bit. So it's not like they are righteous, always hard working employees either When I worked at LAR as a student employee the cooks and workers were always nice. It never seemed like they were begrudgingly doing their job. Granted, since LAR is a much smaller dining hall, everyone knew each other and got along pretty well. Maybe it's different at PAR or the Ike or wherever, but at least where I was the workers were great people.  I agree that the University administration is for the most part a group of selfish morons, but my experiences over 2 years with dining workers has not been good either. The majority of them act like it is the biggest pain in the world to prepare food for me, and when it is busy and food is out they just saunter around like they don't care one bit. So it's not like they are righteous, always hard working employees either    [deleted]  Are they standing out in front of FAR/PAR chanting about the work wages yet? They did this two years ago when I lived there. I lived on the first floor and could hear them demanding better conditions at the top of their lungs. Nothing like being woken up at 6 AM by people demanding things. If anything I just rooted against them because they disturbed my sleeping patterns. ^ Typical selfish suburban kid. Fact: College is damn expensive, even with in-state tuition.\n\nFact:  Few things restrict academic performance as severely as sleep deprivation.\n\nFact:  For various reasons, many college students work late into the night, and at 6AM, may have only recently gone to sleep.\n\nFact:  Students and their parents both have the right to demand that they get the maximum value out of their college expenditure.\n\nWhile some students might be \"selfish suburban kids,\" and are only angry at the demonstrators for aggrivating their hangovers, there are lots of students who actually might be harmed.  How would you feel if you messed up an exam because you had been kept awake by protestors?  What if that one test dropped your grade in the class, resulting in the loss of a scholarship?\n\nThey're trying to use the students as pawns in their little chess game with administration, and in so doing, they're either forgetting or ignoring the fact that without the students, they wouldn't have jobs in the first place. &gt;Fact: For various reasons, many college students work late into the night, and at 6AM, may have only recently gone to sleep.\n\nlulz-worthy\n\nGuess what, the world doesn't stop for you, me, or anybody else. 6am is daytime. At 6am, it is legitimate for loud things to be going on outside your apartment.\n\nProtip: Most of the country is *not* on a college student's schedule.\n\nNow if they were protesting at 4am, that'd be a problem. To be fair, 6am is probably the earliest something like road construction or protesting could begin. \n\nKeep in mind lots of professionals wake up *before* 6am, especially those who have a long commute. I don't know about other places, but in my hometown, the noise ordnance forbids lawn-mowing or other loud noises before 8AM on weekdays.\n\nFurther, the world doesn't run on a college student's schedule, but oh, wait....where are we?  Right...Champaign-Urbana.  A *college town.* So what, because CU is a mid-sized city with a huge university everybody else who lives here is supposed to converge on a college students schedule? Wishful thinking.\n\nMost students on the UIUC campus are transplants, mostly from Chicago it seems. It's a bit ridiculous to expect all the locals to adopt a mindset that benefits a bunch of outsiders. The world just doesn't work like that. When in Rome...\n\n ",
    "url" : "http://i.imgur.com/kapSKJz.jpg"
  }, {
    "id" : 21,
    "title" : "Just got my part back from Ford lab",
    "snippet" : "  How would one go about getting one of these?  How would one go about getting one of these?  Poke around [here](https://www-s.mechse.uiuc.edu/rplab/).  Other options if you want to do 3D printing are [the fablab](http://cucfablab.org/) and [the new makerlab](http://makerlab.illinois.edu/).  To actually print something you will probably need to make a .stl file of it. Im guessing like it was in my highschool and to use it is free but you need to pay for the material? That's exactly how the fablab works.  I think it's something like $0.10/gram of the plastic used.  I assume the others are similar, but I don't know exactly what their policies are.  ME 350 or ME 170?      If you guys want I can give you the .stl file so you guys can make him yourselves. But I better give details about his back. The rapid prototyping machines in Ford Lab build support structures to support the different levels of material as it prints the part. They printed him on his back so his back is course from where they removed the support structures. Also he has \"MADE IN USA\" stamped across the back of his head, just to make him look more authentic",
    "url" : "http://i.imgur.com/qPyDNyR.jpg"
  }, {
    "id" : 22,
    "title" : "ECE Pulse Software Competition",
    "snippet" : "Hey everyone! The 2nd annual ECE Pulse Conference (http://pulse.ece.illinois.edu/) is organizing a set of competitions which will take place on Saturday.\n\nThe Software conference has released documentation and details. Hope to see you compete!\n\nhttps://github.com/Koshroy/pulsegame   Why am I not surprised that this is an RTS? It looks turn based to me. From the documentation:\n&gt;The game type and style is that of a real-time strategy game (RTS) visualized in a top-down view. Sorry we had many hands working on the initial doc draft and we're cleaning things up. It is a Turn-Based Strategy. I'm sorry for the confusion.  I don't get the difference between the different competitions and the different levels of them.\n\nThis game looks interesting, but there's four different levels of software. I don't know which one(s) to sign up for.   Are you Koushik? Man, it is just not right time to post this, everyone is still in the ecstasy of illini won last night and an engineering post will be simply ignored...try to post it sometime next week again when there is no homegame before or after..\n",
    "url" : "http://www.reddit.com/r/UIUC/comments/184hgc/ece_pulse_software_competition/"
  }, {
    "id" : 23,
    "title" : "TYLER GRIFFEY HIT A 3!",
    "snippet" : "Call the presses boys we're in business.  When did we learn how to be clutch?",
    "url" : "http://www.reddit.com/r/UIUC/comments/183pdg/tyler_griffey_hit_a_3/"
  }, {
    "id" : 24,
    "title" : "weird question, but does anyone have any therapist recs?",
    "snippet" : "I'm in the market for a new therapist in C-U, preferably one that isn't ridiculously expensive or one that takes student health insurance. I'd prefer CBT, DBT, mindfulness-based therapy, or especially constructivist therapy, but I'm open. \n\nAny recommendations with details (that I couldn't find online) about the therapist would be helpful! \n  Resources on campus:\n\n1. [McKinley Health Center](http://www.mckinley.illinois.edu/Clinics/mental_health.htm)\n1. [Student Counseling Center](http://www.counselingcenter.illinois.edu/)\n1. [Psychological Services Center](http://www.psc.illinois.edu/)\n1. [Faculty/Staff Assistance Program](http://fsap.illinois.edu/)\n\nBrowse these webpages, and also search for \"therapist/psychotherapist/psychologist/counselor/mental health\" on this subreddit - this question has been asked many times. The above resources are all free/low-cost. If none of these meets your needs, you can still call them up and ask them for recommendations for professionals in the community.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/183zta/weird_question_but_does_anyone_have_any_therapist/"
  }, {
    "id" : 25,
    "title" : "Furniture Stores on campus?",
    "snippet" : "Soooo things at my apartment got a little out of control and someone ended up busting one my end tables. Does anyone know of any stores that sell end tables. Specifically, does anyone know where the Apartment companies down here get their furniture? \n\nI am currently renting with JSM if that makes any difference.   Go to This is It Furniture. You know, I've heard that they've been wheelin' and dealin' for over 20 years now and they're still going downer downer downer.  I just saw a furniture store over by Cafe Kopi and the Art Theater.\nI can't remember the name or the exact location, but I'll come edit it in\nif I do remember. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/184hx5/furniture_stores_on_campus/"
  }, {
    "id" : 26,
    "title" : "Differential Equations and Linear Algebra: \"There were some days when out of 100 enrolled students, fewer than 20 were attending class.\"",
    "snippet" : "  Although I see how someone could be concerned about the teaching methods/(lack of) preparation of, frankly, a small set of professors, attendance is not a good statistic to gauge anything aside from student laziness.\n\nPersonally I much prefer the structure of classes such as Calc 3/Linear Algebra to Phys 211 or 212. I would much rather teach myself than be forced to watch powerpoints online every other day in addition to keeping up with mandatory attendance. Although I see how someone could be concerned about the teaching methods/(lack of) preparation of, frankly, a small set of professors, attendance is not a good statistic to gauge anything aside from student laziness.\n\nPersonally I much prefer the structure of classes such as Calc 3/Linear Algebra to Phys 211 or 212. I would much rather teach myself than be forced to watch powerpoints online every other day in addition to keeping up with mandatory attendance. Physics 211/212 have mandatory attendance? In lecture? Physics 211/212 have mandatory attendance? In lecture? Although I see how someone could be concerned about the teaching methods/(lack of) preparation of, frankly, a small set of professors, attendance is not a good statistic to gauge anything aside from student laziness.\n\nPersonally I much prefer the structure of classes such as Calc 3/Linear Algebra to Phys 211 or 212. I would much rather teach myself than be forced to watch powerpoints online every other day in addition to keeping up with mandatory attendance. So im not the only one that hates the Physics lecture structure. Seems like everything is centered around the smart physics system and premade power points. \n\nI feel I learn a lot better if the teacher actually writes stuff on the board and solves tricky examples.   Yet another thrilling D.I article...\n\n\nIm a math major so maybe my opinion is skewed, but does this article not just sound like a page of whining? Out of curiosity, did you test out of the calculus series courses or did you take them?  I would say that the courses are okay, but when you compare their structure and organization to that of PHYS 211 and 212, they are quite lacking.  He makes a good point with the lectures, too: many engineering students go through basic math classes where they are shown nothing but proofs and example problems on the chalkboard.  Generally engineers understand concepts better if they are taught intuitively rather than through rote methods.\n\nHe's definitely whining a little, but there aren't many other ways to point out that the math department may need to fix a few issues. I tested out of Calc I,II and took calc III freshman year. I don't have a basis for comparison having never taken Phys 211,212 unfortunatly. I understand an engineer being disappointed in the prevalence of proofs, but bear in mind that it is a math class and a lot of math majors are in the class too. \n\nIll be the first to admit that the class and the department are far from perfect (Im a double major and like the econ department significantly more), but as someone above mentioned the writer lists the math department's shortcomings, but doesn't seem to provide any constructive ideas as to how to improve them them.  I tested out of Calc I,II and took calc III freshman year. I don't have a basis for comparison having never taken Phys 211,212 unfortunatly. I understand an engineer being disappointed in the prevalence of proofs, but bear in mind that it is a math class and a lot of math majors are in the class too. \n\nIll be the first to admit that the class and the department are far from perfect (Im a double major and like the econ department significantly more), but as someone above mentioned the writer lists the math department's shortcomings, but doesn't seem to provide any constructive ideas as to how to improve them them.  Believe me, no one complains about the lack of proofs.  Yet another thrilling D.I article...\n\n\nIm a math major so maybe my opinion is skewed, but does this article not just sound like a page of whining?  &gt; This exposes the deeper problem that many professors simply do not care about teaching and consequently have diverted all of their attention to their research.\n\nDing ding ding! Were a Research I institution. Research is so highly valued here that deplorable teachingespecially in the sciencesis pretty much par for the course. I dont know how to fix this, but its something that students (and prospective students) should keep in mind. Granted, I haven't hit 400 level courses yet, but I can only think of two teachers I didn't care for and I took Calc 2 -&gt; 286. Only one was particularly bad (an ECE course), and the other just wasn't a good fit with me because I was too stubborn to read the book (calc 3 prof). I don't think the \"professors are busy doing research and don't care about teaching\" argument holds as much water as people think it does. Granted this is anecdotal, and I have an advantage in that I get early registration, but even most of my friends haven't gotten stuck with horrendous professors.  This guy talks about how awful their teaching methods are but offers no solution. I don't know what he expects them to change. Proofs are a pretty fundamental part of mathematics and there's really no going around it. He also seems to expect to be babysat by the teacher, complaining that the teacher didn't assign problems.I hope he realizes that there's nothing stopping him from doing these problems on his own. This whole article seems like one large exaggeration. This guy talks about how awful their teaching methods are but offers no solution. I don't know what he expects them to change. Proofs are a pretty fundamental part of mathematics and there's really no going around it. He also seems to expect to be babysat by the teacher, complaining that the teacher didn't assign problems.I hope he realizes that there's nothing stopping him from doing these problems on his own. This whole article seems like one large exaggeration. This guy talks about how awful their teaching methods are but offers no solution. I don't know what he expects them to change. Proofs are a pretty fundamental part of mathematics and there's really no going around it. He also seems to expect to be babysat by the teacher, complaining that the teacher didn't assign problems.I hope he realizes that there's nothing stopping him from doing these problems on his own. This whole article seems like one large exaggeration. Proofs really aren't a fundamental part of Math 285 or 415, though... :/\n\nAnd his 285 and 415 instructors really did both have an average of 1.3 on ratemyprofessor, with plenty of data points. :) Remember that the minimum is 1, not 0.           I took CalcI\\II over at UIC. Was really a fan of their teaching model (or maybe i just got good professors). \n\nAnyway there would be 3 lectures and 2 optional discussions a week. Lectures would consist of professors doing some basic proofs but mostly spending time explaining really hard problems to you, then assigning tricky problems for homework. Then the exams would consist of prettying much the basic concepts of the material we learned, \ni.e. integration of parts would have a relatively easy problem that didn't involve obscure trig identities. \n\nHere i feel it is the opposite teachers spend time teaching the absolute basic concept (proofs), then expect you to apply those proofs to really hard problems on the exams.  That would be a great change of pace for math problems. I hated having to memorize obscure trig identities yet have almost no application of them on exams.  Im really against the idea that test should try to trick the user as much as possible. I feel like if you can get the basic idea of integration by parts, you can easily figure it out when you need to do more challenging things. \n\nSo go on make the homework as hard as you can, but dont expect\n us to be able to do the same problems while under the stress of an exam.   Im really against the idea that test should try to trick the user as much as possible. I feel like if you can get the basic idea of integration by parts, you can easily figure it out when you need to do more challenging things. \n\nSo go on make the homework as hard as you can, but dont expect\n us to be able to do the same problems while under the stress of an exam.   ",
    "url" : "http://www.dailyillini.com/opinion/columns/article_f7f85014-70d8-11e2-9e11-001a4bcf6878.html"
  }, {
    "id" : 27,
    "title" : "2 years ago I read that Illinois was undefeated playing #1 teams in Assembly, anyone know what the stat currently is? ",
    "snippet" : "A little background. 2 years ago when we played #1 Ohio State, the Orange Krush had a statistic in their brochure that said we were 5-0 (I think, but not completely sure) when we played the #1 ranked team in Champaign in Assembly Hall. We wound up losing that game to Ohio State. \n\nNow that we have beaten another #1 team coming into Assembly Hall I was wondering if any Orange Krush ppl know where the stat is currently at.  Prior to today's game: Illinois is 2-20 all-time against No. 1-ranked opponents with both victories occurring at the Assembly Hall. Lou Henson's fourth-ranked Illini defeated No. 1 Michigan State, 57-55, on Jan. 11, 1979 on an Eddie Johnson baseline jumper at the buzzer. And fifth-ranked Illinois rolled past No. 1 Wake Forest, 91-73, on Dec. 1, 2004, took over the No. 1 ranking the following week, and stood atop the polls for the remainder of the season en route to an appearance in the 2005 NCAA Championship game.\n\nNot sure about home record, but that gives you an idea.  Still undefeated, because that trivia question said the last time a #1 team came here was 2004. Add one game to whatever it was when you heard that stat.  not sure I follow since we lost to Ohio State (who was #1) that same day.  ~~Are you sure that was at home? Either you're mistaken or the trivia question lied to me.~~\nOk I just looked it up, I guess the trivia question lied.  I could just be remembering it wrong, it was two years ago.... No, I looked it up on Wikipedia. We lost to Ohio State here in the 2010/2011 season when they were ranked #1. The question at the game today said the last time a #1 team came here was in 2004. Maybe the question was or was meant to be the last time we beat a #1 team here.  I wasn't able to go to the game tonight, but I was referring to a statement made 2 years ago at the OSU game.  No, I looked it up on Wikipedia. We lost to Ohio State here in the 2010/2011 season when they were ranked #1. The question at the game today said the last time a #1 team came here was in 2004. Maybe the question was or was meant to be the last time we beat a #1 team here. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/183u0i/2_years_ago_i_read_that_illinois_was_undefeated/"
  }, {
    "id" : 28,
    "title" : "ISS Last Night - $300 for cupcakes, $1775 for pens/keychains/cups/bags, $2129 for publicity, and $309.70 for pizza, water and coffee",
    "snippet" : "While these are only appropriations, and the amount may change, it's important to realize how much of your money the Student Senate burned through last night.  \n\nEDIT: ISS also spent $500 for travel to out of town meetings  Who's giving the money to these idiots so they can pad their resumes with bullshit instead of upgrading classrooms and hiring better professors? Each student pays about $1 per year to the Student Senate. They do not have the power to spend this money on upgrading classrooms or hiring better professors. They should. Thanks for your valuable contribution fosdagger! Next time I address the Senate to tell them that I tell them I would like them to allocate funds towards hiring better professors or upgrading classrooms and they tell me they don't have that power, I'll respond with \"you should.\" How about instead of just replying to them you take some action to make that a possibility? There is no law against it, the reason they \"can't\" is because there is some rule in place that says so; get it changed. This is how I'm interpreting your view of the Senate, \"Hey, Genie, I wish we had the power to build new buildings and hire better professors. I wish to be an all powerful genie!!!\"   Each student pays about $1 per year to the Student Senate. They do not have the power to spend this money on upgrading classrooms or hiring better professors. Why am I paying anything.  If you think about it, I'm probably paying less than a dollar of tuition to put my desk in one of my classrooms.  Why am I paying a full dollar for pizza?  I might get down voted for this but those numbers, while a little odd, aren't outrageous when you consider the quantity ISS might prepare.  I would hate to see the flames if someone got a hold of what some of the university meetings cost. Yea exactly. Do people really think that at the large board meetings the professors and administrators are eating pizza and cupcakes? I wouldnt be surprised at all if their meetings run us $7,000+ each on food alone Yea exactly. Do people really think that at the large board meetings the professors and administrators are eating pizza and cupcakes? I wouldnt be surprised at all if their meetings run us $7,000+ each on food alone I've heard that the Board of Trustees stay in only the finest hotels and eat only the most delicious foods. Free to them... I might get down voted for this but those numbers, while a little odd, aren't outrageous when you consider the quantity ISS might prepare.  I would hate to see the flames if someone got a hold of what some of the university meetings cost.  This is absolutely absurd.  Is there enough time before student elections to call a referendum on dissolving the ISS?  Who received these funds and for what purpose? Give some context, please. (I do know the $300 in cupcakes was for a public event by the 1867 Society.) $300 in cupcakes for the 1867 society event\n$500 in out of town travel to observe a meeting (University Senates Conference)\n$1775 for publicity handouts for students (i.e. ISS tote bags, ISS keychains, ISS cups)\n$2129 (maximum) for election related publicity (bus ads, etc.)\nDon't remember the pizza/water/coffee one\n\nAgain, I'll point out that this is only the maximum amount that will be appropriated (and it may be a smaller amount), but still... It's ridiculous. That all doesn't sound too terribly unreasonable, though I would have folded election publicity and publicity handouts into a single appropriation.  I know hate on the ISS is cool right now (and yeah, that $9000 printing error was funny as fuck), but I don't know if this is the way to do it. That all doesn't sound too terribly unreasonable, though I would have folded election publicity and publicity handouts into a single appropriation.  I know hate on the ISS is cool right now (and yeah, that $9000 printing error was funny as fuck), but I don't know if this is the way to do it. The $500 for travel doesn't sound unreasonable, assuming they have a large group going. Although why they don't have to apply for the travel funding like *every other RSO ever* is beyond me.  Who do RSOs appeal to for travel funding? SORF $300 in cupcakes for the 1867 society event\n$500 in out of town travel to observe a meeting (University Senates Conference)\n$1775 for publicity handouts for students (i.e. ISS tote bags, ISS keychains, ISS cups)\n$2129 (maximum) for election related publicity (bus ads, etc.)\nDon't remember the pizza/water/coffee one\n\nAgain, I'll point out that this is only the maximum amount that will be appropriated (and it may be a smaller amount), but still... It's ridiculous. The pizza/water/coffee is refreshments for the Trustee debate.\n\nSince the person who wins that position has several orders of magnitude more power than any other student, it makes sense to me to hold a debate. /r/UIUC should come out and make its voice heard! And eat some pizza... burntglass, have you even been to a trustee debate before? No one from outside the student government clique attends..     Is there a provision for impeachment in the laws concerning student government? Yes. Who do you have in mind?    They should use that money to put more dual monitors in EWS labs.  I hate coding with only one monitor. That actually has more to do with space,power, and stupid users. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/182ely/iss_last_night_300_for_cupcakes_1775_for/"
  }, {
    "id" : 29,
    "title" : "Does anyone have any experience renting from Kennedy-Wilson?",
    "snippet" : "Signed a lease with them for next year and I'm getting kind of a weird vibe from them already. I know they're new this year to campus so I was wondering if anyone had anything to say about them -- good or bad       They're actually not new. The company has changed their name several times to rid themselves of their horrible reputation. I believe I read about that at The Tenant Union (http://www.tenantunion.uiuc.edu/), because I can't find any info about it online now. Definitely check out The Tenant Union before you sign a lease next time. You can read the past 5 years worth of complaints of every local landlord and how they were resolved. You can also review your lease with professionals to see what's fair and what's shady. The tenant union didn't have any complaint records from them, because they are technically new since like summer 2012. That's probably why they changed their name. The Tenant Union can probably tell you what they used to be called. I'll let you know if I remember.\n\nEdit: This is driving me nuts. I know I read about it when I was looking for a place to live. I really can't find anything about it online. I don't think they have changed their name. Kennedy-Wilson is part of a larger, non-local real estate firm. I think they just recently bought out a lot of C-U apartment buildings. I know they own buildings that used to be CPM and Bankier, and probably others.",
    "url" : "http://www.reddit.com/r/UIUC/comments/183u55/does_anyone_have_any_experience_renting_from/"
  }, {
    "id" : 30,
    "title" : "In case you didn't read the email: UIUC is jumping on the MOOC bandwagon!",
    "snippet" : "  We've been on Coursera since this summer. One class had thousands of students. &gt;One class had thousands of students.\n\nWhich class? We've been on Coursera since this summer. One class had thousands of students.   ELI5 what this means?",
    "url" : "http://mooc.illinois.edu/"
  }, {
    "id" : 31,
    "title" : "Bromley Hall kid gets blasted in the face with glass",
    "snippet" : "    Shit, it got taken down. Anyone DL it in time?  Just watched this in class without sound and I highly enjoyed it. Maybe that's the secret to enjoying this video. Just watched this in class without sound and I highly enjoyed it. Maybe that's the secret to enjoying this video.  Why was that dude boxing a girl? They're friends who wanted to kickbox for practice/fun.\nI know one of them is in ROTC. They're friends who wanted to kickbox for practice/fun.\nI know one of them is in ROTC. I guess that makes sense.  Why was that girl so pissed off though?  I didn't have sound on so I might have missed it. A guy was tapping on the glass like a kid taps a fish tank and it ticked her off.  Well I guess the average Bromley resident is as smart as a fish. That's not very nice. (*Is a bromley resident*)  two friends were sparring and a bunch of childish residents treated it as a joke and a spectacle. i would be upset too. although i'm confused as to how and why they chose this arena for their bout.      What the fuck was it? Anyone got a link or care to explain? This title and all the comments are confusing the hell outta me Guy and a girl were apparently kickboxing in a room that had glass walls (I have no idea why such rooms exist but apparently they have them at Bromley). A bunch of people were watching, and some kid was tapping something (an umbrella?) on the glass wall with all the enthusiasm of [this kid](http://3432-chicago.voxcdn.com/files/2013/02/kid.gif). The girl walked over and kind of hit the glass with her boxing glove. Then the guy walked over and punched straight through it.  Well im really upset that video is gone..    Is it just me, or are there only Bromley kids on this Illinois Confessions website? O.o   [deleted] Remove it form the internet? Surely you jest!\n\nAlso, how in the hell did it get on the internet in the first place? Also, don't do stupid shit and then complain that people find out about it.\n\nIn short, you can't un-internet anything. I realize that, haha but at least get it deleted of of /r/UIUC. I know personally the people from the video, and they want it taken off of here. The video is no longer on Youtube. The one person who (apparently) posted personal information here deleted his post.\n\nSo I don't really see anything worth removing at the present. I realize that, haha but at least get it deleted of of /r/UIUC. I know personally the people from the video, and they want it taken off of here. Then they shouldn't have recorded it, or been doing this in private... [deleted] You can see from the video what room the people that filmed this are in.  Ask them to take it off youtube if anything.  \n\nEDIT: its off youtube, spoke too soon.  [deleted]",
    "url" : "http://youtu.be/adYlxSEdosg"
  }, {
    "id" : 32,
    "title" : "Questions about CPM",
    "snippet" : "So i just lease with CPM, ehh couldnt be worse than IT right? But the threads i see here make me kinda worried. Anything you guys recommended to keep them from fucking me over?\n\nAnd if anyone has some knowledge of the law. Why is it that they are able to legally go into your apartment while you are not their, and show it to strangers? Like they have literally taken me into apartments where halfway through the tour a girl would come out of her bedroom half asleep like \"who are you people\".  I'm in the minority here that I didn't really have any major issues with CPM. I lived in one of their nicer apartments, 6th and Stoughton last year. It was brand new when I moved in, so there were no issues with things inside the apartment. They did however tell us a couple times that we didn't pay rent when we did, but we sorted those issues out easily. We got our whole security deposit back because we got someone to sign a lease on our place for the following year while living there. I suggest you figure out a way to do that because they will try to screw you out of your security deposit. I'm in the minority here that I didn't really have any major issues with CPM. I lived in one of their nicer apartments, 6th and Stoughton last year. It was brand new when I moved in, so there were no issues with things inside the apartment. They did however tell us a couple times that we didn't pay rent when we did, but we sorted those issues out easily. We got our whole security deposit back because we got someone to sign a lease on our place for the following year while living there. I suggest you figure out a way to do that because they will try to screw you out of your security deposit. wait wait... why would you have to get someone to sign in order to get your security deposit back?   It is against the law... depending on where you live.  In Urbana, I'm pretty sure you must give advanced notice of over 24 hours.  The good landlords on campus will do this as well, though CPM is not a good company.  \n\n\nHere is the relevant portions of Urbana munipal code.  Class is starting, so GL finding Champaign's.  \n\n&gt;Sec. 12.5-15. - Landlord's right to access.\n\n&gt;(a)\nThe tenant shall not unreasonably withhold consent to the landlord to enter the rental unit in order to inspect the premises, make necessary or agreed repairs, supply necessary or agreed services, make alterations or improvements if such alterations or improvements do not interfere with the tenant's use of the premises, or to show the rental unit to prospective or actual purchasers, mortgagees or tenants.\n(b)\nThe landlord shall not abuse the right of access to the rental unit or use it to harass the tenant. Except in cases of emergency or by mutual consent, the landlord or landlord's agents shall not enter the rental unit without first providing the tenant with at least twenty-four (24) hours advance notice of the entry and may enter only at reasonable times. Reasonable times shall be considered 10:00 a.m. to 8:00 p.m. on weekdays and 11:00 a.m. to 8:00 p.m. on weekends, or such other times agreed upon by the tenant and the landlord.\n(c)\nFrom the time that either the landlord or the tenant notifies the other party that the rental agreement will not be renewed, the landlord shall have the right to access, without twenty-four (24) hours advance notice, for the purpose of showing the rental unit to prospective tenants, provided that:\n(1)\nThe rental unit has not already been leased for the twelve-month period subsequent to the expiration of the rental agreement;\n(2)\nThe landlord enters only during two (2) specific one-hour periods on weekdays and three (3) specific one-hour periods on weekends, selected by the tenant from among choices offered by the landlord, during which the landlord will have daily access; and\n(3)\nThe landlord shall notify the tenant when the rental unit has been leased for the twelve-month period subsequent to the expiration of the rental agreement. CPM and University Group tapes a calendar on your door every month stating what times they are planning on showing your apartment which is basically giving advance notice. A few other companies such as PPM give a call 24 hours before. It is against the law... depending on where you live.  In Urbana, I'm pretty sure you must give advanced notice of over 24 hours.  The good landlords on campus will do this as well, though CPM is not a good company.  \n\n\nHere is the relevant portions of Urbana munipal code.  Class is starting, so GL finding Champaign's.  \n\n&gt;Sec. 12.5-15. - Landlord's right to access.\n\n&gt;(a)\nThe tenant shall not unreasonably withhold consent to the landlord to enter the rental unit in order to inspect the premises, make necessary or agreed repairs, supply necessary or agreed services, make alterations or improvements if such alterations or improvements do not interfere with the tenant's use of the premises, or to show the rental unit to prospective or actual purchasers, mortgagees or tenants.\n(b)\nThe landlord shall not abuse the right of access to the rental unit or use it to harass the tenant. Except in cases of emergency or by mutual consent, the landlord or landlord's agents shall not enter the rental unit without first providing the tenant with at least twenty-four (24) hours advance notice of the entry and may enter only at reasonable times. Reasonable times shall be considered 10:00 a.m. to 8:00 p.m. on weekdays and 11:00 a.m. to 8:00 p.m. on weekends, or such other times agreed upon by the tenant and the landlord.\n(c)\nFrom the time that either the landlord or the tenant notifies the other party that the rental agreement will not be renewed, the landlord shall have the right to access, without twenty-four (24) hours advance notice, for the purpose of showing the rental unit to prospective tenants, provided that:\n(1)\nThe rental unit has not already been leased for the twelve-month period subsequent to the expiration of the rental agreement;\n(2)\nThe landlord enters only during two (2) specific one-hour periods on weekdays and three (3) specific one-hour periods on weekends, selected by the tenant from among choices offered by the landlord, during which the landlord will have daily access; and\n(3)\nThe landlord shall notify the tenant when the rental unit has been leased for the twelve-month period subsequent to the expiration of the rental agreement. If you sign a lease that states \"prior day,\" rather than 24 hrs, and MHM interprets it to be any time during the prior day (or night) have I released my tenant rights?   So are they affiliated with the University at all, with a name like CPM. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1834tz/questions_about_cpm/"
  }, {
    "id" : 33,
    "title" : "Look what's going to open soon:",
    "snippet" : "  Serious question: why is everyone so excited about this? It's just Wendy's. Granted, it's better than a lot of other fast food places, but there's MUCH better restaurants on Green than Wendy's.\n\nedit: just to clarify, I do like Wendy's. I'm just curious about all the hype. I think it's because it's new. Variety is always nice. It's also really cheap, and I'm not aware of many really cheap options on Green. Yeah, being able to quickly stop in and grab a burger or a frosty is a tempting idea. Plus, it'll be open late so after the bars close, hopefully we'll be able to stop by there. I think it's because it's new. Variety is always nice. It's also really cheap, and I'm not aware of many really cheap options on Green. Cravings? True! Cravings is pretty cheap, and it's really good! However, they don't have that value menu. Cravings is not cheap...\nA meal for $12 where I can get a meal at Wendys for $4 Serious question: why is everyone so excited about this? It's just Wendy's. Granted, it's better than a lot of other fast food places, but there's MUCH better restaurants on Green than Wendy's.\n\nedit: just to clarify, I do like Wendy's. I'm just curious about all the hype. Serious question: why is everyone so excited about this? It's just Wendy's. Granted, it's better than a lot of other fast food places, but there's MUCH better restaurants on Green than Wendy's.\n\nedit: just to clarify, I do like Wendy's. I'm just curious about all the hype. Yeah... Everyone does realize that this is just a crappy fast food restaurant, right? Yeah... Everyone does realize that this is just a crappy fast food restaurant, right? Serious question: why is everyone so excited about this? It's just Wendy's. Granted, it's better than a lot of other fast food places, but there's MUCH better restaurants on Green than Wendy's.\n\nedit: just to clarify, I do like Wendy's. I'm just curious about all the hype. Serious question: why is everyone so excited about this? It's just Wendy's. Granted, it's better than a lot of other fast food places, but there's MUCH better restaurants on Green than Wendy's.\n\nedit: just to clarify, I do like Wendy's. I'm just curious about all the hype.  A block from my apartment, too! By the way, what fucktard went through here and downvoted every single comment to zero? This is America and if you don't like it you kin git out.  There was one on Sixth and Green years ago, where Noodles &amp; Co. is now. It was torn down in the early 2000s.   Eating lunch at Penn Station and walking over for a Frosty afterwards is something I am looking forward to very much.   I might go back for a second degree just to do this daily.  It's always the year AFTER I leave when the good shit happens.  Why are there so many downvotes all over this thread? Why are there so many downvotes all over this thread? I downvoted about 15 things here because the comments had no content; it was nothing personal.    What day does it open? I believe next tuesday  Line will be too long to eat there until at least the summer  I'm really hoping that this is better than the one up on Prospect. I've eaten there a couple times and half the time there's something wrong with my order or the food just isn't good. So I'm hoping this is different management and that it's run better.  I'm really hoping that this is better than the one up on Prospect. I've eaten there a couple times and half the time there's something wrong with my order or the food just isn't good. So I'm hoping this is different management and that it's run better.  I'm really hoping that this is better than the one up on Prospect. I've eaten there a couple times and half the time there's something wrong with my order or the food just isn't good. So I'm hoping this is different management and that it's run better.  &gt; or the food just isn't good\n\nThat might be because you are eating at Wendy's. Then you've just never been to a good Wendy's.    I can't tell from the picture, What corner is that? 6th and green. Across from flat top.\n    What happened to that shitty liquor store? What happened to that shitty liquor store?  Wait, you all have Sonic, Five Guys, Chick-fil-a, AND Chipotle and you're excited about WENDY'S?\n\nEdit: Whoa, whoa, easy with the downvotes...I'm just saying, there's been a Wendy's in Decatur for like the past 2 years and it got old after like two weeks. I'd give my left nut for easy access to a Chipotle. Chik-fil-a is the only one of those on campus and it's not even a real one. Can't be Chik-fil-a without peach shakes in the summer. Wait, you all have Sonic, Five Guys, Chick-fil-a, AND Chipotle and you're excited about WENDY'S?\n\nEdit: Whoa, whoa, easy with the downvotes...I'm just saying, there's been a Wendy's in Decatur for like the past 2 years and it got old after like two weeks. I'd give my left nut for easy access to a Chipotle. Chipotle doesn't really qualify as a fast food place in my book. It is neither fast nor cheap. There is always a line till the door and for that price you can have a meal at a Mexican restaurant with chips, salsa, service and a guaranteed place to sit. Ordering online is a lifesaver. I love walking past everyone in line, picking up my food, and looking like a proud motherfucker on my way out the door.\n\n(but Super Taco &amp; Mas Amigos are both much better options) Good idea, but unless I go there in person I don't get to try out the [tricks](http://www.reddit.com/r/AskReddit/comments/s376a/my_uncle_orders_his_mcdonalds_fries_with_no_salt/c4aw2zh) I've recently learned to get the most bang for the buck (almost 7 bucks) at Chipotle. You can probably get away with doing that online. They let you get both kinds of beans at no charge, and you can ask for whatever in the comments. I dunno if they'd give you 2 tortillas though.  Oh Green Street, you used to be great.",
    "url" : "http://imgur.com/Y0MFQw2"
  }, {
    "id" : 34,
    "title" : "UI crew safely detonates WWII explosive in Catlin",
    "url" : "http://www.news-gazette.com/news/courts-police-and-fire/2013-02-07/ui-crew-safely-detonates-wwii-explosive-catlin.html"
  }, {
    "id" : 35,
    "title" : "TIL that there is a live feed from a camera on top of Foellinger overlooking the quad.",
    "snippet" : "   ",
    "url" : "http://illinois.edu/about/tours/quadCam.html"
  }, {
    "id" : 36,
    "title" : "Personal Training at the ARC?",
    "snippet" : "Hey all, so I know there was a post about this last semester, but I wanted to see if anyone had any experience with the Personal trainers at the ARC. \n\nA bit of background, I'm a guy. I run a bit, but I want to start putting on muscle. I'm an absolute beginner when it comes to working with weights and lifting. I'm thinking about getting a trainer at least once a week to learn how to lift/so I don't kill myself, etc. \n\nAnyway, any experiences, recommendations for trainers?  I humbly recommend you stay away from trainers and instead suggest you hit up /r/fitness and 4chan's /fit/ Ignoring quality issues (I can't speak as to the quality of personal trainers, so we'll ignore that), for many people spending money on something psychologically affects how they view it.  \n\nIf you have paid for an appointment, it is a lot easier to make sure you put the time/consistency in, and for many people, this can be very important to make sure they follow through.\n\nFor many people (myself in the past) consistency is more important than the quality of their workout, and I feel a small investment to ensure that isn't a bad thing. Ignoring quality issues (I can't speak as to the quality of personal trainers, so we'll ignore that), for many people spending money on something psychologically affects how they view it.  \n\nIf you have paid for an appointment, it is a lot easier to make sure you put the time/consistency in, and for many people, this can be very important to make sure they follow through.\n\nFor many people (myself in the past) consistency is more important than the quality of their workout, and I feel a small investment to ensure that isn't a bad thing. &gt; for many people spending money on something psychologically affects how they view it. \n\nMight not work for everyone though. I paid $50 for a group fitness pass one semester thinking it would motivate me to go to the gym to get my money's worth, but I went to exactly 3 classes that semester. In general I think gym memberships are often underutilized, people buy a membership as a New Year's resolution and then give up on it after the first few weeks. I humbly recommend you stay away from trainers and instead suggest you hit up /r/fitness and 4chan's /fit/ Why is that? My roommate is a NASM certified personal trainer, and he has been for 4 years now. I'm fairly certain he knows what he is doing. Plus 1-on-1 personal training is only 25$ per session or 20$ per session if you buy 10 sessions, which is fairly cheap. Why spend money on something you can get for free? My roommate is also a trainer, and he's legit, but OP would likely reach his goals just as fast with an experienced workout partner. Oh I completely agree, but if OP had an experienced workout partner to learn from, they probably wouldn't be posting this.  I humbly recommend you stay away from trainers and instead suggest you hit up /r/fitness and 4chan's /fit/  I'm going with what logged_in_for_this said: stay away from the personal trainers. If you want to learn how to lift, I can guarantee someone from Illini Bodybuilding Club or Illini Powerlifting would be happy to teach you. I'd personally be happy to teach you if you are free to hit the ARC in the evenings. Any of these options would allow you to build muscle a lot more efficiently than what most PTs can offer you.\n\nWith that said, if you're bent on going with a personal trainer, I would highly recommend going with Matt Clark or Sergio Luna. I know them personally, and they take training very seriously. Can vouch for Sergio, here. Workout buddy (to some degree) of mine. Dude definitely knows what he's talking about and doing and he's just an overall great guy, too. Yeah, definitely! I feel like he's one of few who are actually driven to be a PT or in the RST program. It really is his thing.\n\nBtw, do I know you? I'm James, the guy who started the Illini Bodybuilding Club. Okay, next question... I don't know if you're the right person to ask, but if I do want to work with Sergio, do I still have to fill out this [sheet](http://www.campusrec.illinois.edu/personalTraining/) online?\n\nIt seems like that would randomly assign me a trainer, and I'd rather work with one of the people you recommended.  Yeah, definitely! I feel like he's one of few who are actually driven to be a PT or in the RST program. It really is his thing.\n\nBtw, do I know you? I'm James, the guy who started the Illini Bodybuilding Club. Nah, probably not. My name's Kelton and I've worked in with him a couple times and chat with him every time we're both down there now. I generally work out alone but have considered joining one of the groups (powerlifting/bodybuilding) for the social aspect or advice/pointers. Ah, okay. Yeah, you should join the Facebook page. If you see someone in a club shirt, feel free to say hi too. I'm going with what logged_in_for_this said: stay away from the personal trainers. If you want to learn how to lift, I can guarantee someone from Illini Bodybuilding Club or Illini Powerlifting would be happy to teach you. I'd personally be happy to teach you if you are free to hit the ARC in the evenings. Any of these options would allow you to build muscle a lot more efficiently than what most PTs can offer you.\n\nWith that said, if you're bent on going with a personal trainer, I would highly recommend going with Matt Clark or Sergio Luna. I know them personally, and they take training very seriously. I'm a co-worker of Sergio's and can also vouch for him. He is amazing at what he does and has an incredible view on fitness/lifting/nutrition etc. You should definitely make an appointment to meet with him. You won't regret it.  Hey, how do I make an appointment to meet him, like I said earlier, it seems like I'm just supposed to fill out a form and they assign someone to me. \n\nIs there any way I can request him?  I've met and talked with several of them and they are nice people.\n\nThat being said, personal trainers are best for people who just can't get motivated to go to the gym for any reason. Their business model exists to get you to keep paying them, when in reality a personal trainer could teach you everything you need to stop requiring their services in four or five sessions. If you're an *absolute* newbie, my recommendation would be to buy [this book](http://www.amazon.com/Starting-Strength-3rd-Mark-Rippetoe/dp/0982522738/ref=sr_1_1?ie=UTF8&amp;qid=1360247917&amp;sr=8-1&amp;keywords=starting+strength). It's not the end-all be-all of weight training, but it's the best I know of for a beginner.\n\nAs to the ARC trainers specifically, I have seen some of them doing good work, and others doing bullshit bosu ball core crap. I have seen at least one training clients to squat with improper form. They may be correcting their form over a few sessions. After they get hurt?    I am a current client of a personal trainer at the ARC (Sergio). I have been working with him for almost a month now. As a student who started off as a complete beginner (I had a trainer for 3 months last semester) having a trainer helps immensely. I *highly* recommend a personal trainer if you can afford it. Having someone who is NASM certified to construct your fitness plan based on your own personal goals is completely worth it. \n\nAlso having a personal trainer is great for instruction. It's not always how much you train or what you do, it's *how* you do it. Technique in the beginning is essential to ensure that you don't get hurt and that your training is more fruitful. \n\nYou probably won't need a personal trainer forever. You are constantly learning while you're training. Also think of all that money you spend as an investment in your future, being a healthy, fit person. It would be a shame to spend that money on medical bills from being out of shape or overweight. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/181x4o/personal_training_at_the_arc/"
  }, {
    "id" : 37,
    "title" : "Illinois football: Coming off poor season, Illinois satisfied it addressed needs in recruiting class",
    "snippet" : "  ",
    "url" : "http://www.chicagotribune.com/sports/college/ct-spt-0207-illinois-signing-day-football--20130207,0,1678344.story"
  }, {
    "id" : 38,
    "title" : "Why is Cravings closed?",
    "snippet" : "I tried going there yesterday at around 6 pm and it was closed and when I drove by just now it was also closed. I haven't looked at any signs on the door or anything but what gives? Surely they didn't go out of business, they are always packed.  Chinese new year? Chinese new year?  perhaps the miasma made it to sea level again  Health violation? It isn't the first time.\n\nhttp://cu-citizenaccess.org/content/health-officials-temporarily-shutter-2-restaurants-fail-7-others-during-february-inspections That article is from March 2012. Yes I know it's from March 2012. My point is that it isn't the first time Cravings has received a health violation so perhaps they received one again and had to temporarily close down for a clean up. you have to fail like 400 of them before you're forced to close Not if you're the Illini Inn. you have to fail like 400 of them before you're forced to close That article is from March 2012. Health violation? It isn't the first time.\n\nhttp://cu-citizenaccess.org/content/health-officials-temporarily-shutter-2-restaurants-fail-7-others-during-february-inspections  the owner of cravings once told me that they only are closed twice a year: christmas and thanksgiving day... the owner of cravings once told me that they only are closed twice a year: christmas and thanksgiving day...  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/181hzp/why_is_cravings_closed/"
  }, {
    "id" : 39,
    "title" : "Running stairs in Memorial Stadium?",
    "snippet" : "I've heard the stadium is left open at times but to this point its all been hearsay. Does anyone actually know if they actually do leave it open / if you can run stadium sprints there?      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/181xog/running_stairs_in_memorial_stadium/"
  }, {
    "id" : 40,
    "title" : "/r/UIUC should take over Student Senate --- Mandatory ISS election meeting TONIGHT",
    "snippet" : "\"Students interested in running for any of the above positions are required to attend a MANDATORY informational meeting on Wednesday, February 6, 2013 at 7:30 PM in the College of Law building, Room D.\"\n\nhttp://studentelections.illinois.edu/      ",
    "url" : "http://www.reddit.com/r/UIUC/comments/180xxu/ruiuc_should_take_over_student_senate_mandatory/"
  }, {
    "id" : 41,
    "title" : "How can I remotely access files on EWS machines?",
    "snippet" : "I'm working remotely on a project and would like to use an image file from my computer in the project. However, I don't know how I could push the file to my account on the EWS machines from my computer, short of SSHing, opening a browser, going to dropbox, and downloading through there.  WinSCP will work great! \nand you can use the same remlnx.ews.illinois.edu address and transfer files seamlessly         I use 'scp' command for such things. For how to use it just google or man it up.",
    "url" : "http://www.reddit.com/r/UIUC/comments/181zc4/how_can_i_remotely_access_files_on_ews_machines/"
  }, {
    "id" : 42,
    "title" : "Yin-yang at UGL",
    "snippet" : "  I've always wondered is it supposed to be like that? Or is that just some consequence of it being underground and the path of the sun through the sky? I've always wondered is it supposed to be like that? Or is that just some consequence of it being underground and the path of the sun through the sky? the melted part is dirt\nthe black soil absorbs heat, melting the snow\n\nthe white part is mulch. the snow stays because it does not melt in the sun\n\nthe yin yang is always there, except normally it is mulch/dirt not snow/dirt\n\n Doesn't half of it usually have plants growing in it during the warmer months?  ",
    "url" : "http://i.imgur.com/yJoZSPh.jpg"
  }, {
    "id" : 43,
    "title" : "Has anyone ever stopped to talk to one of those ranty religious guys on campus?",
    "snippet" : "I just wanted to know things like what denomination they are, maybe their motivation, etc.  But being me, I wouldn't feel comfortable actually going up and talking to them while thousands of people stream by and I have to get to class.  Probably the biggest one is this guy named [Brother Jed](http://www.brojed.org/), who you can read more about on his website. I'm honestly not even sure he's in it for the Jesus stuff anymore. Most of the time he's just telling stories about his college-aged debauchery, but when he's not doing that, he's advocating for hate of and discrimination against homosexuals. \n\nI'm in a campus nonreligious group called the [Illini Secular Student Alliance](http://www.illinissa.com/), and we try to have some fun with him every time he comes around. He's so predictable that last fall we showed up with bingo cards of everything we knew he was going to say. [Here are some pictures](http://imgur.com/a/FJfQV#0). I'm really glad you can make somebody else's hurfulness into a lighthearted dare I say, social event?  It looks like a lot of fun.  As a Christian, these type of people drive me nuts, because I feel like it paints us as haters.  Thanks for the info! Probably the biggest one is this guy named [Brother Jed](http://www.brojed.org/), who you can read more about on his website. I'm honestly not even sure he's in it for the Jesus stuff anymore. Most of the time he's just telling stories about his college-aged debauchery, but when he's not doing that, he's advocating for hate of and discrimination against homosexuals. \n\nI'm in a campus nonreligious group called the [Illini Secular Student Alliance](http://www.illinissa.com/), and we try to have some fun with him every time he comes around. He's so predictable that last fall we showed up with bingo cards of everything we knew he was going to say. [Here are some pictures](http://imgur.com/a/FJfQV#0).  Not a ranty religious guy but I had a great conversation with a Buddhist monk on the quad for about 20 minutes during some down times between classes back in September. He invited me to a vegetarian/vegan feast at the Red Herring afterwards.    [Obligatory response](http://i.imgur.com/aQZHy.gif)   [deleted] Surprisingly enough, despite the fact that there is an [LDS institute on Lincoln &amp; Illinois](https://studentview.ldschurch.org/Home.aspx/60430), I've never seen them prostletizing on campus during the school year. During the summer is a whole new ball game however. Surprisingly enough, despite the fact that there is an [LDS institute on Lincoln &amp; Illinois](https://studentview.ldschurch.org/Home.aspx/60430), I've never seen them prostletizing on campus during the school year. During the summer is a whole new ball game however. A pair came up to me once when I was filling up at the gas station right next to it. Chatted for a bit, not bad people but they were really weasely when asked about Joseph Smith's history of making shit up and how there is no lingusitc or genetic link between Native Americans and Semites.  I've met a few Mormons, and yeah, that sounds really accurate.  Super nice people, but when it comes to religion, it seems like they just love to argue/debate.  Honestly, I'm pretty firmly rooted in my beliefs.  They won't be able to change me one bit.  But its interesting to hear things from their perspective. They didn't really argue/debate, they just attempted to dodge the subject of Joseph Smith's reputation, the characters that Lucy Harris copied being declared nonsense, or how Joseph Smith was unable to reproduce the Book of Lehi when the original manuscript was lost. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/180gvw/has_anyone_ever_stopped_to_talk_to_one_of_those/"
  }, {
    "id" : 44,
    "title" : "Need a Valentine's Day Gift? Phi Mu Alpha Sinfonia is selling Singing Valentines!",
    "snippet" : "Let the brothers of Phi Mu Alpha Sinfonia make this Valentines Day memorable with a singing quartet to serenade your special someone! Packages include: \n* Quartet, Rose, AND Chocolate for $12\n* Quartet, Rose, OR Chocolate for $10\n* Quartet Only for $8\n* Quartet via Phone or Skype for $5\n\nContact Us at singing2_14@yahoo.com or Stop by the Music Building South Lobby to purchase. \n   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/1804o1/need_a_valentines_day_gift_phi_mu_alpha_sinfonia/"
  }, {
    "id" : 45,
    "title" : "Where can I go to get my computer fixed?",
    "snippet" : "My computer won't successfully start up (and yes, it is plugged in). It keeps bringing up \"windows startup repair\" and then reporting that it cannot find the issue which I believe means it is a hardware problem. I also am fairly certain I know what the problem is but I am not computer savvy enough to fix it myself. Where can I take it on campus to get it fixed?  [Computer Deli](http://www.computerdeli.com/) I can't recommend this place enough. Computer deli does great work and is very inexpensive. I guess it depends on the problem... I went there with a broken laptop screen wondering if they could replace it. The guy spent a couple of minutes trying to find the appropriate screen for the model of my laptop to no avail, telling me that Sony screens are especially hard to come by. Anyways, after failing at that finding one, he ended up suggesting that I leave the laptop with them and gave me a rough estimate for fixing the screen: $150 for a new screen and then $120-something for the labor, plus a suggested $40 \"diagnostic\".... which is honestly ridiculous. I left the store with my laptop, refusing to pay such a ludicrous price for a simple procedure and searched online for a replacement screen. Found the one I needed within a minute on amazon for 50 bucks, and a tutorial video on how to replace the screen myself. I spent a total of 60 bucks for the screen and tools and ten minutes of labor vs. their $270 quote. I'm sure my story is a rare sour note, but I honestly felt like they tried to milk me for my money. [Computer Deli](http://www.computerdeli.com/) where is it?  What do you think the problem is? What do you think the problem is? this is the point in the semester where hard drives love to take a shit and die  Illini Union Tech Zone in the union - very reasonable in price, very knowledgeable - one of them did an AMA here this week.     Find a friend that's an engineer. They will either fix it or find someone that knows how to fix it. You get extra speedy customer service if you're female.\n\nSource: I'm an engineer and I know everything there is to know about computers, and so do all my friends. Being an engineer doesn't automatically mean you know anything about computers. I can't tell you the number of people that say the \"I'm an engineer\" thing when they insist they have a bad wireless card and refuse to accept that maybe nuking all the registry values in CCleaner constantly or nuking whatever malwarebytes picks up in its excessive dragnet isn't a good idea.  Being an engineer doesn't automatically mean you know anything about computers. I can't tell you the number of people that say the \"I'm an engineer\" thing when they insist they have a bad wireless card and refuse to accept that maybe nuking all the registry values in CCleaner constantly or nuking whatever malwarebytes picks up in its excessive dragnet isn't a good idea.  &gt;Being an engineer doesn't automatically mean you know anything about computers.\n\nOf course, I was kidding. However, finding a friend is probably a good first option, since there are a ton of people around that know enough about computers to fix most problems.   I work Engineering IT and have a lot of on-the-side experience, I would be happy to take a look at it for you. No guarantees I can fix it, but I'll only charge you if I do ;) would you mind?",
    "url" : "http://www.reddit.com/r/UIUC/comments/180uob/where_can_i_go_to_get_my_computer_fixed/"
  }, {
    "id" : 46,
    "title" : "Cockblocked CPM today",
    "snippet" : "So a CPM worker came to show my apartment today and while she was showing it she told the person that it would be remodeled and receive new appliances. I interrupted her and told the person that CPM promised me the same thing and it still had not been done. The worker looked shocked and tried to do some damage control but it was too late the person lost interest. Felt good to stick it to them for once  Watch it come out of your security deposit. Seriously watch out, CPM specifically will look for ANY little thing to fuck you over. They aren't above making shit up, too. Take as many pictures as you can before you move out in case they try to pull something. Seriously watch out, CPM specifically will look for ANY little thing to fuck you over.  GET IT IN WRITING. We've already gotten fucked over with being promised remodeling. There's an enforceable contract if it's an oral representation relating to the lease. \n\nBut good luck proving it. What these guys said. Get it in writing. There's an enforceable contract if it's an oral representation relating to the lease. \n\nBut good luck proving it. What these guys said. Get it in writing. Why hello fellow Law alum on Reddit! What year? 2011. How's it going, SB?\n-BL Ah yes. Makes sense. Don't blow me in for redditing at work. Or out me for being an asshole to people online. Ah yes. Makes sense. Don't blow me in for redditing at work. Or out me for being an asshole to people online. GET IT IN WRITING. We've already gotten fucked over with being promised remodeling. I've gotten it in writing and still not had it happen before. Mind you, this was 4-5 years ago. We had remodeling written into our lease. When we moved in, none of it was done. The management (Barr, by the way, and I'm not above calling them out publicly) claimed they were behind in the schedule and they would have it done \"within the next two weeks.\" Also our apartment hadn't been repainted, the carpet hadn't been cleaned, and there was a fucking hole in the wall of one of the bedrooms that was covered with white duct tape. So anyway, multiple weeks pass with no remodel, and we went in personally to complain. We were basically told to \"fuck off.\" Went directly to the tenant union from there. It was a Friday afternoon. Monday morning, the remodeling began.\n\nTL;DR Contact the tenant union with ANY problems with your management. They are awesome and it's a free service (well, free insomuch as you've already paid for it so you may as well use it). If it's any consolation, Barr has more or less disbanded.  And absorbed by University Group. Granted, I've never rented from either, but I'd hardly call that an upgrade. Mind you, this was 4-5 years ago. We had remodeling written into our lease. When we moved in, none of it was done. The management (Barr, by the way, and I'm not above calling them out publicly) claimed they were behind in the schedule and they would have it done \"within the next two weeks.\" Also our apartment hadn't been repainted, the carpet hadn't been cleaned, and there was a fucking hole in the wall of one of the bedrooms that was covered with white duct tape. So anyway, multiple weeks pass with no remodel, and we went in personally to complain. We were basically told to \"fuck off.\" Went directly to the tenant union from there. It was a Friday afternoon. Monday morning, the remodeling began.\n\nTL;DR Contact the tenant union with ANY problems with your management. They are awesome and it's a free service (well, free insomuch as you've already paid for it so you may as well use it). I've gotten it in writing and still not had it happen before. If you get it in writing, can't you take it to student legal services if they don't follow through? If you get it in writing, can't you take it to student legal services if they don't follow through?   I had the opposite experience this year -- made my landlord (Bankier) put a couple of things in the lease to improve, and they made vague noises about fixing it up a bit, but I didn't expect anything more than what I had put in the lease. Moved in to the promised improvements, plus all new carpet and new light fixtures. I'm still pleasantly shocked.  yea, I had Bankier as my landlord last year and was pretty happy with them I have them this year and am going to sign with them again next year. The people in the office are just genuine and nice people that are really helpful when you have a problem. No big complaints from me so far. Really? I always got the slimy-car-salesman feeling from them. I called them to get parking for my current apartment last year and I was assured that there were over 5 garage parking spots left, and was quoted prices for indoor and outdoor parking. I showed up the next day, and suddenly all the garage parking spots were taken and the prices for outdoor parking had gone up $10. I haven't really trusted them since then. I had the opposite experience this year -- made my landlord (Bankier) put a couple of things in the lease to improve, and they made vague noises about fixing it up a bit, but I didn't expect anything more than what I had put in the lease. Moved in to the promised improvements, plus all new carpet and new light fixtures. I'm still pleasantly shocked.  I had the opposite experience this year -- made my landlord (Bankier) put a couple of things in the lease to improve, and they made vague noises about fixing it up a bit, but I didn't expect anything more than what I had put in the lease. Moved in to the promised improvements, plus all new carpet and new light fixtures. I'm still pleasantly shocked.      I'm thinking about leaving a big note next to the door telling the horrors of living with CPM to warn people even when I'm not there as they show it. I think if everyone living with CPM does that the company might be forced to actually do their job You should post the note all over campus, there are so many new inexperienced renters that fall into cpm's trap every school year. \nMaybe if enough word got out, cpm could end up with a loss and consider improving their business practices...? Will do. Similar to the lex campaign a few years back. They sured saved me when I was a freshman. And now the lex is no more. Lex is back in business, but operating on a much smaller operation. Lex had many faults, but the owner of suburban express is just a dick. The only good options left are megabus, peoria charter, greyhound, and amtrak. Sadly, none of those are as convenient as suburban express. I thought it was Lincolnland Express? **L**incolnland **Ex**press = LEX.   I am aware... what is suburban express though? SEX? Lex is back in business, but operating on a much smaller operation. Lex had many faults, but the owner of suburban express is just a dick. The only good options left are megabus, peoria charter, greyhound, and amtrak. Sadly, none of those are as convenient as suburban express. Will do. Similar to the lex campaign a few years back. They sured saved me when I was a freshman. And now the lex is no more. Hmmm...their site is still up and running. Looks like you can still buy tickets, but I haven't seen any lex buses around town lately. ----&gt;http://www.lincolnlandexpress.com/ I'm thinking about leaving a big note next to the door telling the horrors of living with CPM to warn people even when I'm not there as they show it. I think if everyone living with CPM does that the company might be forced to actually do their job  I started to wonder if cockblocked was the right verb and then I remembered that they truly do fuck their tenants.\n\nedit: I accidentally double posted this. But fuck it because karma.     Yeah I know there isn't a legal basis to claim they were supposed to remodel. I asked them to add it to the lease but they gave me some corporate response saying there was no need to blah blah blah and it was already June and it was the last 1bdr under $600 in west campus. So it was that or I had to go live in Urbana not close to my classes. Regardless it felt good to take a stab at them for once. Its not like they ever give back deposits anyway  lessee of CPM here, I had very low expectations from all that I heard about cpm. While living in my apartment all year, they have fixed things that we didnt even ask for, changed ALL the mattresses and box springs within a day of the inquiry, remodeled the cabinets cause we asked them too, and patched a hole in the wall... Everyone needs to learn how to fix small things and stop expecting everything to be done at their whim. Other people are just as busy as you.  They promised me brand new carpet and showed me this awesome apt... it was not the apartment they gave me the keys to.\nInstead, I got an apartment infested with bedbugs and doors that weren't secure.  So I signed a lease with CPM for next year. What exactly is so terrible about them, and what alternatives are there on campus. I looked into roland and jsm, their stuff is way to expensive.  They just neglect buildings until the last possible minute. They will penny pinch and cut as many corners as possible. They talk out of their ass and make so many promises and offer you \"free parking pass\" (they do actually give you the pass). They are rude and come in whenever they please to show your apartment. They will asses as many fees as possible for any little thing. They come at your for bogus \"no rent paid\" claims and if you don't stand up they won't back down. My TV was stolen from them over the summer and they flat out denied that anyone was in there even though there was a note left by a CPM worker. They didn't even return calls from the police and its not like most care to go the extra mile. My friend had his laptop stolen another had his Xbox stolen. They are liars and thief's. One guy who's as bipolar as they come is Jerome. Hes the tall black guy. He's seems as professional and nice as anyone but once you lease he doesn't care what you have to say is extremely rude and condescending. All I'm all I have lived with Roland, University Group, and CPM. Even though they all cut corners somewhere CPM is flat out incompetent. They get tenants every year because of their low rents but they have the worst reviews. The other ones are worth the extra money. So I signed a lease with CPM for next year. What exactly is so terrible about them, and what alternatives are there on campus. I looked into roland and jsm, their stuff is way to expensive.  So I signed a lease with CPM for next year. What exactly is so terrible about them, and what alternatives are there on campus. I looked into roland and jsm, their stuff is way to expensive.   [deleted] ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17y7ki/cockblocked_cpm_today/"
  }, {
    "id" : 47,
    "title" : "UI proposing China-funded 'Confucius Institute' on campus",
    "snippet" : "  Can we not? We just chased a conservative group off campus because we believed it would influence academics at the university. Inviting a foreign government seems like it would do more of the same. Mandarin is a very important language that doesn't get enough exposure in the US. More people speak Mandarin than English in this world, and yet American educational institutions ignore it in favor of familiar languages like German and French. These languages have merit as well, but when you consider that most Mandarin speakers also speak English at some level, it's pretty clear that Americans are behind the curve when it comes to learning other languages. Don't be so quick to assume that this is some infiltration attempt - it has been assessed as very low risk, and it is a downright useful program to have. We let the EU and the Austrian government fund educational programs on our campus, why not give the Confucius Institute a chance? I could not find the Austrian government funded educational program here, so I cannot comment on their contributions. The EU group runs it's own degree rather than offering money to another established group on campus. Additionally the EU represents a huge chunk of Europe encompassing many ideals. The Confucius Institute is offering money to a group that already studies multiple countries in east asia. I can't find out if the money is no-strings-attached money or not. Would the Chinese government be fully OK with their money being used to study issues in Japan? If that is not the case, then this is the so called \"Influencing research priorities\" that people are worried about.\n\nEDIT: Why not support the Freeman fellows? They've been on the brink of closing for years. I am a Chinese student. I got an intern in Ministry of Foreign Affairs of People's Republic of China. From my experience in MFA-PRC,here is what I can tell you:\n1) Although China is one of a super powers country in the world, it only has economic influence. According to a survey conducted by The Times, majority of western country residents think China is a autocratic country like old Russia. It is true that China is still ruled by one party but compare to Russia or India, the \"autocratic\" government is more efficient and has more probity. The stereotype of \"undemocratic\" country ignored the fact China is trying to more democrat and a complete democratic election may not be good for China. To increase the political power and change the stereotype, it is important for foreigners know that our government is more efficient than some other democratic country, for example India or Russia. We also want foreigners know more about our culture. Not just ancient culture but also popular culture like our movie, our books our TV. The academic classes normally will not discuss modern China as the way our government want. So it is necessary for us build an institution to  show American a real China.  This is not brain washing because we just present facts, present how does our cities look, how it used to look like, our TV, our music everything... We want you to draw conclusion after seeing our achievement.  It is not a political propaganda, it is simply display how modern China looks like and then you will see the China is way much better than your thought.\n\n2) Freeman follows and some other USA scholarship are truly brain washing. They try to convince participants that they should use their experience to tell Chinese people what their government or society should be by letting them talking to normal people. But they ignore the face that what fits for America doesn't necessarily fit for China. For example, like direct election. There will be lot of bribery happened in the undeveloped area. \n\n3) True, the whole \"Confucius Institute\" program seems like a little bit political. But please understand that there exist too many misunderstanding regrading China. It is one of government's responsibility to clarify these worries. Isn't that also what USA try to do in Cuba by building culture center to let Cuban people a real America for good? We admit that we are not a real democratic country but please don't just look that part, there is also a part that you will be amazed. For example, I am a Chinese student. I like my life and my country. Though I can't use Facebook or Twitter but I still have many interesting to do. I can criticize my government if I have enough evidence showing I am right. If a local government office is corrupted I can still tell media to expose that. We are more open and transparent than you think! A fun fact, Chinese government does not have my fingerprint but USA government does! Who can tell what does that mean? It is really important for USA people know that because it already affects the business and career of normal Chinese people' lifes.  (US government rejected Huawei's acquisition , Harder for Chinese Students to Get a Work Visa in US, Worriedthat outsourced and cheap Chinese products will hit American economy) It is important for everyone know we are open and clean.\n\nSo yes, be open mind, you will see a different China through \"Confucius Institute\" Don't you enjoy the diversity Japan Garden brought to campus?\n\n\n\n To the rest of the world, what you are saying may sound brainwashed. Adult citizens being told by their government what they can and cannot do with regard to basic things like accessing information on the internet or how many children you can have will sound like a basic human rights violation to many people. From what I hear:\n\n1. The government severely restricts/monitors the internet (Facebook, twitter, certain Google searches. Surprisingly reddit is still not blocked, maybe the government doesn't know about it?). If you don't know what happens in the rest of the world and your government controls what information you can access, the way China is ruled will be the only way you know and it will seem normal to you.\n1. You don't elect your government, you have no say in how your country is run.\n1. There is a big divide between the rich and the poor - you allow the US and other developed countries to use your severly underpaid countrymen and women to produce goods for these countries.\n1. Your government tells you how many kids you can have. If you have a second one by mistake, your choices are to pay a hefty fine or abort it. Since boy children are more valued in China, I hear female foeticide is pretty common - since they can have only one child, they want it to be a boy, leading to a skewed sex ratio.\n1. The government rules with an iron fist, not allowing any dissidents, and [didn't allow the 2010 Nobel Peace Prize winner Liu Xiaobo to accept his prize](http://en.wikipedia.org/wiki/Liu_Xiaobo#Nobel_Peace_Prize), and initially even censored information about him winning the prize. \n\nI think people who grew up in a democracy would find it very disconcerting if they had no choice in electing leaders or affecting laws and policies, and if their government gets to decide what is best for them. Believe or not, you can everything you said in China are just be fine.Because we are not Iran or North Korea, to some extent, we do have speech freedom. You can say everything above we already got answer for you:\n1.True. Block information sucks. But one thing about social network is that there too many rumors. And normally people just tend to believe these rumors because they don't trust anyone besides their own family.  If you use the Chinese social website, you are personnel information will be recorded but only authorized government staffs know. So in future if anyone lied to your friend about you on Facebook and want to get evidence, they can resort to government. It is a compromising solution that both protect privacy and stop rumors.\n\n2. Election means money. We don't want to waste money on election if you no big change will be made if you elected both party.  But we do have congress called Ren min dai bao da hui , where people elected one of their neighbor represent them to reflect their concerns to government. It is kind of election. Many people hadn't done that but from inner news I have heard that, government is working on that. Soon not only people live in rural area but also people live in urban area will also get chance to elect their Ren Min Dai Biao.\n\n3.True there is big divide but another thing is living cost in China is dramatically varies in different area of China. Living cost (food electricity and housing ) will have no big difference (more than 50%) between Illinois and Montana but living cost of Beijing or Shanghai could be 100 times of the living cost of the undeveloped western China. There isn't lots of people suffered from hunger. (It is kind a big achievement, if you don't believe it, take look of India, still there are lot of people in India are suffer from hunger). The difference of rich and poor people are decreasing now because a new amendment just passed last week to charge rich people more tax and use these money to help poor people( like Obama did. But still, the tax we charged is still far less than the tax Obama charged)  So, the difference is not that big and we are working on that.\n\n4) To be fair, if we don't control population , we won't have enough food or resource, seriously can you feed those extra babies? How about let half of Chinese population immigrate to USA? We are also working on that, here is our policy now 1) if you are a minority you can still have more than one child. that's our respect to minority race , for example like Tibetatian 2) if both you and your wife are from single-child family, you are allowed to have more than one child \n\n5) Liu Xiaobo commit a criminal, trying to make a riot. You can't just based on his word, you should really say what he did. He believed that people lived in western country are more educated and thus these western countries should colonized China for 300 years to help us get used to democrat system. What a bullshit! He said lots of racist words too. (He is a racist of his own race. I feel like he just simply hate of being a Chinese and wished to born as a American white male.) And also his word did bother some innocent peoples's life and according to law he should lived in jail. Everything is legal, if you don't believe that you can check our court record. We have enough evidence to sue him. Prisoners should not leave the jail.\n\nTrue, many Chinese people are complaining about our government. But there are way much people believe that by their hard working can bring fortune to themselves and bring prosper to country. In fact, if you ask a random Chinese student in Champaign, they will say appreciate their life today and do not want the democratic changes affects our society. Government are also changing for them by putting effort on issues they really care like education (college tuition is way much cheaper in China) or health care( Beijing residents can get most of the money they spend on medical service refunded ). Without western democracy we can still survive, but without a good education and health care system, you can't even complain!\n\nAll I want to say is please, throw your our thought stereotype toward China away.\" Confucius Institute\" is a great chance for you to know a real modern China. We should appreciate it. \n\nDemocracy is not the only solution. The political system of China may turned out to be best for a country with such a huge population and could be used in other country like India, North Korea, Pakistan or Iran... Believe or not, you can everything you said in China are just be fine.Because we are not Iran or North Korea, to some extent, we do have speech freedom. You can say everything above we already got answer for you:\n1.True. Block information sucks. But one thing about social network is that there too many rumors. And normally people just tend to believe these rumors because they don't trust anyone besides their own family.  If you use the Chinese social website, you are personnel information will be recorded but only authorized government staffs know. So in future if anyone lied to your friend about you on Facebook and want to get evidence, they can resort to government. It is a compromising solution that both protect privacy and stop rumors.\n\n2. Election means money. We don't want to waste money on election if you no big change will be made if you elected both party.  But we do have congress called Ren min dai bao da hui , where people elected one of their neighbor represent them to reflect their concerns to government. It is kind of election. Many people hadn't done that but from inner news I have heard that, government is working on that. Soon not only people live in rural area but also people live in urban area will also get chance to elect their Ren Min Dai Biao.\n\n3.True there is big divide but another thing is living cost in China is dramatically varies in different area of China. Living cost (food electricity and housing ) will have no big difference (more than 50%) between Illinois and Montana but living cost of Beijing or Shanghai could be 100 times of the living cost of the undeveloped western China. There isn't lots of people suffered from hunger. (It is kind a big achievement, if you don't believe it, take look of India, still there are lot of people in India are suffer from hunger). The difference of rich and poor people are decreasing now because a new amendment just passed last week to charge rich people more tax and use these money to help poor people( like Obama did. But still, the tax we charged is still far less than the tax Obama charged)  So, the difference is not that big and we are working on that.\n\n4) To be fair, if we don't control population , we won't have enough food or resource, seriously can you feed those extra babies? How about let half of Chinese population immigrate to USA? We are also working on that, here is our policy now 1) if you are a minority you can still have more than one child. that's our respect to minority race , for example like Tibetatian 2) if both you and your wife are from single-child family, you are allowed to have more than one child \n\n5) Liu Xiaobo commit a criminal, trying to make a riot. You can't just based on his word, you should really say what he did. He believed that people lived in western country are more educated and thus these western countries should colonized China for 300 years to help us get used to democrat system. What a bullshit! He said lots of racist words too. (He is a racist of his own race. I feel like he just simply hate of being a Chinese and wished to born as a American white male.) And also his word did bother some innocent peoples's life and according to law he should lived in jail. Everything is legal, if you don't believe that you can check our court record. We have enough evidence to sue him. Prisoners should not leave the jail.\n\nTrue, many Chinese people are complaining about our government. But there are way much people believe that by their hard working can bring fortune to themselves and bring prosper to country. In fact, if you ask a random Chinese student in Champaign, they will say appreciate their life today and do not want the democratic changes affects our society. Government are also changing for them by putting effort on issues they really care like education (college tuition is way much cheaper in China) or health care( Beijing residents can get most of the money they spend on medical service refunded ). Without western democracy we can still survive, but without a good education and health care system, you can't even complain!\n\nAll I want to say is please, throw your our thought stereotype toward China away.\" Confucius Institute\" is a great chance for you to know a real modern China. We should appreciate it. \n\nDemocracy is not the only solution. The political system of China may turned out to be best for a country with such a huge population and could be used in other country like India, North Korea, Pakistan or Iran... Mandarin is a very important language that doesn't get enough exposure in the US. More people speak Mandarin than English in this world, and yet American educational institutions ignore it in favor of familiar languages like German and French. These languages have merit as well, but when you consider that most Mandarin speakers also speak English at some level, it's pretty clear that Americans are behind the curve when it comes to learning other languages. Don't be so quick to assume that this is some infiltration attempt - it has been assessed as very low risk, and it is a downright useful program to have. We let the EU and the Austrian government fund educational programs on our campus, why not give the Confucius Institute a chance? Can we not? We just chased a conservative group off campus because we believed it would influence academics at the university. Inviting a foreign government seems like it would do more of the same. Might I ask what conservative group got kicked out and why? Academy on Capitalism and Limited Government Fund.\n\nhttp://chronicle.com/article/U-of-IllinoisConserva/41752/\n\nProfessors thought it would affect the University's research. Can we not? We just chased a conservative group off campus because we believed it would influence academics at the university. Inviting a foreign government seems like it would do more of the same. Why not? They're at every other Big Ten campus - seems to work fine, and under the agreement, if we don't like it we can give them the boot after 5 years, no questions asked.  ",
    "url" : "http://www.news-gazette.com/news/education/2013-02-06/ui-proposing-china-funded-confucius-institute-campus.html"
  }, {
    "id" : 48,
    "title" : "Daily Illini: \"Despite common complaints, student senate far from a waste of money\"",
    "snippet" : "  I have twice said (on Reddit) the ISS does nothing to improve my education. This article hasn't done anything to change the factual accuracy of that statement. \n\nFacilitating a debate between students arguing within a false dichotomy? Passing resolutions that amount to nothing more than recommendations (and pointless ones at that, grade replacement for transfer credits, lol-worthy)? What the hell is the female leadership program supposed to do, and why should any of us believe the ISS knows anything about leadership? What else? Coal? Like the university administration isn't already aware of the issue. No-carry? Thanks for letting the next armed nutcase walk on to campus knowing none of us can fire back. \n\nAsking a private company to divulge their budgetary information? Here's an idea, instead of laying on some private company why don't you apply pressure to the UIUC administration to lower tuition and fees? Oh, that's right, it's an important issue directly affecting students, so obviously it isn't an issue the ISS cares about.\n\nThe article is a typical non-answer. I still do not want to give you $2 every semester.  I'm just going to respond to some of the points made:\n\n&gt;last week, we passed legislation asking that we forever be the Fighting Illini, an issue that has been on this campus since the removal of the Chief.\n\nFrom Wikipedia:  \n\n&gt;The name \"Fighting Illini\" was retained, as the NCAA rescinded its criticism of the use of the term. The name \"Fighting Illini\" pre-dates the Chief Illiniwek symbol and was bestowed upon the team in honor of Illinoisans who fought in World War I; the use of the name \"Illini\" dates to the 19th century.\n\nNice!  The senate didn't save a damn thing; people are just misinformed about where \"Fighting Illini\" actually came from.\n\n&gt;co-sponsored a well-attended debate between the College Democrats and Republicans. \n\nGood, just what everyone needs.  College aged kids arguing about politics.  So useful, and no one ever hears it enough.\n\n&gt;In November, ISS passed a resolution urging the University to divest from coal, an issue at the University for quite some time\n\nIn November, good job!  From:\n\nhttp://www.dailyillini.com/features/article_dd73d7f5-602f-5ef7-a88a-57f72fc8a8ad.html\n\n\"[Abbot is] currently in the middle of a transition away from coal, as called for by the Universitys 2010 Illinois Climate Action Plan, or iCAP. The iCAP aims to eliminate all coal use at Abbott by 2017.\"\n\nWay to be on time and relevant, ISS.  Please don't change.\n\n&gt;Just last month, we established the iRent Program and rented out free iClickers to students, saving them about $8,000.\n\nFuck you.  Get more professors to start putting the homework questions online or handed out in class, so students can buy old versions of textbooks for $20, not $200.  You know, something useful, instead of a $20 bauble that we'll use several times throughout our education.  The iclicker is probably the best thing we buy, in a uses:cost ratio.\n\n&gt;We passed a resolution urging the University to remain carry-free due to the proposed firearm changes in Illinois\n\nSo, earlier, he was talking about good debates and political views.  Shouldn't this have been decided there, instead of by the ISS?  Not that their resolution would do anything.   WE'RE IN ILLINOIS.  You're about as likely to get the government in Georgia to start handing out posters promoting abortion clinics as concealed carry on this campus.  [Oh yeah, I have a source for this:](http://www.ncsl.org/issues-research/educ/guns-on-campus-overview.aspx)\n\n&gt;there are 21 states that ban carrying a concealed weapon on a college campus: Arkansas, California, Florida, Georgia, Louisiana, Massachusetts, Michigan, Missouri, Nebraska, Nevada, New Jersey, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, South Carolina, Tennessee, Texas, and Wyoming.\nIn 23 states the decision to ban or allow concealed carry weapons on campuses is made by each college or university individually: Alabama, Alaska, Arizona, Connecticut, Delaware, Hawaii, Idaho, Indiana, Iowa, Kansas, Kentucky, Maine, Maryland, Minnesota, Montana, New Hampshire, Pennsylvania, Rhode Island, South Dakota, Vermont, Virginia, Washington, and West Virginia.\n\nIt sure is likely that Illinois, which *still* doesn't have concealed carry (yet), is going to force the campus to have concealed carry.  Good job.  The ISS, again, passes a resolution akin to \"The sun should rise tomorrow\".\n\n&gt;Many students, despite our efforts, still dont know who we are or how we can help them. Promotion is an important part to any organizations success.\n\nNo, it's just like regular politics, but to an even lesser degree (at least they can pass binding resolutions).  We've heard of the ISS (lord knows we see enough sidewalk chalk), but as long as it keeps its hands out of our pockets to do nothing and play the silly resume fluff game, we don't care.\n\n\n&gt;we avoided a possible split from the graduate delegation through committee reconstruction.\n\nDon't care.  again, stupid internal games.\n\n&gt;Although some senators may disagree with our spending, they are hypocritical in doing so. The same senators mocking our efforts actively participate in the Senates work. \n\nI'm not even sure how to begin addressing this bullshit point.\n\n&gt;The events that we host and co-sponsor are beneficial, such as the College Democrats and Republicans debate. \n\nI see why this is the point that she chose to raise again.  It's the *least* asinine \"accomplishment\".\n\n&gt;To argue that the Illinois Student Senate has done nothing this year but promote itself is incorrect. \n\nGood point!  Time and money wasted, with no real accomplisments.\n\n&gt;Rest assured, we will continue to be the voice of our constituents and welcome anyone to attend our Wednesday meetings to voice their concerns. Remember, elections are coming up, so if you want to directly change this organization, the power is in your hands.\n\n\nThe only useful part of the whole thing. Is anyone on the student senate not on it just so they have another bullet point on their resume? Is anyone on the student senate not on it just so they have another bullet point on their resume?  Does the ISS have any *real* power?  Are any of their decisions binding upon the Board of Trustees, or do they just pass non-binding resolutions expressing the \"sense of the student senate,\" similarly to how Congress declares \"Turnip appreciation day\" or \"National gravity awareness week\"?  How about you get some money to the Math department so they can stop hiring such bad teachers and being assholes about it? ",
    "url" : "http://www.dailyillini.com/opinion/letters_to_editor/article_d9685d54-701c-11e2-be0d-0019bb30f31a.html"
  }, {
    "id" : 49,
    "title" : "LYNDA has high quality video tutorials for hundreds of software - free for UIUC students! It's really neat, just discovered it today =)",
    "snippet" : "  The audio stuff on there is fantastic. I took more notes on Lynda videos than I did in my past four years of school. Which audio stuff are you referring to? I am planning to use the ableton tutorial soon.",
    "url" : "http://www.cites.illinois.edu/training/lyndatutorials.html"
  } ],
  "processing-time-source" : 79,
  "processing-result.title" : "uiuc3_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/uiuc3_reddit.xml"
  }
}