{
  "processing-time-total" : 1378,
  "clusters" : [ {
    "id" : 0,
    "size" : 9,
    "score" : 28.074598480397807,
    "phrases" : [ "Place" ],
    "documents" : [ 1, 9, 24, 29, 34, 38, 40, 43, 47 ],
    "attributes" : {
      "score" : 28.074598480397807
    }
  }, {
    "id" : 1,
    "size" : 8,
    "score" : 57.31824325915095,
    "phrases" : [ "Far" ],
    "documents" : [ 1, 7, 8, 34, 38, 43, 46, 48 ],
    "attributes" : {
      "score" : 57.31824325915095
    }
  }, {
    "id" : 2,
    "size" : 5,
    "score" : 94.8526859679703,
    "phrases" : [ "Career Fair" ],
    "documents" : [ 18, 21, 22, 40, 49 ],
    "attributes" : {
      "score" : 94.8526859679703
    }
  }, {
    "id" : 3,
    "size" : 5,
    "score" : 77.16108643549788,
    "phrases" : [ "Likely if your an International Student" ],
    "documents" : [ 12, 28, 37, 38, 43 ],
    "attributes" : {
      "score" : 77.16108643549788
    }
  }, {
    "id" : 4,
    "size" : 4,
    "score" : 61.25993350402012,
    "phrases" : [ "New Stores" ],
    "documents" : [ 8, 10, 32, 43 ],
    "attributes" : {
      "score" : 61.25993350402012
    }
  }, {
    "id" : 5,
    "size" : 4,
    "score" : 52.62079980304093,
    "phrases" : [ "Run" ],
    "documents" : [ 14, 35, 43, 46 ],
    "attributes" : {
      "score" : 52.62079980304093
    }
  }, {
    "id" : 6,
    "size" : 4,
    "score" : 64.92264077897019,
    "phrases" : [ "Study" ],
    "documents" : [ 4, 27, 36, 38 ],
    "attributes" : {
      "score" : 64.92264077897019
    }
  }, {
    "id" : 7,
    "size" : 4,
    "score" : 52.394523241455836,
    "phrases" : [ "University of Illinois" ],
    "documents" : [ 6, 9, 34, 43 ],
    "attributes" : {
      "score" : 52.394523241455836
    }
  }, {
    "id" : 8,
    "size" : 3,
    "score" : 34.38211872607005,
    "phrases" : [ "Bus" ],
    "documents" : [ 38, 43, 46 ],
    "attributes" : {
      "score" : 34.38211872607005
    }
  }, {
    "id" : 9,
    "size" : 3,
    "score" : 56.159586739986565,
    "phrases" : [ "College of Engineering" ],
    "documents" : [ 11, 28, 38 ],
    "attributes" : {
      "score" : 56.159586739986565
    }
  }, {
    "id" : 10,
    "size" : 3,
    "score" : 60.93149449446373,
    "phrases" : [ "Library" ],
    "documents" : [ 5, 41, 44 ],
    "attributes" : {
      "score" : 60.93149449446373
    }
  }, {
    "id" : 11,
    "size" : 3,
    "score" : 51.8753094482056,
    "phrases" : [ "Manage the Work Sites" ],
    "documents" : [ 38, 42, 43 ],
    "attributes" : {
      "score" : 51.8753094482056
    }
  }, {
    "id" : 12,
    "size" : 3,
    "score" : 80.55599298917723,
    "phrases" : [ "Resume Paper" ],
    "documents" : [ 18, 21, 22 ],
    "attributes" : {
      "score" : 80.55599298917723
    }
  }, {
    "id" : 13,
    "size" : 3,
    "score" : 52.28405951769453,
    "phrases" : [ "Tonight" ],
    "documents" : [ 15, 16, 33 ],
    "attributes" : {
      "score" : 52.28405951769453
    }
  }, {
    "id" : 14,
    "size" : 2,
    "score" : 75.3463445836701,
    "phrases" : [ "Agree that this whole Voting Process" ],
    "documents" : [ 6, 43 ],
    "attributes" : {
      "score" : 75.3463445836701
    }
  }, {
    "id" : 15,
    "size" : 2,
    "score" : 41.28602116645022,
    "phrases" : [ "All-ages" ],
    "documents" : [ 25, 39 ],
    "attributes" : {
      "score" : 41.28602116645022
    }
  }, {
    "id" : 16,
    "size" : 2,
    "score" : 36.85312745008102,
    "phrases" : [ "Cell Phone" ],
    "documents" : [ 20, 47 ],
    "attributes" : {
      "score" : 36.85312745008102
    }
  }, {
    "id" : 17,
    "size" : 2,
    "score" : 44.76640452558253,
    "phrases" : [ "Explosive" ],
    "documents" : [ 2, 43 ],
    "attributes" : {
      "score" : 44.76640452558253
    }
  }, {
    "id" : 18,
    "size" : 2,
    "score" : 45.08230739135511,
    "phrases" : [ "Summer" ],
    "documents" : [ 18, 42 ],
    "attributes" : {
      "score" : 45.08230739135511
    }
  }, {
    "id" : 19,
    "size" : 2,
    "score" : 59.72792977607757,
    "phrases" : [ "Tech Zone" ],
    "documents" : [ 8, 43 ],
    "attributes" : {
      "score" : 59.72792977607757
    }
  }, {
    "id" : 20,
    "size" : 2,
    "score" : 97.79850078919225,
    "phrases" : [ "Turbo Tax" ],
    "documents" : [ 12, 24 ],
    "attributes" : {
      "score" : 97.79850078919225
    }
  }, {
    "id" : 21,
    "size" : 10,
    "score" : 0.0,
    "phrases" : [ "Other Topics" ],
    "documents" : [ 0, 3, 13, 17, 19, 23, 26, 30, 31, 45 ],
    "attributes" : {
      "other-topics" : true,
      "score" : 0.0
    }
  } ],
  "processing-time-algorithm" : 1272,
  "documents" : [ {
    "id" : 0,
    "title" : "For those that live in Urbana apartments and park on the curb",
    "snippet" : "I know there's a rule that you can't stay in a spot for more than three days, but how do they keep track of that? Do consistently move your cars every three days?  I heard from one of the guys that works at one of the apartment management companies that they \"use chalk\". I don't know what exactly this means or how it works nor did I ask him to elaborate, but it's a clue. Anyone care to speculate? They mark a tire with chalk. When you move your vehicle, the chalk wears off.\n\nI imagine they either rotate through colors to tell how long it's been or just mark parked cars every three days.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17npcx/for_those_that_live_in_urbana_apartments_and_park/"
  }, {
    "id" : 1,
    "title" : "off-campus lease",
    "snippet" : "Hi guys,\n\nDo you know any company or person who makes rental leases for a specified period of time like 5 months? It is not important how far away the place is.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17nj00/offcampus_lease/"
  }, {
    "id" : 2,
    "title" : "Anybody else up for that power line explosion in front of Illini Tower? ",
    "snippet" : "There were like 2 explosions. One caused a small power outage and woke me up. Then I looked out my Window to see some bright sparking and eventually a second explosion. \n\nAnybody else see/hear it? I'll get a picture of the pole once it gets light out.     I believe a transformer blew. Probably looked like [this](http://www.youtube.com/watch?feature=player_detailpage&amp;v=hy6UXxhzYlk#t=50s).  I live right by IT and didn't see or hear anything! Dammit! Of course I would sleep through something interesting, but at least I know why my clocks were all out this morning ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17md4b/anybody_else_up_for_that_power_line_explosion_in/"
  }, {
    "id" : 3,
    "title" : "Proposed changes to the Football Stadium",
    "snippet" : "  They're going to add fans to the stands and a team that can get into the endzone?\n\nSeems promising. Should have thought of that years ago.  They're going to add fans to the stands and a team that can get into the endzone?\n\nSeems promising. Should have thought of that years ago.  They're going to add fans to the stands and a team that can get into the endzone?\n\nSeems promising. Should have thought of that years ago.  Shut the fuck up, you ass raping donkey fucker.  I'd like to see your pussy ass out on the field, cunt.  Pathetic trash like you makes me fucking sick.  Get the fuck out of my subreddit, homo. Shut the fuck up, you ass raping donkey fucker.  I'd like to see your pussy ass out on the field, cunt.  Pathetic trash like you makes me fucking sick.  Get the fuck out of my subreddit, homo.  This is like putting new rims on a car with a blown engine. This is like putting new rims on a car with a blown engine. You couldn't have stated that better.  Totally agree.   As long as it doesn't have a blobs of messed up pixels in the middle, it's an improvement.\n\nThe old scoreboard was as wide as that ribbon board that says \"wins wins wins\" so that should give a good comparison as to what the improvement will be.  Looks like this would put it at 6th largest in the conference, and 20th largest in the nation.  Pretty cool.\n\nThey're also adding a scoreboard to the north endzone.  It won't have a video board, but should still be nice for those who would be sitting with their backs to the big board.  The ribbons look nice too. One game, I'm pretty sure some of our video inputs were broken, so we got BTN feed. That wouldn't surprise me.  There always seemed to be a blob of greenish/purple in the middle.\n\nThat scoreboard wasn't *that* old either, did they just go cheap last time around? That wouldn't surprise me.  There always seemed to be a blob of greenish/purple in the middle.\n\nThat scoreboard wasn't *that* old either, did they just go cheap last time around?   How about we focus on changing the football team first? Why not both? Also a better stadium would be an incentive to play here.     Can our school even afford this? The athletic department is self-sustaining through ticket and merchandise revenue, BTN money, and donations. Really, none of your tuition money will go towards this.  The athletic department is self-sustaining through ticket and merchandise revenue, BTN money, and donations. Really, none of your tuition money will go towards this.  Can our school even afford this?     ",
    "url" : "http://www.illinoisloyalty.com/i/n/new-illini-scoreboard-2013.jpg"
  }, {
    "id" : 4,
    "title" : "Anyone ever tutored at Irwin Academic Center?",
    "snippet" : "This is the building where student athletes get to go and receive free academic tutoring. I just got an email from their tutoring coordinator saying that one of my profs from last semester recommended me to tutor a student in his class.\n\nThey pay undergrad tutors $10/hr, do you guys know if this is taxed? Is it a generally good gig? How is the time commitment? Are there other benefits to being able to get into this building? Thanks!\n\nEdit: Thanks to everyone who replied!  I do! Shoot me a pm.   My boyfriend was an athlete who had to put in 10-15 hours per week, depending on grades and course load.  Most athletes are just there because they're required to be, not because they're actively seeking out help on a subject.  They bring a book and \"study\" and clock out as soon as possible..... I would assume tutor wages are taxed, as I would assume it's also probably a good gig because you'll probably get a lot of your own study time too.  I would find out how much of it is really tutoring, vs. being the kid at the door who swipes them in and tells them to put away their magazines.  It's a nice facility, convenient location, and it would look good on a resume! ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17ky9b/anyone_ever_tutored_at_irwin_academic_center/"
  }, {
    "id" : 5,
    "title" : "Is there a public scanner on campus?",
    "snippet" : "I need to scan some documents for a class. Is there a scanner somewhere on campus that students can use?   Grainger Library has two. First floor, go in through the main doors and make a right and they're right there! I'd assume UGL and ACES library probably have 'em too, but I don't usually go there... UGL has two as well.  I think you'd just need to have a flashdrive to store all of the files.   ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17m27z/is_there_a_public_scanner_on_campus/"
  }, {
    "id" : 6,
    "title" : "Voting is live for Campus Spirit Revival - the most liked next symbols for The University of Illinois",
    "snippet" : "    This is just depressing. He can't be replaced. There is still so much Chief memorabilia and tradition here. No matter what UIUC does, Chief will always be our mascot.   Other than the \"Fighting Illini\" with the soldier, they all sucked. Rather have no mascot/symbol than any of those. I would prefer that the symbol be representational of the original source of the \"Fighting Illini\" name as well.\n\nI just don't want to wind up with a guy in a costume on the sidelines like most other teams have. Even when we had the Chief he was just there for the halftime Three-in-One. He was a symbol, not a mascot.  Wait what? Chef Illini is actually on the ballot!\n\nIf Chef Illini actually wins would the NCAA even allow us to have that as a mascot? lol Wait what? Chef Illini is actually on the ballot!\n\nIf Chef Illini actually wins would the NCAA even allow us to have that as a mascot? lol  Where the fuck is the Dragon Warrior?? There was a dragon warrior?  I really hope the Eagle wins. Its got a great description about it, and is visually very similar to the Chief, without looking like it was trying too hard (ie, like the wolf one, and others that tried to incorporate the headdress)   Someone take some screenshots of them for me just to see. I'm not a student anymore; therefore, my log-in doesn't work.  I'm curious! You can still log in if you have a current password. There's a site to reset it somewhere if you remember your security questions. \n\nI was able to log in and see them, but couldn't vote. damn...no even that is working. There's definitely a facebook page with all of these. Somebody who follows it might be able to link you. Or search the group  that would be awesome! If anyone could do that...that would be awesome! [Here it is.](https://www.facebook.com/CampusSpiritRevival) You can still log in if you have a current password. There's a site to reset it somewhere if you remember your security questions. \n\nI was able to log in and see them, but couldn't vote.  Like it or not, the day has come. Voting ends February 1st. The ballot reminds you that you should be focusing on concepts - and therefor the written portion should weigh heavily on your decision. I like the squirrel but don't like the drawing. I'm sure whatever gets picked will be redrawn professionally. This is correct. It mentions at the top that you're voting on the concepts, not the actual pictures.  Then why the hell do we have five billion lincolns?     I can't vote since I'm not a student, but I liked \"Illini Pride\" and the Lincoln I face. HEe heeeee :)  Does anyone agree that this whole voting process is a fucking joke? Haha seriously you think any of the t shirt shops on campus or in the Illinois area are going to make orange and blue shirts with a freaking Kraken on it? Does anyone agree that this whole voting process is a fucking joke? Haha seriously you think any of the t shirt shops on campus or in the Illinois area are going to make orange and blue shirts with a freaking Kraken on it?   Voted for all 3 krakens. No regrets. University of Illinois Krakens. Which slogan?\n\n- We're 1,000 miles from the ocean.\n- We do not sow. Hey, there's just as many krakens in Illinois as there are outside of Illinois!          [deleted] We had a meeting and decided that we're going to let you down. Not alumni in general, just you.  We had a meeting and decided that we're going to let you down. Not alumni in general, just you.  [deleted] As another alumni, I'm excited for a new symbol that will do our university proud going into the future. As another alumni, I'm excited for a new symbol that will do our university proud going into the future. As another alum, meh. Never cared about the chief, and I don't really care about the replacement. I just care that the logo isn't ugly... Is there a link to an external site yet? [deleted]",
    "url" : "http://vote.illinois.edu/"
  }, {
    "id" : 7,
    "title" : "Spotted in Physics 212 today. Congrats on being totally gorgeous, dude.",
    "snippet" : "  I saw you take this picture in Physics 212 today. Twist ending, my friend and I both took pictures, and we were sitting right next to each other. You'll never know. I know which one took it.\nSource: I was right next to you. Source: The nice dream you had during lecture today touché I saw you take this picture in Physics 212 today. I saw you take this picture in Physics 212 today.    I'm in 211 right now and so far our comments have sucked. Most of them are related to how kids aren't understanding physics..  lol I'm in 211 right now and so far our comments have sucked. Most of them are related to how kids aren't understanding physics..  Ours were all terrible puns. When I say terrible I mean TERRIBLE.  Ours were all terrible puns. When I say terrible I mean TERRIBLE.   I'm pretty sure the same thing came up, in the exact same wording except for the genders switched, when I took 212 in 2009. So, uh, don't get too excited.   Ahhh Kwiat. My favorite non-engineering entity of undergrad. Ever. The suspenders. The intelligence! The slick bastard swing danced with my girlfriend and I ain't even mad. Omg, that guy is still around? Does he still drive a sporty red car with license plate \"PHOTON\"? I saw him driving today! His license plate is still \"PHOTON\" but his car is black with a red symbol on the hood.  I didn't get a good look though :/ You can see his car in the uiuc physics gangam style  Ahhh Kwiat. My favorite non-engineering entity of undergrad. Ever. The suspenders. The intelligence! The slick bastard swing danced with my girlfriend and I ain't even mad. Kwiat teaches 214, not 212. And yes, he is amazing.",
    "url" : "http://i.imgur.com/LQ5a7fM.jpg"
  }, {
    "id" : 8,
    "title" : "I work at the Illini Union Tech Zone and I was wondering what you think of the new store and if you have any suggestions, concerns, or questions.",
    "snippet" : "  Do you guys price match? I understand that tech zone is about the convenience of being on campus, but with amazon prime for students products aren't too far away from students.\n\nOtherwise, the store looks great. You guys have a better selection of computers and accessories. For some products, you have even more options than the local Best Buy.  One of the best things about the Tech Zone is the knowledgeability of the staff - they've worked there for years and often have heard of and solved the same kinds of student needs over and over. I really like that. You don't get that at brick and mortar stores - you wouldn't believe the nonsense I've heard at local chains. One of the best things about the Tech Zone is the knowledgeability of the staff - they've worked there for years and often have heard of and solved the same kinds of student needs over and over. I really like that. You don't get that at brick and mortar stores - you wouldn't believe the nonsense I've heard at local chains. What kind of repairs do they do? One of the keys on my keyboard is stiff and I need that fixed, does Tech Zone fix this kind of thing? Does it cost money, and if so, how much?   What's the best student deal you have for laptops? Are you looking for an Apple computer or a Windows computer?\nWe have the MacBook Pro 13\" starting at $1074.  For Windows we have a few HP Elitebook Models that are new, but open box that start at $399.     Do you guys service/fix iDevices? Do you guys service/fix iDevices?   In terms of battery life and general similarity, what is the closest equivalent to the MBA you have?  Especially 13\"+   I feel like the devices need to have little information plates next to them. if I'm going to drop $400+ in a purchase I want to know specs/features  [deleted]   I've been looking all over Reddit for you, Dave. I've scoured this cess pool trying to find you - and now I have!\n\nBecause you LOVE the cock!\n\nEdit: Reddit doesn't understand. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17k6nw/i_work_at_the_illini_union_tech_zone_and_i_was/"
  }, {
    "id" : 9,
    "title" : "T-shirt copyrights",
    "snippet" : "I am trying to print some team shirts ASAP but I am using an Illinois Column \"I\" in the picture. Is there any place or anyone who has the rights to print it? I need small quantity but willing to pay if I can get what I need.     This should be a place to get you going: http://identitystandards.illinois.edu/graphicstandardsmanual/logodownloads/logodownloads.html\n\nClick around on the links on the left, somewhere in there tells you what you can use and how to use them. I *believe* that you can openly use them, but look around on that website. So I just looked at it. You can use it, but it needs the tm sign. You are both wrong.\n&gt; Prior written approval is needed for students, campus groups, registered student organizations, or sports clubs from the Trademark and Licensing Office and the Collegiate Licensing Company (the University's licensing agent) for use of the University name or marks for anything other than official University business. This also applies to students, student groups, and organizations that wish to make use of the University name in conjunction with their group or activities, or those groups desiring use of the University's identifying marks.\n\n[as per dylanova's link](http://identitystandards.illinois.edu/graphicstandardsmanual/universityguidelines/trademarkandlicensing.html) actually, the licensing and trademark office is pretty good with these, as long as you follow the guidelines. \n\"A club team may, however, use a University mark as part of its uniform, provided the item is not issued or made available for sale to anyone other than team members. Students, student organizations and campus groups may receive permission to use a University mark for special uses, such as a commemorative item that is for members use only. No royalties are due on these items. Contact the Trademark and Licensing Office for approval of such uses.\"\nLicensing and trademark Office phone is at the bottom of the page - (217) 333-2474 and (217) 244-0016 - there's also a list of licensed, local manufacturers that handle these often near the bottom of the page. actually, the licensing and trademark office is pretty good with these, as long as you follow the guidelines. \n\"A club team may, however, use a University mark as part of its uniform, provided the item is not issued or made available for sale to anyone other than team members. Students, student organizations and campus groups may receive permission to use a University mark for special uses, such as a commemorative item that is for members use only. No royalties are due on these items. Contact the Trademark and Licensing Office for approval of such uses.\"\nLicensing and trademark Office phone is at the bottom of the page - (217) 333-2474 and (217) 244-0016 - there's also a list of licensed, local manufacturers that handle these often near the bottom of the page.  So how would someone go about getting the chief put onto a t shirt? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17kfcz/tshirt_copyrights/"
  }, {
    "id" : 10,
    "title" : "UIUCProTip: Utilize the ECE Store",
    "snippet" : "A lot of people don't even know this exists and I couldn't find a post about it here (which is very aggravating and surprising). It's located in the basement of Everitt laboratory in RM 60 and I think their hours are Noon-4:30 M-F. \n\nI never went in there before but had to go in and get a lab manual. While in there, I was amazed at the abundant amount of electronic devices they have there at dirt cheap prices. For example, the guy in front of me in line bought an iPod cable for $1.30. I bought a 4 pack of AAA Energizer batteries for about $1.40. Comparatively, Walgreens, TIS, and other stores were charging about $7 for 4 AAAs. They also have a ton of cool things that I wanted to buy and I'm sure they were cheap too: keyboards, mice, headphones, usbs. Call ahead if you're looking for something specific obviously. They also have circuit parts but I'm sure if you needed circuit parts then you already knew that.\n\nBasically, I never saw it pushed here before, but the ECE store is where I'll be going for all my future electronic needs.   I cannot thank you enough for posting this. The ECE store is an amazing resource and is often overlooked in favor of online resources.   Do they have a list of typical products/prices online? Do they have a list of typical products/prices online?  The only thing I find less than ideal is that you can't browse the store. You have to tell the person behind the counter exactly what you want (which they may or may not understand). But I've found good prices on things like generic DisplayPort&gt;HDMI adapters and you don't have to wait weeks for shipping on that one you bought from China.\n\n\nAlso, you can buy 4 AAAs at walgreens for $3.50... so, it's still a savings, but you're getting ripped off if you pay $7.  Anything more than a quarter a battery is a rip off. But idk you must have seen them on sale when you were there. When I was there the generic brand was 4.99 and the Duracell were 6.99. Absurd.  more than a quarter a battery is a ripoff, and yet you paid $1.40 for 4, or 35 cents a battery?   Very true ECE store rocks! One thing from your post though, it's open from 8am to 12noon and then from 1pm to 4:30   Now I was under the impression that only ECE and engineering students could use the store. Is this just a completely false assumption? Yup! any student can use it Yup! any student can use it I'm not sure about that. I was always told that you needed to be an ECE, and I've always had my card scanned when I've bought stuff from there. ProTip:  ECE scans your iCard but its not linked to UIUC Banner according to the staff.  Its only to keep track of weird purchases so you can use ECE after you graduate until your icard exprires I'm not sure about that. I was always told that you needed to be an ECE, and I've always had my card scanned when I've bought stuff from there.    I'm not even an engineer and I went there once for an auxiliary cable for my car...$2.00 as opposed to $14 at walmart  I need new headphones, the rubber part of mine has slipped away and is exposing the wires which are getting frayed. I didn't see any headphones in the catalogue but does anyone know if they carry them anyways? I need new headphones, the rubber part of mine has slipped away and is exposing the wires which are getting frayed. I didn't see any headphones in the catalogue but does anyone know if they carry them anyways?     ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17ikro/uiucprotip_utilize_the_ece_store/"
  }, {
    "id" : 11,
    "title" : "My humble proposal for the new $100M pledge to the College of Engineering",
    "snippet" : "  Not a bad idea, but it needs ziplines from the top of each bell tower to popular destinations around campus. Not a bad idea, but it needs ziplines from the top of each bell tower to popular destinations around campus. That's So Riven   Ringing all these bells simultaneously opens the gates to hell...aka Unofficial.   I SEE YOU *Ash nazg durbatulûk, ash nazg gimbatul, ash nazg thrakatulûk agh burzum-ishi krimpatul.* [All Hail](http://farm9.staticflickr.com/8447/7842832986_275e4ca459_z.jpg)   For $100 million, you could have 66 of them - why limit yourself to 10? The grant was for 1.5 million, but the actual cost of the tower was much higher. Rumored up to 10 million.       Funny enough, one of our projects last year in ME 370 (Mechanical Design) was to model a bell tower that would go on the Engineering Quad... So we put ours right where that goofy sculpture is by MEL. Goofy sculpture?\n\nSomeone isn't properly letting you guys in on the secret there anymore, evidently... Explain? Funny enough, one of our projects last year in ME 370 (Mechanical Design) was to model a bell tower that would go on the Engineering Quad... So we put ours right where that goofy sculpture is by MEL.     2 much yoleaux 2 much swague 420\nedit: downvotes, really? edit: downvotes, really? literally  THIS! What a waste of money that damn bell tower is. That was a donation Yeah, I'm pretty sure the donor stipulated it be a memorial to his wife or something That was a donation",
    "url" : "http://i.imgur.com/E9VXhZZ.jpg"
  }, {
    "id" : 12,
    "title" : "International students: question about tax treaty",
    "snippet" : "I am going to file my tax return for the first time. I am on f1 student visa and the whole tax filing system is really foreign to me. I read online that as international students, I can get about $5000 tax exemption thanks to a tax treaty between my county and the U.S. But I must do paper filing instead if I want to get the treaty benefit.\nSo has any international student here ever done taxes under the tax treaty? Any tips or pointers as to where I should get my taxes done (since I can't file online using softwares like Turbo Tax)? Many thanks!!   [deleted]  Are you making income? If you're not, the Form 8843 is the only form you'll need, but I am not a tax professional.\n\nMost likely the tax exemptions will do jack all for you since I'm guessing you're not making enough for most exemptions to matter. do all F1 student need to fill the Form 8843? I am so confused as to fill it up or not :/.     What country?  Yes, they have to be done on paper.  Tax Treatys are really a cluster fuck all around as most likely if your an international student, you an dependent in your home country and have a smaller exemption if the tax treaty had that provision in there.  Have you tried r/tax? What country?  Yes, they have to be done on paper.  Tax Treatys are really a cluster fuck all around as most likely if your an international student, you an dependent in your home country and have a smaller exemption if the tax treaty had that provision in there.  Have you tried r/tax?",
    "url" : "http://www.reddit.com/r/UIUC/comments/17jh48/international_students_question_about_tax_treaty/"
  }, {
    "id" : 13,
    "title" : "Illinoisnet down again? ",
    "snippet" : "Sitting in siebel, unable to connect   And yet people are confused when I suggested that CITES should be improved. &gt; CITES should be improved.\n\nDo you mean the whole damn giant-ass, IT-providing organization? Or some aspect of the services they provide? In either case, how? (Beyond just saying \"the internet should always work for me and their gmail login is dumb and where did my netfiles go.\")\n\nI can see why you feel like CITES has fallen short. I felt that way before I got an IT job with ACES, but I found that many problems aren't actually as simple as some people doing their jobs poorly. It may be an issue with the school's ISP or your own computer's credentials. As one example, CITES could communicate to users about maintenance and outages on IllinoisNet.  Instructors in the CS building have been regularly losing their wireless connection in the middle of lectures!  This has been going on for weeks.  What is going on?  Why?  Why aren't they communicating about it.\n\nIT organizations that blame their users for their own lack of communication are unprofessional. As one example, CITES could communicate to users about maintenance and outages on IllinoisNet.  Instructors in the CS building have been regularly losing their wireless connection in the middle of lectures!  This has been going on for weeks.  What is going on?  Why?  Why aren't they communicating about it.\n\nIT organizations that blame their users for their own lack of communication are unprofessional.  I had trouble with both earlier,  but others were getting on fine, quite easily could have been on my end\n     Lots of drivers have problems with IllinoisNet. Not sure exactly what it is, but I know Apple's drivers (The broadcom ones) SUCK for University WiFi. Lots of drivers have problems with IllinoisNet. Not sure exactly what it is, but I know Apple's drivers (The broadcom ones) SUCK for University WiFi. Really? Besides lately, I haven't had any issues in my four years here.",
    "url" : "http://www.reddit.com/r/UIUC/comments/17is9z/illinoisnet_down_again/"
  }, {
    "id" : 14,
    "title" : "Looking over the quad today",
    "snippet" : "  This makes it look endless, which is awesome. It's like a video game or dream where you just keep running but never get to the end...because...you know...it's one of those levels. The staircase in Mario 64! No no it does end but it takes about twenty minutes, go try it. No no it does end but it takes about twenty minutes, go try it. It's like a video game or dream where you just keep running but never get to the end...because...you know...it's one of those levels.          It was brought to my attention that the man who took this picture is /u/imarealboyce. I saw this shared by a mutual friend of ours on my FB feed. So thanks to him for taking this great one. I hope you don't feel offended that I upped it here realboyce.      [deleted] Kinda like how you were probably gawking like a baby at the Midwest snow? Granted, none yet this year but it could get horrible.  [deleted] So sort of like not everyone from Chicago is totally amazed by fog, I see. Would you like a ladder to help get off your high horse? [deleted] Ok bud. I called the fire station to get you down so hang in there.  [deleted]",
    "url" : "http://i.imgur.com/sZviks9.jpg"
  }, {
    "id" : 15,
    "title" : "Gallery of the Fog around campus tonight",
    "snippet" : "       Damn, that first picture would be such tight butthole if that person wasn't there. Anyone know photoshop? Damn, that first picture would be such tight butthole if that person wasn't there. Anyone know photoshop?",
    "url" : "http://imgur.com/a/ioOkt"
  }, {
    "id" : 16,
    "title" : "Lazering down the quad tonight",
    "snippet" : "     Wow thats pretty cool. What'd you use? Wow thats pretty cool. What'd you use? Fuck you.  Get out of my subreddit, faggit",
    "url" : "http://imgur.com/wk2mkd4"
  }, {
    "id" : 17,
    "title" : "Which Improv group was performing at the Union last evening (~7:30pm)?",
    "snippet" : "You guys performed a sketch about an emotional picnic, \"The Man from Cincinnati\", and some others.  I thoroughly enjoyed your performance but I didn't catch the name of your group.  So who are you? :)   I'm not in the group, but I think that would have been Titanic? I believe they perform at the Union regularly.  They only have shows once a month. It was probably Spicy Clamato or Debono- they have shows every monday. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17iq5b/which_improv_group_was_performing_at_the_union/"
  }, {
    "id" : 18,
    "title" : "Career Fair Advice-Ask Away",
    "snippet" : "Since I've seen a lot of posts asking for career fair advice, I figured I'd give some generic advice and answer some questions. Qualifications: Been to many career fairs and have had multiple internships and have a FT job. \n\nAsk away!\n\nAdvice:\nPrint out at least 10-15 resumes on resume paper, you can have this done at NotesnQuotes or buy your own paper at any bookstore\n\nBuy a padfolio! $20 at walgreens or a bookstore\n\nWear a suit\n\nResearch companies before hand, at the very least know what positions they are hiring for, but don't be afraid to talk to companies you haven't prepped for.\n\nHave a little intro prepared, here's my typical one: Hi, my name's Yamas and I'm a senior majoring in Finance. On campus I'm involved in {insert RSO and position if you have one here} and this past summer I {Had an internship, took courses, (don't say this part if you just fucked around)}. I saw you're currently hiring for the Software developer role and I was wondering if you could tell me a bit more about the position. \nFrom here, go with the conversation and talk about your experiences to have a reason to give them your resume. I personally like to put a resume on top of my padfolio so they see I have one and may ask for it. \n\n\nThat's all I have off the top of my head but I'm glad to provide more advice if needed.    Which companies give out the best free stuff at career fairs? Which companies give out the best free stuff at career fairs? Which companies give out the best free stuff at career fairs? Which companies give out the best free stuff at career fairs? [deleted]  I have to comment on the suit part. I was very worried that not having a suit would be a big deal. I went to the career fair today wearing a dress shirt, black trousers and a leather jacket. None of the recruiters had any problem in speaking to me; got invited to interviews from nearly every booth that I talked in. Disclaimer: I looked mostly at software companies.\nBut yes, 99% of the people were wearing suits. Seemed to set me out from the crowd actually :). Just try to look smart and professional.\n\nThe other advice is spot on. Try to smile when speaking to the people standing at the booths, don't be very formal I have to comment on the suit part. I was very worried that not having a suit would be a big deal. I went to the career fair today wearing a dress shirt, black trousers and a leather jacket. None of the recruiters had any problem in speaking to me; got invited to interviews from nearly every booth that I talked in. Disclaimer: I looked mostly at software companies.\nBut yes, 99% of the people were wearing suits. Seemed to set me out from the crowd actually :). Just try to look smart and professional.\n\nThe other advice is spot on. Try to smile when speaking to the people standing at the booths, don't be very formal I have to comment on the suit part. I was very worried that not having a suit would be a big deal. I went to the career fair today wearing a dress shirt, black trousers and a leather jacket. None of the recruiters had any problem in speaking to me; got invited to interviews from nearly every booth that I talked in. Disclaimer: I looked mostly at software companies.\nBut yes, 99% of the people were wearing suits. Seemed to set me out from the crowd actually :). Just try to look smart and professional.\n\nThe other advice is spot on. Try to smile when speaking to the people standing at the booths, don't be very formal    if you dont know what the company you're about to talk to does, if they're hiring people in your major, or what industry they are in, don't bother.\n\nprepare yourself.\n\nsource: me, UIUC BSEE 2010 grad, who now recruits for my organization ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17icky/career_fair_adviceask_away/"
  }, {
    "id" : 19,
    "title" : "Course/minor advise. ",
    "snippet" : "ABE major here, just trying to decide between a few electives for my major. Can anyone compare MCB 450, CHBE 471, CHBE 472, CHBE 473 for me? similarities and differences would be great, or just recommendations in general. I'm also considering doing a minor in bioengineering or biomolecular engineering but can't decide between the two, so any advice there would be great as well. Thanks.  Avoid bioengineering.  The department is a disorganized mess. Why is that? I've always heard that bioengineering is really bad. I've been told that it's hard to get into and there's basically no jobs for it anyways.",
    "url" : "http://www.reddit.com/r/UIUC/comments/17j10c/courseminor_advise/"
  }, {
    "id" : 20,
    "title" : "What's the best way to sell a cell phone? ",
    "snippet" : "I just want to do a swap with cash for someone on campus so we can both save ourselves from eBay fees and whatnot. If it helps, I'm trying to sell a Lumia 920.    what is your price?   I'm interested. But I'm on tmobile. Will it work? I'm interested. But I'm on tmobile. Will it work?",
    "url" : "http://www.reddit.com/r/UIUC/comments/17ifkk/whats_the_best_way_to_sell_a_cell_phone/"
  }, {
    "id" : 21,
    "title" : "Printing resumes?",
    "snippet" : "All these career fairs coming up. Anyone know where I can get resumes printed on good paper? I imagine the FedEx shop on Wright would do so but if anyone knows of anywhere else with better prices perhaps. I'm a cheap bastard  Depends how much your looking to print.\n\nCan buy your own resume paper that will last the next few semesters for about $10, and then print it for free at an EWS lab if your an engineer.\n\nJust ask the person working in the lab to help you with putting the paper in the printer. I'm not sure if they will allow you to do that. Been doing that the past few semesters and have had no problems. Just ask the person working. I'm not sure if they will allow you to do that.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17i95i/printing_resumes/"
  }, {
    "id" : 22,
    "title" : "For those attending the career fairs during these next couple weeks...",
    "snippet" : "    Where can you get one? Where can you get one? I just made one. Printed my name, major, and year of graduation on a piece of paper in nice font. Took all of 20 seconds. Is there a ready-to-use template? You would need that plastic cover with the safety pin too - where do you get that?\n\nI just found my (hand-written) nametag from last semester's career fair - would that do too?  Fyi, you can print your resume on fancy paper (if that's what you hope will make you stand out) at ECS in DCL as well.  What's the etiquette on backpacks at career fairs? I have one of those side things (are they called satchels?)... is that more preferred? I have a lot of class these couple days and don't know what to do. Usually there's a bag check Can I get some more general tips? I don't know what the fuck I'm doing. I'm great at talking but I'm talking about little things like how many buttons to have buttoned on my suit, how to carry my resumes, how we get conversation started. Any tips?  Can I get some more general tips? I don't know what the fuck I'm doing. I'm great at talking but I'm talking about little things like how many buttons to have buttoned on my suit, how to carry my resumes, how we get conversation started. Any tips?  What's the etiquette on backpacks at career fairs? I have one of those side things (are they called satchels?)... is that more preferred? I have a lot of class these couple days and don't know what to do.",
    "url" : "http://www.quickmeme.com/meme/3srg4x/"
  }, {
    "id" : 23,
    "title" : "Looking *down* on the quad today",
    "snippet" : "  Where are you and how...did you get up there? here's the link : [quad cam](http://illinois.edu/about/tours/quadCam.html) Actually, the quad cam is that little doohickey next to the little white round thing along the roof in the picture. I was on the dome. how in the world did you get up there?  It's kind of complicated and there's a lot of paths up, but I'll post a foellinger guide sometime Where are you and how...did you get up there?",
    "url" : "http://i.imgur.com/q4qfXl9.jpg"
  }, {
    "id" : 24,
    "title" : "Income tax time- any suggestions for a good place to get them done?",
    "snippet" : "  I use Turbo Tax. It's fairly simple, plus they file your federal returns for free online. I've been told that you can file state taxes online for free at another source, but Turbo Tax charges around $30 for filing state returns. Once you've got a completed federal return, the Illinois return is super easy.  You can file it free online through the Illinois Dept of Revenue: http://www.revenue.state.il.us/Individuals/IllinoisPropertyTaxCredit.htm\n\nBut otherwise, I agree with the others - a 1040EZ is very easy (hence the name), and the 1040A is simple too.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17i28q/income_tax_time_any_suggestions_for_a_good_place/"
  }, {
    "id" : 25,
    "title" : "Help out a local record label! They're raising money to open an All-Ages Venue! Every dollar helps!",
    "snippet" : " ",
    "url" : "http://www.indiegogo.com/errorrecords"
  }, {
    "id" : 26,
    "title" : "Blast from the past: The tale of the 2002 Student Government election fiasco - also known as Snailgate",
    "snippet" : "    I voted then, only time I voted in an ISG election. My vote for Gnome and Snail was a protest vote against the very idea of ISG. ",
    "url" : "http://www.cheesecake.org/isgelection/"
  }, {
    "id" : 27,
    "title" : "Glass Bottles/Jugs?",
    "snippet" : "Does anyone know where I could buy/acquire 1 gallon glass jugs cheaply around here?   Buy a gallon of Carlos Rossi wine from Meijer or Walmart     Idea Store might have something. Seems like something they'd have lying around. The Idea store has *everything*.  Wonder what OP is up to... :P I am studying chemical reactions, specifically those that use a biological agent to convert some or all sugars into C2H6O, a organic compound. Friar Tuck has 1 gallon growlers, and 3 gallon, 5 gallon, and 6.5 gallon carboys. The growlers are $3.99. I bought a few this weekend.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17hyrk/glass_bottlesjugs/"
  }, {
    "id" : 28,
    "title" : "$100 million pledged to College of Engineering",
    "snippet" : "  \"The increased scholarship funds resulting from the new endowment will strengthen the College’s ability to attract and retain the most exceptional engineering students.\"  \n\nPlease don't let this just be ten 1000$ scholarships given to only female international students whose parents served in the army and are related to faculty.  \"The increased scholarship funds resulting from the new endowment will strengthen the College’s ability to attract and retain the most exceptional engineering students.\"  \n\nPlease don't let this just be ten 1000$ scholarships given to only female international students whose parents served in the army and are related to faculty.  Did this actually happen? No, but I find it annoying how hard it is to get a merit based scholarship as a white male with a 4.0 and an officer of an engineering related club, when there are other scholarships where the requirements are based on your DNA and passing half of your classes. I understand why those scholarships exist, and I know they're mostly from private donors who are connected to that certain group, but that doesn't make it any less frustrating.  http://www.finaid.org/scholarships/20110902racescholarships.pdf\n\n&gt; Caucasian students receive a \ndisproportionately greater share of total merit-based grants. Caucasian students represent 73.6% of meritbased grant recipients but only 61.8% of the student population. \"The increased scholarship funds resulting from the new endowment will strengthen the College’s ability to attract and retain the most exceptional engineering students.\"  \n\nPlease don't let this just be ten 1000$ scholarships given to only female international students whose parents served in the army and are related to faculty.  As international female student in engineering, I have reviewed lots of scholarship requirement. I'm disqualified from virtually 99% of them because of my citizenship. :( I don't think international students (women or men) get any/many scholarships. The undergrads come from very wealthy families and grads are on research/teaching assistantships.  [ECE+BioE= sharks with frickin' laser beams attached to their heads!] (http://datacenteroverlords.files.wordpress.com/2012/08/dr_evil_one_million_dollars.jpg)  I don't want to be a drag, but does the College of Eng really need more money? Research funding, new facilities cost and maintenance, faculty and staff, scholarships... I don't know that you any idea how much money it costs to do all these things and how much money the College of Engineering currently has in its accounts, but it certainly doesn't hurt to have more.  If you are more asking \"why not give it to the English department\", I hope you can appreciate that, relative to many other fields, engineering facilities for research have more infrastructural costs.  Not to mention equipment and materials for ongoing research is also quite expensive, whether it be civil, mechanical, electrical, materials science etc. There are also economic incentives.. Research funding, new facilities cost and maintenance, faculty and staff, scholarships... I don't know that you any idea how much money it costs to do all these things and how much money the College of Engineering currently has in its accounts, but it certainly doesn't hurt to have more.  If you are more asking \"why not give it to the English department\", I hope you can appreciate that, relative to many other fields, engineering facilities for research have more infrastructural costs.  Not to mention equipment and materials for ongoing research is also quite expensive, whether it be civil, mechanical, electrical, materials science etc. There are also economic incentives.. I do appreciate that it costs a whole heck of a lot to maintain research, and I don't necessarily think that it should go to the English Dept (I can read and write anywhere), I was just honestly asking if it's really necessary. Bardeen Quad is gorgeous, and I'm employed by a group within the College of Engineering, they are quite generous with their compensation. Of course there is the issue that other departments could do more if they had the funds to do so. But yeah, at the end of the day, engineering costs a lot when used appropriately.  I don't want to be a drag, but does the College of Eng really need more money? It's better than giving it to the rest of the university where it will certainly go straight into some administrator's bank account! I don't want to be a drag, but does the College of Eng really need more money? I don't want to be a drag, but does the College of Eng really need more money? I don't want to be a drag, but does the College of Eng really need more money?  They better do a good job distributing this scholarship money. I wish that they'd just focus on getting the most exceptional students instead of trying to get as many female students as possible.\n\nThe quality of some of the female students in physics is embarrassing and it hurts the college as a whole. I'd rather have fewer, but better, female engineering students than more, but worse. I would like to argue that there are also plenty of male students in various engineering/physics degrees that are an embarrassment to their respective department, you just choose to notice the females that aren't your idea of \"exceptional\".  \n\nI knew a lot of females in engineering while an undergrad and not very many received scholarship money to \"recruit more females\".  I happened to receive a little, but I was one of three girls I knew of and I deserved that scholarship money just as much as any one else did.  They better do a good job distributing this scholarship money. I wish that they'd just focus on getting the most exceptional students instead of trying to get as many female students as possible.\n\nThe quality of some of the female students in physics is embarrassing and it hurts the college as a whole. I'd rather have fewer, but better, female engineering students than more, but worse. Are you Sheldon Cooper?  They better do a good job distributing this scholarship money. I wish that they'd just focus on getting the most exceptional students instead of trying to get as many female students as possible.\n\nThe quality of some of the female students in physics is embarrassing and it hurts the college as a whole. I'd rather have fewer, but better, female engineering students than more, but worse.",
    "url" : "https://engineering.illinois.edu/GEBI"
  }, {
    "id" : 29,
    "title" : "Falling Illini or skydiving around UIUC?",
    "snippet" : "Trying to finish that before graduation bucket list.  Anyone know if Falling Illini are still around or the places to skydive around Champaign?  Looks like the RSO is gone (the officer board graduated), but [their website](http://fallingillini.org/) still has some useful information.  Aw really? Damn that always looked fun ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17hcle/falling_illini_or_skydiving_around_uiuc/"
  }, {
    "id" : 30,
    "title" : "Zumba?",
    "snippet" : "does anyone have any info about zumba classes at the arc? time? cost? class credits? etc...  My personal recommendations: Sarah (nice and energetic, work strength exercise into routine) and Paula (tough and energetic, will kick your ass)\nI don't like Maddie. She's still a bit green. I have never been to one taught by Sara.\nAlways go early to stake out your territory, they class get filled up very quickly. Have fun! My personal recommendations: Sarah (nice and energetic, work strength exercise into routine) and Paula (tough and energetic, will kick your ass)\nI don't like Maddie. She's still a bit green. I have never been to one taught by Sara.\nAlways go early to stake out your territory, they class get filled up very quickly. Have fun! My personal recommendations: Sarah (nice and energetic, work strength exercise into routine) and Paula (tough and energetic, will kick your ass)\nI don't like Maddie. She's still a bit green. I have never been to one taught by Sara.\nAlways go early to stake out your territory, they class get filled up very quickly. Have fun! My personal recommendations: Sarah (nice and energetic, work strength exercise into routine) and Paula (tough and energetic, will kick your ass)\nI don't like Maddie. She's still a bit green. I have never been to one taught by Sara.\nAlways go early to stake out your territory, they class get filled up very quickly. Have fun!  [times](http://www.campusrec.illinois.edu/fitness/) and [cost](http://www.campusrec.illinois.edu/fitness/participate.html)",
    "url" : "http://www.reddit.com/r/UIUC/comments/17hen4/zumba/"
  }, {
    "id" : 31,
    "title" : "MS in Technology Management",
    "snippet" : "My roommate and I are thinking about applying. I was wondering if there's anyone here who is in or graduated from the program, and if they wouldn't mind sharing their opinions and experiences.\n\nThanks!   I've been getting emails about it for the past couple months as well. So I'd be interested if it was worth considering.  I'm talking to the SCS career adviser about it tomorrow and potentially going to the Business or Campus career people and asking too. I've been getting emails forever and it seems like they're trying to sell it really hard, and I get skeptical with that. I'm talking to the SCS career adviser about it tomorrow and potentially going to the Business or Campus career people and asking too. I've been getting emails forever and it seems like they're trying to sell it really hard, and I get skeptical with that.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17gwel/ms_in_technology_management/"
  }, {
    "id" : 32,
    "title" : "Bring a Trader Joe's to CU!",
    "snippet" : "  People have been trying to get Trader Joe's to CU for years. [The Pickus Company](http://www.news-gazette.com/news/other/2005-06-29/city-council-picks-burnham-developer-study-session.html), who were the developers behind Burnham 310, considered trying to get a Whole Foods, Wild Oats, or Trader Joe's way back in 2005. From [an article](http://www.news-gazette.com/news/business/features/its-your-business/2012-09-16/its-your-business-craft-brewery-mahomet.html) in the News Gazette earlier this year: \n\n&gt; Alison Mochizuki, director of public relations for Trader Joe's, said Thursday that Champaign-Urbana is not included in the company's plan for new stores in 2013 and 2014 \"at this time.\"\n\nAlso, Trader Joe's stores tend to open in metropolitan areas with a dense population and high income and education levels, which is not exactly the case for CU.   I've petitioned too and wrote them directly.  They kindly replied they would look into it but most likely thought that our community wasn't the right fit.  This was back in 2010. I've petitioned too and wrote them directly.  They kindly replied they would look into it but most likely thought that our community wasn't the right fit.  This was back in 2010. I've petitioned too and wrote them directly.  They kindly replied they would look into it but most likely thought that our community wasn't the right fit.  This was back in 2010.  Wouldn't a Trader Joe's in C-U pretty much put Common Ground Food Co-op out of business? It'd probably put Strawberry Fields out of business; Common Ground seems to have a much more loyal following.  I was told in a BADM class that the CU area does not fit the Trader Joe's market positioning strategy; their finance people and the other bigwigs who open new stores require strict criteria for choosing their locations.  One of these criteria, if I remember correctly, are the number of college-educated households bringing in six figures annually, and apparently the number isn't high enough for them to move on it. \n\nTL:DR They don't see enough money in C-U to invest in a location here  ",
    "url" : "http://traderjoes4cu.wordpress.com/"
  }, {
    "id" : 33,
    "title" : "[EVENT] Punk show at Red Herring TONIGHT (1/28)",
    "snippet" : "(Lifted from facebook event)\n\nBands:\n\nKOWABUNGA! KID - local loud-pop, freshly returned from tour\n\nSLEEPYHEAD - returning Minnesota pop-punk, back for blood and/or guts\n\nUNCLE SHAM - local freak-out boys, back with a nü name (ex Panel Van/Rusalka)\n\nMonday, January 28th, 10pm, $3\nThe Red Herring Vegetarian Restaurant\n1209 W. Oregon, Urbana, ILLLLLL\nNo drugs/alcohol in venue plz\n\n\nhttps://www.facebook.com/events/196208517185488/  [deleted]",
    "url" : "http://www.reddit.com/r/UIUC/comments/17fmf0/event_punk_show_at_red_herring_tonight_128/"
  }, {
    "id" : 34,
    "title" : "Visiting UIUC tomorrow. Is there any interesting places i should check out after the campus tour?",
    "snippet" : "  The beauty of UIUC to me (a graduating senior in May and Fall 2013 Grad student) is the culture of downtown. \n\nFood? Courier Cafe (ive had a good time there, but service can be sketch at times)\n\nSights? Champaign Art Theatre : 35mm Film Theatre its a cool experience.\n\nSports? All the main sports things are down near FAR/PAR, im a huge tennis fan so Atkins tennis center is great for playing tennis with super nice courts\n\nDepends what you're looking for, but I really enjoy the variety of downtown champaign, the restaurants and cafes. The rest of campus gets redundant after 4 years (but thats to be expected)\n\nFeel free to ask more questions. Thanks, I am going to visit downtown Champaign and i am also a tennis fan, so i'll make sure to check out the tennis center The real thing I love about U of I is that even though its a public school it has a great program. You meet a very diverse group of people if you put in the effort (lest you fall into a clique) \n\nQuad day is always insanely fun. There is a club for anything. \n\nIt really depends what you want to Major in, if its financially worth it (im out of state and I do Civil Engineering, we are #1 for undergrad and grad.)\n I am from Illinois and doing Chem/Pre-Med so i hope its gonna be worth it. Well I know Chemistry is somewhat well known here? And Pre-Med it doesn't matter too much where you go, its more so Med School itself as many of my friends have said. That being said, I'm sure the program is fine here considering my roomies parents both graduated from here and are well paid Doctors.\n\nInstate = cheap. Lucky you! Unfortunately in state here is still expensive :( womp. Just not as expensive as out of state! 40,000$ out of state.. with out them scholarships.. I would cry you a river. Sorry! All I meant is that compared to other state's in school tuition, it's pretty expensive. For example, Indiana University in-state is like $14k. Illinois is $28k.  I am from Illinois and doing Chem/Pre-Med so i hope its gonna be worth it. I am from Illinois and doing Chem/Pre-Med so i hope its gonna be worth it. Do spec Chem, not LAS chem. small but HUGE difference.  Depending on how long you're going to be around for, here is a (incomplete) list of some good places to eat:\n\n* [Black Dog](http://www.yelp.com/biz/black-dog-smoke-and-ale-house-urbana)\n* [Radio Maria](http://www.yelp.com/biz/radio-maria-champaign)\n* [Ko Fusion](http://www.yelp.com/biz/kofusion-champaign)\n* [Zorba's](http://www.yelp.com/biz/zorbas-restaurant-champaign)\n* [Cracked](http://www.yelp.com/biz/cracked-the-egg-came-first-urbana)\n* [Fat Sandwich](http://www.yelp.com/biz/fat-sandwich-company-champaign)\n* [Timpone's](http://www.yelp.com/biz/timpones-restaurant-urbana) You must visit fat sandwich If they are drunk... Depending on how long you're going to be around for, here is a (incomplete) list of some good places to eat:\n\n* [Black Dog](http://www.yelp.com/biz/black-dog-smoke-and-ale-house-urbana)\n* [Radio Maria](http://www.yelp.com/biz/radio-maria-champaign)\n* [Ko Fusion](http://www.yelp.com/biz/kofusion-champaign)\n* [Zorba's](http://www.yelp.com/biz/zorbas-restaurant-champaign)\n* [Cracked](http://www.yelp.com/biz/cracked-the-egg-came-first-urbana)\n* [Fat Sandwich](http://www.yelp.com/biz/fat-sandwich-company-champaign)\n* [Timpone's](http://www.yelp.com/biz/timpones-restaurant-urbana) Depending on how long you're going to be around for, here is a (incomplete) list of some good places to eat:\n\n* [Black Dog](http://www.yelp.com/biz/black-dog-smoke-and-ale-house-urbana)\n* [Radio Maria](http://www.yelp.com/biz/radio-maria-champaign)\n* [Ko Fusion](http://www.yelp.com/biz/kofusion-champaign)\n* [Zorba's](http://www.yelp.com/biz/zorbas-restaurant-champaign)\n* [Cracked](http://www.yelp.com/biz/cracked-the-egg-came-first-urbana)\n* [Fat Sandwich](http://www.yelp.com/biz/fat-sandwich-company-champaign)\n* [Timpone's](http://www.yelp.com/biz/timpones-restaurant-urbana) Depending on how long you're going to be around for, here is a (incomplete) list of some good places to eat:\n\n* [Black Dog](http://www.yelp.com/biz/black-dog-smoke-and-ale-house-urbana)\n* [Radio Maria](http://www.yelp.com/biz/radio-maria-champaign)\n* [Ko Fusion](http://www.yelp.com/biz/kofusion-champaign)\n* [Zorba's](http://www.yelp.com/biz/zorbas-restaurant-champaign)\n* [Cracked](http://www.yelp.com/biz/cracked-the-egg-came-first-urbana)\n* [Fat Sandwich](http://www.yelp.com/biz/fat-sandwich-company-champaign)\n* [Timpone's](http://www.yelp.com/biz/timpones-restaurant-urbana) Depending on how long you're going to be around for, here is a (incomplete) list of some good places to eat:\n\n* [Black Dog](http://www.yelp.com/biz/black-dog-smoke-and-ale-house-urbana)\n* [Radio Maria](http://www.yelp.com/biz/radio-maria-champaign)\n* [Ko Fusion](http://www.yelp.com/biz/kofusion-champaign)\n* [Zorba's](http://www.yelp.com/biz/zorbas-restaurant-champaign)\n* [Cracked](http://www.yelp.com/biz/cracked-the-egg-came-first-urbana)\n* [Fat Sandwich](http://www.yelp.com/biz/fat-sandwich-company-champaign)\n* [Timpone's](http://www.yelp.com/biz/timpones-restaurant-urbana) Depending on how long you're going to be around for, here is a (incomplete) list of some good places to eat:\n\n* [Black Dog](http://www.yelp.com/biz/black-dog-smoke-and-ale-house-urbana)\n* [Radio Maria](http://www.yelp.com/biz/radio-maria-champaign)\n* [Ko Fusion](http://www.yelp.com/biz/kofusion-champaign)\n* [Zorba's](http://www.yelp.com/biz/zorbas-restaurant-champaign)\n* [Cracked](http://www.yelp.com/biz/cracked-the-egg-came-first-urbana)\n* [Fat Sandwich](http://www.yelp.com/biz/fat-sandwich-company-champaign)\n* [Timpone's](http://www.yelp.com/biz/timpones-restaurant-urbana)  Adding to the list of good food:\nMaize, Dos Reales, Firehaus, Za's Or just Maize I could live off of Maize.. Are you mayan? ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17gi2p/visiting_uiuc_tomorrow_is_there_any_interesting/"
  }, {
    "id" : 35,
    "title" : "Buses running until 5am?",
    "snippet" : "A friend told me that the campus buses (I think the 220 specifically?) are now running until 5am. Is this true &amp; is it just the 220?   Not 100% sure if this is new or not, but it does run until 5am [on Friday and Saturday Nights](http://www.cumtd.com/maps-and-schedules/route/220-illini/saturday/night) according to the schedule but it doesn't say anything about weekday evenings. You could always call and ask if you're that curious. \n",
    "url" : "http://www.reddit.com/r/UIUC/comments/17gysz/buses_running_until_5am/"
  }, {
    "id" : 36,
    "title" : "MCAT study buddy...",
    "snippet" : "Anybody taking the March/April MCAT want to get together to study a few times a week?    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17hdhe/mcat_study_buddy/"
  }, {
    "id" : 37,
    "title" : "Has anyone ever been a LAS 101 or 122 intern?",
    "snippet" : "Or whatever the equivalent was in your college? Did you like the experience/think it was worth it? Thanks for any input!  I was an LAS 122 intern last year. Overall it was pretty easy. The lesson plans that you have are given to you so you don't have to get super creative with the lesson plan. My students were pretty cool though and no one caused trouble in class thank god. On the whole I liked it, and I'd say give it a shot.",
    "url" : "http://www.reddit.com/r/UIUC/comments/17frcd/has_anyone_ever_been_a_las_101_or_122_intern/"
  }, {
    "id" : 38,
    "title" : "Are cs125 exams really worth $1000?",
    "snippet" : "  As the CS125 instructor I find this interesting, flattering and saddening too. The question is whether to put up a warning sign, pounce like a cat, or set a trap like a spider. It won't be the first time a student has been thrown out of UIUC due to a CS125 exam. \nBy the way it takes about 100 hours to just to write the 4 exams - so I claim they should be worth a lot more! On the other-hand he could just go to office hours, use Piazza etc etc and actually learn some CS skills and knowledge instead. Oh hey Professor Angrave! As the CS125 instructor I find this interesting, flattering and saddening too. The question is whether to put up a warning sign, pounce like a cat, or set a trap like a spider. It won't be the first time a student has been thrown out of UIUC due to a CS125 exam. \nBy the way it takes about 100 hours to just to write the 4 exams - so I claim they should be worth a lot more! On the other-hand he could just go to office hours, use Piazza etc etc and actually learn some CS skills and knowledge instead. lol. Professor Angrave on reddit. http://i.imgur.com/PGGhl.gif He's so hip.  He even used a throwaway, which means he probably has an actual account Or maybe he made an account for the first time? The learning curve for using reddit is steep.\n\nWhat is the world coming to? Professors, police, FBI browsing /r/uiuc. Or maybe he made an account for the first time? The learning curve for using reddit is steep.\n\nWhat is the world coming to? Professors, police, FBI browsing /r/uiuc. If you had told me ~~11 years ago~~ nine years ago that I would be abandoning facebook because I couldn't avoid my parents, aunts, cousins, nieces, and nephews, I would have been kind of surprised. It did take quite a while though.\n\nKind of an interesting life cycle, for websites... 11 years ago there was no facebook As the CS125 instructor I find this interesting, flattering and saddening too. The question is whether to put up a warning sign, pounce like a cat, or set a trap like a spider. It won't be the first time a student has been thrown out of UIUC due to a CS125 exam. \nBy the way it takes about 100 hours to just to write the 4 exams - so I claim they should be worth a lot more! On the other-hand he could just go to office hours, use Piazza etc etc and actually learn some CS skills and knowledge instead. I personally would recommend setting a trap like a spider followed by pouncing like a cat.  As the CS125 instructor I find this interesting, flattering and saddening too. The question is whether to put up a warning sign, pounce like a cat, or set a trap like a spider. It won't be the first time a student has been thrown out of UIUC due to a CS125 exam. \nBy the way it takes about 100 hours to just to write the 4 exams - so I claim they should be worth a lot more! On the other-hand he could just go to office hours, use Piazza etc etc and actually learn some CS skills and knowledge instead. Please set a trap like a spider, and then pounce like a cat. The following was written by you on your website:\n\n&gt;[*If you're not prepared to mentally work hard (12+ solid hours per week) on learning and push your brain to analyze and solve technical problems, then this course is not for you. So yes - this is a significant time commitment but more importantly it's a commitment to your future self.*](https://wiki.engr.illinois.edu/display/cs125/Communications)\n\nIf they can't get through a 100-level course without paying someone to take their exam for them, do you think that they are in the right program? Do you think that this is the right course for them?\n\nIf I were a CS undergrad taking this course, I'd be super-pissed that someone is getting their grades *by having more money than me*... while I'm legitimately trying to pass the exams by taking notes every lecture. Well seeing as you are still a grad student...\n\nOnce you get out into the real world you will realize that money makes the world go around. I would think you would know that with the 100k+ you've paid for your education without seeing any RoI yet ;) I know enough about the *Real World*™ to understand that the mosquitoes that get swatted are the ones that get caught.\n\nThis particular mosquito doesn't seem to fly silently enough to warrant getting a pass, so I have no qualms with them getting punished for their idiocy. As the CS125 instructor I find this interesting, flattering and saddening too. The question is whether to put up a warning sign, pounce like a cat, or set a trap like a spider. It won't be the first time a student has been thrown out of UIUC due to a CS125 exam. \nBy the way it takes about 100 hours to just to write the 4 exams - so I claim they should be worth a lot more! On the other-hand he could just go to office hours, use Piazza etc etc and actually learn some CS skills and knowledge instead. What exactly is the ad asking for? Someone to go and physically take the test for them?\n\n&gt; it takes about 100 hours to just to write the 4 exams\n\nNot familiar with these exams, what kind of exam takes 25 hours?\n &gt;What exactly is the ad asking for? Someone to go and physically take the test for them?\n\nThat's what it looks like. It'd require some shennanigans with an iCard, but nothing that's impossible for someone determined. \n It's hard to say this without sounding racist, but a lot of chinese students look pretty similar. If the class is large enough that the professor / TA's don't know the student specifically, I don't think that it'd be very hard for one student to take the exam with anothers' ID. I've heard of people going as far as making fake IDs for tests. They're gonna have so much fun in the real world when they tell employers about their CS minor and then can't demonstrate skills learned in the first month of an introductory CS class.  It's hard to say this without sounding racist, but a lot of chinese students look pretty similar. If the class is large enough that the professor / TA's don't know the student specifically, I don't think that it'd be very hard for one student to take the exam with anothers' ID. It's hard to say this without sounding racist, but a lot of chinese students look pretty similar. If the class is large enough that the professor / TA's don't know the student specifically, I don't think that it'd be very hard for one student to take the exam with anothers' ID. &gt;What exactly is the ad asking for? Someone to go and physically take the test for them?\n\nThat's what it looks like. It'd require some shennanigans with an iCard, but nothing that's impossible for someone determined. \n Well I'd think it would be much easier and less stressful to actually study and take the exams themselves. Posting an ad, finding a willing person to take the test, arranging for ID swaps/disguises, risking getting caught, etc. seem way more work than actually studying. If they got admitted to the program in the first place, how hard can a 100-level course be? Or does UIUC lower admission standards for international students because they bring in tuition money?  Well I'd think it would be much easier and less stressful to actually study and take the exams themselves. Posting an ad, finding a willing person to take the test, arranging for ID swaps/disguises, risking getting caught, etc. seem way more work than actually studying. If they got admitted to the program in the first place, how hard can a 100-level course be? Or does UIUC lower admission standards for international students because they bring in tuition money?  The other thing to consider is that people who cheat here as freshmen very likely got here by cheating as freshmen 4 years ago. What do you mean by that? They cheated in freshman year of high school? What exactly is the ad asking for? Someone to go and physically take the test for them?\n\n&gt; it takes about 100 hours to just to write the 4 exams\n\nNot familiar with these exams, what kind of exam takes 25 hours?\n As the CS125 instructor I find this interesting, flattering and saddening too. The question is whether to put up a warning sign, pounce like a cat, or set a trap like a spider. It won't be the first time a student has been thrown out of UIUC due to a CS125 exam. \nBy the way it takes about 100 hours to just to write the 4 exams - so I claim they should be worth a lot more! On the other-hand he could just go to office hours, use Piazza etc etc and actually learn some CS skills and knowledge instead.  I'll do it for $900  I was cruising that message board for a few minutes and it looks like this kind of \"job offer\" is not uncommon. Is it just an international student problem? Do these people think they can discuss this on a public forum in the most widely used language in the world and not get caught?\n\nEdit: Ok, to be fair, I read more of the forum on my bus ride to work. The vast majority of the posts are benign. There were 3 asking for people to take test/attend class on their behalf and 2 posts looking for people to write college admission essays on other's behalf. As someone who has been on both the student and teacher perspectives, I would like to offer this closing thought: everyone cheats, and Chinese international students are by far the most entitled and unapologetic cheaters. I was cruising that message board for a few minutes and it looks like this kind of \"job offer\" is not uncommon. Is it just an international student problem? Do these people think they can discuss this on a public forum in the most widely used language in the world and not get caught?\n\nEdit: Ok, to be fair, I read more of the forum on my bus ride to work. The vast majority of the posts are benign. There were 3 asking for people to take test/attend class on their behalf and 2 posts looking for people to write college admission essays on other's behalf. As someone who has been on both the student and teacher perspectives, I would like to offer this closing thought: everyone cheats, and Chinese international students are by far the most entitled and unapologetic cheaters. I was cruising that message board for a few minutes and it looks like this kind of \"job offer\" is not uncommon. Is it just an international student problem? Do these people think they can discuss this on a public forum in the most widely used language in the world and not get caught?\n\nEdit: Ok, to be fair, I read more of the forum on my bus ride to work. The vast majority of the posts are benign. There were 3 asking for people to take test/attend class on their behalf and 2 posts looking for people to write college admission essays on other's behalf. As someone who has been on both the student and teacher perspectives, I would like to offer this closing thought: everyone cheats, and Chinese international students are by far the most entitled and unapologetic cheaters. &gt; Chinese international students are by far the most entitled and unapologetic cheaters.\n\nReally? I see them working very hard (at least the graduate students), so I wonder why they would need to cheat. &gt; Chinese international students are by far the most entitled and unapologetic cheaters.\n\nReally? I see them working very hard (at least the graduate students), so I wonder why they would need to cheat. That is my observation for undergrads only. I don't personally know any grad students that cheat, nor have I heard of anyone in my department blatantly cheating.  I've never actually have one come in. I got a buddy that's an expert in CS125 exams, lemme give him a call. Hey yeah I got an A+ in CS125, so the guys call me in whenever they have a question about the course.  \n\n What people think of when they take CS125 is Prof. Angrave and fedoras, and that's really what you get out of the class. The exams aren't really what people are interested in these days. A high score on the exams really isn't that difficult to acquire if you've been attending the lecture and do the proper work. In today's market, I've seen these exams going for maybe 100 to 150 dollars a piece, but that's from a perfect exam stand in. With this particular instance I'm a little suspect because of the location of the posting, and the non native language which suggests this may be a reproduction \"CS125 God.\"  \n\nI would put the value of this guy at about 50$ per exam, with the final being maybe 75$.   Doesn't seem to be the only time he's asked these things.\n\nThis one includes an email:\n\n&gt; http://www.uiuccssa.org/bbs/archiver/?tid-27043.html\n\nAnyone here a member of the uiuc cssa? How common is this?\n\n 1. Email poster with interest in job offer from @illinois.edu email account.\n\n2. Receive reply, perhaps getting personal information (necessary to take the exams).\n\n3. Take correspondence(s) to CS125 professor.\n\n4. Get idiot failed and/or expelled.\n\n-----\n\nI really hate rich kids who think they can buy their degrees. These types of people start by paying for their exams, then graduate and end up paying for their Masters or PhD theses using [resources like this](http://www.customwritings.com/thesis-writer.html), because they never learned a single thing in undergraduate. They are parasites on the system, and have already doomed themselves to failure.\n\nI don't know what's worse. Paying for your grades, or being so *obvious* about it. I suppose when you have money, it doesn't really matter. 1. Email poster with interest in job offer from @illinois.edu email account.\n\n2. Receive reply, perhaps getting personal information (necessary to take the exams).\n\n3. Take correspondence(s) to CS125 professor.\n\n4. Get idiot failed and/or expelled.\n\n-----\n\nI really hate rich kids who think they can buy their degrees. These types of people start by paying for their exams, then graduate and end up paying for their Masters or PhD theses using [resources like this](http://www.customwritings.com/thesis-writer.html), because they never learned a single thing in undergraduate. They are parasites on the system, and have already doomed themselves to failure.\n\nI don't know what's worse. Paying for your grades, or being so *obvious* about it. I suppose when you have money, it doesn't really matter. It's definitely believable you can bullshit your way through an undergraduate degree, which is deplorable. There's no way you could use a site like above and get a Ph.D. or Master's degree, particularly in a science or engineering field. You don't just submit a thesis and get it, people would realize you haven't done a lick of research (plus things like qualifying exams and prelims).  You'd think so but there actually are examples of people who have tried to pay someone else to write a thesis for them.  1. Email poster with interest in job offer from @illinois.edu email account.\n\n2. Receive reply, perhaps getting personal information (necessary to take the exams).\n\n3. Take correspondence(s) to CS125 professor.\n\n4. Get idiot failed and/or expelled.\n\n-----\n\nI really hate rich kids who think they can buy their degrees. These types of people start by paying for their exams, then graduate and end up paying for their Masters or PhD theses using [resources like this](http://www.customwritings.com/thesis-writer.html), because they never learned a single thing in undergraduate. They are parasites on the system, and have already doomed themselves to failure.\n\nI don't know what's worse. Paying for your grades, or being so *obvious* about it. I suppose when you have money, it doesn't really matter.  This is really interesting. I had a friend in MSE 401 last semester who observed that during an in-class quiz, one international student, wearing a white hoodie, asked to go to the bathroom, and another international student, this one wearing a purple hoodie, came back.\nWhat saddened me most about this was that it was unclear whether anything was done about this at all- I imagine it would have been pretty easy to prove that there was something academically dishonest going on. Your friend should have said something after class. Professor Dillon would have at least started watching that student more closely.  Remember kids, crime pays.  Anyone have a screenshot of the message that was posted? It has now disappeared. Word must have spread fast and reached the original poster. \n\nI'm also curious, is this kind of behavior accepted in Chinese culture - the end being more important than the means? If hypothetically I wanted to hire someone to take my exams, I would be too embarrassed to post it on a public message board, I would do it more discreetly to maintain some semblance of dignity/respectability. There must be many Chinese people on /r/uiuc - please clarify this for the rest of us. Do the others who read those boards simply accept it as normal and look the other way and leave these posts unreported? Even OP calls themself \"wasnotmybusiness\". Anyone have a screenshot of the message that was posted? It has now disappeared. Word must have spread fast and reached the original poster. \n\nI'm also curious, is this kind of behavior accepted in Chinese culture - the end being more important than the means? If hypothetically I wanted to hire someone to take my exams, I would be too embarrassed to post it on a public message board, I would do it more discreetly to maintain some semblance of dignity/respectability. There must be many Chinese people on /r/uiuc - please clarify this for the rest of us. Do the others who read those boards simply accept it as normal and look the other way and leave these posts unreported? Even OP calls themself \"wasnotmybusiness\". I'm going to overly generalize this but I feel like it's applicable to international students from all countries, not just China.\n\nMany come from VERY wealthy families. This should be pretty obvious as out of state tuition is already insanely high. I know a lot of people with wealthy backgrounds who fuck around 24/7.\n\nThe other percentage of international students came here with a lot of  hard work. Often times their families have spent all their savings in order to provide their children with a good education in the States.\n\nNo, it is definitely not accepted as a part of the culture. There are idiots in every culture. &gt; No, it is definitely not accepted as a part of the culture.\n\nI disagree. From what I've seen they have a very different cultural understanding of what constitutes cheating. During one of our \"ethics\" lectures, we had a group of chinese students argue with the professor that if you're sick for a week and can't make it to lecture, it's perfectly okay to copy your friend's homework since \"it wasn't your fault\". A large group of them also got caught buying past exams (which weren't supposed to be available) and when the professor found out they complained because they bought them fair and square. The entire exam results were thrown out.\n\nThings like this seemed much more common with the Chinese students than the other international groups. It's not that they want to be lazy --its the opposite. They care *so much* about succeeding that they go to great lengths to do it. &gt; No, it is definitely not accepted as a part of the culture.\n\nI disagree. From what I've seen they have a very different cultural understanding of what constitutes cheating. During one of our \"ethics\" lectures, we had a group of chinese students argue with the professor that if you're sick for a week and can't make it to lecture, it's perfectly okay to copy your friend's homework since \"it wasn't your fault\". A large group of them also got caught buying past exams (which weren't supposed to be available) and when the professor found out they complained because they bought them fair and square. The entire exam results were thrown out.\n\nThings like this seemed much more common with the Chinese students than the other international groups. It's not that they want to be lazy --its the opposite. They care *so much* about succeeding that they go to great lengths to do it.    As a non CS major, can someone elaborate a little bit on the exam? Is it an online required exam(s) taken throughout the semester? Is it multiple choice or requires code? I'm guessing answers floating around won't be of much good for the test?  thread deleted ... :( did someone get a screencap?  I dont really understand why people make sucha a big deal about cheating. So what if some people get away with it on a few tests. Its gonna come back to bite them in the ass in subsequent courses, or when they try to find a job. \n\nEven if you somehow managed to cheat on every test and graduate with a 4.0, im sure you would not get past the interview process.  I agree somewhat: The curves in many core classes mean that a cheater who gets an A is robbing a deserving student of that A.\n\nThen again, grades aren't that important in CS if you're just trying to get a job after undergrad. They're just one method of earning a job interview with many companies. I agree somewhat: The curves in many core classes mean that a cheater who gets an A is robbing a deserving student of that A.\n\nThen again, grades aren't that important in CS if you're just trying to get a job after undergrad. They're just one method of earning a job interview with many companies. More importantly though why the hell would you cheat on a cs125 test. Its one of the best classes I have ever taken, and while it is difficult it seems like you would really have to try hard to get below a B-/C+\n",
    "url" : "http://translate.google.com/translate?hl=en&amp;sl=auto&amp;tl=en&amp;u=http%3A%2F%2Fwww.uiuccssa.org%2Fbbs%2Fviewthread.php%3Ftid%3D30103%26extra%3Dpage%253D1"
  }, {
    "id" : 39,
    "title" : "Help fund a new all-ages music venue in town! Opens in April.",
    "snippet" : " ",
    "url" : "http://igg.me/p/316203"
  }, {
    "id" : 40,
    "title" : "ECS fair ",
    "snippet" : "Hi guys\n\nSo tomorrow is the ECS career fair, and unfortunately I never got around to registering\n\nDoes anyone know if it's actually possible to attend without prior registration?\n\n\n   No need to register. Just bring your I-card, resumes, and preferably a printed name tag from DCL so you don't have to wait in the line for those. \n\nAlso suit up. Do one really have to suit up? Yeah it's the dress code - it's like a uniform, *everyone* sticks to it, even women. You'd feel very out of place if you didn't suit up. If you're not looking for a job/internship and are simply there to collect freebies I guess you can go in jeans - not sure if anyone checks you are dressed properly before they let you enter. I was planning to go in with a nice dress shirt, dress pant and dress shoe. No suit. I think it's professional enough? I did something like that last time and carried a plastic folder instead of a leather portfolio and I did feel quite out of place - and that was in September when it was too hot for a suit. I don't know whether employers will discriminate but you might yourself feel less confident if you are underdressed. You could just look around the first day and decide how you feel about it. Maybe a sports coat would do if you don't have a suit (not sure though - maybe others here know this stuff better). I did something like that last time and carried a plastic folder instead of a leather portfolio and I did feel quite out of place - and that was in September when it was too hot for a suit. I don't know whether employers will discriminate but you might yourself feel less confident if you are underdressed. You could just look around the first day and decide how you feel about it. Maybe a sports coat would do if you don't have a suit (not sure though - maybe others here know this stuff better). ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17gqts/ecs_fair/"
  }, {
    "id" : 41,
    "title" : "Bookmarklet to reload a paper database through the library's proxy - easy access to papers from home",
    "snippet" : "For any of you who love the breadth of access to research paper databases that we have on campus, and want to enjoy the same at home with ease, I made you this bookmarklet:\n\njavascript:%20window.location%20=%20window.location.protocol%20+%20'//'%20+%20window.location.hostname%20+%20'.proxy2.library.illinois.edu'%20+%20window.location.pathname%20+%20window.location.search;\n\nIt tacks on '.proxy2.library.illinois.edu' to the domain name in the URL and reloads the page. The first time in a session, the proxy will want to authenticate you. After that, just click and smile :-). I've tested it with the ACM and IEEE sites, but it should work for anything else that's authentication-free on campus.\n\nTo install it, copy the text into a bookmark in your browser. Reddit doesn't want to format it as a link like I asked it to :-/  You can also use VPN! Ewww. Fuck that noise. Incredibly slow, drops connections, requires configuration on every machine I touch, etc. I'll take 1 line of JS in a browser any day.",
    "url" : "http://www.reddit.com/r/UIUC/comments/17ewyy/bookmarklet_to_reload_a_paper_database_through/"
  }, {
    "id" : 42,
    "title" : "Is the Summer Management Program / College Works Program a scam?",
    "snippet" : "A few representatives spoke in my ECE 110 class and had us fill out a card. Heard back from the guys for a meeting. Gut feeling said it was was a scam.  I seen this many times, and with today's difficult job market, I follow a general rule:\n\nIf a person walks up to you and they have absolutely no knowledge of who you are, how qualified you are, and if you even know what their company is and they offer you a job ANYWAY - that job is most likely bullshit.\n\nEDIT: Grammar I seen this many times, and with today's difficult job market, I follow a general rule:\n\nIf a person walks up to you and they have absolutely no knowledge of who you are, how qualified you are, and if you even know what their company is and they offer you a job ANYWAY - that job is most likely bullshit.\n\nEDIT: Grammar Thanks!  I did this a couple summers ago. Not really a scam, but its super shady. You'll go through some basic training for painting, but most of it focuses on business. You will make your own painting business, market it, hire for it, book painting jobs, and manage the work sites. The whole program is kind of a crap shoot. If you're lucky you'll have a lot of help for the summer and spring and hire some good workers, paint 10-15 houses, and pocket around $10,000 during the summer. If you're unlucky, you'll be left to fend for yourself, and have very little to show for it, and end up either making $2,000 or just breaking even. Either way, it all boils down to how much you time you put in to it. It can be around 20-30hrs/week during the semester and the 50+hrs/week during the summer on the high end, or you could put in the minimum and have a shitty time. All in all, I don't regret doing it, but I wouldn't do it again if I got the chance. If my lackluster response doesn't give you enough info., feel free to ask me more. I did this a couple summers ago. Not really a scam, but its super shady. You'll go through some basic training for painting, but most of it focuses on business. You will make your own painting business, market it, hire for it, book painting jobs, and manage the work sites. The whole program is kind of a crap shoot. If you're lucky you'll have a lot of help for the summer and spring and hire some good workers, paint 10-15 houses, and pocket around $10,000 during the summer. If you're unlucky, you'll be left to fend for yourself, and have very little to show for it, and end up either making $2,000 or just breaking even. Either way, it all boils down to how much you time you put in to it. It can be around 20-30hrs/week during the semester and the 50+hrs/week during the summer on the high end, or you could put in the minimum and have a shitty time. All in all, I don't regret doing it, but I wouldn't do it again if I got the chance. If my lackluster response doesn't give you enough info., feel free to ask me more.     One of my friends did this a couple summers ago and hired all of his friends to work for him. I think he ended up making around 10,000 but lost most of his friends because he was paying them less than minimum wage. He would block off a wall and say this wall should take 4 hours and it would take 8 because most of the houses were in shitty condition and prepping took a long time. So we would get paid 8.25 X 4 hours for 8 hours of manual labor.\n\nAlso college works takes like 30% and i think the district manager takes 10-15% you also pay for equipment and supplies so if you really wanted to do this do it yourself and you could make a hell of a lot more.    ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17elud/is_the_summer_management_program_college_works/"
  }, {
    "id" : 43,
    "title" : "Potential Referendum Question.....another mandatory student fee ",
    "snippet" : "\"Should each student contribute $2.00 per semester to the Student Government to keep the Student Government financially independent from the University and Campus Administrations?\"\n\n/Discuss\n\n  This may be an unpopular stance but I couldn't give a good goddamn about the goddamn student government. You want to be financially independent from the university? Start a fucking bake sale. \n\nUntil policies go into play that are a bit more cost-effective and not a waste of everybody's goddamn time (Hey let's waste a bunch of money banning smoking) they can feel free to shove their two dollars right up their cornholes. Seriously. I'm also going to hijack your top comment here and ask, what exactly is it that the student government actually does? So far I have only seen two things that involve the government. 1 is ban smoking, which I know is an explosive topic but I think is a load of nonsense. The other is offer an outlet for fraternity brothers to get elected to some power position. I know this because I've seen a ton of friends share \"XX Fratstar for Student Government\" FB pages. \n\nSo what is it that the Student Government needs $60,000 to run? Seriously. I'm also going to hijack your top comment here and ask, what exactly is it that the student government actually does? So far I have only seen two things that involve the government. 1 is ban smoking, which I know is an explosive topic but I think is a load of nonsense. The other is offer an outlet for fraternity brothers to get elected to some power position. I know this because I've seen a ton of friends share \"XX Fratstar for Student Government\" FB pages. \n\nSo what is it that the Student Government needs $60,000 to run? Looking at their budget from the 2011-2012 year, without context it just looks like they're paying themselves. I really hope I'm wrong with this.  Seriously. I'm also going to hijack your top comment here and ask, what exactly is it that the student government actually does? So far I have only seen two things that involve the government. 1 is ban smoking, which I know is an explosive topic but I think is a load of nonsense. The other is offer an outlet for fraternity brothers to get elected to some power position. I know this because I've seen a ton of friends share \"XX Fratstar for Student Government\" FB pages. \n\nSo what is it that the Student Government needs $60,000 to run? [deleted] Sorry I didn't mean it to come off as such. I have nothing against frats themselves, but when they utilize their networks to set members up for elections it does bother me. I know that's one of the biggest perks of frats but I think it takes a large portion of integrity out of these school elections though.  Sorry I didn't mean it to come off as such. I have nothing against frats themselves, but when they utilize their networks to set members up for elections it does bother me. I know that's one of the biggest perks of frats but I think it takes a large portion of integrity out of these school elections though.  Anyone with a lot of friends would be able to do the same thing. Whether they were in a fraternity or not. I know but that's not really the point.  Why? Any social person could do the same thing. Anyone in say the rock climbing club could easily get all their rock climbing friends to vote for them. Do you really expect antisocial people to do as well in elections as social people? Politics shouldn't be dependent on who you know. It can be dependent on popularity, but only if that popularity is drawn from support for your political ideals. I doubt people who know a candidate for their rockclimbing skills would be informed of their politics.  Well then leave frat's out of it because it's a political problem bro.\n Sorry I didn't mean it to come off as such. I have nothing against frats themselves, but when they utilize their networks to set members up for elections it does bother me. I know that's one of the biggest perks of frats but I think it takes a large portion of integrity out of these school elections though.  [deleted] So because something is like real politics its a good thing?? [deleted] That's the idea. You can't work for a change so you're just accepting the fate you've been given. Good one.  [deleted] This may be an unpopular stance but I couldn't give a good goddamn about the goddamn student government. You want to be financially independent from the university? Start a fucking bake sale. \n\nUntil policies go into play that are a bit more cost-effective and not a waste of everybody's goddamn time (Hey let's waste a bunch of money banning smoking) they can feel free to shove their two dollars right up their cornholes. This may be an unpopular stance but I couldn't give a good goddamn about the goddamn student government. You want to be financially independent from the university? Start a fucking bake sale. \n\nUntil policies go into play that are a bit more cost-effective and not a waste of everybody's goddamn time (Hey let's waste a bunch of money banning smoking) they can feel free to shove their two dollars right up their cornholes. How is banning smoking expensive? A) Enforcing the ban costs money (staff, processing)\n\nB) Setting up places to sequester the smokers (smoking huts, designated areas, etc)\n\nDo you have an idea of how much just those goddamn metal signs cost? It's ridiculous and most of of all DOES NOT MAKE THIS CAMPUS MORE ATTRACTIVE TO THE CASH-COW THAT IS INTERNATIONAL ENGINEERING STUDENTS Two points:\n\n1) ISS did not sponsor or support the smoking ban. Regardless of what University officials may have said, the ban was conceived and promoted by the former Student Trustee - an elected official beyond the control of the ISS.\n\nI for one hate smoking, but a total ban on a campus this size is ill-advised and a clear violation of personal freedom.\n\n2) As a member of the Academic (faculty-student) Senate's committee on University Student Life, I don't remember smoking shelters or designated areas coming up in discussion. I wouldn't expect to see any. 1) The resources of the campus police or whoever would be enforcing this waste of time are not infinite, and either the university must spend more to add officers to not cut on policing elsewhere or they will be tied up doing garbage like citing people for smoking instead of driving around giving jaywalking tickets like we need them to (sarcasm on that last bit...) And yes, the funds for this sort of thing won't come from the ISS but they have to come from somewhere and I sure as shootin' know UIUC is not running a massive surplus.\n\n2) The shelters and such had been discussed by various people involved with the ban in the past, didn't realize there wasn't an a policy of \"hit the bricks, asshole\" instead of one of accomodation. Actually, it looks like they are going for more of a 'hit the bricks, asshole' approach.\n\nhttp://www.campusrec.illinois.edu/Smoke-Free/faq.html\n\n&gt;Question: Will there be designated smoking areas on campus?\n&gt;\nNo. Smoking will be prohibited on all campus grounds. There are two reasons for this:\n&gt;\nEstablishing designated smoking areas undermines the new policy. The purpose of the policy is to create a health-supporting community for everyone, tobacco-users and non-users alike. Creating smoking areas does not contribute to that purpose.\n&gt;\nSmoking zones and perimeter policies have not been found to be effective or enforceable, and smoking shelters are expensive to construct and maintain. Campuses with full smoke-free policies have reported fewer problems with compliance than policies that include smoking areas.  But guys, if we don't fund the Student Senate, then how else will they be able to pay for [more than $9,000 in self-advertisement?](http://www.dailyillini.com/news/campus/article_8b09184a-47e2-11e2-af22-001a4bcf6878.html)\n\nSeriously, I hate our student government for shit like this.  If other RSOs need to raise their own money if they want more than basic funding, why does the student government deserve special treatment? I can literally think of dozens of better ways to spend that money on campus.  Why give it to a bunch of entitled, self-involved clowns?\n\n1) Repaint the bike lanes on campus\n2) Improve CITES infrastructure/staff\n3) Build/improve bus shelters on some of the more common stops on campus\n4) Fix some of the aging AV systems in the classrooms on campus\n5) Better quality toilet paper for the restrooms on campus\n6) Improve the desks/chairs in some of the older classrooms\n7) Investigate safer ways to route street traffic through/around campus\n8) A student sponsored scholarship for underprivileged or underrepresented students\n9) An annual campus wide reward to recognize outstanding instructors\n10) Improve the security systems on the dormitories\n11) Pay for campus police to do extra patrols of some of the more dangerous areas on campus\n12) Replace/repair some of the damaged equipment in the ARC\n\nAnd those are just off the top of my head. I think some of those issues have more to do with the city and not the university.  I can literally think of dozens of better ways to spend that money on campus.  Why give it to a bunch of entitled, self-involved clowns?\n\n1) Repaint the bike lanes on campus\n2) Improve CITES infrastructure/staff\n3) Build/improve bus shelters on some of the more common stops on campus\n4) Fix some of the aging AV systems in the classrooms on campus\n5) Better quality toilet paper for the restrooms on campus\n6) Improve the desks/chairs in some of the older classrooms\n7) Investigate safer ways to route street traffic through/around campus\n8) A student sponsored scholarship for underprivileged or underrepresented students\n9) An annual campus wide reward to recognize outstanding instructors\n10) Improve the security systems on the dormitories\n11) Pay for campus police to do extra patrols of some of the more dangerous areas on campus\n12) Replace/repair some of the damaged equipment in the ARC\n\nAnd those are just off the top of my head. To address your concerns:\n\n1. I've been told that Urbana and Champaign actually own these. Although that never made much sense to me, you'd get more traction calling your City Councilperson.\n2. Does anything in particular bother you about CITES?\n3. Again, I'm not sure if the shelters belong to the University or MTD. I'll look into it. Any stops in particular you'd like to see? (I spend most of my time north of Green, so I'm not ideally placed to know about the southern bus routes.)\n4. ISS once tried to have a ceiling projector installed in a room at the Union. The University wanted $15,000 just to install the mounting bracket and power outlet. That should give some perspective on how much an AV system costs.\n5. God yes, though I would wager the budget for toilet paper is more than any twenty students pay in tuition.\n6. Last I heard, the state of Illinois owes the University tens, if not hundreds, of millions of dollars for maintenance and renovation projects. Combine that with a multi-year planning, purchasing, and evaluation process, and renovating one classroom or lab can take the better part of a decade and $100,000. The Academic (faculty-student) Senate has started a lobbying effort with the state legislature to fix some of these issues, but it's going to be an uphill battle.\n7. There are Campus Committees dedicated to this kind of thing, but they often lack students willing offer input. [Apply here](http://www.iss.illinois.edu/ccapplication.aspx).\n8. Agreed.\n9. University administrators giving large cash gifts to faculty? That sounds like a recipe for corruption to me, but I'm a bit of a cynic. The ISS [gives out \"Teaching Excellence Awards\" annually](http://www.reddit.com/r/UIUC/comments/16wadn/seeking_nominations_for_teaching_excellence_awards/) by the way, based on student nominations.\n10. As a graduate student, I'm not familiar with security at the student dorms. Anything particularly concerning there?\n11. I agree that we need to up police presence on campus at night. I did my undergraduate at Virginia Tech, and the campus police there were far more active at night than here.\n12. Campus Rec receives a very generous budget from the University and student fees. If something is broken and not fixed quickly, it's most likely not been reported up to the people in charge. I can get you the contact info if you have specifics.\n\nAnything else? That was super interesting and informative, and I can tell you put a lot of thought and effort into it.  Thank you!  If I could transfer my karma down here to get more attention to your post, I would do it.  People should definitely read it.  I'm not going to do a point by point response to distract from it (but I do want to discuss all of this more!)\n\nThe reason for my list was more to make the point that an increase in tuition should go toward improving the life of students on campus, and that I could easily think of some of those ways off the top of my head.  Maybe they're not all practical, but there's obviously a lot we could do.  I don't really see student government taking the lead on these kinds of issues. I can literally think of dozens of better ways to spend that money on campus.  Why give it to a bunch of entitled, self-involved clowns?\n\n1) Repaint the bike lanes on campus\n2) Improve CITES infrastructure/staff\n3) Build/improve bus shelters on some of the more common stops on campus\n4) Fix some of the aging AV systems in the classrooms on campus\n5) Better quality toilet paper for the restrooms on campus\n6) Improve the desks/chairs in some of the older classrooms\n7) Investigate safer ways to route street traffic through/around campus\n8) A student sponsored scholarship for underprivileged or underrepresented students\n9) An annual campus wide reward to recognize outstanding instructors\n10) Improve the security systems on the dormitories\n11) Pay for campus police to do extra patrols of some of the more dangerous areas on campus\n12) Replace/repair some of the damaged equipment in the ARC\n\nAnd those are just off the top of my head. I can literally think of dozens of better ways to spend that money on campus.  Why give it to a bunch of entitled, self-involved clowns?\n\n1) Repaint the bike lanes on campus\n2) Improve CITES infrastructure/staff\n3) Build/improve bus shelters on some of the more common stops on campus\n4) Fix some of the aging AV systems in the classrooms on campus\n5) Better quality toilet paper for the restrooms on campus\n6) Improve the desks/chairs in some of the older classrooms\n7) Investigate safer ways to route street traffic through/around campus\n8) A student sponsored scholarship for underprivileged or underrepresented students\n9) An annual campus wide reward to recognize outstanding instructors\n10) Improve the security systems on the dormitories\n11) Pay for campus police to do extra patrols of some of the more dangerous areas on campus\n12) Replace/repair some of the damaged equipment in the ARC\n\nAnd those are just off the top of my head. I like the bike paths one. Perhaps also install a few bike racks in more places. I like using them. I don't like putting my bike on one of the posts for the chain fence. But guys, if we don't fund the Student Senate, then how else will they be able to pay for [more than $9,000 in self-advertisement?](http://www.dailyillini.com/news/campus/article_8b09184a-47e2-11e2-af22-001a4bcf6878.html)\n\nSeriously, I hate our student government for shit like this.  If other RSOs need to raise their own money if they want more than basic funding, why does the student government deserve special treatment?     No. I cannot see what the Student Government would need with $85,766 annually. Based off the [allocated budget for this year](http://iss.illinois.edu/ISS_Budget_2011-2012.pdf), I'm only questioning where the $72,000 you've got budgeted from the university is going.   \nWhere exactly is it going, besides towards passing bans on things that the bulk of student body doesn't care about [(IE voter turnout for the smoking ban)](http://www.dailyillini.com/news/article_7e6c65cb-6227-56cf-b834-2e4daa02300b.html)?  Wow, $2,294 for telephone lines.   To be fair, they are made of solid gold. No. I cannot see what the Student Government would need with $85,766 annually. Based off the [allocated budget for this year](http://iss.illinois.edu/ISS_Budget_2011-2012.pdf), I'm only questioning where the $72,000 you've got budgeted from the university is going.   \nWhere exactly is it going, besides towards passing bans on things that the bulk of student body doesn't care about [(IE voter turnout for the smoking ban)](http://www.dailyillini.com/news/article_7e6c65cb-6227-56cf-b834-2e4daa02300b.html)?  WHERE DOES THIS MONEY GO WHAT THE HELL DO YOU NEED FOUR THOUSAND DOLLARS FOR A COMMITTEE FOR No. I cannot see what the Student Government would need with $85,766 annually. Based off the [allocated budget for this year](http://iss.illinois.edu/ISS_Budget_2011-2012.pdf), I'm only questioning where the $72,000 you've got budgeted from the university is going.   \nWhere exactly is it going, besides towards passing bans on things that the bulk of student body doesn't care about [(IE voter turnout for the smoking ban)](http://www.dailyillini.com/news/article_7e6c65cb-6227-56cf-b834-2e4daa02300b.html)?  $2,500 a year on *office supplies*?\n\nThe average cost of office supplies in the US [is about $20/month](http://www.bundle.com/spending/data/office-supplies-20/). Keep in mind that number is for... you know... *actual businesses*. Unless they're swimming in printer ink, I refuse to believe that they can run through that much money.\n\nI hope that their actual *spending* was nowhere near the amount that they *budgeted*. The average business doesn't have to print out **54 copies of everything**.\n\nBecause each senator has to receive the agenda, minutes, and pieces of proposed legislation in print at the meetings, the ISS goes through a mountain of paper and ink - even printing two pages per side and double-sided. (It has been suggested that this be done digitally only, but that would unfairly exclude student senators unable to afford electronics.) Then you start piling on staples, binders (for storing all those documents until the session ends), pens, printer repair/replacement costs...\n\nI don't think the amount spent comes near the budgeted amount in the end, but that budget reflects a sort of worst case scenario. (That and I've heard that last year's treasurer was extremely incompetent.)\n Why not just hold your meetings in a lecture hall with powerpoint capability?   \nCouple that with reminding senators that there are plenty of tech labs on campus, you'd save a significant amount of money on supplies regardless of what it actually is. The average business doesn't have to print out **54 copies of everything**.\n\nBecause each senator has to receive the agenda, minutes, and pieces of proposed legislation in print at the meetings, the ISS goes through a mountain of paper and ink - even printing two pages per side and double-sided. (It has been suggested that this be done digitally only, but that would unfairly exclude student senators unable to afford electronics.) Then you start piling on staples, binders (for storing all those documents until the session ends), pens, printer repair/replacement costs...\n\nI don't think the amount spent comes near the budgeted amount in the end, but that budget reflects a sort of worst case scenario. (That and I've heard that last year's treasurer was extremely incompetent.)\n Honestly, many students (if not most) have either a laptop or smartphone, or something to read digital documents off of. And if they don't they can print out a copy before the meeting.   I wish that most of the students who would be voting on this could see the discussion going on here. I feel like a big problem in this referendum wll be all the students who don't know anything about the issue (myself included) who read the question and say \"meh, 2 dollars, no big deal, and anyway it boosts student power\" and don't know exactly what the ISS does. To this date I still don't know what the ISS does, all I've seen are ads from them. Frankly I think my residence hall's executive board puts on better events than they do, and their funding comes from the University Housing payments so they're not about to charge students just to entertain them. When is voting going on?\nI did not hear about this until I saw this thread and I can't find information about this online.    No. As a suggestion, they can fine the smoking people and make that money.  This is actually how the first student government at UIUC funded themselves. Later governments stopped because it was really, really annoying... I was being sarcastic actually. Although I don't smoke I have no problem with the people smoking outside.  I am a prior Student Senator. I think that the separate fee is not a good pursuit of the Student Senate's time and energy. The Student Senate had significant independence some time ago (pre-2008 IIRC) and it resulted in some heavy corruption, but also a huge restructuring by the Senate in self-policing and oversight. While I was there, we had great Treasurers that ensured everything was financially accounted for, and frequently wound up . That said, the Student Senate can often get a little bit pushed around by the University administration to toe the line on some issues, so I can understand their desire to obtain financial independence from what the administration deigns to provide.\n\nSecond, people have asked what Student Senate even does. Are there a lot of fratstars in the Senate? Sure. It's a power position, it's bound to attract those kinds of people. However, we do a variety of things for the student body:\n\n-Lobbying Springfield on behalf of the student body and University (this is probably where most of the phone bill cost comes from). We also host the cost of bus transportation for the student body to assist on Illinois Day with lobbying.\n\n-Educating students about their rights regarding interactions with police. Given the degree of intoxication that goes on, we do this several times a year to try and provide some legal knowledge to the student body.\n\n-Hosting the Student Trustee debate (arguably the most important position in the student body)\n\n-Determining better use of traffic systems (I saw this point come up further down the page). There are committees that actually manage this. I was on one myself.\n\n-Serving as the sounding board of the student body. You get a diverse array of opinions in 40,000 students, and while individual groups can push for action on an issue, we serve as a way to pare down all those different opinions into one that is easily digestible by the administration. Dear God, you should have seen the debates that occurred about the administration's actions taken during the Next Dance.\n\n-Finally, I won't mince words. We also serve as an extra funding board for student issues. This can range from assisting Habitat for Humanity, multicultural social events, graduate student town halls, or environmental action nights. $9,000 on just advertising is a lot to drop and plain ridiculous. That would eliminate numerous valuable events that could have been held, and Activity Day is actually a better return on our investment ($12 registration fee for a table netting hundreds of interested students).\n\n**Source:** I am a former Student Senator, 2009-2010, and literally drafted by my classmates (I didn't choose to run until they put me on the ballot and voted me in based on my advocacy work regarding the MTD cuts that year). I got to experience developing the student body's stance on issues including the clout scandal and Chief's Next Dance). Thank you for giving us an insider's perspective.  If I may ask, how important do you think the student government's independence from the administration is?  Is the $60,000+ budget they are asking for justifiable, or is there a significant amount of wasted spending there?\n\nI ask because I there are some items from last year's spending--such as thousands spent on some sort of Big 10 student government conference--make me curious whether some money is spent on the senators and not on the functioning of the senate.\n\n(edit: some words)  [A link to their twitter](https://twitter.com/ILStudentSenate).\n\nI followed them a long while ago, and unfollowed them based upon one of their meeting minutes (Sep 5) which seemed ridiculously pointless.  \n\nOn Oct 10: \n\n&gt;\"We have a 5.4 billion dollar budget,\" Monte Beaty said. \n\n Hahaha so funny.  /s\n\nThese are just a few.  Seems like a waste.  Just like their advertising.    Here's a relative daily illini article. \n\n\"“Let me tell you, it does not cost more than $1,000 to spend a weekend in Chicago,” said Matt Gold, senator and senior in LAS.\nSenator Max Ellithorpe, graduate student, agreed with Gold.\n“This is why we have failed our constituents,” Ellithorpe said. “This is government at its finest, and I think this is ridiculous that we’re discussing lavish expenses.”\"\n\nhttp://www.dailyillini.com/news/campus/article_85fb5dbc-6903-11e2-9307-0019bb30f31a.html\n\nnote: edited for accuracy. \n Oh I didn't even realize it was you who brought up this issue.\n\nDespite our differences in the past, thanks for bringing this to light and I am glad that there are some people with a sense of fiscal responsibility in the ISS. Here's a relative daily illini article. \n\n\"“Let me tell you, it does not cost more than $1,000 to spend a weekend in Chicago,” said Matt Gold, senator and senior in LAS.\nSenator Max Ellithorpe, graduate student, agreed with Gold.\n“This is why we have failed our constituents,” Ellithorpe said. “This is government at its finest, and I think this is ridiculous that we’re discussing lavish expenses.”\"\n\nhttp://www.dailyillini.com/news/campus/article_85fb5dbc-6903-11e2-9307-0019bb30f31a.html\n\nnote: edited for accuracy. \n &gt; only two \"senators\" voted against a specific spending bill\n\nWhat do you mean by that? The article says the spending bill went back to committee.\n\n[Edited for clarity.] Here's a relative daily illini article. \n\n\"“Let me tell you, it does not cost more than $1,000 to spend a weekend in Chicago,” said Matt Gold, senator and senior in LAS.\nSenator Max Ellithorpe, graduate student, agreed with Gold.\n“This is why we have failed our constituents,” Ellithorpe said. “This is government at its finest, and I think this is ridiculous that we’re discussing lavish expenses.”\"\n\nhttp://www.dailyillini.com/news/campus/article_85fb5dbc-6903-11e2-9307-0019bb30f31a.html\n\nnote: edited for accuracy. \n  I am currently a student senator in LAS who served 2 years ago and am serving in the current assembly.  The really sad thing is that the senate is getting away from their true purpose and that is to stand up for the students not promote themselves through outrageous $9000 cheesy advertisements at sporting events.  I wasn't able to attend last weeks meeting, but since I was recently reappointed, I had a couple of senators on my behalf fight against a fund allocation for a 10 dollar name plate for me. I didn't want it, and I sure didn't want my constituents money spent on something that serves absolutely no purpose.  That is approximately 500 bucks wasted every year on stupid name plates.  Well apparently, there was a movement to amend the fund allocation to remove my nameplate, and it failed.  Fiscal irresponsibility at it's finest right there, and there is no reason there should be an additional fee if the ISS can't spend it's current budget wisely. I am currently a student senator in LAS who served 2 years ago and am serving in the current assembly.  The really sad thing is that the senate is getting away from their true purpose and that is to stand up for the students not promote themselves through outrageous $9000 cheesy advertisements at sporting events.  I wasn't able to attend last weeks meeting, but since I was recently reappointed, I had a couple of senators on my behalf fight against a fund allocation for a 10 dollar name plate for me. I didn't want it, and I sure didn't want my constituents money spent on something that serves absolutely no purpose.  That is approximately 500 bucks wasted every year on stupid name plates.  Well apparently, there was a movement to amend the fund allocation to remove my nameplate, and it failed.  Fiscal irresponsibility at it's finest right there, and there is no reason there should be an additional fee if the ISS can't spend it's current budget wisely.  In my opinion, ISS continues to push itself further into obscurity.  Things have gotten notably worse within the organization.  They seem to spend a majority of their time talking about fund allocations and internal procedure, and less time on ways to represent students.  I can't say that I've ever heard more people use the word \"distinguished\" in a single meeting.    Many people here do not have a lot of money and many of them are on student loans. As a result, they should not be forced to pay additional fees, especially if there are having difficulty paying for tuition. If they want to implement a mandatory fee, it should only be for people who have extra money to spend.\n\nIf the Student Government needs money, I will gladly donate at least $10 if they give me an easy way to do so such as allowing me to charge the donation to my student account.\n  http://iss.illinois.edu/documents.asp\n\nA link to the ISS governing documents and their site for anyone who wants to look at such things. I haven't really looked at much but there is the budget for last year. Is there a place to find this year's budget?  Is there a timeline for when this will be brought up in a meeting or when students can vote?     https://www.facebook.com/cunninghamfortrustee?ref=stream &lt;--- A person on the iSS, he made a status which asks for thoughts on this issue, ask him questions cause you will get no answers on reddit.  he's not iSS  he's not iSS  Also i found it amusing how once he gets a question on the subject, he deletes the status. Should a person running for office have answers and not run away from a difficult question? ... Also i found it amusing how once he gets a question on the subject, he deletes the status. Should a person running for office have answers and not run away from a difficult question? ...  Everything you want to know on this topic can be found in this report. It not only includes the current years budget, but also offers justifications and commentary. A great read in my opinion!\n\nThe file is temporarily hosted on ge.tt because the ISS website is having some issues\n\nhttp://ge.tt/3yOtxnW/v/0?c\n\nsource: The Treasurer This report confirms a couple of things:\n1) ISS spent $929 on nameplates\n2) ISS spent $9,000 on basketball advertisements\n3) ISS spent money on travel to a conference\n4) ISS spends (in my opinion) too much money\n5) ISS spends money on (in my opinion) silly things Actually, it says that nothing was spent on basketball advertisements...\n\nIRC, the nameplates bill barely passed.",
    "url" : "http://www.reddit.com/r/UIUC/comments/17e64f/potential_referendum_questionanother_mandatory/"
  }, {
    "id" : 44,
    "title" : "Is there a library around on campus that allows you to check out CDs? ",
    "snippet" : "My local library carries CDs by modern bands and if they didn't have a specific CD, they would bring it in for you. Is there a library that has CDs that you can take out? I really like listening to CDs because then I can go through my nice speakers and listen in my car.  It's not technically on campus but it's really close. Champaign Public Library, on Green.  Or Urbana Free Library in downtown Urbana. It's not technically on campus but it's really close. Champaign Public Library, on Green.  Do we have to get a card for this? Do we have to get a card for this?  The UGL does. Nice, this is what I was hoping to hear. Do they have an online database?\n\nEDIT. I found it, but let's say it says it's at Residence Halls Lincoln Avenue CDs or  Residence Halls Busey-Evans CDs, where would I have to go to get that? Would they just transport to UGL if I put it on hold or something?\n\nDouble EDIT: And furthermore, because it looks like they are spread out across different locations, does that mean that I can't just go and browse around because it might not be the full selection at one location? Nice, this is what I was hoping to hear. Do they have an online database?\n\nEDIT. I found it, but let's say it says it's at Residence Halls Lincoln Avenue CDs or  Residence Halls Busey-Evans CDs, where would I have to go to get that? Would they just transport to UGL if I put it on hold or something?\n\nDouble EDIT: And furthermore, because it looks like they are spread out across different locations, does that mean that I can't just go and browse around because it might not be the full selection at one location? Nice, this is what I was hoping to hear. Do they have an online database?\n\nEDIT. I found it, but let's say it says it's at Residence Halls Lincoln Avenue CDs or  Residence Halls Busey-Evans CDs, where would I have to go to get that? Would they just transport to UGL if I put it on hold or something?\n\nDouble EDIT: And furthermore, because it looks like they are spread out across different locations, does that mean that I can't just go and browse around because it might not be the full selection at one location?  Almost all of the dorms (\"residence halls\") have libraries with A TON of CDs to be checked out. No need to be living in the dorms either.  ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17exzk/is_there_a_library_around_on_campus_that_allows/"
  }, {
    "id" : 45,
    "title" : "CS 460 TA",
    "snippet" : "I am currently in CS 460(Computer Security Laboratory). I enjoy the course and the instructor is great, but I don't like the TA, especially after my experience with him in CS 461 last semester. He has yelled at students several times including once during a guest lecture for CS 460 last semester where he yelled at a bunch of students at coming in for the next lecture and indicated that he enjoyed yelling at people.\n\nI feel that we should take some sort of action, but I'm not sure what we can do as students. Thoughts?   He's sarcastic and not serious ever. Yeah he just seems really sarcastic about everything. Regardless I don't think that kind of behavior is appropriate for a TA either. I would talk to the instructor of the course about this. Too bad the instructor is just a visiting lecturer who is also sarcastic... I missed class Friday and he signed on irc in the middle and called me the resident brony ;__; I'm not even a brony To be fair, your username contains 'poni' Too bad the instructor is just a visiting lecturer who is also sarcastic... I missed class Friday and he signed on irc in the middle and called me the resident brony ;__; I'm not even a brony Too bad the instructor is just a visiting lecturer who is also sarcastic... I missed class Friday and he signed on irc in the middle and called me the resident brony ;__; I'm not even a brony The TA or prof? He's sarcastic and not serious ever.    nvm, wrong person, i don't know anything about Susan Hinrichs, so i can't judge her Nice try, CS 460 TA and redditor for 0 days.  Maybe students in his class should work harder and pretend to be more mature than they are. Then maybe the poor guy will not need to yell. Maybe the asian students in class should learn better English, too. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17ehkb/cs_460_ta/"
  }, {
    "id" : 46,
    "title" : "How to get to the mega bus terminal at 6am?",
    "snippet" : "I have a mega bus ticket at for 630 am next Saturday and need to get to the Illinois Terminal at least by 6. However the teal bus doesn't run that early so I won't be able get there that way. Anyone have any ideas of how to get there that early?  I'm in PAR if that makes a difference.   Try calling SafeRides. I had to do that to get to the Terminal for an early Megabus trip last semester. 217.265.7433 A friend actually suggested this.  I feel like this is kind of exploiting their services unless I happen to get drunk before hand. It's not b/c their service is to provide safe transportation for times when buses aren't operating. Walking definitely doesn't feel too safe. It's not b/c their service is to provide safe transportation for times when buses aren't operating. Walking definitely doesn't feel too safe.  Use saferides!! Before I graduated I had to be at the terminal at 6 am every day (to transfer to a second bus for student teaching). Let me tell you..you aren't abusing the service by not being drunk. They got to know me by name and loved having a coherent person to converse with. Also, business is pretty slow at that point in the morning, anyway. PLEASE use this. You're paying for it, anyway.   Best bet is probably to call a cab.  It's too long of a walk... Can you recommend any local cab companies? Best bet is probably to call a cab.  It's too long of a walk...  If you want to rely on buses, the 270N Air Bus departs Illinois Terminal at 5:20am and returns at 6:20am.  It's cutting it close but it's really the only way to get there that early by bus.\n\nThe 5:28am 270S serves PAR; you'd have to get on, ride it all the way to the airport, and then back to Illinois Terminal (the opposite terminus).  Or you can walk to Transit Plaza, etc. and get it on the way back north.\n\n[Timetable for your reference](http://www.cumtd.com/maps-and-schedules/route/270-air-bus/saturday/daytime) Thats cutting it a little too close for my taste.  Thanks though.   Can't take the Silver to the Union and walk? It isn't that far.  AFAIK the silver doesn't run that early.",
    "url" : "http://www.reddit.com/r/UIUC/comments/17edo1/how_to_get_to_the_mega_bus_terminal_at_6am/"
  }, {
    "id" : 47,
    "title" : "My cousins saw a concert in Urbana Thursday night and haven't been heard from since, please help :( (and up vote for visibility)",
    "snippet" : "Here is a picture of the two of them: http://imgur.com/XDjIeDW\nThey saw a concert at the Canopy Club Thursday night and their ride left them there with no coats and a dying cell phone. No one has heard from them since early Friday morning. The local police haven't been of any help. This may be a long shot but if anyone has seen them or heard anything PLEASE pm me. Also sharing their photo on Facebook to help spread the word would be \n\nEDIT  photos\nhttp://imgur.com/XjhNBRO\nhttp://imgur.com/4OCvoy7  UPDATE: I've been informed that they are Ok! Ill post letter when I find out the details but I want to thank everyone for their concern :) UPDATE: I've been informed that they are Ok! Ill post letter when I find out the details but I want to thank everyone for their concern :) [deleted]  Did you check Merry Ann's? They're probably still there right now. Did you check Merry Ann's? They're probably still there right now. fuck you   I hope you find them! They're both very attractive and because of that I'm sure reddit will provide you with plenty of white knights willing to help.  I am a musician and I know 2 girls who look like that would have no problem hitching a ride from the band. It's my best guess they're in the next town over enjoying their time with rock stars they just made friends with.  Keep your chin up OP, it may not be something totally bad. &gt; I am a musician and I know 2 girls who look like that would have no problem hitching a ride from the band. It's my best guess they're in the next town over enjoying their time with rock stars they just made friends with.\n\nTranslation: those girls are totally out getting their snootches pounded. you mean those two *classy* ladies in the pic? no way That was really not necessary and you're a douche.   &gt;you're a douche\n\nBe that as it may, I still hope that your friends are promptly found and returned home safely. you mean those two *classy* ladies in the pic? no way you mean those two *classy* ladies in the pic? no way I hope you find them! They're both very attractive and because of that I'm sure reddit will provide you with plenty of white knights willing to help.  I am a musician and I know 2 girls who look like that would have no problem hitching a ride from the band. It's my best guess they're in the next town over enjoying their time with rock stars they just made friends with.  Keep your chin up OP, it may not be something totally bad. I hope you find them! They're both very attractive and because of that I'm sure reddit will provide you with plenty of white knights willing to help.  I am a musician and I know 2 girls who look like that would have no problem hitching a ride from the band. It's my best guess they're in the next town over enjoying their time with rock stars they just made friends with.  Keep your chin up OP, it may not be something totally bad. Someone wants to help? Must be a white knight loser, mirite? I never realized that White Knight implied loser.   have you filed a missing person report yet? Doing so will probably get you more publicity   Was it the Baauer concert? I photographed it, I can look through some of my crowd shots to see if I can find them/people they were with if you want I wonder if im in any of them    [deleted] they aren't staying at them, fuck you      [deleted] I love that gif more than life itself, but this is not the place for it What was the gif?",
    "url" : "http://www.reddit.com/r/UIUC/comments/17bjgw/my_cousins_saw_a_concert_in_urbana_thursday_night/"
  }, {
    "id" : 48,
    "title" : "fuckin FAR...",
    "snippet" : "   \"I approve this message?\" Why is Skrillex the authority of authority on memes in dorm rooms?\n\n**EDIT:** Now I know why Skrillex approves. [He is a meme!](http://www.quickmeme.com/meme/3sr3l7/)\n\nOh no - don't tell me those are are door decorations. I hope an RA wouldn't use rage faces as door decs. Bro, dubstep is hip. So are mee-mee's  is that building still infested with ladybugs? Ladybugs? I don't remember that. A few years ago there was an outbreak of aphids.  Shortly after, there was an outbreak of ladybugs to eat the aphids.  I'm not sure how the conditions at FAR were, but there were bugs everywhere, and it was impossible to move around without walking through a cloud of bugs. A few years ago there was an outbreak of aphids.  Shortly after, there was an outbreak of ladybugs to eat the aphids.  I'm not sure how the conditions at FAR were, but there were bugs everywhere, and it was impossible to move around without walking through a cloud of bugs. A few years ago there was an outbreak of aphids.  Shortly after, there was an outbreak of ladybugs to eat the aphids.  I'm not sure how the conditions at FAR were, but there were bugs everywhere, and it was impossible to move around without walking through a cloud of bugs. A few years ago there was an outbreak of aphids.  Shortly after, there was an outbreak of ladybugs to eat the aphids.  I'm not sure how the conditions at FAR were, but there were bugs everywhere, and it was impossible to move around without walking through a cloud of bugs. A few years ago there was an outbreak of aphids.  Shortly after, there was an outbreak of ladybugs to eat the aphids.  I'm not sure how the conditions at FAR were, but there were bugs everywhere, and it was impossible to move around without walking through a cloud of bugs.",
    "url" : "http://i.imgur.com/k5Slb2A.jpg"
  }, {
    "id" : 49,
    "title" : "Business Career Fair on Tuesday",
    "snippet" : "Where can we find information about the companies that are going to be there? Anybody have any personal advice on how to maximize success at these sorts of things? \n\nTuesday, January 29, 12-4 pm\n\n    Business Career Fair; ARC Gym 2\n    For companies recruiting all business majors.\n    Public Accounting Firms Fair; ARC MP Room 6\n    For recruitment of all professional services with public accounting firms\n\nWednesday, January 30, 12-4 pm\n\n    Business Career Fair; ARC Gym 2\n    For companies recruiting all business majors.\n   &gt; recruiting all business majors\n\nDoes anyone know if they would/have recruited economics majors before?  &gt; recruiting all business majors\n\nDoes anyone know if they would/have recruited economics majors before?    Be prepared for the companies to say, \"You can apply on our website\". No shit. ",
    "url" : "http://www.reddit.com/r/UIUC/comments/17dgd3/business_career_fair_on_tuesday/"
  } ],
  "processing-time-source" : 106,
  "processing-result.title" : "uiuc5_reddit.xml",
  "XmlDocumentSource.xml" : {
    "absolutePath" : "/Users/cole/code/cs467/r-topics/carrot2-cli-3.6.2/../data/reddit_xml/uiuc5_reddit.xml"
  }
}